[{"content": "<![CDATA[<p>Greg #66, I think I can answer some of your questions.</p>\n<p>First, one small point: Peano arithmetic is a theory in the language of the natural numbers, so it does not have any way to talk about or prove things about the real numbers. One appropriate setting (which is still quite close to things like PA) for things like the Hadwiger-Nelson problem is second order arithmetic (where we can quantify not just over natural numbers, but also sets of natural numbers). In this setting we can talk about real numbers as e.g. Dedekind cuts.</p>\n<p>Second, yes the figure showing that the local chromatic number of the plane is at most 7 is valid in ZF and also in all but extremely weak theories of second order arithmetic.</p>\n<p>Third, a sentence in first order logic is called Π_1 if the only quantifiers that appear in it are universal (although typically, bounded existential quantifiers are also allowed). More properly, this should be called Π^0_1 where the superscript indicates that the sentence is first order. A sentence in second order logic where the only second order quantifiers are universal is called Π^1_1 and so on. What Scott is asking is if the Hadwiger-Nelson problem is equivalent to a Π^0_1 statement in the language of the natural numbers. Note that a sentence being Π^0_1 in set theory is pretty different than a sentence being Π^0_1 in arithmetic (because in set theory this already means we can quantify over all sets and not just over natural numbers). The reason Scott is asking this is because Π^0_1 sentences over the natural numbers have the interesting property that if they are independent of PA (or whatever sufficiently strong theory you fancy) then they are actually true. This is because a Π^0_1 statement being false is equivalent to the existence of a counterexample satisfying a statement where all quantifiers are bounded and PA is strong enough to prove all true statements with only bounded quantifiers (in fact, much less than PA is needed).</p>\n<p>Fourth, the de Bruijn-Erdos theorem (along with the observation about finite unit-distance graphs being always represented in the plane by algebraic numbers) shows that in ZFC, the problem of showing that the chromatic number of the plane is greater than, say, 6 is equivalent to a Π^0_1 statement of arithmetic (though note that this is not quite the same as the Hadwiger-Nelson problem). But without choice (or more accurately, without the ultrafilter lemma), it is at least not obviously equivalent to a Π^0_1 statement. On the other hand, your proposed &#8220;local chromatic number&#8221; can be shown to be equivalent to a Π^0_1 statement even in a very weak theory. So if someone were to show this &#8220;local&#8221; version independent of your favorite theory of second order arithmetic (or ZF or whatever) then they would have simultaneously resolved the problem itself in whatever stronger system they used to prove the independence. Of course, it is also possible for it to be independent of ZF but independent that it&#8217;s independent, etc.</p>\n<p>Fifth, the Shelah-Soifer papers don&#8217;t say anything about the local version. In fact, they show that for some graphs, the local version and the global version can disagree when choice is not present (in their case, specifically in a model without choice and where all sets of reals are Lebesgue measurable).</p>\n]]>", "author": "Patrick", "published": "2018-04-15 07:44:31+00:00", "title": "By: Patrick"}, {"content": "<![CDATA[<p>Scott #60:</p>\n<p>I&#8217;ll use &#8220;orthogonal rank&#8221; to refer to &#8220;the smallest dimension in which there is an orthogonal representation&#8221;.</p>\n<p>This recent <a href=\"https://arxiv.org/abs/1801.03542\" rel=\"nofollow\">paper by Laura Mančinska and David Roberson</a> gives separations between quantum chromatic number and orthogonal rank. They need only three colors and separate in both directions! That is, they find one graph with quantum chromatic number 3 but orthogonal rank > 3 and another graph with orthogonal rank 3 but quantum chromatic number > 3.</p>\n]]>", "author": "Jalex Stark", "published": "2018-04-15 10:00:12+00:00", "title": "By: Jalex Stark"}, {"content": "<![CDATA[<p>Greg #66: I think it would be pretty surprising if an upper bound on the local chromatic number could be proven in ZF (or some stronger theory) but not in PA. There are plenty of Π_1 statements that have this property, but they are usually pretty artificial.</p>\n<p>For a similar reason, I think it would be surprising if the statement could be proven to be independent of ZF (because that would mean it could be proven true in a slight strengthening of ZF, but not in PA). However, I wouldn&#8217;t be particularly surprised if the statement was in fact independent of ZF (not that we would have any way of finding out that this is the case, if the independence is unprovable).</p>\n<p>Patrick #67: To formalize in PA, you use the fact that the coordinates of the points in any counterexample can be assumed to be algebraic.</p>\n]]>", "author": "Dacyn", "published": "2018-04-15 10:27:13+00:00", "title": "By: Dacyn"}, {"content": "<![CDATA[<p>Jalex #68: Thanks&#8212;I hadn&#8217;t seen that paper, and it&#8217;s a treasure trove of examples and intuitions about quantum chromatic number!</p>\n<p>I confess that I was <i>totally</i> confused about how orthogonal rank could possibly be greater than quantum chromatic number, as this paper claims, since can&#8217;t we get a k-dimensional orthogonal representation by taking a quantum k-coloring and then picking any one color?  And indeed, the Cameron et al. paper had a result (Proposition 7) that seemed to be saying that quantum chromatic number is an upper bound on orthogonal rank, as I&#8217;d expect.</p>\n<p>On closer examination, though, the upper bound on orthogonal rank is given by &#8220;rank-1 quantum chromatic number&#8221;&#8212;i.e., quantum chromatic number when we restrict ourselves to projectors of rank 1.  I had thought that those were the only kind of projectors <i>ever</i> allowed.</p>\n<p>So then, this must be the resolution: if you want quantum chromatic number to be less than orthogonal rank, you do so using higher-rank projectors (though I confess I still don&#8217;t have any intuition for it).</p>\n]]>", "author": "Scott", "published": "2018-04-15 13:42:05+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Patrick and Dacyn &#8211; Thanks for your comments!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2018-04-15 15:13:59+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Dacyn #69: Your comment says how to formalize the &#8220;local chromatic number&#8221; in PA using a fact about it that is provable in ZF. My point was that you can&#8217;t formalize the original Hadwiger-Nelson problem in first order arithmetic unless you use something like the de Bruijn-Erdos result to get an equivalent statement in first order arithmetic. But it is not obvious (and maybe not even true) that ZF proves the Hadwiger-Nelson problem is equivalent to a first order sentence of arithmetic, so it doesn&#8217;t seem fair to say we can talk about it in PA.</p>\n]]>", "author": "Patrick", "published": "2018-04-15 16:11:59+00:00", "title": "By: Patrick"}, {"content": "<![CDATA[<blockquote><p>Your comment says how to formalize the “local chromatic number” in PA using a fact about it that is provable in ZF.</p></blockquote>\n<p>Sure, you can&#8217;t even define the entire Hadwiger-Nelson graph in PA, much less prove anything about it.</p>\n<p>Still, what I meant in this case was finding (in PA) the maximum chromatic number of every finite graph which is realizable in the plane with unit distances.  Those graphs evidently can be defined in PA.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2018-04-15 18:03:06+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Patrick #72: Your comment #67 was a response to Greg #66 who was talking about the local chromatic number, so I assumed you were as well. Sorry for any confusion!</p>\n]]>", "author": "Dacyn", "published": "2018-04-15 18:14:48+00:00", "title": "By: Dacyn"}, {"content": "<![CDATA[<p>Meanwhile <a href=\"https://arxiv.org/pdf/1708.01081.pdf\" rel=\"nofollow\">here</a> is something else interesting.   The Hadwiger-Nelson problem for the hyperbolic plane depends on the specific choice of the edge length ℓ.   It seems that the known lower bounds are bounded as a function of ℓ, but the known upper bounds grow linearly in ℓ.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2018-04-15 18:26:03+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Scott #70:</p>\n<p>I don&#8217;t have a lot of intuition for strategies in graph-coloring games (indeed, I think one of the main theses of that paper is that almost nobody does), but I think that the idea of using projectors of rank >1 should not be too surprising. Already this is necessary for winning the Magic Square game. </p>\n<p>For anybody interested in the question of the quantum chromatic number of the plane, section 4.2 of the Mančinska-Roberson gives some pretty concrete tools for proving that the quantum chromatic number of a graph is at least 4. At a first glance, it seems like the Moser spindle (the minimal unit distance graph of classical chromatic number 4) is too small to analyze with these tools, but that some kind of sum of a few Moser spindles may be enough.</p>\n]]>", "author": "Jalex Stark", "published": "2018-04-15 21:33:10+00:00", "title": "By: Jalex Stark"}]