[{"content": "<![CDATA[<p>[&#8230;] post on his blog covering his and others&#8217; responses to this year&#8217;s Edge question [^], Scott singled out three answers by others (at the Edge forum) which he thought were heading in [&#8230;]</p>\n]]>", "author": "In QM, local action does make sense | Ajit Jadhav's Weblog", "published": "2016-01-08 04:03:30+00:00", "title": "By: In QM, local action does make sense | Ajit Jadhav's Weblog"}, {"content": "<![CDATA[<p><b>Rural knowledge</b>&nbsp; Re Rahul&#8217;s comment #64, <a href=\"http://modernfarmer.com/2015/07/how-to-make-a-pond/\" rel=\"nofollow\">farm-boys are taught young</a> that water-tight earthern barriers are:</p>\n<p>(1) feasible on clay-ground (e.g., the Netherlands)<br />\n(2) infeasible on sand-ground (e.g., Mumbai)<br />\n(3) ludicrous on karst-ground (e.g., Florida)</p>\n<p>See for example Martin et al. &#8220;Sea-level Rise Impacts on Coastal Karst Aquifers&#8221;, and references therein.</p>\n<p><b>Conclusion</b>&nbsp; The world&#8217;s coastal grounds are, most commonly, geologically unsuited to dike-protection from sea-level rise, and engineers appreciate the economic implications of this reality <a href=\"http://thinkprogress.org/climate/2015/03/30/3600645/rick-scott-climate-denial/\" rel=\"nofollow\">more realistically than politicians</a>.</p>\n]]>", "author": "John Sidles", "published": "2016-01-08 13:39:56+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>@John Sidles</p>\n<p>Are you saying it is impossible to build a sea-wall in Mumbai?</p>\n<p>Or just more difficult? Sure, sand-ground might be more expensive to build on but isn&#8217;t &#8220;infeasable&#8221; too strong a word? </p>\n<p>Any opinions about the Backbay Reclamation Project in Mumbai which reclaimed approx. 400 acres of land from the sea back in 1930? And of course it is all surrounded by&#8230;&#8230;.a sea wall. </p>\n<p><a href=\"http://theory.tifr.res.in/bombay/physical/geo/backbay-reclamation.html\" rel=\"nofollow\">http://theory.tifr.res.in/bombay/physical/geo/backbay-reclamation.html</a></p>\n<p>In fact, large areas of Mumbai (e.g. East Docks, Sasson Docks, Marine Drive) wouldn&#8217;t exist had it not been a combination of sea walls & reclamation. </p>\n<p><a href=\"https://pbs.twimg.com/media/CAy8zF5UUAAg6Qw.jpg\" rel=\"nofollow\">https://pbs.twimg.com/media/CAy8zF5UUAAg6Qw.jpg</a></p>\n]]>", "author": "Rahul", "published": "2016-01-08 14:33:12+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul,</p>\n<p>About three years ago I looked at climate issues and posted this:</p>\n<p><a href=\"http://broadspeculations.com/2012/08/26/climate-of-change/\" rel=\"nofollow\">http://broadspeculations.com/2012/08/26/climate-of-change/</a></p>\n<p>I didn&#8217;t try to argue about the reality of climate change but rather just accepted the predictions of IPCC about likely temperature rises to examine predictions about its effects. I happen to believe there is human caused global warming but I think the degree of warming is on the lower end of most predictions. For the sake of argument, I took the IPCC middle range predictions.</p>\n<p>Ultimately I concluded that sea level rise is the one clear effect of global warming that would be the most difficult and costly to remedy.</p>\n<p>Many other potential effects have multiple other variables affecting their outcome and ultimately are difficult to prove with a high degree of confidence. Many of the other effects also can be significantly mitigated by economic growth in developing countries. Mitigation of sea level could be accomplished with economic growth but is much more costly and difficult than other changes, such as improvement in agricultural practices, sanitation, and water management. Most of these other changes also are desirable in their right without respect to their ability to mitigate climate change. </p>\n<p>So in the end I think we need to worry about global warming and take steps to reduce greenhouse gas emissions through development of alternative energy sources but we need to be very careful not to reduce economic growth particularly in developing countries. I see this is a delicate balancing act and  calls for drastic actions as misguided.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-01-09 14:03:17+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>@James Cross:</p>\n<p>I think your comment is perfect. I think in the whole AGW denier saga the other question has been somewhat neglected:</p>\n<p>i.e. Given AGW exists, what are the magnitudes of the various changes and what are the relative costs & timelines of engineered solutions that might be possible to mitigate the effects. </p>\n<p>How to implement AGW measures without stanching Economic Growth in Developing nations is going to be a very crucial problem. But unfortunately I don&#8217;t see much focus on this delicate, nuanced balancing problem. </p>\n<p>Instead I see non-nuanced responses like &#8220;India / China = evil for embarking on a massive drive of coal fired power plants&#8221; and daring to boost the living standards of their people.</p>\n]]>", "author": "Rahul", "published": "2016-01-09 18:21:09+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>In regard to Rahul #69, commended topics of study are <a href=\"https://www.google.com/search?q=%22deep+polder%22+%22confining+layer%22&ie=utf-8&oe=utf-8#q=%22deep+polder%22+%22Holocene+confining+layer%22\" rel=\"nofollow\">&#8220;Holocene confining Layer&#8221; and &#8220;deep polder&#8221;</a></p>\n<p><b>In a nutshell</b>&nbsp; Because the Netherlands is naturally endowed with relatively impermeable subsurface confining layers, it can <a href=\"http://www.bodeminjectie.nl/en/wat-doen-we/welafdichting/\" rel=\"nofollow\">feasibly build and feasibly maintain</a> deep polders (habitable land below sealevel); conversely regions lacking confining confining layers&nbsp;&mdash; like Florida, Mumbai and most other low-lying regions around the globe&nbsp;&mdash; cannot build or maintain deep polders by <i>any</i> demonstrated or envisioned geotechnic means.</p>\n<p>&#8212;&#8212;&#8212;&#8212;</p>\n<p>In regard to James Cross #70 &#8220;delicate balancing act and calls for drastic actions&#8221;, commended reading is historian Lawrence Freedman&#8217;s recent (and well-reviewed) <i>Strategy: a History</i> (2013, Oxford University Press); </p>\n<p>Here is a sampling of Feldman&#8217;s historical account, from his Preface, and from his concluding chapters &#8220;The limits of rational choice&#8221; and &#8220;Beyond rational choice&#8221;.<br />\n<blockquote><b>Preface</b>&nbsp;[&hellip;] [This book] shows how in distinct military, political, and business spheres, there has been a degree of convergence around the idea that the best strategic practice may now consist in forming compelling accounts of how to turn a developing situation into a desirable outcome.  The practice of thinking of strategy as a special form of narrative came into vogue as the 1960s turned into the 1970s, and disillusion set in with the idea that large enterprises and even wars could be controlled by means of a central plan.  Developments in cognitive psychology and contemporary philosophy came together to stress the importance of the constructs through which events are interpreted.</p>\n<p><b>The limits of rational choice</b>&nbsp;[&hellip;] A particularly influential theory was one that stressed the benefits of treating all choices as if they were rational.  Adherents were confident that they, almost uniquely, could offer a theory [&hellip;] in which all propositions could both be deduced from a strong theory and then validated empirically.  Though rational choice theory consistently delivered far less than promised, and its underlying assumptions became vulnerable to a fundamental challenge from cognitive psychology, it was promoted effectively and in a highly strategic manner.  [Its proponents] were not deterred by the widespread apprehension that the theory depended upon an untenable view of human rationality.  The claim, they insisted, was no more than that the premise of rationality helped generate good theory.</p>\n<p><b>Beyond rational choice</b>&nbsp;[&hellip;] A complex theory of decision-making emerged [that] was at all times influenced by the social dimension and emphasized the importance of familiarity; the effort required to understand the distant and menacing; the inclination to frame issues in terms of past experiences, often quite narrowly and with a short-term perspective; and the use of shortcuts (heuristics) to make sense of what was going on.  None of this fit easily with descriptions in terms of the systematic evaluation of all options, a readiness to follow an algorithmic process to a correct answer, employing the best evidence and analysis, keeping long-term goals clearly in mind. [&hellip;] John Lehrer summed up the implications of the research:<br />\n<blockquote>&#8220;The conventional wisdom about decision-making has got it exactly backward.  It is the easy problems&nbsp;&mdash; the mundane math problems of daily life&nbsp;&mdash; that are best suited to the conscious brain. [&hellip;]  Complex problems, on the other hand, require the processing powers of the emotional brain, the supercomputer of the mind.&#8221;</p></blockquote>\n</blockquote>\n<p> <b>Grand unifying conclusion</b>&nbsp; Feasible global warming strategies depend from twin anchors in quantum theory: the (mathematically rational) quantum radiation transport theory that governs CO2-driven global warming, and the (mathematically rational) quantum thermodynamic theories that govern both the technical feasibility of carbon-neutral production of energy and the efficient uses of that energy in fabrication, concentration, purification, and computation.  </p>\n<p>Concomitantly, the 21st century&#8217;s evolving social constructs (that bridge these two quantum anchors) are surveyed in the evolving, tightly coupled, post-rational strategic narratives of small-&#8220;p&#8221; philosophers (John Rawls, Martha Nussbaum), small-&#8220;h&#8221; historians (Jonathan Israel, Lawrence Freedman), small-&#8220;e&#8221; economists (Francis Spufford, Amartya Sen), and small-&#8220;n&#8221; novelists (Annie Proulx, Dominique Edde, Ted Chiang)&nbsp;&hellip; practitioners whose works, in aggregate, are showing us the opening ways by which &#8220;the supercomputing powers of our emotional brains&#8221; increasingly nourish our shared hopes for the great challenges and opportunities of our century.</p>\n]]>", "author": "John Sidles", "published": "2016-01-10 00:27:18+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>#Scott 53</p>\n<p>Good answer Scott!  I&#8217;m impressed that you&#8217;re not sucked in by the &#8216;Deep Learning&#8217; hype.  I also think that you were wise to doubt the hype surrounding Bayesianism!  </p>\n<p>Bayesianism is a &#8216;grand unified theory of reasoning&#8217; that all of science be should be based on assigning (and updating) probabilities for a list of possible outcomes; the probabilities are supposed to indicate your subjective degree of confidence that a given outcome will occur.</p>\n<p>Contrast this with an alternative conception of rationality as espoused by David Deutsch.</p>\n<p>David Deutsch in his superb books, &#8216;The Fabric Of Theory&#8217; and &#8216;The Beginning Of Infinity&#8217;, argued for a different theory of reasoning than Bayesianism. Deutsch (correctly in my view) pointed out that real science is not based on probabilistic predictions, but on explanations. So real science is better thought of as the growth or integration of knowledge, rather than probability calculations. </p>\n<p>So what&#8217;s wrong with Bayesianism?</p>\n<p>Probability theory was designed for reasoning about external observations &#8211; sensory data. (for example, &#8220;a coin has a 50% chance of coming up heads&#8221;). In terms of predicting things in the external world, it works very well.</p>\n<p>Where it breaks down is when you try to apply it to reasoning about your own internal thought processes. It was never intended to do this. As statistician Andrew Gelman correctly points out, it is simply invalid to try to assign probabilities to mathematical statements or theories, for instance.</p>\n<p>Can an alternative mathematical framework be developed, one more in keeping with the ideas of David Deutsch and the coherence theory of knowledge?  </p>\n<p>My own idea is to separate out levels of abstraction when reasoning (or equivalently, levels of recursion).  In my proposed framework, there are 3 levels, and each level gets its own measure of &#8216;truth-value&#8217;.   The idea is that different forms of reasoning correspond to different levels of abstraction. </p>\n<p>Known popular types of truth-measure are Boolean (True/False) and probability (0-1).  I&#8217;m proposing we should be using a different measure, called conceptual coherence (categorization measure). </p>\n<p>As a rough working definition of *conceptual coherence*, I would define it thusly;</p>\n<p>&#8220;The degree to which a concept coheres with (integrates with) the overall world-model.&#8221;</p>\n<p>Here&#8217;s what&#8217;s wrong with Bayesianism:  There is not just uncertainty about our own knowledge of the world (probability), there is another meta-level of uncertainly; uncertainty about our own reasoning processes, or logical uncertainty.  Bayesianism can&#8217;t help us here.  Conceptual coherence can.  Lets see how:</p>\n<p>All statements of the form:</p>\n<p>‘outcome x has probability y’ </p>\n<p>can be converted into statements about conceptual coherence, simply by redefining ‘x’ as a concept in a world-model. Then the correct form of logical expression is: </p>\n<p>‘concept x has coherence value y’. </p>\n<p>The idea is that probability values are just special cases of coherence (the notion of coherence is more general than the notion of probabilities).</p>\n<p>To conclude, conceptual coherence is the degree with which a concept is integrated with the rest of your world-model, and I think it accurately captures in mathematical terms the ideas that Deutsch was trying express, and is a more powerful method of reasoning than Bayesianism.</p>\n]]>", "author": "mjgeddes", "published": "2016-01-10 05:49:05+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>mjgeddes #73: Well, I try to avoid <i>every</i> kind of hype.  On the other hand, I&#8217;m as impressed as the next person by the successes of deep learning in the past few years&#8212;even though the ideas are old, the level of success is new.</p>\n<p>And I never, ever want to be on the side that constantly has to explain why actual success in solving actual problems better than before &#8220;doesn&#8217;t count&#8221; or &#8220;doesn&#8217;t address the <i>real</i> issues,&#8221; which more and more is the tack that the anti-deep-learning people have to take.</p>\n<p>(In the same way, if D-Wave were actually solving real-life optimization problems better than you could with the best classical algorithms, you&#8217;d find me here <i>defending</i> them against critics!  As I keep repeating, the scientific details of what D-Wave is doing matter precisely because they <i>don&#8217;t</i> win against the alternatives in a fair fight in the same sense that deep learning does.)</p>\n]]>", "author": "Scott", "published": "2016-01-10 11:37:26+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>[&#8230;] answers are quite enlightening. I was reading Professor Scott Aaronson&#8217;s blog, and he already commented on the answers this year, and he himself is one of the writer of answer. These answers will give [&#8230;]</p>\n]]>", "author": "Edge Annual Question 2016 : WHAT DO YOU CONSIDER THE MOST INTERESTING RECENT [SCIENTIFIC] NEWS? WHAT MAKES IT IMPORTANT? | Shaun Ling", "published": "2016-01-10 13:50:15+00:00", "title": "By: Edge Annual Question 2016 : WHAT DO YOU CONSIDER THE MOST INTERESTING RECENT [SCIENTIFIC] NEWS? WHAT MAKES IT IMPORTANT? | Shaun Ling"}, {"content": "<![CDATA[<p>A prominent instance, in the past decade, of &#8220;old ideas that achieve new levels of success&#8221; (in the phrase of Scott&#8217;s comment #74), has been the Moore&#8217;s Law growth of the math-and-physics literature of <a href=\"http://blog.computationalcomplexity.org/2016/01/predictions-of-new-year.html?showComment=1452048256970#c1468940811481271769\" rel=\"nofollow\">matrix product states and tensor networks</a> (MPS/TN)&nbsp;&hellip; in that the doubling time of MPS/TN, sustained for the past decade, has been  ~38 months.</p>\n<p><b>Q1</b>&nbsp; Aren&#8217;t MPS/TN algebraic state-spaces mathematically well-suited to the description of DWAVE-type quantum dynamical processes?</p>\n<p><b>Q2</b>&nbsp; Does it matter all that much, whether MPS/TN state-spaces are realized in billions of classical silicon gates versus millions of quantum DWAVE gates?  Is it realistic to foresee that these two approaches will prove to have complementary advantages?</p>\n<p><b>Q3</b>&nbsp; Is it realistic to hope that, in the coming decade, continued advances in MPS/TN algorithmic capabilities and continued advances in DWAVE-type hardware capabilities can unite to mutually sustain a &#8220;<a href=\"http://electroiq.com/blog/2011/01/itrs-2010__a_more-than-moore/\" rel=\"nofollow\">more than Moore virtuous circle</a>&#8221; of advances in quantum computation and simulation capability, in both algorithms and hardware?</p>\n<p>For sure, 2015 has given us plenty of quantum research articles whose findings are reasonably compatible with the answer to all of these questions being&nbsp;&#8220;yes&#8221;.  So&nbsp;perhaps DWAVE&#8217;s investors and customers aren&#8217;t so dumb!&nbsp; <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "John Sidles", "published": "2016-01-10 14:06:33+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>I agree, Scott, I don&#8217;t much care for the question either, but then Brockman&#8217;s an impresario and that&#8217;s his shtick. I find I&#8217;ve wandered far away from the festival of tweets and headlines that science writing has become &#8212; I&#8217;m still very glad of its rebirth,  but I just don&#8217;t think it&#8217;s very interesting. For one thing, there&#8217;s much too much to know; for another, you might know that a new piece of work&#8217;s going to be extremely important, but in general not only isn&#8217;t that how it works, but it&#8217;s important only because of a whole rhizome of other work, most of which doesn&#8217;t sound all that very exciting, some of which may be pretty old. It&#8217;s exciting in the aggregate, in other words. </p>\n<p>Not too long ago the Atlantic went looking for a new science writer &#8212; Ed Yong took the job &#8212; and it was the same problem: they wanted someone who could &#8220;break science news&#8221;. It seems to me one of the least interesting available ways of talking about science, and the relentless focus on news-cycle timescales does a lot to guarantee that the discussion about science won&#8217;t be all that smart. </p>\n<p>My guess actually is that Brockman didn&#8217;t much care whether the question was taken very seriously, though, and that he was more interested in assembling a set of name essays.</p>\n]]>", "author": "amy", "published": "2016-01-11 03:09:57+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Sir in the light of recent events.<br />\nAt QIP2016 Bravyi @IBMResearch showed Computing distance of a given stabilizer code is NP-hard. But for &#8220;homological CSS codes&#8221; is P.<br />\nAnd a lot of other stuff like this has happened this year.<br />\nDo you think we are approaching P = NP, or are all these just some specialized cases.</p>\n]]>", "author": "Sanketh Menda", "published": "2016-01-11 04:09:08+00:00", "title": "By: Sanketh Menda"}, {"content": "<![CDATA[<p>Sanketh #78: Sergey&#8217;s result sounds great.  But the truth is that we&#8217;ve had <i>thousands</i> of examples, since the 1970s, where a problem is NP-hard but an extremely similar-sounding problem is in P.  This is not evidence for P=NP.  If anything, I claim, it&#8217;s evidence for P&ne;NP&#8212;because if P=NP, then you would&#8217;ve expected that in at least one such case, the same problem would&#8217;ve been found to be both NP-complete and in P, yet somehow that never happens.  (In an <a href=\"http://www.scottaaronson.com/blog/?p=1720\" rel=\"nofollow\">earlier post</a>, I called this phenomenon the &#8220;invisible electric fence.&#8221;)</p>\n]]>", "author": "Scott", "published": "2016-01-11 08:32:40+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>The points that Amy raises (#77) are well-addressed in Terry Tao&#8217;s essay &#8220;<a href=\"http://arxiv.org/abs/math/0702396\" rel=\"nofollow\">What is good mathematics</a>?&#8221; (arXiv:math/0702396 and Bull.&nbsp;Amer. Math.&nbsp;Soc.&nbsp;2007; note that Tao acknowledges comments and suggestions from Gil Kalai).  It is necessary only to map &#8220;mathematics&#8221; to &#8220;science&#8221; in passages like:<br />\n<blockquote>The concept of <strike>&nbsp;mathematical&nbsp;</strike> <em>scientific</em> quality is a high-dimensional one and lacks an obvious canonical total ordering.&nbsp;&hellip; The very best examples of good mathematics [are] part of a greater mathematical story, which then unfurls to generate many further pieces of good mathematics of many different types. Indeed, one can view the history of entire fields of <strike>&nbsp;mathematics&nbsp;</strike> <em>science</em> as being primarily generated by a handful of these great stories, their evolution through time, and their interaction with each other.</p></blockquote>\n<p>A ringing affirmation of Tao&#8217;s narrative-centric perspective is the concluding chapter &#8220;Stories and Scripts&#8221; of Lawrence Freedman&#8217;s historical survey <i>Strategy</i> (of #72) , which quotes sociologist Joseph E. Davis as follows:<br />\n<blockquote>&#8220;Research suggests that power comes less from knowing the right stories than from knowing how and [how] well to tell them: what to leave out, what to fill in, when to revise and when to challenge, and whom to tell or not to tell.&#8221;</p></blockquote>\n<p>Even in mathematics, there is a characteristically human, passionate, poignant aspect to Tao/Freedman-style story-construction; for example in the introduction to Dolgachev&#8217;s <i>Classical Algebraic Geometry: a Modern View</i> (2012) we read<br />\n<blockquote>&#8220;How sad it is when one considers the impossibility of saving from oblivion so many names of researchers of the past who have contributed so much to our subject.&#8221;</p></blockquote>\n<p>Similarly Tom Conte&#8217;s recent &#8220;Computing roadmapping: a proposal&#8221;&nbsp;&mdash; Conte is President of the IEEE Computer Society and co-chairs the <a href=\"http://rebootingcomputing.ieee.org/\" rel=\"nofollow\">IEEE Rebooting Computing Committee</a>&nbsp;&mdash; is concerned with failures of the Moore&#8217;s Law narrative in computing, concludes with a somber yet hilarious conclusion<br />\n<blockquote>&#8220;We&#8217;re all smart people, but we have to pay attention to <a href=\"http://1.bp.blogspot.com/-AZNV9I1nBF4/UB6SvKtIR6I/AAAAAAAAAWY/fk8_oWh9JCI/s1600/midvale+school+for+the+gifted.jpg\" rel=\"nofollow\">the writing on the wall</a>.&#8221;</p></blockquote>\n<p>Note: the linked Far Side cartoon &#8220;Midvale School for the Gifted&#8221; is Conte&#8217;s.</p>\n<p>A very great virtue of <i>Shtetl Optimized</i> (as it seems to me) is the shared reading of &#8220;the writing on the wall&#8221;, <i>especially</i> when our various readings of that writing generate good stories in the sense of Tao and Freedman.</p>\n]]>", "author": "John Sidles", "published": "2016-01-11 12:06:01+00:00", "title": "By: John Sidles"}]