[{"content": "<![CDATA[<p>No substantial comment, but would you mind fixing the last link to point to the <a href=\"http://arxiv.org/abs/quant-ph/0606066\" rel=\"nofollow\">abstract</a> rather than directly to the PDF?  (For the usual reasons &#8212; the PDF doesn&#8217;t have a link back, the abstract has useful links, etc.)  Thank you!</p>\n]]>", "author": "Sniffnoy", "published": "2015-07-01 19:45:01+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Sniffnoy #6: OK, done!</p>\n]]>", "author": "Scott", "published": "2015-07-01 19:46:41+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Well done to the Ambainis and the cool achievement. </p>\n<p>@Scott I sort of try to learn complexity theory on my own on my spare time. So I followed your advice, and bought your book, QCSD. I read all of it cover to cover. Frankly speaking, I did not understand 95% of the materials, especially how easily you posed and solved the problems. I have not given up, and I will re-read the book again after I finish writing my PhD thesis (my major is engineering), somewhere in March 2016.  I think I need more background materials. I searched my university library and found a book by Chuang et al. “Quantum computation and quantum information.“ Do you reccomend this book? Also what othe authors should I seek to cover enough starting materials to enrich my understanding of complexity theory? </p>\n<p>Sorry I put this here where everyone is cheering the recent good work.</p>\n]]>", "author": "aviti", "published": "2015-07-03 01:10:35+00:00", "title": "By: aviti"}, {"content": "<![CDATA[<p>aviti #8: Yes, Nielsen and Chuang is the standard textbook for quantum computing; it&#8217;s excellent (even though 16 years old by now).  If you wanted to start with something shorter and more introductory, you could try David Mermin&#8217;s &#8220;Introduction to Quantum Computer Science.&#8221;</p>\n<p>And if you wanted <i>classical</i> complexity theory rather than quantum, here are four books I recommend (the first is the most introductory, the third and fourth are the most modern in what they cover):</p>\n<p>Sipser, Intro to the Theory of Computation<br />\nPapadimitriou, Computational Complexity<br />\nArora and Barak, Computational Complexity: A Modern Approach<br />\nMertens and Moore, The Nature of Computation</p>\n]]>", "author": "Scott", "published": "2015-07-03 10:19:38+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scot#9 thanks a lot. Will get working now to acquire those books and get myself busy.</p>\n]]>", "author": "Aviti", "published": "2015-07-04 08:20:00+00:00", "title": "By: Aviti"}, {"content": "<![CDATA[<p>It&#8217;s seems the problem was more with a failure of imagination regarding the expressiveness of Boolean functions than about coming up with new Quantum algorithms?</p>\n]]>", "author": "fred", "published": "2015-07-04 22:33:33+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Aviti #10<br />\nas an engineer, I found the book &#8220;Quantum Computing for Computer Scientists&#8221; to be quite good, with very lots of clear practical exercises.</p>\n]]>", "author": "fred", "published": "2015-07-04 22:39:15+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Fred #11: Yup.</p>\n]]>", "author": "Scott", "published": "2015-07-05 02:46:23+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>This seems like one of those rare cases where all the mathematical machinery has been there for some time, and the scientists&#8217; imagination had to catch up. I wonder if John Bell&#8217;s discovery of his famous theorem felt the same way&#8230; After all, the EPR paradox had been out there for 30 years by then. </p>\n<p>And it makes one think what other &#8220;obvious in retrospect&#8221; discoveries are just waiting to be revealed.</p>\n]]>", "author": "Shmi Nux", "published": "2015-07-05 05:34:49+00:00", "title": "By: Shmi Nux"}, {"content": "<![CDATA[<p>Shmi Nux #14:</p>\n<ul>This seems like one of those rare cases where all the mathematical machinery has been there for some time, and the scientists’ imagination had to catch up.</ul>\n<p>Such cases are not particularly rare!</p>\n<p>Bell&#8217;s Theorem is a slightly different case, where it took 30 years for anyone even to <i>pose the question</i> with any mathematical precision&#8212;but once they did, the answer was just simple arithmetic.  Here, the questions were posed in the 1990s, but it took until now for anyone to have the right idea about what the answers would look like.</p>\n<ul>And it makes one think what other “obvious in retrospect” discoveries are just waiting to be revealed.</ul>\n<p>If you find any, let us know! 😀</p>\n]]>", "author": "Scott", "published": "2015-07-05 14:16:12+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #15,</p>\n<p>Speaking of &#8220;waiting for scientists imagination to catch up&#8221;, check out the following and be prepared to say: &#8220;Why didn&#8217;t I think of this&#8221;:</p>\n<p><a href=\"http://www.theguardian.com/science/2015/jul/06/philae-comet-could-be-home-to-alien-life-say-top-scientists\" rel=\"nofollow\">http://www.theguardian.com/science/2015/jul/06/philae-comet-could-be-home-to-alien-life-say-top-scientists</a></p>\n]]>", "author": "Raoul Ohio", "published": "2015-07-06 02:29:09+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Fred #12, thanks a lot.</p>\n]]>", "author": "aviti", "published": "2015-07-06 03:01:39+00:00", "title": "By: aviti"}]