[{"content": "<![CDATA[<p>Fascinating! &#8230;(reminds me slightly of an instance I stumbled upon in the Kasner & Newman classic, &#8220;<strong>Mathematics and the Imagination</strong>&#8221; where they gave erroneous limiting values for the radii of circles inscribing or circumscribing successive polygons, <em>aka</em> the &#8220;polygon-inscribing constant&#8221; and the &#8220;polygon-circumscribing constant.&#8221; Their volume was originally published in 1940, but my 1989 edition was still not corrected, though other math books do carry the correct values).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/R:Shecky.html\">Shecky R</a>", "published": "2014-12-03 19:39:41+00:00", "title": "By: Shecky R"}, {"content": "<![CDATA[<p>hi, a big fan of your am scientist columns & books etc.<br />\nyep this finding of the counterexample is one of the great/ celebrated early findings of empirical mathematics via computer experiments.<br />\nsee also <a href=\"http://vzn1.wordpress.com/2014/02/14/great-moments-in-empiricalexperimental-mathtcs-research-breakthough-sat-induction-idea/\" rel=\"nofollow\">great moments in empirical math</a> and <a href=\"http://vzn1.wordpress.com/2014/11/26/collatz-striking-visualization-of-binary-density-for-3x-1-operation/\" rel=\"nofollow\">latest collatz conjecture experiments</a></p>\n]]>", "author": "vzn", "published": "2014-12-04 04:27:27+00:00", "title": "By: vzn"}, {"content": "<![CDATA[<p>Very interesting! I also found amusing the definitive tone of the sentence &#8220;does not contribute to the conceptual framework of mathematical activity&#8221;. Maybe the author is asking too much from a counterexample &#8211; closing down a false avenue is actually quite an important contribution. Did the attitude towards computations change since then?</p>\n]]>", "author": "LK", "published": "2014-12-04 13:42:49+00:00", "title": "By: LK"}, {"content": "<![CDATA[<p>Is computation a respectable activity in mathematics these days? I guess opinions differ and tastes differ. There&#8217;s certainly an enthusiastic community working in &#8220;experimental mathematics&#8221;; for example, see <a href=\"http://www.ams.org/notices/201110/rtx111001410p.pdf\" rel=\"nofollow\">this essay</a> by David Bailey and Jon Borwein. But maybe a brute-force search for counterexamples is not the most elegant or subtle use of our power tools.</p>\n<p>My scan of the 1970 article cut off the author in mid-sentence. Here&#8217;s how the passage continues:</p>\n<blockquote><p>Atkin <em>[2]</em> discusses this point in connection with what he calls feasible computability; in his words &#8220;each new generation of machines makes feasible a whole new range of computations; provided mathematicians pursue these rather than merely break old records for old sports, computation will have a significant part to play in the development of mathematics.&#8221;</p></blockquote>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2014-12-04 18:28:34+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>I had another strategy for correcting the error. I reached behind me for my copy of Guy, Unsolved Problems in Number Theory, 3rd ed., looked at the Table of Contents, saw Section D (Diophantine Equations), and within it problem D1 (Sums of like powers. Euler&#8217;s conjecture.), which directed me to page 209. The correct equation is at the top of page 210, and the reference is given at the end of the problem discussion, on page 217. </p>\n<p>Full marks to you for spotting the parity violation!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Myerson:Gerry.html\">Gerry Myerson</a>", "published": "2014-12-05 02:20:18+00:00", "title": "By: Gerry Myerson"}, {"content": "<![CDATA[<p>Nice. FYI, a simple speedup of the Python can be done by using a set for the lookup, e.g. sfifths = set(fifths), and &#8220;if cc_sum in sfifths&#8221;.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/O'Boyle:Noel.html\">Noel O'Boyle</a>", "published": "2014-12-05 10:46:48+00:00", "title": "By: Noel O'Boyle"}, {"content": "<![CDATA[<p>Yes! Thanks for the astute suggestion. Getting <em>O(1)</em> rather than <em>O(n)</em> access is clearly the right thing to do, and it makes a difference in practice. Runtime drops from 36 seconds to 8 seconds.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2014-12-05 12:51:05+00:00", "title": "By: Brian Hayes"}]