[{"content": "<![CDATA[<p>Gil #120: I don&#8217;t endorse everything Teddy Roosevelt said or did, and I probably don&#8217;t even fully endorse that particular quote.  But the quote <i>is</i> perfectly clear about the &#8220;blood and sweat and tears&#8221; being on the doer&#8217;s own face, not other people&#8217;s.</p>\n]]>", "author": "Scott", "published": "2017-10-15 15:59:00+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Aspect #123: Thanks so much.  To quote the early xkcd&#8212;in a different but very likely related context&#8212;I indeed feel like <a href=\"https://xkcd.com/55/\" rel=\"nofollow\">&#8220;my normal approach is useless here.&#8221;</a></p>\n]]>", "author": "Scott", "published": "2017-10-15 18:13:50+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Gatekeeprs #100: props for mentioning this year&#8217;s Nobel Prize in Physics by the way.  It went to a very worthy place.  <a href=\"https://www.nobelprize.org/nobel_prizes/physics/laureates/2017/press.html\" rel=\"nofollow\">https://www.nobelprize.org/nobel_prizes/physics/laureates/2017/press.html</a>  Rainer Weiss, Barry C. Barish, Kip S. Thorne win the prize in 2017 for their work on gravitational wave detector.</p>\n]]>", "author": "jonas", "published": "2017-10-15 20:53:00+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>gentzen #125:</p>\n<p>In science it is always a bad idea to say &#8220;no way&#8221; in cases like this, so I will say instead &#8220;unlikely&#8221;. If you were to look at the content of what the best high schools taught as it pertains to mathematics and physics in the 1950s and you were to compare that with what it is being taught today in the best high schools on both topics -the qualification &#8220;best&#8221; is to make sure I remove other effects like the general deterioration of teaching quality in the West during the same time as it pertains to K-12 levels- I bet that there wouldn&#8217;t be much difference: students would be taught mostly classical mechanics with the promise of learning &#8220;general relativity&#8221; in college to those students interested in specializing in physics. The only meaningful change I can imagine is that today&#8217;s students use calculators/computers instead of slide rules. The fact that I can only point to this change also says something about the last 70-80 years. There have been vast improvements in technology but it seems we are working under the same scientific paradigms. </p>\n<p>I agree with Scott  #122 as to what constitutes revolutionary knowledge. As somebody said, once invented, almost anybody with the right training and attitude can do calculus. However, it takes a genius like Newton -or Leibniz- to invent calculus. The same can be said about classical mechanics, general relativity or the results due to Godel or Turing. </p>\n<p>The only theory I can see as with the potential of belonging to that league is string theory, but it would need to be empirically verified in the way the LIGO experiment verified the existence of gravitational waves, for example.</p>\n]]>", "author": "The Problem With Gatekeepers", "published": "2017-10-16 00:47:07+00:00", "title": "By: The Problem With Gatekeepers"}, {"content": "<![CDATA[<p>I remember looking at Sowa&#8217;s blog and thinking it was interesting and that its name and some of its contents were basically an affectionate joke.  I took Gowers&#8217; own link to it as a sign that Gowers had taken it in stride.</p>\n<p>Re #122 &#8220;In 20th-century mathematics, arguably only the work of Gödel, Turing, and Shannon really rises to that level&#8221;, I think you have to include von Neumann (foundations of QM etc), the discovery of chaos (hard to put a single name to it, but the foundational paper was written by Edward Lorenz, a meteorologist who discovered the butterfly through debugging his numerical weather prediction stuff, and realized it meant quite simple ODE&#8217;s had chaotic solutions, which he wrote up), Wiener (control theory / cybernetics), and maybe I&#8217;ll call the Feynman path integral a mathematical contribution.  Heck, why not add Cook and Levin, since &#8220;it&#8217;s not the critic who counts&#8221; can be explained by the Impagliazzo&#8217;s Five Worlds paper, where P!=NP shows why Gauss (the doer) really does have greater capability than Grouse (the critic).  </p>\n<p>I&#8217;ll also claim that type theory is relevant to the nature of knowledge, though not at the 5-year-old level.  As an applied example, see compcert.inria.fr which is about the only practical compiler in existence which experimentally appears to be practically free of bugs (it&#8217;s all done with type theory).  It&#8217;s particularly important if one is interested in proofs, beyond knowing that some things are provable and others aren&#8217;t.</p>\n]]>", "author": "asdf", "published": "2017-10-16 01:43:17+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>Interesting post. Einstein disappoints because he spent his last decades looking for a world that could be understood by an &#8216;Einstein&#8217; instead of looking for the real world, the world with things like higgs fields and cosmological constants in it.  Poor little fool! Feynman liked to play easy games too much: sort of like when you take your gramma to the casino and she is all like screw the roulette wheel the slots are shiny, and they got pictures of John Wayne and Harrison Ford and Gandalf on them!  Terry Tao &#8211; spent the first 30 years of his life chasing approbation for getting test questions right &#8211; like some nightmare where everybody is in an &#8220;elite&#8221; high school math class until they are middle aged, taking one test after another and putting down &#8216;brilliant&#8217; solutions simply to impress Teacher &#8230; Stephen Hawking &#8211; just as bad, but not test questions, answers to the mystery of the universe, as long as they could be narrated in a way that would make the chicks at the BBC ooh and aah over him&#8230; Eliezer Y. has the benjamins and the free time to do something with his life and he just refuses to grapple with anything but his parallel-to-the-world-religions view of &#8220;rationality&#8221;.  SlateStarCodex is People Magazine (by the way, the best magazine covering celebrity rehabs &#8211; an important subject if one runs a rehab center or invests in one) for monolingual technological people who get paid to assess people in trouble, using the latest coolest statistical props &#8230;  Shakespeare could have been a great playwright but he got bogged down in the minutiae of Elizabethan words, plus he did not really like people who were not young or rich  &#8230;. Homer&#8217;s Iliad is a little better than Hemingway, but not much &#8230; And nothing is more overrated than High Renaissance Italian Art &#8211; Michelangelo with his endless variations on &#8220;human&#8221; &#8220;proportions&#8221;, Raphael with his sad little attempts at showing what good-souled people would look like under eternal blue and true skies, and Leonardo&#8217;s crafty little versions of some future AI&#8217;s second-rate pastiche of painting.  Well everyone can be criticized.  I once helped a couple of guys push their car out of a snowy ditch and they did not even say thanks!  Not that I mind.  I pushed the car, they drove it.  I remember.</p>\n]]>", "author": "middle aged veterinarian", "published": "2017-10-16 01:57:41+00:00", "title": "By: middle aged veterinarian"}, {"content": "<![CDATA[<p>Scott:</p>\n<p>>  It’s purely a comment about me and my cognitive style.</p>\n<p>and </p>\n<p>> The higher part of my brain says that’s nonsense, that there’s obviously deep insight to be had in all these fields, given all the verifiably brilliant people who swear by them.</p>\n<p>A lot of this is actually about the differences in the way human brains work. Including what kind of abstractions seem natural to different people.</p>\n<p>The Typical Mind fallacy/Mind Projection fallacy is one of the most pervasive ones, and the hardest to accept as one&#8217;s own blind spot (in nerd fights it&#8217;s often something like &#8220;But this is so clear! How can anyone not get that!&#8221; and &#8220;This is super convoluted, there are far simpler ways to explain it!&#8221;).</p>\n]]>", "author": "Shmi", "published": "2017-10-16 02:04:21+00:00", "title": "By: Shmi"}, {"content": "<![CDATA[<p>The Problem With Gatekeepers:</p>\n<p>String Theory has made multiple testable predictions, and every single one of them has been successfully falsified. 10/11 dimensions? Check. Superpartners? Check. You can continue the list, starting from the original failed string model for the strong interaction. </p>\n<p>The reason String Theory is still alive is because of the dire state of competing models, and because of the tantalizing glimpses of the potential advances that it offers, like the AdS/CFT correspondence and the holographic principle in general. That&#8217;s why string theorists shrug and say &#8220;well, the dimensions could be curled on themselves so we can&#8217;t see them yet&#8221;, &#8220;The superpartners could be too heavy for our instruments to see them&#8221; and so on.</p>\n<p>It is becoming more and more likely that any significant advances in unifying QM and GR will be heavily based on the information theoretical ideas, and the Scott&#8217;s talk last week, which I hope to understand at least 10% of once it&#8217;s posted online and maybe explained by the author on this blog, might be highlighting some baby steps in that direction.</p>\n]]>", "author": "Shmi", "published": "2017-10-16 02:35:42+00:00", "title": "By: Shmi"}, {"content": "<![CDATA[<p>#129:<br />\n&#8220;There have been vast improvements in technology but it seems we are working under the same scientific paradigms.&#8221;</p>\n<p>Well, in terms of mathematics and the physical sciences, most of the low-hanging fruit has probably been picked, with physics being by far the most advanced of the human sciences.  </p>\n<p>But other areas have been neglected.  Specifically, I think the really big revolutionary advances of the future will be mainly in the social and cognitive sciences.  </p>\n<p>In terms of AI-related stuff, we&#8217;ve got to understand concepts and knowledge representation!  Probability theory can&#8217;t handle concepts and planning (memory and imagination).  And this is all tied up with the &#8216;control problem&#8217; I believe.  Understand concepts and knowledge representation, the answers to the control problem will fall out naturally I&#8217;m claiming!</p>\n<p>Go to my wiki-book here and carefully read though my A-Z list of central concepts in the field of knowledge representation (I&#8217;ve now greatly improved and expanded the lists, this one&#8217;s now up to 144 entries):</p>\n<p><a href=\"https://en.wikipedia.org/wiki/User:Zarzuelazen/Books/Reality_Theory:_Ontology%26Concepts\" rel=\"nofollow\">https://en.wikipedia.org/wiki/User:Zarzuelazen/Books/Reality_Theory:_Ontology%26Concepts</a></p>\n<p>Too many of these entries are only at the level of philosophy rather than proper science.</p>\n<p>Here is where AI researchers should be directing their point-of-attack!</p>\n]]>", "author": "mjgeddes", "published": "2017-10-16 03:19:40+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>Scott #110:</p>\n<p>I am surprised at your assessment of the level of intellectual discourse on r/sneerclub. I do not post there myself, but I have been exposed to new ideas as a result of browsing that subreddit, as well as related anti-rationalist forums. I&#8217;d say that I used to be someone who agreed with most of what you and Scott Alexander had to say about the topic, but now I am not: and the reasons I had for changing my mind were (at least by my own lights) principled and informed. One might even say that it was &#8220;rational&#8221; to change my mind! For instance, I actually found the discussion of Ron&#8217;s role in HPMOR that you alluded to in your original post really insightful. The fact is, part of the reason that I liked HPMOR in an earlier time in my life was because I had the same toxic mindset that permeates that entire work regarding the importance of intelligence and the role of &#8220;ordinary&#8221; people. Reading that post about Ron helped me identify and characterize that mindset both in myself and in the work. There&#8217;s a thread about IQ that directly criticizes you on the front page, and inside, there&#8217;s a discussion of Kropotkin that left me (as you put it) &#8220;intellectually sated.&#8221; There&#8217;s also links on that subreddit to criticisms of predictions re: the singularity and superintelligence that changed my mind on the subject and were quite interesting in their own right. I could go on.</p>\n<p>Of course, I also think that &#8220;sneering&#8221; is often more worthwhile than attempting to engage with certain people earnestly. But the two are not mutually exclusive: you can sneer, and you can offer cogent criticisms of your opponent&#8217;s position. And I find that your dismissal of what you&#8217;ve found in r/sneerclub wanting: there&#8217;s a lot of content there that you either have dismissed or failed to notice. Which makes me think that your central thesis &#8212; that it&#8217;s easier to criticize than to build something up &#8212; is not really true, at least not in this case (I hesitate to speak more generally). The only asymmetry I see between your post and some of the posts on r/sneerclub is that I am broadly convinced by the latter and I find the former frustratingly uncharitable.</p>\n]]>", "author": "tb", "published": "2017-10-16 03:59:42+00:00", "title": "By: tb"}, {"content": "<![CDATA[<blockquote><p>Gatekeepers #98: In the last (say) 70 years, would you say that Russia or Europe produced any scientific discoveries comparable to general relativity or quantum mechanics or Turing computation? If not, then consider the possibility that we’re not talking about a European vs. American phenomenon at all.</p></blockquote>\n<p>The unbelievable unification of biology, chemistry, material science, and physics in the last 70 years qualifies as a scientific achievement surpassing both general relativity and Turing computation in how it affects our daily lives and in how both scientists and normal people perceive the world. It does not surpass quantum mechanics, since quantum mechanics enabled that achievement in the first place. And just like quantum mechanics, it was not the work of a single person (like general relativity and Turing computation), but the collaborative effort of many different people over a long period of time. I have no idea of the relative contributions of America, Russia, or Europe to that achievement. However, I think that this achievement provides strong evidence that current academic traditions of &#8220;agreement and compliance&#8221; are no worse than previous academic traditions of &#8220;disagreement and noncompliance&#8221; (with your opposer) when it comes to advancing science and embracing new paradigms.</p>\n<p>I am not a physicists, and I don&#8217;t know how closely theoretical physicists still associate themselves with mathematics. But for bleeding edge experimental physics, chemistry and material science are no less important than mathematics. Even astrophysics can not afford to neglect astrochemistry. And it goes the other way too, bleeding edge chemistry and material science are no longer possible without advanced physical imaging methods like nuclear resonance tomography or electron microscopy.</p>\n<p>Even so the mathematics produced by attempts to unify QM and GR is deep and satisfying, it is pale compared to the real contributions of physics to our understanding of the world and to enable advances in chemistry and related sciences. And many applications of the (probabilistic or) stochastic paradigm embraced by quantum mechanics and thermodynamics are still out there waiting for scientists to discover and elaborate them, independent of whether mathematics follows that stochastic paradigm or not.</p>\n]]>", "author": "gentzen", "published": "2017-10-16 09:03:34+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>I may not have thick enough skin for this kind of forum.  As someone who sometimes finds himself nodding along with both Zeilberger and sowa, I may be too impressionable.  But as the kind of amateur who enjoyed Quantum Computing since Democritus and gave a logic course for undergrads based on who could name the big of number, I continue to hope that computer scientists will make more honest efforts to learn and contribute to algebra.</p>\n<p>I feel compelled to advertise once again on this blog that I do not know the computational complexity of some of the most basic algebro-topological invariants, such as the topological K-theory of a finite simplicial complex.  All work on complexity in algebraic topology that I am aware of seems to either reduce to Postnikov tower ideas from the 50s, or be spun off from Anick&#8217;s work on unstable rational homotopy theory in the late 80s.  It depresses me that even people as strong as Gowers seem all too willing to be scared off by words like spectral sequence.  I have often literally heard algebraic topologists say things like &#8220;I have known since the 70s that this computation is hard in general&#8221;, but there is no market for the unproven theorems behind their statements.</p>\n]]>", "author": "Jeremy", "published": "2017-10-16 11:03:47+00:00", "title": "By: Jeremy"}, {"content": "<![CDATA[<p>Scott #33</p>\n<p>I honestly think the whole CS theory community would benefit from an extended question and answer session entitled &#8220;What&#8217;s the point of Theory B?&#8221;. The questions would hopefully be answered by the leading lights in their respective areas.</p>\n<p>I am not sure I know any serious Theory A researchers who can point to specific examples of why current Theory B research is important and/or exciting. This is a massive gap in mutual understanding between neighboring research fields.</p>\n<p>And yes, I am volunteering you to instigate this.</p>\n]]>", "author": "TheoryA", "published": "2017-10-16 11:08:50+00:00", "title": "By: TheoryA"}, {"content": "<![CDATA[<p>tb #135: Your polite brief for SneerClub reminds me of a &#8220;good cop / bad cop&#8221; routine.</p>\n<p>One cop says to me, &#8220;you vain fuck, you mediocrity with a shitty blog, you dickhead,&#8221; while the other one says, &#8220;I&#8217;m genuinely surprised that you don&#8217;t listen more to my colleague over here; he makes some insightful points that changed the way I think about these questions&#8230;&#8221; 🙂</p>\n<p>The &#8220;fascinating&#8221; threads you mention distort my views to where I no longer recognize them.  E.g., they somehow took a blog post in which I <b>criticized</b> the design of IQ tests, and argued for IQ&#8217;s basic irrelevance for individuals (as opposed to population-level research)&#8212;and then force-fit it into the frame that I&#8217;m yet another IQ elitist who thinks people with low IQs don&#8217;t deserve to live, or something?  I found nothing objectionable about the quoted Kropotkin passage, <i>except</i> for the un-argued insinuation that the passage somehow refuted something I had said (what, exactly?).  How can I engage with people whose view of me is determined like ~98% by hostile preconceptions, rather than by what I actually write?</p>\n<p>Incidentally, I, too, am extremely skeptical of predictions about a singularity in this century, and often argue with my friends in the rationalist community about it&#8212;but to me, the very fact that I <i>argue</i> puts me closer to them than to the sneerers.  Contrary to what you say, there&#8217;s really no place whatsoever for sneering, if you think (as I do) that there&#8217;s <i>any</i> non-negligible chance that your opponents might turn out to be right, or even if there&#8217;s anything to be learned from them&#8212;and if your opponents have extended you the courtesy of not sneering at you.</p>\n]]>", "author": "Scott", "published": "2017-10-16 13:35:08+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Jeremy #137:</p>\n<ul>I feel compelled to advertise once again on this blog that I do not know the computational complexity of some of the most basic algebro-topological invariants, such as the topological K-theory of a finite simplicial complex. All work on complexity in algebraic topology that I am aware of seems to either reduce to Postnikov tower ideas from the 50s, or be spun off from Anick’s work on unstable rational homotopy theory in the late 80s. It depresses me that even people as strong as Gowers seem all too willing to be scared off by words like spectral sequence.</ul>\n<p>You&#8217;re a grad student?  It sounds to me like, in the above passage, you&#8217;ve just carved out an <i>extremely</i> promising research agenda for yourself!  The people on earth who both (1) understand algebraic topology, and (2) understand (and are non-dismissive of) computational complexity, can indeed probably be counted on the fingers of one hand.  Rather than decrying the situation, I encourage you to see it as an opportunity.</p>\n<p>You worry that there might be no &#8220;market&#8221; for complexity results about topology&#8212;but I can tell you that, e.g., the work by Hass, Lagarias, and Pippenger, and subsequent work by Kuperberg and others, on the computational complexity of unknottedness was well-received in the TCS community (or certainly by me 🙂 ).  As was the work by Babai, Seress, et al. that applied the classification of finite simple groups to computational group theory, and pretty much any other work that uses deep math to answer questions that the TCS community is able to understand.</p>\n]]>", "author": "Scott", "published": "2017-10-16 13:49:30+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Regarding modern achievements along the lines of Godel, Turing, Einstein: what about Game Theory by von Neumann and Nash?</p>\n]]>", "author": "Atreat", "published": "2017-10-16 12:51:10+00:00", "title": "By: Atreat"}, {"content": "<![CDATA[<p>#tb,</p>\n<p>&#8220;One might even say that it was “rational” to change my mind! For instance, I actually found the discussion of Ron’s role in HPMOR that you alluded to in your original post really insightful. The fact is, part of the reason that I liked HPMOR in an earlier time in my life was because I had the same toxic mindset that permeates that entire work regarding the importance of intelligence and the role of “ordinary” people. Reading that post about Ron helped me identify and characterize that mindset both in myself and in the work.&#8221;</p>\n<p>The entire discussion seemed to me to be a strawman of what Eliezer was doing by focusing essentially on the literary necessity of Ron&#8217;s role, which is a justification for Ron to exist at an outside the story level in the original material, but not much of a reason for him to be an interesting or major character in a rationalist-focused fic. (That said, at least one HPMOR inspired fanfic, Arithmancer did do interesting things with Ron). </p>\n<p>&#8220;There’s a thread about IQ that directly criticizes you on the front page, and inside, there’s a discussion of Kropotkin that left me (as you put it) “intellectually sated.”&#8221;</p>\n<p>Where are you looking? The vast majority of that thread is more sneering, accusing Scott of having a persecution complex and all sorts of very strange things that seem even stranger when one realizes that one of the primary points of both his post and the Scott A post was that IQ isn&#8217;t by itself a useful individual metric for most purposes. Frankly, it seems like the entire thread is missing the point, almost deliberately. And the only &#8220;discussion&#8221; of Kropotkin is two long quotes, which also seems to be more of a strawman of what anyone has been arguing. For example, it starts off with &#8220;yeah the fact that a lot of these guys can&#8217;t articulate or full-throatedly support a defense of inherent human value that isn&#8217;t conditioned on intelligence is so frustrating to me. &#8221;  This seems ridiculous at multiple levels: First of all, Scott Alexander and Yudkowsky have discussed a lot what they think of in terms human values. Second it is pretty easy to determine  simply from what he does for a living that Scott Alexander has a pretty damn high opinion of inherent human value for people who aren&#8217;t that intelligence. Third, most people don&#8217;t bother going around giving &#8220;a a defense of inherent human value that isn&#8217;t conditioned on intelligence&#8221; because there&#8217;s generally no need to because people in our society (including the dreaded rationalists) generally take this for granted; apparently the readers of Sneerclub are reading into things a belief that isn&#8217;t remotely present.</p>\n<p>&#8220;There’s also links on that subreddit to criticisms of predictions re: the singularity and superintelligence that changed my mind on the subject and were quite interesting in their own right&#8221;</p>\n<p>Which specific links did you find to fit into this category?</p>\n]]>", "author": "Joshua Zelinsky", "published": "2017-10-16 13:07:00+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>TheoryA #138: Sorry, too much on my plate right now!  I volunteer <i>you</i> to organize and host that Q&#038;A session. 🙂</p>\n]]>", "author": "Scott", "published": "2017-10-16 14:03:14+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #141, &#8220;Contrary to what you say, there’s really no place whatsoever for sneering, if you think (as I do) that there’s any non-negligible chance that your opponents might turn out to be right, or even if there’s anything to be learned from them—and if your opponents have extended you the courtesy of not sneering at you.&#8221;</p>\n<p>+1</p>\n<p>Scott is articulating the ideal and one I wholeheartedly agree with. Now, humans being humans, we all fall short of this ideal at times, but (*crucially*) it is the ideal and one we should strive for.</p>\n<p>Folks who do not share belief in this ideal are very hard for me to communicate with even though I also fall short of this ideal many times.</p>\n]]>", "author": "Atreat", "published": "2017-10-16 14:17:33+00:00", "title": "By: Atreat"}, {"content": "<![CDATA[<p>Scott #138 </p>\n<p>One option would just be to pose the question as a blog post and see what happens (notice how I returned the workload to you 🙂 ).</p>\n<p>But a guest post be a Theory B expert might be even better.</p>\n]]>", "author": "TheoryA", "published": "2017-10-16 14:21:02+00:00", "title": "By: TheoryA"}, {"content": "<![CDATA[<p>As an example: the facebook discussion between t&#8217;Hooft and Tim Maudlin recently was an excellent example of two people genuinely trying to communicate even though they were sneering at times. Frustration happens. Human communication is messy and full of emotion. But, crucially, both sides were investing some amount of good faith in trying to come to a meeting of the minds.</p>\n<p>SneerClub is almost by definition all about erasing any good faith from the discussion. To ask Scott and others to try and navigate the morass of bad faith offered in the hope of finding some good ideas or worthy criticism is perhaps a bit too much??!! <&#8211; trying really hard not to sneer 🙂</p>\n]]>", "author": "Atreat", "published": "2017-10-16 14:25:36+00:00", "title": "By: Atreat"}, {"content": "<![CDATA[<p>Hi Scott<br />\nI might agree with you about Godel/Turing/Shannon if you think about scientific/technological/society impact, but pure math, which is what sowa is interested in is neither about science (math that nature happens to use), nor  technology/engineering.<br />\nIn fact, if that is the criteria I dont think that Gauss/Riemann/Euler would count as greats from your point of view (Newton would). Yet, mathematicians would count them as greats and try to continue their legacies.<br />\nRegarding the last 70 years in terms of pure math, I think that two major conceptual advances are, The Grothendick program (A.K.A., arithmetic geometry), which helped solve major (and concrete) number theoretic problems using geometric means<br />\nThe Langlands program which relates number theory  to representation theory, the third is the influence of string theory on geometry, giving fantastic new insights and introducing amazing dualities. Moreover, there are very strong connections between all three. I would also mention the Thurston program in low dimensional geometry which has been the most successful in terms of implementation, the related Schramm program as a major new insight in probability which is also strongly related to conformal field theory and has revolutionized the field and the work of Gromov, again  in geometry. Europeans and definitely Russians played a major role in all these developments.<br />\nAll these have up to now, essentially zero influence outside math and they are all really difficult, so few mathematicians, even in number theory, representation theory, geometry and probability actively work on them, much as most computer scientists dont try to prove lower bounds.</p>\n<p>I think what worries sowa and others is that even fewer people will want to work in these challenging areas in the future.<br />\nI dont support sowa otherwise, I think Gowers and Tao are awesome</p>\n]]>", "author": "eitan bachmat", "published": "2017-10-16 14:41:12+00:00", "title": "By: eitan bachmat"}, {"content": "<![CDATA[<p>Oh, and the rise of ergodic theory, Furstenberg, Margulis, Ratner, Eskin-Mirzakhani, Mcmullen&#8230; (closer to Gowers and Tao)</p>\n]]>", "author": "eitan bachmat", "published": "2017-10-16 14:45:12+00:00", "title": "By: eitan bachmat"}, {"content": "<![CDATA[<p>To add to #142 there are several important research agenda relating topology and complexity and let me mention one. Two papers by Gregory R. Chambers, Dominic Dotterrer, Fedor Manin, Shmuel Weinberger representing a major breakthrough on a conjecture of Gromov (in fact a whole array of conjectures)  are  <a href=\"https://arxiv.org/abs/1610.04888\" rel=\"nofollow\">https://arxiv.org/abs/1610.04888</a> and <a href=\"https://arxiv.org/abs/1611.03513\" rel=\"nofollow\">https://arxiv.org/abs/1611.03513</a> . Complexity and Topology is a main research agenda for Weinberger for over a decade, and it is related to a lot of very deep and difficult mathematics</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2017-10-16 15:00:04+00:00", "title": "By: Gil Kalai"}]