[{"content": "<![CDATA[<p>I had to look up the word teleology to understand your Nautilus interview. Wow-wee, now I know some philosophy. I shall endeavor to forget it as soon as possible.</p>\n]]>", "author": "rrtucci", "published": "2015-02-20 08:39:41+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>Sniffnoy #19: On the contrary, ALL the money goes to the student.  (I don&#8217;t even handle the money; the student and the P&ne;NP prover arrange that themselves.)</p>\n]]>", "author": "Scott", "published": "2015-02-20 10:41:31+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Very moving story about an almost-forgotten founder of computer science. He was even less fortunate than Grothendieck, who at least didn&#8217;t die prematurely as an alcoholic. Somehow he was at the mercy of his spiritual fathers. Had he been able to achieve his work on probabilistic three-dimensional neural networks, we&#8217;d probably know more about how the brain works by now&#8230;</p>\n]]>", "author": "Serge", "published": "2015-02-20 11:20:41+00:00", "title": "By: Serge"}, {"content": "<![CDATA[<p>Great article & great interview of you, Scott. I&#8217;m really digging Nautilus.</p>\n]]>", "author": "Vadim", "published": "2015-02-20 14:23:07+00:00", "title": "By: Vadim"}, {"content": "<![CDATA[<p>Challenge: Produce a deterministic, formally-illogical algorithm, for a non-trivial problem, that produces the right answer with bounded error and performance comparable to a deterministic logical algorithm.</p>\n<p>As building blocks, consider borrowing from this list of non-sequiturs (one is sufficient :)):<br />\n<a href=\"http://en.wikipedia.org/wiki/Non_sequitur_(logic)\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Non_sequitur_(logic)</a></p>\n<p>Maybe that&#8217;s not so interesting &#8211; we can certainly craft problems for which non-sequiturs happen to work pretty well &#8211; but consider the hypothetical class <i>Bounded-Error Illogical Polynomial Time</i>. How does it relate to other classes?</p>\n<p>While it&#8217;s true that, unlike a randomized algorithm, a deterministic illogical algorithm will consistently fail or succeed on the same input, we can always just &#8220;shuffle&#8221; the input and retry.</p>\n]]>", "author": "Job", "published": "2015-02-20 14:40:47+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>Alex #17: Yeah, I was also a bit skeptical about that part of the article.</p>\n]]>", "author": "Scott", "published": "2015-02-20 15:04:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Re #17 and #25:</p>\n<p>I can make a plausible guess about this. Perhaps he/they had an insight about digital logic aspects of the brain. Furthermore, this was early on in the evolution of this concept. And it is very common to go &#8220;all in&#8221; on new ideas (compare to the common observation that the recently converted are often the worst religious nuts). Thus, when the &#8220;messy analogue pre-conditioning&#8221; in the eye was found, it appeared to be at odds with the pure theory they had been developing, and thus a real bummer.</p>\n<p>From the Speed of Light Update desk: It is widely reported today that the speed of light has been demonstrated to NOT be a constant c, but to vary (for various reasons, including non-vacuum) with an upper bound of c. Check it out online.<br />\nDecades ago I read a related paper by Ernst Breitenberger that relativity should be based on (what EB called) &#8220;the signal velocity&#8221; s with the requirement that c .LE. s.<br />\nI had not been aware that active &#8220;Speed of Light&#8221; work was ongoing. But, when considering cosmology, it seems to me that there might be something we don&#8217;t get, so reexamining every step is important.</p>\n]]>", "author": "Raoul Ohio", "published": "2015-02-20 22:19:21+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>I did&#8217;nt knew either this piece of history. Thank you very much!<br />\nK.</p>\n]]>", "author": "anon", "published": "2015-02-21 22:17:10+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>The article notes that the logical calculus paper by McCulloch  and Pitts inspired von Neumann. It was also noticed by Rabin and Scott who cite it as an example of a graph-based representation of languages in their paper on finite automata.</p>\n]]>", "author": "Vijay D'Silva", "published": "2015-02-22 01:27:03+00:00", "title": "By: Vijay D'Silva"}, {"content": "<![CDATA[<p>It&#8217;s fascinating that von Neumann and the EDVAC architecture were so heavily influenced by McCulloch and Pitts&#8217; calculus and neural networks.</p>\n<p>Personally I had the impression that the early history of computers involved people trying to make physical realizations of Turing machines. Was that at all true? If it was, it seems people changed course pretty quickly&#8230;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/f/Flynn:Thomas.html\">Thomas Flynn</a>", "published": "2015-02-22 08:44:57+00:00", "title": "By: Thomas Flynn"}]