[{"content": "<![CDATA[<p>@mjgeddes #6</p>\n<p>It is called Wick rotation and it is a well known tool of quantum theory, transforming your problem into an exercise in statistical mechanics.<br />\nIt is not so clear how it works for quantum gravity, but in special cases it can be done (e.g. by Hartle&Hawking).</p>\n]]>", "author": "wolfgang", "published": "2018-03-17 16:16:20+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Hawkings appeared on ST-TNG, Futurama, The Simpsons, and more also The Big Bang Theory (7 times!). On TBBT they also mention him often. This of course makes sense since TBBT is about a photon of physicists (little known fact: Photon is the plural word for physicists).</p>\n<p>He always played himself.</p>\n<p>I suspect these appearances made viewers more aware of science. I wonder if, just as Scott and Lance (see Complexity Blog) were influenced (positively!) by Hawking&#8217;s books, if others may be influenced (positively!) by his TV appearances.</p>\n]]>", "author": "GASARCH", "published": "2018-03-17 20:23:41+00:00", "title": "By: GASARCH"}, {"content": "<![CDATA[<p>Extending functions into the complex plane is of course common, already Sundman was doing that when he solved the 3-body problem. I take it that Scott was not asking about that basic idea, but about the implications in this case.</p>\n]]>", "author": "Jr", "published": "2018-03-17 23:25:03+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Perhaps I should add that Hawking&#8217;s scientific achievements and his appetite for life were both admirable. The world is a  poorer place without him.</p>\n]]>", "author": "Jr", "published": "2018-03-17 23:32:39+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Jr #9: IIRC, he was presenting imaginary time not just as a useful mathematical trick, but as an important component of reality.</p>\n<p>But it was one of his trademarks to make brief, bold, and enigmatic proclamations of that kind, and leave it for others to figure out what they meant.  That’s something that he could get away with and most of us only wish we could. 🙂</p>\n]]>", "author": "Scott", "published": "2018-03-18 11:49:15+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>On &#8220;imaginary time&#8221;, I found that learning about the <a href=\"https://en.wikipedia.org/wiki/Method_of_steepest_descent\" rel=\"nofollow\">method of steepest descent</a> inspired in me a striking mental picture of what is going on. I emphasize that I&#8217;m not familiar with Hawking&#8217;s work and so I don&#8217;t know how accurate this picture actually is.</p>\n<p>These quantum mechanical questions are about oscillatory integrals over the infinite-dimensional space of field configurations. Instead, I&#8217;ll consider the easier question of oscillatory integrals on a one-dimensional space. A classical example is the Airy function, which up to normalization is defined by Ai(x) = int exp(i(xt+t^3/3))dt. When x<0 this function can be approximated using the stationary phase method, which is also what&#8217;s used to calculate quantum mechanical wavefunctions that closely approximate a classical trajectory. The idea is that for most values of t the expression exp(i(xt+t^3/3)) oscillates rapidly, and so the nearby values of t cancel each other out and the integral is small. However, near the critical values t=+-sqrt(-x), which are the points where (d/dt)(xt+t^3/3)=0, the integral concentrates around a particular phase for a longer interval, and the dominant contribution to the integral comes from around these points. It can be calculated that the width of these regions nonoscillatory regions is around (-x)^(-1/4), and so the value of Ai(x) is also around (-x)^(-1/4) for x<0, times some phase factor. These calculations be refined to give very precise estimates of Ai(x) as x goes to negative infinity.</p>\n<p>What about when x is greater than 0? Then there are no critical points; the function xt+t^3/3 has positive derivatives everywhere. Since there are no critical points, the estimate given by the stationary phase method as above is zero. More precisely, it can be shown this way that Ai(x) goes to zero faster than x^(-N) for any N as x goes to positive infinity. However, Ai(x) is not exactly zero, and we need a new method to determine exactly how small it gets.</p>\n<p>The solution is to extend the function exp(i(xt+t^3/3)) to complex values of t and interpret Ai(x) as a contour integral. Then it is possible to shift the contour to get a more tractable integral. Specifically, shifting the contour for short distances in the positive imaginary direction makes the amplitude of this function exponentially smaller. This continues until you reach the <i>complex</i> critical point t_0=i*sqrt(x). Shifting the contour any higher makes the amplitudes increase again. It is possible to shift the contour in such a way so that it reaches a peak value at t=t_0 and rapidly decreases away from this point. It follows that Ai(x)~exp(i(x*t_0+t_0^3/3)) =exp(-2/3*x^(3/2)).</p>\n<p>My mental picture for imaginary time, which I repeat is only an educated guess, is that something similar is happening. Hawking is calculating the probability amplitude of a certain hypersurface as a path integral over all field configurations of a four-dimensional manifold with this hypersurface as a boundary. There is no classical trajectory which leads to this hypersurface without a singular boundary, and this leads to the stationary phase method failing to give an answer. However, by complexifying the space of field configurations it is possible to find a complexified trajectory which is a critical point of the Lagrangian and shift the contour of the path integral so that configurations around that trajectory are the dominant contributors to the integral. I believe that what people are calling imaginary time is related to the imaginary component of this trajectory in the complexified space of field configurations.</p>\n<p>I would appreciate it if somebody who knows more about Hawking&#8217;s cosmological model would corroborate or refute the picture I just gave.</p>\n]]>", "author": "Itai Bar-Natan", "published": "2018-03-18 13:26:08+00:00", "title": "By: Itai Bar-Natan"}, {"content": "<![CDATA[<p>&#8216;Imaginary time&#8217; apparently has a physical interpretation as related to &#8216;inverse temperature&#8217;.   </p>\n<p>From the wikipedia article:<br />\n<a href=\"https://en.wikipedia.org/wiki/Wick_rotation\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Wick_rotation</a></p>\n<p>&#8220;Wick rotation connects statistical mechanics to quantum mechanics by replacing inverse temperature with imaginary time&#8221;</p>\n<p>Here are some quotes from an expert on Quora (published in Forbes):<br />\n<a href=\"https://www.forbes.com/sites/quora/2016/11/15/einstein-and-hawking-had-different-ideas-about-the-concept-of-imaginary-time/#381e3ab83e0e\" rel=\"nofollow\">https://www.forbes.com/sites/quora/2016/11/15/einstein-and-hawking-had-different-ideas-about-the-concept-of-imaginary-time/#381e3ab83e0e</a></p>\n<p>&#8212;<br />\nThe “imaginary time” associated with Hawking comes &#8230; from Feynman’s path integral formulation of quantum mechanics.<br />\n In basic terms, the path integral approach gives you the probability with which any state will transition from state a to state b, by evaluating the integral of all possible paths between them.</p>\n<p>Analyzing this problem is hard, and the integral of all possible paths blows up in your face. But there is a trick that (seemed) to simplify it, called “Wick rotation”. This trick crops up across physics, where it’s useful in classical and statistical mechanics problems, as well as in QM. What a Wick rotation does is to transform a problem posed in Euclidean space into a slightly different one posed in Minkowski space (and vice versa). Often, the analogous problem in the other space turns out to be easier, so you solve it there, and then transform back again. And so it proves here: the integrals turn out to be much easier once they are Wick rotated. The key substitution is similar to Minkowski’s original (give or take few constants), it’s usually written as t=−it′.</p>\n<p>Stephen Hawking and James Hartle built this trick into an approach called “Euclidean Quantum Gravity”, and at the time that Hawking wrote A Brief History of Time, it was top of Hawking’s mind as a promising research direction, and so he wrote a popular account of it in the book. However, the approach has not developed as Hartle and Hawking hoped, and Euclidean Quantum Gravity is now very much a minority interest.</p>\n<p>&#8212;</p>\n]]>", "author": "mjgeddes", "published": "2018-03-18 13:27:38+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>Thank you for the link to the obituary by Roger Penrose.</p>\n]]>", "author": "jonas", "published": "2018-03-18 17:53:04+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>Wishing a speedy recovery to Dick Lipton, who is recovering from heart surgery according to the most recent post on his blog:</p>\n<p><a href=\"https://rjlipton.wordpress.com/\" rel=\"nofollow\">https://rjlipton.wordpress.com/</a></p>\n]]>", "author": "asdf", "published": "2018-03-19 00:13:43+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>mjgeddes #6</p>\n<p>&#8220;Read an interesting tidbit about how better AI programs meant Hawking’s speech selection programs were getting faster and faster to the point where he didn’t have to type much because the program could anticipate what he wanted to say&#8221;</p>\n<p>Hmm&#8230; Once the matching probability is 99.9999% can we claim that the mind has been effectively &#8220;uploaded&#8221; into the machine?</p>\n]]>", "author": "fred", "published": "2018-03-19 21:05:26+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Well that Wick rotation stuff is very interesting indeed.</p>\n<p>The way I interpret it then is this:   classical thermodynamics can be generalized to obtain analogous notions in quantum physics.  So it looks like the Schrodinger equation is analogous to the ‘heat equation’ and ‘action’ (in the quantum physics sense) becomes analogous to kinetic energy.</p>\n<p>Then imaginary time is a sort of generalized notion of ‘temperature’. If you imagine temperature as related to thermal oscillations of matter caused by kinetic energy, then ‘imaginary time’ is referring to the oscillations of quantum paths (in Feynman’s path integral formulation).   The magnitude of these oscillations is given by the ‘action’.</p>\n<p>Quantum states can be interpreted as taking ‘random walks’ in a ‘space of possibility’ (quantum Brownian motion so to speak)!  There’s a ‘space of possibility’  (imaginary time), which, unlike real time, has the characteristic that you can move back just as easily as you can move forward.  Movements through ‘possibility space’ correspond to Feynman’s sum over histories &#8211;  states of matter exploring quantum possibilities at random.</p>\n]]>", "author": "mjgeddes", "published": "2018-03-21 03:59:04+00:00", "title": "By: mjgeddes"}]