[{"content": "<![CDATA[<p>Alan M- The movie you describe sounds like it could be an episode of NUMB3RS, though I&#8217;m not sure. In the episode the bad guys do kidnap the child of a mathematician working on RH&#8212; the show claims that RH &#8211;> Factoring easy, which while not currently know is not so implausible for a TV show, and that once you have the proof you could, within hours, have a fast algorithm, which is implausible.</p>\n<p>bill g.</p>\n]]>", "author": "gasarch", "published": "2014-12-18 19:43:54+00:00", "title": "By: gasarch"}, {"content": "<![CDATA[<p>Regarding Yooler for Euler, upper-class Brits have a penchant for the crude anglicization of foreign names. Perhaps the best example is &#8220;Quicks-oat&#8221; for Quixote. </p>\n<p>That said, British physicists are known to giggle when their American colleagues say &#8220;Plonk&#8221; for Planck (according to my German-speaking colleague it should actually be &#8220;Plank&#8221;). In the UK, plonk is a derogatory term for cheap wine and a plonker is a not-too-clever person.</p>\n]]>", "author": "Hamish", "published": "2014-12-19 16:21:43+00:00", "title": "By: Hamish"}, {"content": "<![CDATA[<p>I think in general, it&#8217;s pretty realistic for the movie to call him Yooler, since, well, that&#8217;s what *most* people (wrongly) call him&#8230;</p>\n]]>", "author": "Travis", "published": "2014-12-19 17:26:19+00:00", "title": "By: Travis"}, {"content": "<![CDATA[<p>Scott: Another contender for best prepared grad student of all time might be Lars Onsager. As I recall from the obituary in Physics Today, he was in the US on the eve of WW2. He was hired to be a physics prof at Yale, but did not have a PhD dissertation. Upon learning that he had solved all the problems but four in Whittaker and Watson&#8217;s &#8220;Modern Analysis&#8221;, which was known to have dozens of unsolved problems, the Math department gave him a PhD on the spot.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-12-19 18:22:45+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>My russian professors pronounced Euler Yooler too, and consequently I pronounce the name of my rabbit Yooler, so don&#8217;t think the movies invented that one out of whole cloth.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Meehan:Murray.html\">Murray Meehan</a>", "published": "2014-12-19 18:38:14+00:00", "title": "By: Murray Meehan"}, {"content": "<![CDATA[<p>While I think Turing did great work, the lambda calculus and its application to type theory and higher order logic was huge, and the application to solve the Entscheidungsproblem was also huge. Turing&#8217;s work, while important, is most appropriately labeled as computer science. Church&#8217;s is broader, in the field of mathematics and proof theory. I don&#8217;t think either figure should be minimized. If you&#8217;re a mathematician, you&#8217;re going to use Church&#8217;s work more, and if you&#8217;re a computer scientist, you&#8217;re going to hold more reverence for Turing.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Akin:Dez.html\">Dez Akin</a>", "published": "2014-12-19 19:52:53+00:00", "title": "By: Dez Akin"}, {"content": "<![CDATA[<p>I&#8217;ve heard of this guy:</p>\n<p><a href=\"http://phys.org/news/2014-12-thomas-vidick-quantum-code.html\" rel=\"nofollow\">http://phys.org/news/2014-12-thomas-vidick-quantum-code.html</a></p>\n]]>", "author": "asdf", "published": "2014-12-19 21:15:09+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>Fred #33</p>\n<p>Turing was most certainly <i>original</i> (brilliantly so) in that paper &#8211; but it wasn&#8217;t pioneering in dynamical systems theory for the same reason Poincare&#8217;s late 19th century paper on the stability of the Solar System wasn&#8217;t pioneering &#8211; not enough people understood its importance</p>\n<p>But back to the more controversial point &#8211; how pioneering/inflential was Turing in the history of (practical) computing?</p>\n<p>hmm, Scott will not like this comment, but I think that the (many) engineers of computers in the mid 20th century were far more important than the &#8220;theoretical computer science&#8221; ideas of Turing and others. Even Von Neumann is incorrectly credited with a (original, but not spectacularly so) contribution to the design of computing architecture &#8211; which was essentially due to engineers. </p>\n<p>In WW2 the british computers owed the biggest debt to Tommy Flowers, not Turing.</p>\n<p>And really, once the transistor had been discovered, how hard is it to work out that is it good to put the program in fast transitor memory (instead of on cards) along with the data.</p>\n<p>Furthermore, really, how hard would it be for an intelligent undergraduate to design a computer from scratch given modern circuit components, and a basic course in boolean algebra?</p>\n<p>Many engineers solved that problem with rudimentary devices available to them, all oblivious to the theoretical ideas of Turing, Von neumann etc</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2014-12-19 23:18:49+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>James #41<br />\nindeed in electronics class we had to design an entire ALU by hand on paper using basic gates. We certainly didn&#8217;t need any high level CS knowledge to do this (just understanding transistors, boolean logic, and binary arithmetics).<br />\nTo me Turing&#8217;s contribution was to take such a basic hardware and do a crazy jump into the magical realm of software, with fascinating practical concepts like emulation, virtual machines, etc.</p>\n]]>", "author": "fred", "published": "2014-12-21 06:12:08+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>The current Prime Minister of Singapore is, if not a professional mathematician, at least  a talented amateur who was Senior Wrangler in 1973.</p>\n<p><a href=\"http://en.wikipedia.org/wiki/Lee_Hsien_Loong\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Lee_Hsien_Loong</a></p>\n]]>", "author": "BPL23", "published": "2014-12-22 00:33:30+00:00", "title": "By: BPL23"}]