[{"content": "<![CDATA[<p>Wiggy #124:</p>\n<ul>Now Scott would answer “interference” but that is a little short. I suggest we just need two or more clear sentences to follow.</ul>\n<p>Reminds me of when a reporter asked Feynman to explain in a couple sentences what he had won the Nobel Prize for, and he answered that if he could do that, it wouldn&#8217;t have been <i>worth</i> a Nobel Prize. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /></p>\n<p>OK, OK, how about: &#8220;Quantum algorithms achieve speedups by exploiting the central phenomenon of quantum mechanics, which is <i>interference</i> between paths with different amplitudes.  The quantum algorithm designer carefully choreographs things so that the paths leading to each wrong answer interfere destructively and cancel each other out, while the paths leading to the right answer&#8212;or at any rate, to <i>some</i> answer that tells you <i>something</i> about your original problem&#8212;reinforce.&#8221;</p>\n]]>", "author": "Scott", "published": "2014-10-08 13:14:54+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Everyone: I heard back from the people at Cornell; they say they&#8217;re doing a light edit pass on the videos, but in the meantime, the old URLs <i>should have</i> continued to work; they&#8217;ll look into the matter and get back to me in a few days.</p>\n]]>", "author": "Scott", "published": "2014-10-08 13:19:00+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>#126</p>\n<p>Very interesting, thanks!</p>\n]]>", "author": "Jay", "published": "2014-10-08 13:51:18+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>#129 Scott, that&#8217;s very nice.  </p>\n<p>To follow it up, can I suggest that a Lakatos style dialogue (see <a href=\"https://en.wikipedia.org/wiki/Proofs_and_Refutations\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Proofs_and_Refutations</a> ) with imaginary inquisitors on the topic of quantum computing could be a) a huge amount of fun and b) immensely useful.</p>\n]]>", "author": "Wiggy", "published": "2014-10-08 15:13:02+00:00", "title": "By: Wiggy"}, {"content": "<![CDATA[<p>Jay #131: OK, I <a href=\"http://cstheory.stackexchange.com/questions/25995/for-a-random-oracle-r-does-bpp-equal-the-set-of-computable-languages-in-pr\" rel=\"nofollow\">posted your question on CS StackExchange</a>!  Thanks again for the interesting question; hopefully someone will answer it soon.</p>\n]]>", "author": "Scott", "published": "2014-10-08 15:14:28+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I got some basic questions.</p>\n<p>1) Is the hidden subgroup problem for all groups in BQP? (I know it is for some non-abelian groups, like generalized quaternion groups)</p>\n<p>2) What&#8217;s the relationship between BQP and NP-intermediate?</p>\n<p>3) Is circuit minimization in BQP? </p>\n<p>4) How can quantum algorithms be leveraged for first order theorem proving? Is search sufficient? 3 SAT seems pretty easy in comparison. I mean <i>technically</i> there&#8217;s a quadratic speedup for 3-sat, and you can reduce a SMT question to SAT, but what about for undecidable theories with infinite models? It&#8217;s not obvious to me how to implement resolution with a set of support with quantum search.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Akin:Dez.html\">Dez Akin</a>", "published": "2014-10-08 19:20:19+00:00", "title": "By: Dez Akin"}, {"content": "<![CDATA[<p>While you&#8217;re on the subject of the random oracles, what do you think about the random oracle hypothesis? The IP theorem gives a counterexample. Is there some substitute with algebraic oracles?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Knight:Douglas.html\">Douglas Knight</a>", "published": "2014-10-08 20:21:06+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>So, if I understand the responses so far, we indeed have BPP=P^R&#8217; and AM=NP^R&#8217;, through appeal to 1-0 law and known equivalences BPP=Almost-P and AM=Almost-NP (was bluffed by the appeal to 1-0 law!).</p>\n<p>This result, in addition to P^R⊂NP^R, confirm your conjecture that finding a computable problem separating P^R and NP^R (would lead to BPP⊂AM)/(is as hard to prove as BPP⊂AM). </p>\n<p>Thanks Scott for providing&posting a clean question, and thanks Grochow&Jeřábek for the answer!</p>\n]]>", "author": "Jay", "published": "2014-10-08 20:21:16+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Douglas #135: Don&#8217;t believe the Random Oracle Hypothesis, never did.  On the other hand, I dislike when people get dogmatic about these things.  Even if ROH fails, it can still be extremely interesting to know whether two complexity classes can or can&#8217;t be separated by a random oracle&#8212;basically, you&#8217;re asking whether there&#8217;s a &#8220;highly unstructured problem&#8221; (or better: problem with extremely weak promise) that one model of computation can solve and the other can&#8217;t.</p>\n<p>(For example, would you have guessed that P and NP can be separated by a random oracle, but that P and NP&cap;coNP <i>can&#8217;t</i> be&#8212;at least not without separating complexity classes in the unrelativized world?)</p>\n]]>", "author": "Scott", "published": "2014-10-08 22:40:05+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Dez #134:</p>\n<p>(1) Ettinger, Hoyer, and Knill showed that HSP can always be solved using a polynomial number of quantum queries to the group oracle.  Unfortunately, for most nonabelian groups (S<sub>n</sub>, D<sub>2n</sub>, etc.), we don&#8217;t actually know how to implement the measurement on the coset states in BQP&#8212;we only know that a measurement <i>exists</i> (possibly requiring exponential time)!  So, unknown.</p>\n<p>(2) There exist (probably) NP-intermediate problems, like circuit minimization, the turnpike problem, etc., that no one has had <i>any</i> good ideas for how to put in BQP.  In the other direction, we don&#8217;t know whether BQP is contained in NP.  So, I guess I&#8217;ll go with incomparable as far as anyone knows?</p>\n<p>(On the other hand, here&#8217;s an interesting question that just occurred to me.  Can one show that, if NP&nsub;BQP, then there must exist NP-intermediate problems that aren&#8217;t in BQP?  I conjecture that one could, using a variant of Ladner&#8217;s construction.  Of course, the NP-intermediate problem constructed this way will be extremely artificial.)</p>\n<p>(3) As I said, I&#8217;ve never seen any half-promising idea for how to put circuit minimization in BQP, though (I hope you&#8217;re sitting down for this&#8230;) we can&#8217;t rule it out either.</p>\n<p>(4) The question of what polynomial speedups one could expect for various specific NP-complete problems is an extremely messy and complicated one.  For one has to compare the <i>best</i> classical algorithm out there against the <i>best</i> quantum algorithm&#8212;and both might be extremely hard to determine on their own!  And the answers might be problem-dependent.</p>\n<p>So, to answer your question: I can&#8217;t think right now of anything better to do for first-order theorem-proving with a quantum computer, than<br />\n(a) taking a standard backtrack search algorithm and Groverizing it, or<br />\n(b) converting to 3SAT and then running the adiabatic algorithm.</p>\n]]>", "author": "Scott", "published": "2014-10-08 23:52:30+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #128:</p>\n<blockquote><p> “if this person is truly meant to do theory, then he or she will ignore my advice; the only ones on whom the advice will work are those for whom it’s good advice.” Like the early scenes of a karate movie, where the master tries to talk the apprentice out of his or her quest.&#8221;</p></blockquote>\n<p>Perhaps CS needs harder, colder, more persuasive karate masters? <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /></p>\n]]>", "author": "Rahul", "published": "2014-10-09 03:37:47+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Scott &#8211; can you comment on the response to Jay&#8217;s question over at StackExchange?  It is a little confusing to me because</p>\n<p>a) Josh uses this AlmostP class when you explicitly say not to. </p>\n<p>b) Emil points out that the only property of computable languages that is used in the proof is that they are countable.  But if we union in your &#8220;problem of guessing the bits of the specific random sequence R&#8221;, the language is still countable but not computable, right?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Seattle:Sleepy_in.html\">Sleepy in Seattle</a>", "published": "2014-10-09 13:16:46+00:00", "title": "By: Sleepy in Seattle"}, {"content": "<![CDATA[<p>Sleepy #140: Josh&#8217;s solution is correct, and nice (I don&#8217;t know why I didn&#8217;t think of using the zero-one law).</p>\n<p>a) While Jay&#8217;s model was different from AlmostP (because of the order of quantifiers), Josh PROVES that it ends up equaling AlmostP.</p>\n<p>b) In place of the computable languages, we could use any countable set of languages that&#8217;s SPECIFIED IN ADVANCE (i.e., any set not depending on R).</p>\n]]>", "author": "Scott", "published": "2014-10-09 14:58:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>In fields of computer science other than quantum computing, such as machine learning, for example, there are algorithms that seem to solve real-world instances of NP-complete problems efficiently. Why they do is, according to some talks I&#8217;ve heard, not well-understood mathematically. So is it crazy to think that a quantum computer might do something strange and new that lets it solve real-world instances of difficult problems efficiently? It&#8217;s a hard question to answer because we can&#8217;t directly do much experimentation yet, but my point is that sometimes we can make practical progress without understanding the theory, right?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hopkins:Sam.html\">Sam Hopkins</a>", "published": "2014-10-09 16:21:57+00:00", "title": "By: Sam Hopkins"}, {"content": "<![CDATA[<p>Scott #138:</p>\n<p>Thanks, I appreciate it. It&#8217;s exciting that so much is unknown and so much to learn, but also a bit distressing that we don&#8217;t know anything.</p>\n<p>I&#8217;m trying to imagine what sort of problems are outside NP but inside BQP. Are there any candidates? Can we prove that there are BQP problems that exist outside of NP if we make assumptions about other complexity classes?</p>\n<p>Circuit minimization, if it&#8217;s in BQP, struck me as an actually useful application of quantum computers. Maybe it&#8217;s too much to hope for it to be in BQP.</p>\n<p>As for quantum algorithms that attempt to answer first order validity, it would be nice to know there&#8217;s some polynomial speedup faster than Groverizing (what an amusing term) but I also suspect there isn&#8217;t. It&#8217;s not obvious to me even how to apply Grover&#8217;s algorithm to first order resolution for undecidable theories either. I guess that shouldn&#8217;t be too surprising, given how much work is still left to do improving the question of answering first order validity with classical algorithms.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Akin:Dez.html\">Dez Akin</a>", "published": "2014-10-09 19:04:35+00:00", "title": "By: Dez Akin"}]