[{"content": "<![CDATA[<p>A paper calendar might be a robust alternative.</p>\n]]>", "author": "Maris", "published": "2017-04-18 10:42:32+00:00", "title": "By: Maris"}, {"content": "<![CDATA[<p>Hi Scott,</p>\n<p>First belated congratulations to you and Dana on Daniel! He looks super cute! </p>\n<p>Good luck to you in your just fight&#8230; I somehow managed to only get screwed by this a couple of times.  (Very recently when I didn&#8217;t realize that the U.S. switched to DST a couple of weeks before Israel.)</p>\n<p>I am guessing that eventually when you schedule an event, you will see a pop up announcement along the lines of:</p>\n<p><i>&#8220;After reading your email, we see that you were invited to give a talk in California on that day. Should we schedule this in PST? Also, we notice you keep giving the same talk again and again so we have taken the liberty of responding to the email with the title and abstract.&#8221;</i></p>\n<p>If it makes you feel better, I used to feel the same way about the difficulty of formatting math in powerpoint, and eventually it did improve. So, contrary to what the &#8220;dark enlightenment&#8221; folks think, not everything has been going to hell since the French revolution.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barak:Boaz.html\">Boaz Barak</a>", "published": "2017-04-18 11:46:08+00:00", "title": "By: Boaz Barak"}, {"content": "<![CDATA[<p>At least most of the timezone/daylight savings confusion is less ridiculous than it used to be. Years ago, Indiana was famous for being the state where no one knows what time it is. This (I believe) was the original motivation for the old TV series &#8216;Eerie Indiana&#8217;, where a small town was dogged (that&#8217;s an in-joke) by supernatural events.</p>\n]]>", "author": "MattF", "published": "2017-04-18 12:20:00+00:00", "title": "By: MattF"}, {"content": "<![CDATA[<p>It&#8217;s not just Google. I&#8217;ve exactly the same issues with the calendar on my Apple devices. </p>\n<p>I often put in the time of the appointed in the subject, just to be sure.</p>\n]]>", "author": "Abigail", "published": "2017-04-18 12:53:48+00:00", "title": "By: Abigail"}, {"content": "<![CDATA[<p>Jumping off from what &#8220;A&#8221; said&#8230; Judging from the crappy interface for gmail (which is amazingly bad compared to, say, what Yahoo mail had 10 years ago) and the low frequency of improvements to this and other tools, Google is so confident of user lock-in that they are hardly investing at all in making the  UIs better. Perhaps this is part of a long term plan to atomize human society by making us all show up for our meetings at the wrong times, provoking irritated, resentful and uncooperative behavior and thereby making it easier for the robots to take over.</p>\n]]>", "author": "Foster Boondoggle", "published": "2017-04-18 15:10:48+00:00", "title": "By: Foster Boondoggle"}, {"content": "<![CDATA[<p>The obvious solution is to have special &#8220;travel events&#8221; you can put in, which define a shift from one time zone to another. Of course, all times will be stored in UTC, but all data entry and display will be parsed using these dividers.</p>\n<p>Thus when you schedule a flight to Europe for a particular day and time, you enter the date and time of travel as a special &#8220;travel event&#8221;, and it automatically converts all data displays following that event (up to a &#8220;return event&#8221;) as displayed and entered in local time.</p>\n]]>", "author": "jonathan", "published": "2017-04-18 16:11:44+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>Spencer #24:</p>\n<p>You seem to be misunderstanding what Scott&#8217;s suggesting.  He&#8217;s talking about a possibility where, when you enter a time, what the computer would store would <i>actually be a specific instant of time</i>, but rather a sort of &#8220;floating time&#8221; object that would represent different instants depending on your current time zone, an object that would be dynamically cashed out to different instants only when necessary.  So if you enter &#8220;4 PM&#8221;, knowing that your&#8217;e going to be in California, the computer doesn&#8217;t attempt to guess that you&#8217;ll be in California and adjust the instant it stores appropriately &#8212; it doesn&#8217;t store an instant at all.  It stores an object that represents &#8220;4 PM&#8221;, and then when it actually needs to use this object, such as to check whether to trigger a notification, it notices that you are currently in California and interprets it as &#8220;4 PM Pacific time&#8221;.</p>\n<p>I&#8217;m not suggesting such a solution is easy or bulletproof; other people have already pointed out pitfalls with it (it doesn&#8217;t work for the phone call case).  But it doesn&#8217;t involve any attempts to guess at future time zones.</p>\n]]>", "author": "Sniffnoy", "published": "2017-04-18 17:09:03+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>I know I&#8217;m not a tech person, but is this a CS problem or a CEO one? </p>\n<p>I&#8217;ve noticed that, once c-suite execs hit a net worth high enough to justify a private jet, they usually only take meetings in their home time zones. I&#8217;ve heard a few reasons for this, but the most common is that it&#8217;s necessary to prevent jet lag, which would cost the company &#8220;millions in negotiations.&#8221; </p>\n<p>I have a hunch that&#8217;s why this idea keeps getting shot down internally.</p>\n]]>", "author": "dumb blonde secretary", "published": "2017-04-19 01:46:17+00:00", "title": "By: dumb blonde secretary"}, {"content": "<![CDATA[<p>This <i>Shtetl Optimized</i> essay is one of many that remind me of Mark Twain&#8217;s stories.  Gently updating <a href=\"http://www.telelib.com/authors/T/TwainMark/prose/roughingit/roughingit70.html\" rel=\"nofollow\">Chapter LXX of Twain&#8217;s <i>Roughing It</i></a> (via the historically natural map of &#8220;19th&nbsp;century bad&nbsp;handwriting&#8221;&nbsp;&rarr; &#8220;21st&nbsp;century bad&nbsp;software&#8221;) yields a fateful conclusion:</p>\n<blockquote><p>Alas, it was too late, gentlemen&nbsp;&mdash; too late. Google&#8217;s criminal delay had done its work&nbsp;&mdash; young Aaronson was no more. </p>\n<p>His spirit had taken its flight to a land where all anxieties shall be charmed away, all desires gratified, all ambitions realized.  </p>\n<p>Poor lad, they laid him to his rest with an Android in each hand.</p></blockquote>\n<p>More mathematically, Scott&#8217;s essay inspired me to post, earlier today on the <i>Mathematica StackExchange</i>, the plaintive <i>cri de coeur</i> &#8220;<a href=\"https://mathematica.stackexchange.com/questions/143894/sporadic-numerical-convergence-failure-of-singularvaluedecomposition-message-s\" rel=\"nofollow\">Sporadic numerical convergence failure of SingularValueDecomposition</a>&#8220;, which seeks Panglossian relief from a algorithmic bug of twelve years standing.</p>\n<p>To sustain our hope of improvements, it can be helpful to reflect that &#8220;Hope is itself a species of happiness, and, perhaps, the chief happiness which this world affords&#8221; (Samuel Johnson)&nbsp;🙂</p>\n]]>", "author": "John Sidles", "published": "2017-04-19 02:14:08+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>That will become even more confusing once we travel and meet in VR!</p>\n<p><a href=\"https://www.youtube.com/watch?v=SCrkZOx5Q1M\" rel=\"nofollow\">https://www.youtube.com/watch?v=SCrkZOx5Q1M</a></p>\n<p>(yes, Google Earth VR is fantastic)</p>\n]]>", "author": "fred", "published": "2017-04-19 16:09:00+00:00", "title": "By: fred"}]