[{"content": "<![CDATA[<p>My worthless impression of the Switch-On/Light-On, Switch-Off/Light-Off model is that, yes, humans like to use simple heuristics to plot their way through life; but sometimes the hoof-beats are from zebras.</p>\n]]>", "author": "JimV", "published": "2017-06-06 00:32:28+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>Hoel #54,</p>\n<p>You object to Scott&#8217;s normalization fix and suggest you disagree both technically and conceptually, but then your so-called technical objection is just that Scott&#8217;s fix ruins your conceptual story. Then you cloud up the whole thing with obfuscated language about supervening layers and so on. Scott thinks you are arguing in good faith, but I have my doubts&#8230; from here it just looks like you&#8217;ve erected a rickety Rube Goldberg contraption with feigned philosophical underpinnings to arrive at the conceptual story you want to tell of causal emergence.</p>\n<p>Scott, I think Carroll signed the letter, but his explanation after was pretty tepid. No where near as full throated as your other famous collaborator 😉</p>\n<p>You claim to be Switzerland here, but should I read it as telling that you interpreted my comments as indicting the Linde/Guth side and not ISL?? 😉</p>\n]]>", "author": "Adamt", "published": "2017-06-06 02:26:25+00:00", "title": "By: Adamt"}, {"content": "<![CDATA[<p>@Adamt #56. I don’t dismiss Scott’s “normalization fix” because of conceptual reasons. I dismiss it because it leads to nonsensical conclusions.</p>\n<p>Scott’s objection to the math has boiled down to believing that “requiring the macro-distribution to arise by marginalizing the micro-distribution seems like the correct choice to me.” This is referring to the distribution of interventions on the system by some experimenter. So Scott claims experimenters should perturb any given system through all possible micro-states. If Scott wants to analyze the information in the causal relationships of a computer’s logic gates, he must first learn the full set of its subatomic states. Even worse, such a “measure” of causal influence has nothing to do with a system&#8217;s mechanisms or connectivity, except that of its fundamental microscale. But changing the measure in the horrible way Scott suggests doesn’t change the fact that causal structure does indeed shift its properties across scales, such as becoming more deterministic, less degenerate, or creating different mechanisms. This is the heart of causal emergence. A good measure like effective information is sensitive to this. Scott’s arbitrary fix severs this connection so the measure has nothing to do with the strength of causal relationships.That’s why it spits out random numbers for even a simple causal relationship, like that of a light switch to a light bulb. Now how, on earth, do you think that’s a conceptual issue and not a technical one? Because I want some of whatever you and Scott are smoking, so I too can look at a chain of deterministic COPY gates in a computer and go: “zero causal relationships here….&#8221; ::: exhalation :::</p>\n<p>Broad philosophical handwaving about how there is no real problem to be solved or how all events have infinite causes are totally fine in my book. Hell, they are sometimes warranted and I completely welcome them. But the technical objection about some kind of unnecessary normalization hidden away in EI is literally just wrong. In an earlier post, I also point out why the data processing inequality does not apply to this situation. So there are no technical objections I know of that hold up.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hoel:Erik.html\">Erik Hoel</a>", "published": "2017-06-06 02:57:08+00:00", "title": "By: Erik Hoel"}, {"content": "<![CDATA[<p>Adamt #56: I&#8217;m not, to put it mildly, a good source of information on what the universe might have been doing in the first trillionth of a trillionth of a second of its existence.  And yes, I&#8217;m open to the possibility that we know far less about such matters than a lot of popular cosmology writing would lead one to think.  (From 1 second or so after the Big Bang is a different story: there we have a picture based on the Standard Model and GR that impressively matches observed data.)</p>\n<p>Sean Carroll occupies an interesting position here: on the one hand, he signed the letter in support of inflationary cosmology; but on the other hand, it was his own writings, such as <a href=\"https://arxiv.org/abs/1406.3057\" rel=\"nofollow\">this one</a>, that drove home the point for me that most of the arguments for inflation that the educated layperson would know are just flat-out misleading or wrong.  Among other things, Roger Penrose is fundamentally correct that inflation is of no help whatsoever in producing a special initial state for the universe, because it requires an even specialer state to get it started.</p>\n<p>On the other hand, the alternatives to inflation, like bouncing and ekpyrotic cosmologies, don&#8217;t seem to an outsider to inspire any great confidence; and inflation arguably <i>did</i> have success in predicting detailed features of the CMB (even if perhaps those same features could&#8217;ve been predicted without inflation, just by saying &#8220;we don&#8217;t know the exact mechanism, but everything should probably be as simple and generic as it could be&#8221;).</p>\n<p>So, all in all, I&#8217;m left in the uncomfortable position of saying that most of the arguments for inflation that an outsider would know (such as it giving enough time for different regions of the observable universe to equilibrate with each other) appear to be wrong, but nevertheless, some variant of inflation might very plausibly have happened, for all I know.</p>\n]]>", "author": "Scott", "published": "2017-06-06 03:33:36+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> (in the OP) seeks emergent answers to “Why has air travel in the US gotten so terrible?”</p></blockquote>\n<p><b>Breaking News</b> Donald Trump has  appointed Steve &#8220;Torture Memo&#8221; Bradbury to be <a href=\"http://www.politico.com/story/2017/06/05/trump-nominee-torture-bradbury-239167\" rel=\"nofollow\">General Counsel of Transportation</a>.  Quarks and gluons aside, we air-travellers emergently dislike the sound of THIS!&nbsp;🙂</p>\n<p>More broadly, the discourse of the Aaronson/Hoel debate (so far) calls to mind Groucho Marx&#8217;s assessment &#8220;I&#8217;ve&nbsp;had a lovely time, but this wasn&#8217;t&nbsp;it.&#8221;&nbsp;🙂</p>\n<p>&#8212;&#8212;&#8212;-</p>\n<p><b>Mind-fullness</b>&nbsp; Searching the latest of <i>Mind</i>&nbsp;&mdash; Ludwig Wittgenstein&#8217;s least-liked academic journal&nbsp;&mdash; for philosophical assessments of emergent phenomena turned up a really lovely article (as it seemed to me) by MIT professor Jack Spencer, having the engaging title &#8220;Able to do the Impossible&#8221; (<i>Mind</i>, 2017, <a href=\"http://www.jackspencer.org/uploads/1/4/0/3/14038590/non-internet_version_10.pdf\" rel=\"nofollow\">preprint here</a>).  </p>\n<p>One illuminating aspect of Spencer&#8217;s article (for me), is its application to philosophical universes in which <a href=\"https://en.wikipedia.org/wiki/Church%E2%80%93Turing_thesis#Variations\" rel=\"nofollow\">the Extended Church-Turing Thesis</a> is not only factually false, but even metaphysically impossible.  </p>\n<p>Nonetheless, by the construction &#8220;Case 1: Close calls&#8221; of Spencer&#8217;s section 1.3 &#8220;Constructing other G-cases&#8221;, it can plausibly happen that the Extended Church-Turing Thesis is &#8220;G-true&#8221; (in Spencer&#8217;s terminology)&nbsp;&hellip; in the sense that the Extended Church-Turing Thesis is <i>emergently true</i> (as an dynamical consequence of QED field theory, for example).</p>\n<p>There&#8217;s no shortage of newly-launched enterprises whose business models rely upon &#8220;G-closeness&#8221; to truth of the Extended Church-Turing Thesis&nbsp;&hellip; and the good news for young STEAM-students is, these enterprises are hiring.  </p>\n<p>Thus Spencer&#8217;s modes of thinking about emergent physics, cognition, and truth are (for me anyway) appreciably more pragmatically fruitful than any modes that the Hoel/Aaronson debate has suggested (so&nbsp;far, at any&nbsp;rate).</p>\n<p><b>Meta conclusion</b>&nbsp; Efforts to identify and conciliate the strongest emergence-related STEAM-works are more likely to provoke fruitful discourse and/or prospering STEAM-enterprises than criticism of the weakest works.</p>\n]]>", "author": "John Sidles", "published": "2017-06-06 04:15:56+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>I think it is an interesting attempt. But the main concept used is basically relative entropy at higher levels of descriptions. I am not sure that Hoel has made a convincing argument (which I think is quite bold and far reaching) in arguing that higher level causation is mostly just relative entropy.<br />\nTaking a Bayesian perspective, entropy is a measure of our knowledge, and relative entropy measures our information gain from one distribution to another (at any level of description, macro or micro). More information gain at a higher level than the corresponding lower level states does not necessarily mean it can be considered as a causation at higher level. Anyway, what is the proposed relation between information/knowledge and causation? One is passive and one is active. The former may be a necessary condition for the latter but not a sufficient one.<br />\nBy the way, I also think that Tononi&#8217;s psi function fails to capture consciousness. To me, it is definitely not a sufficient condition for consciousness (I am not a panpsychism). It is at most a necessary condition. I suspect it is the same here about Hoel&#8217;s argument. Relative entropy may be a necessary condition for higher level causation, but not a sufficient one.</p>\n]]>", "author": "Daniel Tung", "published": "2017-06-06 04:54:43+00:00", "title": "By: Daniel Tung"}, {"content": "<![CDATA[<p>A remark regarding Scott&#8217;s itching nose example: </p>\n<p>Scott wrote: &#8220;I scratched my nose because it itched, not because of the Standard Model of elementary particles&#8221; and elaborated:  &#8220;my nose is made of subatomic particles, and its behavior is in principle fully determined (at least probabilistically) by the quantum state of those particles together with the laws governing them&#8221;</p>\n<p>Consider the three statements: </p>\n<p>A) Scott&#8217;s nose itches </p>\n<p>B) Scott&#8217;s nose will itch on June 9, 2022</p>\n<p>C) Itching nose causes Scott to scratch it</p>\n<p>First, in all these statements Scott himself and even Scott&#8217;s nose are not concrete well-defined meta states of some larger (&#8220;microscopic&#8221;) system. The ambiguities in associating a concrete meta state to Scott and his nose still allow the  statement &#8220;Scott nose will itch in June 9, 2022&#8221; to be pretty well defined and not to depend on the precise meta states chosen to represent Scott and his nose. </p>\n<p>Second, in order to give very precise (even probabilistic) prediction for the event &#8220;Scott&#8217;s nose will itch on June 9, 2022&#8221; we need a huge microscopic system, perhaps as large as the entire universe or at least large enough that will enable  us to tell also if Erik Hoel&#8217;s nose will itch on the same day.</p>\n<p>Third, the causal structure &#8220;itchy nose causes Scott to scratch it&#8221; may emerge in much smaller systems which do not allow predicting if the nose will itch.</p>\n<p>Last, the ambiguity in &#8220;what Scott is&#8221; is related also to the question if Scott has  free will regarding scratching his nose when it itches.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2017-06-06 05:42:11+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>I have a feeling that EI is described somewhat clumsily with reductionist, naturally, replying to the claims as formally described.</p>\n<p>If you have a full description of a system in terms of microstates and their dynamics, and a description of the observed distribution of initial states, there is nothing else to measure about the system — the rest can be deduced. If you list the macrostates, the micro-level description will provide a complete prediction of possible dynamic behaviours; if you add some indication of distribution of input states (and most of the time macro states are not enough to _completely_ describe the dynamics, because there is distribution of micro-level states inside each macro-level state), you get the distribution of the output states just from the micro-level description.</p>\n<p>The description of EI leaves a superficial impression that the claim above is not believed to be literally true; I am not convinced. On the other hand, the claim above is not that strong, and I think this claim is approximately all that reductionism expects from the world.</p>\n<p>In my view after reading the reply and the comments here, the descriptions of EI in terms of interventions and system as causal channel etc. seem to be more about choosing the description level for optimal use of information, stability of observed behavior etc.</p>\n<p>If we compress pretty pictures, of course we would like to classify all the possible pictures into 2^n equiprobable classes which capture the most interesting differences for us, and equiprobability is about efficiency of description and selecting the most relevant information to convey etc.the images</p>\n<p>And when we study dynamics, if some part of information doesn&#8217;t affect the outcome, and some part is used in such a chaotic way that our measurements do not give enough precision, it is quite natural for a natural science to become less interested in these parts of the description and switch to studying the parts of the input that have a measurable causal effect on the output.</p>\n<p>So maybe EI should be framed not as claiming reductionism is wrong (just not a currently feasible program in most fields of study, which is obvious), and maybe some comparison with Lyapunov exponents could be drawn; they are about describing evolution along one axis as stable and predictable and along some other axis as very unstable, which seems to be something similar…</p>\n]]>", "author": "Michael", "published": "2017-06-06 08:47:48+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Scott &#8212; take heart in the words of the emerging Trump administration philosopher, James Mattis &#8230; &#8220;&#8221;Once we&#8217;ve exhausted all possible alternatives, the Americans will do the right thing. We will still be there&#8221;! What will be true of the Pacific will be true of the Paris accord as well. </p>\n<p>(Even though I hate referring to a Churchillism&#8230;)</p>\n]]>", "author": "saraswat", "published": "2017-06-06 09:06:10+00:00", "title": "By: saraswat"}, {"content": "<![CDATA[<p>(On a slightly different topic, is there a version of Scott Aaronson for AI? cf Scott #35 &#8230; </p>\n<p>&#8220;a theoretical computer scientist, one who spends a lot of time doing math _and AI_  and trying to write for broad audiences _about which outcomes of AI research can be made to happen in practice (just SMOP)/which are possible/which are implausible/which are impossible_&#8221;. </p>\n<p>(my additional requirements in _&#8230;_ :-).)</p>\n<p>If ever the world needs such a person, it is now!)</p>\n]]>", "author": "saraswat", "published": "2017-06-06 09:38:38+00:00", "title": "By: saraswat"}, {"content": "<![CDATA[<p>#99 and #102</p>\n<p>I think there is lot of &#8220;talking past each other&#8221; that goes on in the scientific world and sometimes in these threads as well.  It&#8217;s always great when people really understand the point the other side is trying to communicate as best as possible, before an idea is dismissed. Granted, this takes time and is not feasible for every &#8220;paradigm-smashing&#8221; theory that shows up in your mailbox. </p>\n<p>Misunderstandings may be better solved through short back-and-forth dialogue, as opposed to long papers/articles/posts.  Too bad scientists don&#8217;t have more round table discussions.  I&#8217;d love to see Scott and another QM expert or two sit down with some respected scientists on the &#8220;hidden variable&#8221; side (e.g. Wolfram, &#8216;t Hooft, etc.). Having an informal, short-response discussion might allow both sides to really pinpoint where their opinions diverge, and clear up any misunderstandings that exist.</p>\n]]>", "author": "Jon K.", "published": "2017-06-07 18:59:05+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>Jon K. #111: But scientists <i>do</i> sit down and hash out their differences all the time.  It&#8217;s just that, because of selection effects, those discussions often aren&#8217;t what you see on blogs like this one.  Often the scientists start with a vast amount of shared understanding, and the point that they disagree about it is too technical&#8212;too deep in the search tree&#8212;for hashing it out on a general-interest blog to make sense.  Other times, one side realizes extremely quickly that they made a mistake, or the sides realize they were just using words differently, and there&#8217;s no reason to take the whole thing public.</p>\n<p>But then there are the cases where essentially all experts have a certain shared understanding, based on common use of words and concepts&#8212;for example, that local hidden variable theories can&#8217;t violate the Bell inequality&#8212;but a small contingent goes to the public with claims that some local hidden variable theory <i>can too</i> violate Bell.  In such cases, in my experience, no amount of discussion with the radical contingent ever really clears anything thing up, because the radical contingent never submits to the same shared understanding of words and concepts as everyone else.  &#8220;Yes, you say that 1+1=3 is false, but that&#8217;s only because you&#8217;ve ignored multiple realizability and non-orientable manifolds and Clifford algebras and yada yada yada&#8230;&#8221;</p>\n<p>Anyway, for reasons I&#8217;ll leave as exercises for the reader, it&#8217;s these latter cases that disproportionately make it to <i>Shtetl-Optimized</i>. 🙂</p>\n]]>", "author": "Scott", "published": "2017-06-07 20:01:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Will #104: Thanks very much for your comment, which helped me clarify my own thoughts!  This will, I think, be my final &#8220;technical&#8221; response to Erik Hoel, and to Simon DeDeo (who has a tweetstorm arguing that I&#8217;m wrong).</p>\n<p>It seems to me that there are two comparisons that would make sense here.</p>\n<p>On the one hand, you could look at a &#8220;natural&#8221; distribution D<sub>mic</sub> over microstates, as well as the distribution D<sub>mac</sub> over macrostates that D<sub>mic</sub> gives rise to (obtained by coarse-graining D<sub>mic</sub>).  If you do that, then of course predictability given a sample from D<sub>mic</sub> will be at least as great as predictability given a sample from D<sub>mac</sub>, by the data processing inequality.  So, no good for Hoel&#8217;s thesis.</p>\n<p>Alternatively, you could take seriously everything Erik keeps saying about the importance of coding, exogenous interventions by the experimenter, and Pearl&#8217;s do-operators.  That would suggest letting the experimenter choose a distribution D<sub>mac</sub> over macrostates that <i>maximizes</i> the effective information.  OK, but then that D<sub>mac</sub> is consistent with some underlying distribution D<sub>mic</sub> over microstates, and a sample from D<sub>mic</sub> still gives you at least as great predictability as a sample from D<sub>mac</sub>.  So, no good for Hoel&#8217;s thesis either.</p>\n<p>What Hoel actually does is an unholy hybrid of the two things.  On the one hand, he says that we get to consider a uniform distribution D<sub>mac</sub> over macrostates, because we&#8217;re the experimenters and we can exogenously intervene.  OK.  But on the other hand, he refuses to let us consider the distribution D<sub>mic</sub> over microstates that would naturally arise by drawing a macrostate from D<sub>mac</sub>.  Instead he demands, for no discernable reason, that the microstate be drawn from the <i>uniform distribution over all microstates</i>, something  that would only make sense in a situation with no exogenous control.</p>\n<p>Of course, only by rigging the comparison in that way, is he able to arrive at the amazing conclusion that a D<sub>mac</sub> sample can give you more information than a D<sub>mic</sub> sample.</p>\n]]>", "author": "Scott", "published": "2017-06-08 03:33:36+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #113: Thanks, I was getting confused here!  I was confused as to how Hoel&#8217;s talking about it in terms of channel capacity (which should yield an inequality as usual, right?) matched up with his uniform distribution; the answer appears to be &#8220;it doesn&#8217;t&#8221;.</p>\n]]>", "author": "Sniffnoy", "published": "2017-06-08 06:06:51+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>&#8220;maybe just bored with debates about ‘reductionism’ versus ’emergence’?&#8221;. me too. here&#8217;s two statements that are relevant.</p>\n<p>(1) from Raold Hoffman, Nobel Prize winning theoretical chemist: </p>\n<p>&#8220;there are concepts in chemistry which are not reducible to physics. Or if they are so reduced, they lose much that is interesting about them. I would ask the reader who is a chemist to think of ideas such as aromaticity, acidity and basicity, the concept of a functional group, or a substituent effect. Those constructs have a tendency to wilt at the edges as one tries to define them too closely. They cannot be mathematicisized, they cannot be defined unambigously. But they are of fantastic utility to our science.”</p>\n<p>(2) from Physics Today April 2017 &#8220;In Defense of Crazy Ideas&#8221;:</p>\n<p>&#8220;As for Crazy Ideas of the Third Kind [&#8230;] The extension of a rubber band, which roughly obeys Hooke’s law, is purely entropic and has nothing to do with the forces between the atoms that make up the material, so one could say that in that case a force law emerges from Boltzmann’s deﬁnition of entropy.&#8221;</p>\n]]>", "author": "Richard Gaylord", "published": "2017-06-08 07:20:38+00:00", "title": "By: Richard Gaylord"}, {"content": "<![CDATA[<p>The comments are completely screwed up for me. A few days ago I could see up to around #85, but now it&#8217;s stuck at #73. Also, I am not Adamt, but their info is stuck in the boxes (previously it was someone else&#8217;s info).</p>\n<p>No need to post this comment, just letting you know.</p>\n]]>", "author": "Adamt", "published": "2017-06-08 13:56:43+00:00", "title": "By: Adamt"}, {"content": "<![CDATA[<p>That comment seems to have cleared up the logjam, because now I can see up to #115.</p>\n]]>", "author": "Adamt", "published": "2017-06-08 14:04:41+00:00", "title": "By: Adamt"}, {"content": "<![CDATA[<p>I can&#8217;t see the last comments. The homepage link displays 115 comments but when I click I only see the first 64 comments</p>\n]]>", "author": "Libb", "published": "2017-06-08 14:20:39+00:00", "title": "By: Libb"}, {"content": "<![CDATA[<p>Ok now that I commented I can see them..</p>\n]]>", "author": "Libb", "published": "2017-06-08 14:21:14+00:00", "title": "By: Libb"}, {"content": "<![CDATA[<p>Just popping back in this one time to link <a href=\"http://www.erikphoel.com/blog\" rel=\"nofollow\">a new non-technical explainer of causal emergence</a> on my website. It also demonstrates why Scott&#8217;s criticism, which is actually clearest not in his original post but in #113 (and also Will&#8217;s #104), is based on failing to separate out the information associated with causal structure from information in general.</p>\n<p>Thanks for the discussion &#8211; Erik</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hoel:Erik.html\">Erik Hoel</a>", "published": "2017-06-08 16:05:53+00:00", "title": "By: Erik Hoel"}]