[{"content": "<![CDATA[<p>Scott #47</p>\n<p>Thanks for your answer! One of the things that makes this blog so great is how much you interact with its readers <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /> </p>\n<p>With respect to your reply, I completely agree with you. The problem is not that we mention the potential applications of research in quantum information. The real problem comes when we <i>oversell</i> these applications and ignore the drawbacks.</p>\n<p>In fact, from my own experience, an understanding of the caveats and limits of a particular research direction usually leads to even better directions! Pretending that quantum computing or quantum cryptography can provide an advantage over their classical counterparts when they cannot, only makes it harder to understand those cases in which a real advantage can be had.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arrazola:Juan_Miguel.html\">Juan Miguel Arrazola</a>", "published": "2014-04-02 20:47:54+00:00", "title": "By: Juan Miguel Arrazola"}, {"content": "<![CDATA[<p>fred #54: That&#8217;s a somewhat confused description of protein folding, because we know that even a quantum protein couldn&#8217;t just &#8220;magically&#8221; find the lowest-energy configuration by trying every possible configuration in parallel.  For like the 10 trillionth time, <b>that&#8217;s not how quantum mechanics works!</b>  Thus, even assuming the relevance of quantum effects to protein folding, a large part of the explanation for protein folding&#8217;s efficiency <i>must</i> come down to the structure of the search space.  I.e., the search space must be &#8220;simple&#8221; enough that the protein&#8217;s quantum-mechanical evolution can reliably reach the ground state (which wouldn&#8217;t be so surprising, since proteins were subject to strong evolutionary pressure to satisfy exactly that property!).  If so, though, one is led to ask whether classical algorithms like simulated annealing or Quantum Monte Carlo could also work just as efficiently.  If they can&#8217;t, then the difference between quantum and classical that led to the performance gap would <i>need</i> to be something subtle about the search space&#8212;since again, not even the quantum process would be able to explore an <i>arbitrary</i> search space efficiently.</p>\n<p>Anyway, all of that was simply <i>assuming</i> that whatever&#8217;s in the linked preprint (which I haven&#8217;t read yet) is true!  I note that the preprint is from 2011, is formatted for someplace like <i>Science</i> or <i>Nature</i>, but doesn&#8217;t seem to have appeared anywhere, which probably indicates that it was rejected (despite the exciting nature of its claims).  So strong skepticism is advised.</p>\n]]>", "author": "Scott", "published": "2014-04-02 21:07:16+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I completely agree with Scott that a demonstration of scalable Quantum Computing is AT LEAST as big a deal as experimental confirmation of the Higgs boson (or inflation etc )</p>\n<p>Come on people &#8211; we need to be REALLY REALLY sure that Quantum Mechanics, as understood in 2014, is an EXACT description of Nature.</p>\n<p>Maybe the reason we are struggling with QG unification and primordial universe models is that we have TOO MUCH CONFIDENCE in the the EXACTNESS of the postulates of QM.</p>\n<p>A demonstration of Shor&#8217;s algorithn to a few thousand bits would pretty much seal it for QM postulates needing NO MODIFICATIONS &#8211; and would be far more useful than getting a human on Mars (for example).</p>\n]]>", "author": "anon", "published": "2014-04-02 21:15:29+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>Don&#8217;t you quantum computing guys need to get a Bat Cave and spend a few billion dollars on something before we can get enthusiastic about what you are doing?</p>\n<p>You could also promise us the Matrix or at least a Holodeck?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2014-04-02 21:28:29+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>anon #57</p>\n<p>&#8220;A demonstration of Shor’s algorithm to a few thousand bits would be far more useful than getting a human on Mars (for example).&#8221;</p>\n<p>One human, okay, sure&#8230;<br />\nBut two humans, like, say, me and Angelina Jolie, and then the earth would just happen to be hit by a giant asteroid&#8230; it&#8217;s not so clear-cut.</p>\n]]>", "author": "fred", "published": "2014-04-02 21:35:17+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>James #58:</p>\n<ul>Don’t you quantum computing guys need to get a Bat Cave and spend a few billion dollars on something before we can get enthusiastic about what you are doing?</ul>\n<p>If you provide the few billion dollars, I&#8217;m willing to move in to the Bat Cave.</p>\n]]>", "author": "Scott", "published": "2014-04-02 21:38:37+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>And the guy who posted above that physics progress is due to war is spectacularly wrong. Newton, Faraday, Maxwell, Einstein, Heisenberg, Schrodinger, Dirac, Pauli, etc etc made their discoveries in peacetime.</p>\n<p>(Einstein did finalise GR during WW1 &#8211; but I hardly think himself and Hilbert were motivated by military considerations)</p>\n]]>", "author": "anon", "published": "2014-04-02 21:38:44+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>James #58</p>\n<p>Good news: it&#8217;s only a matter of time before Scott joins Oculus VR.</p>\n]]>", "author": "fred", "published": "2014-04-02 21:53:24+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott, nothing wrong with having fun. But, as i said, as a particle physicist I do not feel correctly represented by this kind of stuff: sorry.<br />\nI really wait for a movie about complexity theorists <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_wink.gif\" alt=\";)\" class=\"wp-smiley\" />  .</p>\n]]>", "author": "LK", "published": "2014-04-02 22:12:29+00:00", "title": "By: LK"}, {"content": "<![CDATA[<p>anon #61, IMHO you spectacularly failed at grasping the premise of the discussion.  </p>\n<p>It&#8217;s not about the question if military spending is a prerequisite for physics progress, but rather if the amount we&#8217;ve seen spent on HEP over the last couple decades is still a consequence of its military applicability.</p>\n]]>", "author": "quax", "published": "2014-04-02 23:02:51+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Scott #46:</p>\n<blockquote><p> finding a quantum computational speedup would be a final, crowning confirmation for quantum theory itself, </p></blockquote>\n<p>How badly does Quantum Theory need such a confirmation? I&#8217;m not sure. Haven&#8217;t the last 100 years of results & experiments made our belief in the correctness of QM very very strong? Is there a significant cohort that&#8217;s still unsure about the core of QM?</p>\n<p>Wasn&#8217;t the situation with Higgs a lot different? Pre LHC was there as much consensus & certainties about the theories as there is with QM? I&#8217;m sincerely asking. I genuinely don&#8217;t know. </p>\n<p>Ultimately though, this is a futile discussion to some extent: how compelling one finds one goal over another is bound to stay subjective.  The only real test is to actually try convincing public audiences (funding bodies?) how compelling your reasons are. If Scott can do it (without hype) for QC as well as the Physicists did for the LHC, it&#8217;ll be an impressive achievement for sure.</p>\n]]>", "author": "Rahul", "published": "2014-04-03 05:14:35+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul #39 (also, Scott #46):</p>\n<p>Here are some reasons why I think the quest for building a full blown quantum computer and also for funding QC/QI theory is at least as compelling as the search for the Higgs boson and high-energy theory:</p>\n<p>1. If it were indeed true that BQP was the most computational power we can extract from the Universe, imagine what that would mean: We would have a <i>computational</i> characterization of the fundamental structure of the Universe. How awesome is it that Universe fundamentally restricts, via computational hardness, what any agent that might possibly come into existence in the Universe can do. Anybody who says they&#8217;re not excited about this needs also  to claim that the 2nd law of thermodynamics is not exciting.</p>\n<p>2. Indeed, we&#8217;re already very aware of the power of quantum mechanics: lasers, transistors, nuclear bombs, high-density hard drives, atomic clocks (which feed into GPS) to name a few. If we have working large-scale QCs, how awesome would it be that we use this theory to redefine the very way we think about what information and computation is and it has real-world consequences! In other words, <i>the fundamental mathematical structure</i> of the Universe will have been <i>tamed</i> by humans! Not <i>verified</i>, but <i>tamed</i>. </p>\n<p>3. IMHO, QC/QI has been the freshest breath to quantum foundations since John Bell and Kochen-Specker. Quantum mechanics sets the <i>fundamental ontology</i> of our Universe. Insistent denials notwithstanding, I think it is safe to say we&#8217;re still confused about what picture about the Universe QM provides us. Building a QC makes this issue more pressing. When we achieve macroscopically coherent controllable quantum phenomena, it forces all of us to confront these philosophical confusions: much like modern high-energy theory and cosmology have forced us to confront the possibility of the multiverse and think more deeply about the problem of why there is something rather than nothing. </p>\n<p>4. Building on the previous point, no one would deny that attempts to think about and build AIs has forced us to clarify concepts related to the problem of induction and the philosophy of mind. IMHO, thinking clearly about QM/QC/QI and attempting to build QCs will force us to clarify concepts about ontology, epistemology, locality, reality, causality.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/K:Sid.html\">Sid K</a>", "published": "2014-04-03 06:31:12+00:00", "title": "By: Sid K"}, {"content": "<![CDATA[<p>fred #54: Oh, let&#8217;s make exaggerated claims!  </p>\n<p>&#8220;Even a short journal article with 100 words can have 10^100 configurations.  If the journalist tried these texts at the rate of 100 billion a second, it would take longer than the age of the universe to find the correct one. Just how the brains of these journalists do the job in hours, nobody knows.&#8221;</p>\n<p>Must be because the brain is a quantum computer, eh?</p>\n]]>", "author": "jonas", "published": "2014-04-03 06:53:48+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>IMHO, the Scott&#8217;s test is relevant with formal problem: if axioms of QM (at least, in a version used by QC community) could peacefully coexist with possibility of effective classical simulation (i.e. ECT)? Real quantum computer would provide an obvious NO answer to such a question.</p>\n]]>", "author": "A.Vlasov", "published": "2014-04-03 09:30:54+00:00", "title": "By: A.Vlasov"}, {"content": "<![CDATA[<p>Rahul #65:</p>\n<ul>Haven’t the last 100 years of results &#038; experiments made our belief in the correctness of QM very very strong? Is there a significant cohort that’s still unsure about the core of QM?</ul>\n<p>Well, it&#8217;s not just the people who flat-out deny QM.  It&#8217;s also the people like Gil Kalai, Michel Dyakonov, Robert Alicki, and possibly even yourself (in previous threads), who say they accept QM, but then hypothesize some other principle on top of QM that would &#8220;censor&#8221; quantum computing, or make the effort of building a QC grow exponentially with the number of qubits, or something like that, and thereby uphold the classical Extended Church-Turing Thesis.  As I&#8217;ve said before, I don&#8217;t think they&#8217;re right, but I think the <i>possibility</i> that they&#8217;re right is sufficiently sane to make it worth doing the experiment.</p>\n<p>(Much like the people who said, sure, there has to be <i>something</i> new at the LHC scale to keep the laws of physics consistent, but who knows if it&#8217;s a Higgs boson?  It could be just about anything.  The fact that it <i>turned out</i> to be the Higgs, exactly the one predicted in the 1960s, doesn&#8217;t mean that it wasn&#8217;t worth doing the experiment.)</p>\n<p>Lastly, I&#8217;ll make the obvious remark that the QC skeptics can&#8217;t have it both ways: they can&#8217;t oppose efforts to build a QC both because it will never work, and because it will so obviously work that the question isn&#8217;t even interesting! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Scott", "published": "2014-04-03 13:10:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>fred #21</p>\n<p>I am thinking that the Jacquard weaving is an automatic production of pattern weaving, where the workers are replaced by machines, so that it is an automation can be seen like a centrifugal governor (machines that control machines, or cybernetic).<br />\nI am thinking that if the analogic machanism is reduced to atomic dimension (like a biologic control), then there is appearance of a quantum effects, so that the miniaturization (to biological dimension) give quantum calculus (a mechanism like an analogic calculus for sensor like smell, vision); if there is low temperature, then there is the wave function overlapping, and an increase of the quantum analogical effect in cybernetic.<br />\nI think that the virtual reality can be seen like an evolution of perspective theory.<br />\nI think that the technological revolution cannot be made without theoretical revolution: one can say that the Iron Age happen without math, without theory, but the smithing technique was a verbal knowledge, and a craft knowledge that can be translated in a theoretical metallurgy book; it is possible a random evolution, a random result (like the penicillin), but the understanding of the result is necessary (ever a theory).</p>\n]]>", "author": "domenico", "published": "2014-04-03 13:00:14+00:00", "title": "By: domenico"}, {"content": "<![CDATA[<p>jonas #67<br />\nHaha, it&#8217;s not my claim, it&#8217;s in that MIT Technological Review article!<br />\nAlso, a journalist brain is a computer (not sure how many teraflops), so it can in principle solve some classes of combinatorial problems efficiently (e.g. Bipartite Matching).<br />\nI think that Scott&#8217;s response to this is that the solution space for the protein folding might not be as interesting as it seems &#8211; e.g. when a stone rolls down a hill there&#8217;s a gigantic amount of paths it could take to reach the bottom (taking into account the fact it&#8217;s a chaotic system), but with enough gravity and slope, it won&#8217;t get stuck half way down and will reach the bottom no matter what and the &#8220;optimization&#8221; problem becomes trivial (not sure if the analogy is right).</p>\n]]>", "author": "fred", "published": "2014-04-03 13:11:04+00:00", "title": "By: fred"}, {"content": "<![CDATA[<blockquote><p> It’s also the people like Gil Kalai, Michel Dyakonov, Robert Alicki, and possibly even yourself (in previous threads), who say they accept QM, but then hypothesize some other principle on top of QM that would “censor” quantum computing</p></blockquote>\n<p>Of course I totally accept QM. I don&#8217;t have a strong opinion either way on if QC is fundamentally possible or violates some as yet unknown constraint. Perhaps that reflects my relative ignorance of the fields. </p>\n<p>My argument is purely pragmatic:  Every device that&#8217;s consistent with known physical laws hasn&#8217;t been built. Nor is there the need to build every such device. Some devices may be entirely consistent & allowable by physical laws but just too damn difficult or expensive to build. </p>\n<p>Most estimates I&#8217;ve seen for when a practical, scalable, even marginally &#8220;useful&#8221; QC might be built run into time-scales so long as to dampen my enthusiasm. Mind, these weren&#8217;t skeptics making the estimates. In an ideal world with infinite resources I&#8217;d have absolutely no problems with a massive scale, mega QC development project. But sadly that&#8217;s not the world we live in. </p>\n<p>Even in the annoying, resource-constrained world we live in I&#8217;ve no beef with supporting a niche group of motivated, talented researchers work on trying to build a QC (or figure out why it cannot be built).  There&#8217;s many unsolved problems to be solved, not all as glamorous as QC perhaps. There&#8217;s some (subjective) optimum level of effort, funding and manpower one ought to pour into cracking each such problem. If one were some all-powerful funding-allotment-czar. Personally, I think we are already at that optimal point for QC (and spare me the comparison with how much money Facebook wastes on writing stupid games. ) </p>\n<p>Am I as enthusiastic about QC as I was about the LHC? No. Maybe that&#8217;s just my mistake. Time will tell.</p>\n]]>", "author": "Rahul", "published": "2014-04-03 13:55:40+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Scott &#8211; </p>\n<blockquote><p>[The people who] hypothesize some other principle on top of QM that would “censor” quantum computing, or make the effort of building a QC grow exponentially with the number of qubits, or something like that, and thereby uphold the classical Extended Church-Turing Thesis. As I’ve said before, I don’t think they’re right, but I think the possibility that they’re right is sufficiently sane to make it worth doing the experiment.</p></blockquote>\n<p>I agree.  However, (1) if they are right, their explanations for how they could be right are grossly inadequate.   (This is a pattern that has also developed among alternatives to inflationary cosmology and to string theory.)   (2) Although I agree that it&#8217;s an important reason to do the experiment, it is not by any means the main reason.  I am confident, albeit not 100% certain, that Peter Shor et al are right.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-04-03 14:56:49+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>The Extended Church-Turing Thesis.has about 80 years of empirical confirmation. How many anti-QC principles do you want?</p>\n<p>Scott, do you similarly claim that the SUSY skeptics must prove that some accepted principle censors SUSY? At some point it becomes wasteful to spend billions of dollars looking for SUSY particles when all attempts have failed.</p>\n]]>", "author": "Observer", "published": "2014-04-03 17:27:58+00:00", "title": "By: Observer"}, {"content": "<![CDATA[<p>Observer #74:</p>\n<ul>The Extended Church-Turing Thesis.has about 80 years of empirical confirmation. How many anti-QC principles do you want?</ul>\n<p>LOL, quantum mechanics <i>also</i> has about 80 years of empirical confirmation!  (Or more like 90, actually.  And for the ECT, it&#8217;s more like 50 years.)  And no one has convincingly explained how to reconcile quantum mechanics with the ECT, so as to kill quantum computation.  Given that the revision quantum mechanics suggests to the ECT is so subtle and interesting, that (as Greg says above) no one has any good ideas for how to modify or add to quantum mechanics to uphold the ECT, and that the people who formulated the ECT simply weren&#8217;t thinking about quantum mechanics, it seems reasonable to guess that QM will simply win this bout, and the ECT will need to revised (or &#8220;upgraded&#8221;) to the Quantum ECT.</p>\n<ul>Scott, do you similarly claim that the SUSY skeptics must prove that some accepted principle censors SUSY?</ul>\n<p>That&#8217;s a terrible analogy, because SUSY could simply not be there&#8212;or be there but only at the Planck scale&#8212;without creating any true crisis for currently-accepted physics.  &#8220;All&#8221; it would mean is that various apparent fine-tunings in the known laws of physics would remain unexplained, or would be even worse than they would be with SUSY.  But that&#8217;s a bullet that one could always simply bite and move on.</p>\n<p>A better analogy is the Higgs boson.  My understanding is that, without the Higgs <i>or something else new</i> at LHC energies, the amplitudes for certain electroweak processes at LHC energies would exceed 1&#8212;an obvious mathematical absurdity.  So we knew, even before the LHC was built, that either the LHC would find the Higgs, or else it would find something else even more interesting than the Higgs.</p>\n<p>In the same way, the possibility of using Shor&#8217;s algorithm to factor large numbers in polynomial time is a <i>prediction</i> of 1920s quantum mechanics, plus some extremely minimal assumptions about the ability to prepare, control, and measure quantum states as desired.  So we know, even before building a QC, that either it has to work, or else there has to be some new physical phenomenon even more interesting than QC that <i>prevents</i> it from working.</p>\n<p>And yes, of course it&#8217;s possible that human beings will simply give up, or run out of money, before they <i>either</i> build a scalable QC or discover the reason why it couldn&#8217;t have worked.  The same could have happened with the Higgs boson: physicists could have given up before finding <i>either</i> the Higgs or whatever else it was that corrected the electroweak amplitudes at LHC energies.  But fortunately, they <i>didn&#8217;t</i> give up: with the support of their civilization, they persevered, so that now we know the truth.</p>\n]]>", "author": "Scott", "published": "2014-04-03 19:33:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #75<br />\nBut, if we manage to build a QC that successfully implements Shor&#8217;s, perfect invalidation of the ECT would still require to formally also prove that factoring can&#8217;t be done classically, right?</p>\n]]>", "author": "fred", "published": "2014-04-03 21:26:38+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Rome was not built in a day and so is also true of the LHC or the manhattan project or the Apollo program or the Hubble space telescope. LHC was the culmination of a long line of particle accelerators. The proof-of-concept that fission is feasible was demonstrated by Fermi&#8217;s working fission reactor. The proof that fusion is feasible was already out there for everyone to see. Rockets and telescopes have been around for a very long time. I do not see why QC should be given a free pass in this regard and I am certain Scott is not arguing for that (Scott has quoted Babbage more than once to make this precise point). If QC is to become successful as a computational pardigm there will need to be a very long line of tiny steps building up to the eventual machine. Thinking *only* about implementing Shor&#8217;s algorithm is not going to serve any purpose towards realizing a QC. Perhaps what is needed is for the QC experts to lay out a program of incremental steps for the next 50-100 years. Of course this is already obvious to those in the QC business and I am sure such a program is under way in many research labs. If someone were to throw $100 billion at IBM in 1980 would that have speeded up the emergence of Google? I am therefore not quite sure if the present is the right time to give QC a ton of attention and resources. People tend to take a wait and see approach and that is not entirely a bad thing. Besides, whats the hurry? If we get there 20 years late isn&#8217;t  that way better than never getting there (there := scalable QC)?</p>\n]]>", "author": "no_one", "published": "2014-04-03 22:20:12+00:00", "title": "By: no_one"}, {"content": "<![CDATA[<p>fred #76</p>\n<p>Yes, it would. Instead of using Shor&#8217;s Algorithm, you could instead implement Boson Sampling at a large scale. This would be both easier than implementing Shor&#8217;s Algorithm (It doesn&#8217;t require a general purpose QC.) as well as a more persuasive invalidation of the ECT (because if BS can be efficiently solved on a classical turing machine, then the polynomial hierarchy collapses).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/Nelson:Peter.html\">Peter Nelson</a>", "published": "2014-04-03 22:22:52+00:00", "title": "By: Peter Nelson"}, {"content": "<![CDATA[<p>fred #76: Yes, what Peter Nelson #78 said!</p>\n<p>no_one #77: Yes, <i>of course</i> you want to work toward universal QC in a sequence of incremental steps, rather than going straight for factoring a 2000-bit number.  So that&#8217;s exactly what labs all over the world have been doing for the past 15-20 years: first demonstrating 1-qubit gates, then demonstrating 2-qubit gates, and now (like Martinis&#8217;s group) starting to demonstrate the requirements of quantum error-correction in a potentially-scalable architecture.</p>\n<p>And I completely agree with you that the time has not yet arrived for a Manhattan Project style push for scalable QC: there&#8217;s still a lot of basic research that remains to be done.  (In fact, that&#8217;s <i>another</i> thing I dislike about the &#8220;gizmo vision&#8221; of QC!  It keeps pushing people toward saying that scalable QC will be practical in the next few years&#8212;who wants a gizmo that will take 50 years to arrive?&#8212;even when they know it&#8217;s wildly overoptimistic.)</p>\n]]>", "author": "Scott", "published": "2014-04-03 22:47:49+00:00", "title": "By: Scott"}]