[{"content": "The LIPIcs issue is a pity, indeed. One should mention that LIPIcs asked for a 10-week pre-conference submission of all the material, but ICALP said 6 weeks is the minimum. We tried to cope with that, but failed. But it&#39;s not only LIPIcs to blame. <br /><br />Interestingly, some papers contains flaws that LIPIcs is still trying to resolve as part of publishing a high-quality proceedings volume. <br /><br />Most of the authors did not comply to our typesetting instructions which results in a huge amount of additional work for LIPIcs. How come?", "author": "M Herbstritt", "published": "2016-07-20 08:39:37.293000+00:00", "title": ""}, {"content": "Marc, <br /><br />I do not think that I blamed LIPIcs for the delay at any point. I simply referred to teething problems and I squarely took the blame for the delay, both at the General Assembly and in the blog post devoted to it. I will add your comment to the main body of the post, if you want. <br /><br />Regarding the typesetting issues that you raise, those were also discussed at the General Assembly. Thore Husfeldt mentioned them, as editor of a recent LIPIcs proceedings. I thanked Thore and asked the audience to help the proceedings chair and the LIPIcs staff by sticking to the typesetting instructions they are given. There was an interesting follow-up discussion and you will receive some of the suggestions from the EATCS Secretary Office. <br /><br />The ICALP deadline for delivering the proceedings versions of the papers is April 30. Since the conference takes in the first or the second week of July, it is impossible for ICALP to deliver the papers to LIPIcs ten weeks before the conference <br /><br />We are looking forward to working together with LIPIcs for future editions of ICALP. <br /><br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Aceto:Luca.html\">Luca Aceto</a>", "published": "2016-07-20 09:01:19.091000+00:00", "title": ""}, {"content": "Thanks, Luca, for the clarifications. We are also looking forward to future ICALP volumes in LIPIcs. ", "author": "M Herbstritt", "published": "2016-07-20 09:26:46.937000+00:00", "title": ""}, {"content": "Marc, I have added a brief account of the discussion related to the proceedings to the post. I also included some of your comment.) A version of this post will appear in the October issue of the Bulletin of the EATCS. Let me know if you have any other comment. ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Aceto:Luca.html\">Luca Aceto</a>", "published": "2016-07-20 09:53:59.737000+00:00", "title": ""}, {"content": "Thanks for the report!  I attended the meeting, and it was quite interesting.  I have two questions related to publication issues:<br /><br />1. About authors not complying with the  typesetting instructions, I would like to point out that lipics is much more demanding than others with respect to final versions, resulting in substantial efforts to prepare them.  I am for instance guilty of ignoring some recommendations (no cleverref, and although not explicitly stated, no natbib), that would involve a major rehaul of my LaTeX sources, but comply with the other time-consuming requisites (single LaTeX file, with only the needed macros and BibTeX entries).<br /><br />Given the number of conferences now publishing with lipics, it might make sense to ask the community for help with improving the process; I&#39;d for instance rather help solving whatever issues there might be with cleverref and natbib once and for all for everyone rather than rewrite my files by hand for every conference paper.<br /><br />I would also second Mikkel Thorup&#39;s suggestion to set up a web-based interface so that authors could validate their final submissions directly.<br /><br />2. About posting final versions of accepted papers online, I would go further as in FOCS&#39; call for paper, which indicates that &quot;Authors are encouraged to post full versions of their submissions in a freely accessible on-line repository such as the arxiv, the ECCC, or the Cryptology ePrint archive.  (Papers that are not written well enough for public dissemination are probably also not ready for submission to FOCS.)  We expect that authors of accepted papers will make full versions of their papers, with proofs, available by the camera-ready deadline.&quot;", "author": "Sylvain", "published": "2016-07-21 13:54:28.345000+00:00", "title": ""}, {"content": "Sylvain, <br /><br />Thank you very much for your comments/questions. I will forward them to the proceedings chair for ICALP and to the new president of the EATCS right away. <br /><br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Aceto:Luca.html\">Luca Aceto</a>", "published": "2016-07-21 14:31:54.516000+00:00", "title": ""}]