[{"content": "<![CDATA[<p>(1) Ultra-narrowly, Dan Staley&#8217;s computational critique of the &#8220;Concealed Carry Is Nuts&#8221; Fermi Calculation (circal <a href=\"#comment-1734928\" rel=\"nofollow\">#14</a>) is addressed by the corrective factor &#8220;1/10&#8221;, isn&#8217;t&nbsp;it?</p>\n<p>(2) Somewhat more broadly, Fermi calculations *do* accommodate probabilistic correlations&nbsp;&mdash; the Fermi art being, to arrange the deductive steps such that computational refinements will most likely act to <i>strengthen</i> the conclusion.  </p>\n<p>More folks would appreciate the force of Fermi-style assessments of gun-violence&nbsp;&mdash; wouldn&#8217;t they?&nbsp;&mdash; if Donald Trump, the NRA, and the Republican did not politically collude in legislatively <i>banning</i>&nbsp;(!) scientific research that would elucidate the&nbsp;point. </p>\n<p>Is there any other point&nbsp;&mdash; aside from the deliberate cultivation of public ignorance&nbsp;&mdash; to the Trump/NRA/Republican ban on gun-violence research?</p>\n<p>(3) Most broadly, grotesque &#8220;alt.quibbling&#8221; in respect to the brutal realities of firearm-violence continues a &#8220;wrong-side-of-history&#8221; quibble-tradition whose type-specimen is Jefferson Davis&#8217; grotesque &#8220;alt.quibbling&#8221; in respect to the brutal realities of slave-trading.</p>\n<p>For example, in Jefferson Davis&#8217; self-authored <i>A Short History of the Confederate States of America</i> (1890) we read</p>\n<blockquote><p> &#8220;In 1807 [&#8230;] the slave-trade was finally abolished, and has never since had any legal existence in any of the States. &nbsp;&hellip; Retiring from public life and occupied [from 1835-1860] with the peaceful pursuits of a planter&nbsp;&hellip; at my home at Briarfield, Mississippi&nbsp;&hellip;&#8221;</p></blockquote>\n<p>Somehow, although in Davis&#8217; personal view &#8220;the slave-trade was finally abolished&#8221;, Jefferson Davis himself acquired, during the years 1835-1860, no less than 139 slaves&nbsp;&mdash; over and beyond the single slave that Davis possessed as a manservant at the beginning of this period&nbsp.</p>\n<p>It was this wholly Jefferson-owned slave-community that was solely responsible for the construction of the plantation that Davis describes as &#8220;my home at Briarfield, Mississippi&#8221;, wasn&#8217;t&nbsp;it?</p>\n<p>By what &#8220;alt.quibbling&#8221; rhetorical tricks&nbsp;&mdash; aside from the most shamefully degrading abuse of language&nbsp;&mdash; could Davis describe his own large-scale slave-exploitation as a practice <i>other</i> than &#8220;slave-trading&#8221;?  </p>\n<p>By what pathological traits of personality&nbsp;&mdash; aside from the <a href=\"http://www.mentalhealthamerica.net/conditions/personality-disorder\" rel=\"nofollow\">DMS-5 Cluster B personality traits</a> that Jefferson Davis himself objectively evidenced&nbsp;&mdash; could Davis continue, as late as 1890, to regard slaveholding as &#8220;the peaceful pursuit of a&nbsp;planter&#8221;?</p>\n<p>Are Jefferson-level Cluster B cognitive traits sufficiently in evidence among senior officials of the Republican Party, and at the highest levels of the White House, as to reasonably <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3652711\" rel=\"nofollow\">arouse profound and fast-evolving concerns among scientists in&nbsp;general</a>, and cognitive scientists in&nbsp;particular?  </p>\n<p>The objectively evident answers&nbsp;&mdash; for an overwhelming consensus of scientists, physicians, and historians at least&nbsp;&mdash; to&nbsp;all of the seven questions posed above, is simply &#8220;yes&#8221;, isn&#8217;t&nbsp;it?</p>\n]]>", "author": "John Sidles", "published": "2017-05-04 02:43:18+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Mateus #18:</p>\n<p>&#8220;Maybe the US is doing something wrong, and other countries are doing it right&#8221;. </p>\n<p>Maybe indeed. </p>\n<p>But as I said in a debate with a Marxist economist a couple decades ago, &#8220;Have you noticed in which direction people are climbing over the fence?&#8221;.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-05-04 03:40:01+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Lol&nbsp;&hellip; Raoul Ohio&#8217;s remark suggests several forward-looking Fermi questions!</p>\n<p><b>Q</b> How many American citizens presently live abroad?</p>\n<p>&nbsp;&nbsp;• 0.01 million<br />\n&nbsp;&nbsp;• 0.1 million<br />\n&nbsp;&nbsp;• 1 million<br />\n&nbsp;&nbsp;• 10 million<br />\n&nbsp;&nbsp;• 100 million</p>\n<p><b>Q</b> How many of these citizens will marry abroad?  </p>\n<p><b>Q</b> How many will eventually return?</p>\n<p><b>Q</b> Are these numbers increasing or decreasing?</p>\n<p><b>Q</b> Is cultural isolationism sensible? Feasible?</p>\n]]>", "author": "John Sidles", "published": "2017-05-04 07:36:32+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Scott #18: Well, in the cases of affordable healthcare and gun control the reasons why the US cannot do it are rather clear. Not for me in the case of murder sprees. But I wasn&#8217;t trying to make some generic criticism about the country, but to point to a basic problem-solving strategy that seems to be completely ignored in the US. </p>\n<p>But to answer your question: I don&#8217;t know much about the US, so I&#8217;m not an adequate Second Autocrat. When I asked why do people go into murder sprees in the US much more often than elsewhere it was an honest question, not a rhetorical one. But there must be a way of solving the murder spree problem without losing Silicon Valley!</p>\n<p>Raoul Ohio #21: This is a non-sequitur. I&#8217;m just saying that a US without murder sprees would be better than a US with murder sprees. Or are you saying that if the murder spree problem is fixed there would be such catastrophic side effects that people would start fleeing the country?</p>\n]]>", "author": "Mateus Arajo", "published": "2017-05-04 07:53:40+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Scott, you may want to temporarily disable the blog&#8217;s comment plugin temporarily as it appears to be leaking personal information. To wit, it has twice occurred recently that the name and email fields of the comment form were filled in when I opened a blog page. I know nothing about WordPress development, but a quick search suggests that it may be <a href=\"https://cometcache.com/kb-article/what-are-wordpress-nonces-and-why-are-they-not-cache-compatible/\" rel=\"nofollow\"> caused by </a> the interaction of akismet comments and some kind of caching. Although, that page only discusses caching of the nonce (which I get every time I load the page), and not other fields (which have only been filled occasionally), so it may be a red herring. You can see a redacted example of the page source <a href=\"https://gist.github.com/anonymous/d65bff20914ebb1071c657c35d02b30f\" rel=\"nofollow\"> here</a> (note lines 442 and 445). Apart from email leaks, the nonce caching also apparently causes spam filtering to work poorly.</p>\n]]>", "author": "Bug hunter", "published": "2017-05-04 10:54:59+00:00", "title": "By: Bug hunter"}, {"content": "<![CDATA[<p>@Mateus- the problem is that the US murder rate is indeed much higher than other countries but in the majority of murders, the victim knows his or her killer. Murder sprees like this make up a relatively small portion of the total.</p>\n]]>", "author": "Michael", "published": "2017-05-04 12:05:28+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Bug hunter #24: I&#8217;m sorry to hear about that.</p>\n<p>As it happens, I&#8217;ve noticed a bunch of <i>other</i> buggy behaviors in WordPress recently.  These include:</p>\n<p>&#8211; New posts and comments taking a very long time, up to an hour, to actually show up (even after being published or approved)</p>\n<p>&#8211; My own login, to my WordPress Dashboard, not propagating to the rest of the browser &#8212; so when I&#8217;m leaving a comment like this one, it&#8217;s just as &#8220;a&#8221; Scott; the commenting system no longer recognizes me as &#8220;the&#8221; Scott 🙂</p>\n<p>&#8211; The blog simply not loading at all in Google Chrome on my laptop</p>\n<p>I can&#8217;t help but suspect that all these behaviors have the same cause, but I can&#8217;t figure out what it is.  Can anyone suggest anything to try?</p>\n<p>You suggest temporarily disabling &#8220;the blog&#8217;s comment plugin,&#8221; but <i>which</i> comment plugin (I have several)?  I&#8217;m not sure I understood what you meant by that, or how to do it.</p>\n]]>", "author": "Scott", "published": "2017-05-04 14:59:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>The problem of comments not appearing on this blog (when under load) is at least a year old. I suppose that might count as recent. It is also a caching problem; I can tell because when I modify the URL to create a new one, new comments do appear.</p>\n]]>", "author": "Douglas Knight", "published": "2017-05-04 16:10:11+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>@John Sidles</p>\n<p>> For scientists to embrace permissive gun-laws:<br />\n> A necessary precondition is that the Republican Party, Donal Trump, and the NRA must immediately rescind America’s willfully ignorant, culturally disgraceful, and morally wrong prohibition of scientific research regarding gun violence.</p>\n<p>The short answer is that a few years back the director of the CDC got censured for using funds from the CDC’s budget for what amounted to political activism. CDC money was effectively being spent on partisan political lobbying.</p>\n<p>> The final nail in the coffin came in 1995 when the Injury Prevention Network Newsletter told its readers to “organize a picket at gun manufacturing sites” and to “work for campaign finance reform to weaken the gun lobby’s political clout.” Appearing on the same page as the article pointing the finger at gun owners for the Oklahoma City bombing were the words, “This newsletter was supported in part by Grant #R49/CCR903697-06 from the Centers for Disease Control and Prevention.”</p>\n<p><a href=\"http://thefederalist.com/2015/12/15/why-congress-cut-the-cdcs-gun-research-budget/\" rel=\"nofollow\">http://thefederalist.com/2015/12/15/why-congress-cut-the-cdcs-gun-research-budget/</a></p>\n<p>There&#8217;s been a pretty long history of violence/firearms research&#8230; if not *fraud*, than at least *dishonesty*. I could probably dig up more examples &#8211; but (with all due respect, you seem like a pretty decent person!) I&#8217;m not sure how much effort I want to put into an internet debate.</p>\n<p>@Scott Aaronson</p>\n<p>> If there were even a few examples of campus murder sprees that were stopped by heroic students carrying concealed weapons, that would be evidence I’d need to weigh, alongside any evidence in the other direction</p>\n<p>I think this is very reasonable. And I&#8217;ll admit there is very little hard evidence either way. In general (not just on campus), mass shootings are almost never stopped by civilian concealed carry permit holders.</p>\n<p>The pro-gun control side says this is because concealed carry permit holders aren&#8217;t helping. The anti-gun control side says this is because concealed carry permit holders stop the would-be mass shooter before the incident could become a mass shooting. Note that &#8220;stop&#8221; does not necessarily mean shooting the perpetrator &#8211; in many cases, when confronted by armed opposition, the perpetrator will commit suicide. I consider this moderate evidence in favor of the pro-CCW side.</p>\n<p>The people I know, personally, are excellent shots and cool under pressure, but I can see how there would be concern that the average CCW permit holder doesn&#8217;t have anything resembling the training of the average police officer. I have a few counterarguments: First, it amazes me how *little* firearms training the average police officer gets &#8211; I maintain that a lot of the CCW permit holders are better than you think, in comparison. Second, civilians who are carrying are *not* meant to do everything that a police officer is meant to, the analogy I&#8217;ve heard (I forget the source) is that they are &#8220;speed bumps&#8221; not &#8220;roadblocks&#8221;. Finally, during a shooting, it&#8217;s not *hard* to tell the difference between the &#8220;good guys&#8221; and the &#8220;bad guys&#8221; &#8211; the good guys are the ones who have control over their firearm and are carefully looking around; the bad guys are the ones indiscriminately shooting at their fellow human beings.</p>\n<p>But you asked for specific incidents. My memory isn&#8217;t great on this one, but the highest-profile incident that comes to mind is the University of Texas tower shooting. The short summary is that an ex-Marine sharpshooter grabbed several rifles and began shooting people on campus from a tower.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/University_of_Texas_tower_shooting\" rel=\"nofollow\">https://en.wikipedia.org/wiki/University_of_Texas_tower_shooting</a></p>\n<p>This happened before SWAT teams were a thing and the police were pretty caught off guard. A few notes of interest:</p>\n<p>&#8211; A student ended up providing the police a rifle, since the police were not equipped properly.</p>\n<p>&#8211; A retired veteran accompanied the police up the tower to cover them while they confronted (and ended up killing) the shooter</p>\n<p>&#8211; A combination of police officers and civilians provided cover fire from the ground while a small group &#8211; two police officers and the retired veteran &#8211; went up the tower.</p>\n<p>The biggest change after this was that SWAT teams were created. The police were (reasonably!) very uncomfortable with civilian shooters taking part in the conflict.</p>\n<p>I&#8217;m not sure that this is strong evidence for *concealed carry* &#8211; what was needed were rifles; pistols are basically useless against a shooter from a tower and you can&#8217;t concealed-carry a rifle. But I certainly think it&#8217;s *weak* evidence in favor of letting responsible civilians be armed.</p>\n]]>", "author": "Joshua Brule", "published": "2017-05-04 18:16:22+00:00", "title": "By: Joshua Brule"}, {"content": "<![CDATA[<p>>isn’t it overwhelmingly likelier that a gun-filled campus would lead to more such tragedies, and those on a larger scale?</p>\n<p>I&#8217;d be more worried about a knife-filled campus leading to more such tragedies, since this attack happened with a knife.</p>\n]]>", "author": "Daniel", "published": "2017-05-04 23:45:55+00:00", "title": "By: Daniel"}, {"content": "<![CDATA[<p>Daniel #29: Well yes, <i>this</i> attack happened with a knife, but other campus attacks (including, infamously, at UT) have happened with guns, and been more deadly as a result.</p>\n]]>", "author": "Scott", "published": "2017-05-05 15:20:00+00:00", "title": "By: Scott"}]