[{"content": "<![CDATA[<p>Scott,<br />\nI think you are taking the argument a bit too far, or are taking the phrase &#8220;Agree to Disagree&#8221; to focus solely on the word disagree. What is your concept of that phrase?  Or, more exactly, before you heard of Aumann’s Theorem, what did you imagine &#8220;Agree to Disagree&#8221; would look like for two rationalists discussing?</p>\n<p>Imagine two twins separated, one raised in England and one in the US.  Before they meet, they each think the word color is spelled differently.  What is the correct spelling of the word color or colour?  After they meet and discuss, they will leave, each still believing their previous spelling was correct, and will likely continue to use their spelling, yet they will now agree there is another acceptable way of spelling it _in_a_different_context_.  That is perfectly acceptable with Aumann’s Theorem, and that is exactly what I would expect two rationalists &#8220;agreeing to disagree&#8221; would look like.  They did not converge on one correct way to spell the word color.  Yet they fully agree. But will also likely maintain the same actions in their different contexts in the future, but now agreeing there is another equally valid way to look at it if they were in a different context.</p>\n<p>I can see a lot of &#8220;Aumann discussions&#8221; just ending with: sure, I now see that if I grew up in your shoes that is a rational position, and now you see that if you grew up in my shoes that is a rational position.  We agree to disagree.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Brown:Edward.html\">Edward Brown</a>", "published": "2015-09-26 05:03:48+00:00", "title": "By: Edward Brown"}, {"content": "<![CDATA[<p>Re ideas on impossibility of heavier-than-air powered flight in the 19th century and earlier: it&#8217;s amusing to consider that birds and other animals were doing it all along&#8212;but most humans just assumed it couldn&#8217;t be scaled up to the point where we could do it ourselves (after all, steam engines are too heavy relative to power output, so that&#8217;s that). da Vinci was probably the honorable exception. Then there were some with impossibility &#8220;proofs&#8221;, I suppose, . . . 😉</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Read:Nick.html\">Nick Read</a>", "published": "2015-09-26 18:30:31+00:00", "title": "By: Nick Read"}, {"content": "<![CDATA[<p>Brown #39,</p>\n<p>In your example the twins don&#8217;t disagree after their discussion. They would simply agree that the British and the American spelling are different.</p>\n]]>", "author": "Jr", "published": "2015-09-26 19:32:52+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Scott #38: &#8220;I tend to think: if the remarks were factually false or morally evil, then condemn or ridicule them on those grounds! And if they were neither false nor evil, let them stand.&#8221;</p>\n<p>I&#8217;m confused by your wording. Does this mean there are examples of remarks you&#8217;d condemn that are both factually true and morally evil?</p>\n]]>", "author": "Anonymous", "published": "2015-09-26 23:10:04+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>Jr #41: Yes, thank you!  There&#8217;s no actual factual question at issue there.</p>\n]]>", "author": "Scott", "published": "2015-09-26 23:31:10+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Anonymous #42: There are obvious examples where it can be morally evil to speak a truth (&#8220;why yes, Mr. Ax Murderer, the child is in <i>that</i> room!&#8221;).  But I was thinking more about morally evil statements that don&#8217;t purport to be factual at all (example: &#8220;all left-handed people should be rounded up and killed&#8221;).</p>\n]]>", "author": "Scott", "published": "2015-09-26 23:33:37+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<blockquote><p><b>Anonymous</b> wonders &#8220;[Are there] examples of remarks you’d condemn that are both factually true and morally evil?&#8221;</p></blockquote>\n<p>The poet replies<br />\n<blockquote><a href=\"http://www.poetryloverspage.com/poets/blake/to_see_world.html\" rel=\"nofollow\"><b>Auguries of Innocence</b></a></p>\n<p>A truth that&#8217;s told with bad intent<br />\n&nbsp;&nbsp;Beats all the Lies you can invent</p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&mdash; William Blake (circa 1789)</p></blockquote>\n<p><b>Initial question</b>&nbsp; Does Blake&#8217;s criterion encompass internet quibbling and cherry-picking?</p>\n<p><b>Note</b>&nbsp;  Michael Harris&#8217; recent <i>Mathematics Without Apologies</i> (2015) is worth searching for words like <b>&#8220;<a href=\"https://books.google.com/books?id=UZGSBAAAQBAJ&pg=PA187&dq=intention\" rel=\"nofollow\">intention</a>&#8220;</b>, <b>&#8220;<a href=\"https://books.google.com/books?id=UZGSBAAAQBAJ&pg=PA187&dq=yoga\" rel=\"nofollow\">yoga</a>&#8220;</b>, and  &#8220;foundations&#8221;&nbsp;&mdash; and even Steven Pinker&#8217;s <b>&#8220;<a href=\"https://books.google.com/books?id=UZGSBAAAQBAJ&pg=PA187&dq=cheesecake\" rel=\"nofollow\">cheesecake</a>&#8220;</b>&nbsp;&mdash;  whose meanings in Harris&#8217; view (and mine too) are interlocking.  </p>\n<p>For example,&nbsp;Harris quotes (approvingly?) the critic Roger Fry:<br />\n<blockquote>If by some miracle beauty could be generated without effort, the whole world would be richer.&nbsp;[&hellip;] [A]s things are at present, with our gaping admiration for professional skill, we are in less danger of finding a prophet whose utterance is spoiled by imperfect articulation than of being drowned beneath floods of uninspired rhetoric.&#8221;</p></blockquote>\n<p><b>Further questions</b>&nbsp; Is truth irrelevant, when it is expressed without regard for intention?  Or are we better off (individually and/or collectively) just asking for &#8220;more truthy-cheesecake, please?&#8221;</p>\n]]>", "author": "John Sidles", "published": "2015-09-27 00:10:26+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Scott #43:</p>\n<p>You said &#8220;it applies anytime your opinions are functions of the state of the world&#8221;.  Spelling is very much a function of the state of our surrounding culture.</p>\n<p>The point is that they left in agreement, not by either abandoning their original spelling, but just by agreeing that there is another acceptable way in a different context.  That is exactly what I would imagine &#8220;agreeing to disagree&#8221; would mean in a rational context: they don&#8217;t abandon their original belief, but merely append the other&#8217;s as an acceptable alternative in a different context.  And they know that the other knows that they know that the other knows &#8230; etc. so their priors match now on this topic, even though they didn&#8217;t converge on one spelling.</p>\n<p>You skipped the question: Before you heard about Aumann’s Theorem, what did you imagine “Agree to Disagree” would look like for two rationalists discussing?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Brown:Edward.html\">Edward Brown</a>", "published": "2015-09-27 02:33:14+00:00", "title": "By: Edward Brown"}, {"content": "<![CDATA[<p>Edward #46: No, you&#8217;re again playing semantic games, which sound good but don&#8217;t reflect the math.</p>\n<p>Within the context of Aumann&#8217;s Theorem, &#8220;the world&#8221; (the thing that has a state &omega;&isin;&Omega;) means <i>the entire universe</i>&#8212;the whole domain of discourse that the two participants in the conversation are both talking about.</p>\n<p>Thus, in your example, &#8220;&#8216;color&#8217; is the correct spelling everywhere&#8221; would be one statement about the world, which could be true for some &omega;&#8217;s and false for others.</p>\n<p>&#8220;&#8216;colour&#8217; is the correct spelling everywhere&#8221; would be a second such statement.</p>\n<p>&#8220;&#8216;color&#8217; is correct in some places while &#8216;colour&#8217; is correct in others&#8221; would be a third statement.</p>\n<p>If Alice had only ever seen it spelled &#8216;color,&#8217; then her credence would presumably be split between the first and third statements&#8212;and, of course, among countless other possibilities, e.g. that it can be spelled &#8220;color&#8221; or &#8220;kuller,&#8221; but never &#8220;colour&#8221; (but to keep our own meta-conversation tractable, we need to focus in on a few statements of interest to us).  Likewise, if Bob had only ever seen it spelled &#8216;colour,&#8217; then his credence would be split between the second and third statements.</p>\n<p>But this means that, as soon as Alice and Bob start talking, they can come to agreement (and common knowledge of agreement) that the third statement is correct, while the first and second are incorrect.</p>\n<p>You might object that, if Alice had never seen it spelled &#8216;colour,&#8217; then the possibility that it might be spelled that way in other parts of the world would never even occur to her.  She wouldn&#8217;t have a prior probability for its being true, because she wouldn&#8217;t even have considered it.</p>\n<p>Yet, while this is true of humans, it&#8217;s emphatically not true of the idealized Bayesian agents that Aumann&#8217;s Theorem talks about.  Such an agent, by definition, has a prior for <i>everything</i>.  And she&#8217;s only ever &#8216;surprised&#8217; because something happens that she assigned a tiny probability to, never because something happens that she didn&#8217;t assign a probability at all.</p>\n<p>Again, no one is pretending for a microsecond that this captures real human behavior!  As I said in both the interview and my blog post, the question is just whether this is a standard of rationality that we should <i>aspire</i> to.</p>\n<p>Lastly, regarding your question: alas, I don&#8217;t remember thinking deeply&#8212;or even shallowly&#8212;about what the phrase &#8220;agreeing to disagree&#8221; truly means before I&#8217;d encountered Aumann&#8217;s theorem.  (I was a bad Bayesian, with no prior over the possible meanings. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> )  But if you&#8217;d asked me, I&#8217;m sure I would have said that &#8220;color&#8221; vs. &#8220;colour&#8221; was a trivial and uninteresting example&#8212;exactly like two people preferring different flavors (flavours?) of ice cream.  I.e., sure, woohoo, we&#8217;ve found a difference between people or cultures.  But it&#8217;s not one that corresponds to two rational agents holding different beliefs about the actual reality of their shared world.  So it doesn&#8217;t seem like something that even the most thoroughgoing rationalist could get uncomfortable about.  Vive la différence!</p>\n]]>", "author": "Scott", "published": "2015-09-27 04:41:40+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Addendum: What I could have said in the interview is that Aumann&#8217;s Theorem applies to moral questions if, and only if, you&#8217;re a moral realist&#8212;i.e., if you believe that complete knowledge of the objective facts of the world would also resolve all moral questions in a universal way.  If you reject moral realism, then agreeing to disagree about moral questions becomes no more problematic from a Bayesian perspective than agreeing to disagree about which ice cream flavor is tastiest, or whether it&#8217;s flavor or flavour.</p>\n<p>The difference between morality and the other examples, is just that I suspect there are few if any spelling realists or tastiest-ice-cream-flavor realists.</p>\n]]>", "author": "Scott", "published": "2015-09-27 05:10:14+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott,<br />\nThank you. It makes more sense now.</p>\n<p>And I was indeed thinking ahead to moral questions, as I was feeling uncomfortably like Aumann&#8217;s theorem was claiming there needed to be a convergence. But your follow up helped resolve that as well.  I guess I&#8217;m not a moral realist, for I feel the best they could do is say statements like &#8220;if you take such and such as a premise for morality, then this and that will follow&#8221;, and one could never reason out the premise itself.</p>\n<p>I chose spelling so it wouldn&#8217;t get mired in side discussions.  I&#8217;m not sure I&#8217;d go so far as to say morality is as much a social convention as spelling, as the latter is more arbitrary in some sense I&#8217;m not sure I could quantify easily. But I always find it frustrating when people try to argue morality with logic.  It&#8217;s like the people who leave little booklets about their faith to encourage convertion&#8230; they point out real situations in the world or that people may have, then they always quote the bible, book of mormon, etc. as if we already agree that is a place to start from, and arrive at a conclusion.  That may seem silly, but when I hear vegan&#8217;s proselytizing it comes off the same way to me.  And any arguments I make in return, probably come off similarly.  (For similar reasons, even though I agree with many of your social stances, I cringe a bit when you word it as society progressing when there is a social shift in the premises we use to discuss morality. You even hope we can look &#8216;ahead&#8217; to the next shift.  This appears to presupposed there is a correct fitness function of morality that we are trying to optimize.)</p>\n<p>I usually come to your blog to hear about snippets from the edge of complexity theory.  But I am glad you feel open enough to share thoughts on other subjects.  I don&#8217;t find philosophy as interesting as Julia Galef does, but it is always neat to hear someone speak enthusiastically about a piece of a subject matter that excites them. I ended up watching several of her youtube videos.</p>\n<p>Thank you for sharing.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Brown:Edward.html\">Edward Brown</a>", "published": "2015-09-27 19:09:40+00:00", "title": "By: Edward Brown"}]