[{"content": "its really great to have a few such broadminded scientists in (T)CS like papadimitriou who can see the forest for the trees, instead of the narrow-focused specialization that sometimes inundates the field (like other scientific fields). also while widespread, recognition and exploration of the &quot;algorithmic lens&quot; still seems in early days with vast <i>terra incognita</i> remaining. more on <a href=\"https://vzn1.wordpress.com/2015/06/01/tribute-celebration-of-the-algorithmic-lens/\" rel=\"nofollow\">the algorithmic lens</a>", "author": "vz nuri", "published": "2015-07-17 16:27:02.295000+00:00", "title": ""}, {"content": "oh, one other item/ feedback. re point &quot;No known “neurally plausible” algorithm solving a nontrivial problem&quot;. actually this seems to be superseded by recent research mainly into image recogintion/ vision processing. algorithmic models are increasingly biologically plausible and there is fairly solid theory about how the mammalian vision processing system works wrt algorithm perspectives eg &quot;sparse coding,&quot; &quot;feature detection&quot; etc. some of this is captured in new/ cutting edge <a href=\"https://vzn1.wordpress.com/2013/10/28/deep-learning-ai-artificialreal-brain-research-leadscompendiumcritical-masssingularity/\" rel=\"nofollow\">&quot;deep learning&quot;</a> approaches even recently generating big headlines. agreed these approaches are not attempting to have high &quot;biological fidelity/ verisimilitude&quot; but they at least have high &quot;biological similarity&quot;. part of the difficulty here is the compartmentalization of scientific fields. biologists study biology, machine learning theorists study machine learning. there are some rare crosscutting scientists/ work. again papadimitriou is a case study here eg wrt his interest in &quot;computational evolutionary theory&quot;.", "author": "vz nuri", "published": "2015-07-18 18:32:32.615000+00:00", "title": ""}, {"content": "Nice summary — a small nitpick, however: if I remember correctly (this may be a dubious assumption, however) the talk, the &quot;Babies vs. Computer disconnect&quot; was two-way: <br />&quot;babies can easily achieve cognitive tasks that are very hard for computers&quot;<br />AND<br />&quot;computers can easily achieve cognitive tasks that are very hard for babies&quot;<br />", "author": "Clement C.", "published": "2015-07-19 19:46:29.424000+00:00", "title": ""}, {"content": "Thanks Clement. I mentioned your recollection in the post since I might have missed the other half of the disconnect. However, it seems to me that computers are capable of cognitive tasks that are very hard for humans of all ages :-)", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Aceto:Luca.html\">Luca Aceto</a>", "published": "2015-07-19 23:56:04.989000+00:00", "title": ""}]