[{"content": "How did the attendance compare to past STOCs?", "author": "Anonymous", "published": "2017-06-26 16:52:52.582000-04:00", "title": "How did the attendance compare to past STOCs?"}, {"content": "Attendance was higher than all at recent conferences (going back to at least 2004) except for STOC 2014 in New York.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Beame:Paul.html\">Paul Beame</a>", "published": "2017-06-26 19:14:25.889000-04:00", "title": ""}, {"content": "Were the  plenary talks/conference talks recorded? If so, when and where can we view them?", "author": "Anonymous", "published": "2017-06-26 20:54:47.292000-04:00", "title": ""}, {"content": "I second the second anonymous commenter. Watching some of the talks would be wonderful for people unable to attend!", "author": "Anonymous", "published": "2017-06-27 04:53:27.203000-04:00", "title": ""}, {"content": "Prefacing all this with the fact that I didn&#39;t actually attend STOC/TheoryFest, mostly due to what follows.<br /><br />I feel like when you ask a computer scientist: &quot;What makes a bigger and better conference?,&quot; the &quot;obvious&quot; answer is often &quot;more talks!&quot; This is in part the feeling I got from the schedule for TheoryFest.<br /><br />On the other hand, if you talk to any theoretician, they&#39;ll tell you that the &quot;hallway track&quot; is the most meaningful session for them. With this in mind, I propose that events dedicated to *community building* would have the greatest impact. <br /><br />In this vein, I applaud efforts such as the networking lunch (https://twitter.com/fortnow/status/877232575948959744) -- this is the type of thing that I think all participants will remember. I also like the *idea* (but not this execution) of having a poster session, which I think results in meaningful interactions between individuals.<br /><br />On the other hand, the number of talks seemed overwhelming. The poster sessions, while a good idea, took up two of the evenings. Conference evenings make up some of my fondest memories, and I&#39;ve gotten to know my fellow theorists much better as a result. Lance also retweeted a challenge for a soccer game against another conference (https://twitter.com/wjcook/status/877327124519989253). Why not make this a thing? (ICALP had a soccer game a few years ago: http://icalp2014.itu.dk/conference/~/link.aspx?_id=5F98F3FC22054F3EBA899EF3570FA37C&amp;_z=z).<br /><br />In short, I feel like the goal of a conference (and indeed, a &quot;theory festival&quot;) should be about building the community by facilitating meaningful interactions between people, rather than just being more talks and non-interactive academic content (I believe there may be ways to do the latter in a more meaningful way, i.e., the poster session, but also maybe research &quot;speed dating&quot;, etc.).<br /><br />(Posted anonymously, but I&#39;m an upper-year graduate student at a school with a decently sized theory group)", "author": "Anonymous", "published": "2017-06-27 14:36:53.334000-04:00", "title": ""}, {"content": "I didn&#39;t expect to like the poster session, but I thought it went quite well and spurred a lot of conversations that otherwise wouldn&#39;t happen. When I see a STOC talk often there are a resounding zero questions. My feeling is that the &quot;are there any questions?&quot; part of the talk is not working, and the poster session is a good way to remedy that.<br /><br />That said, I&#39;d prefer the poster session *before* dinner, perhaps starting before 5pm, as otherwise this makes it harder to go to eat with colleagues.<br /><br />I enjoyed that there were morning plenary talks, as that meant I could comfortably skip them (as opposed to waking up early for talks I don&#39;t want to miss). This made the overall experience a bit more relaxed, but I&#39;m not sure that was intended. <br /><br />But otherwise the program felt too busy. The invited afternoon plenary talks were not as interesting as I had hoped. I think it would have been better to spread out these talks throughout the week - they would have been easier to digest that way.<br /><br />On a slightly different note, I&#39;d personally like the governance of STOC to change. The business meeting does not feel like the right time to discuss serious issues. There is not enough attendance, the discussion has in the past become less than productive, and often only the loudest people speak. I&#39;d prefer something more along the lines of CCC, where they have voting-by-email for important issues. It becomes delicate on how to define &quot;membership&quot;, but I feel that those people who have both had a paper at STOC *and* actually attended should have more votes in this process.<br /><br />(As an example of changing governance, I am very happy that acm-stoc.org is now the website for STOC, but am frankly embarrassed for the community that it took so long for this to happen.)", "author": "Anonymous", "published": "2017-06-27 23:30:37.751000-04:00", "title": ""}, {"content": "The talks were recorded.  I&#39;m in touch with the local arrangements folks to see when they become available, but they will soon.  I&#39;ll announce it on the blog.   <br /><br />However, the issue of &quot;recording talks&quot; is a thorny one.  It&#39;s significantly expensive.  (Yes, we could make it cheaper by organizing a &quot;volunteer army&quot; to record all the talks in a less professional matter, and if you&#39;d like to be responsible for organizing that for the next STOC, please send me e-mail, I&#39;d be happy to talk with you.)   And while SIGACT can subsidize that some over the long run the people paying for recording are the conference attendees, who are arguably not the people who need the talks recorded.  OK, I imagine many speakers are happy to have their talks recorded for an Internet audience, so that really is arguable, but there is reasonable concern that recording reduces conference attendance, which is not what we want.  <br /><br />Longer-term, my opinion is that things like recording talks is going to mean higher registration fees, so it&#39;s important that people paying those fees -- that is, the people going to the conference -- really want it to happen.  ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2017-06-28 00:17:30.079000-04:00", "title": ""}, {"content": "&quot;On a slightly different note, I&#39;d personally like the governance of STOC to change.&quot; <br /><br />I&#39;m not clear what you mean by this.  STOC is governed by the SIGACT Executive Committee.  We have elections every 3 years, with an election coming up next year, as announced at the business meeting.  So the governance is going to change.  If you want to be involved in the change, send me your name and let me know that you&#39;d like to run.  (Or, of course, encourage colleagues to do so.)  <br /><br />&quot;The business meeting does not feel like the right time to discuss serious issues.&quot;  <br /><br />I agree.  It&#39;s not.  It&#39;s certainly an appropriate place to raise issues, and I appreciate when people do, but I don&#39;t think we can have significant discussion in 1 to 1.5 hours at the business meeting.  (I don&#39;t think I&#39;ve suggested otherwise.)  <br /><br />Take this TheoryFest as an example.  It was brought up at several business meetings.  And it was great that the general idea was raised there.  Actually getting it off the ground required getting a very dedicated volunteer committee together, having lots of offline discussion over several months about what we should try to do, and then working together to make it all happen.  Thanks again to everyone involved in organizing the TheoryFest.  <br /><br />You say you have ideas for how you want to make things better?  Great.  Volunteer.  Don&#39;t just send me a note saying you&#39;d like something done;  send me a note saying you want to volunteer to make something happen.  Then we can figure out if it is something the SIGACT EC can agree to, or, if needed, arrange a vote to see if it should happen.  And then we can help you try to make what you want to happen, happen.      ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2017-06-28 00:30:14.610000-04:00", "title": ""}]