[{"content": "If I had to guess, I think the context here is important. Nick has made some talks at ONS on how to empower people to manage their home networks and control data usage. I would assume the comment here pertains to something like this: &quot;here&#39;s a solution that allows the parent to set data usages limit to different kids so that an aggregate stays under the cap.&quot; And the solution may be technically valid, using SDN and nice cool solutions, but in the end, the question the reviewer is asking is: is this a feature that the parents will use? Will they indeed spend time worrying about allocating 1Gb to Timmy and 1.5Gb to Betsie?<br /><br />Not all papers would suffer from this criticism, not many target home users.<br /><br />The criticism of: &quot;why are you studying this problem that&#39;s not very relevant in practice&quot; is relatively common. Just look at many energy efficiency papers which improve one phase of a process that is negligible in the big picture. ", "author": "WithinTheContext", "published": "2014-05-03 12:35:12.316000-04:00", "title": ""}, {"content": "&quot;fail!&quot;... a review almost as good as one written by Eliza, lol... the review is quite laughable &amp; probably by some grad student who is new to reviewing, and whose advisor didnt give them much guidelines on that. it would be interesting to know what paper it was in reference to.<br /><br />however, the intense/narrow specialization of modern scientific fields in general, TCS included, is worth some consideration and few within the fields comment on that. it is rarely pointed out. striving to see or not lose sight of the &quot;big picture&quot; is a very worthwhile goal.", "author": "Anonymous", "published": "2014-05-03 14:30:15.876000-04:00", "title": ""}, {"content": "I think picking on the reviewers is wrong at least in TCS conferences: currently PC members get 40-50 papers to review they are asked to reject 80-90% of them and then we act surprised when their reviews are completely random.<br /><br />The fault lies on PC chairs and steering committees who have failed to let conferences grow along with their fields. Having larger conferences reduces the amount of &quot;waterfall&quot; papers that demand review cycles in each iteration while at the same time reducing the incredibly high rejection rates of top conferences.<br /><br />Additionally we should take a page from other fields in CS where conferences have affiliate workshops/venues where a good but not great paper can appear and be done within one review cycle. INFOCOM A and INFOCOM B are one example.<br /><br />But I don&#39;t expect anything to change. If FOCS hasn&#39;t found a way to accept 5 more papers in 20 years, what hope do they have of achieving any meaningful change? <br /> ", "author": "Anonymous", "published": "2014-05-03 22:45:55.034000-04:00", "title": ""}, {"content": "A review is almost by definition an opinion, except when it points out factual errors. Is it really necessary to mention this specifically in every review? Isn&#39;t it enough to always read them as such?<br /><br />Further more, unless you propose that all papers that are factually correct have to be accepted to any journal and conference they are submitted to, these opinions in reviews matter.<br /><br />And finally, yes the quoted review is worded strongly, but it actually does express that this is just an opinion. It uses phrases like &quot;I think&quot; and &quot;I am not at all sure&quot;. Of course you can rephrases it to &quot;In my most humble opinion (which shouldn&#39;t matter of course because the authors probably know better) it could potentially be helpful if the authors considered...&quot; but what is the point?", "author": "conti", "published": "2014-05-06 20:59:57.690000-04:00", "title": ""}]