[{"content": "<![CDATA[<p>Scott: </p>\n<p>Can you elaborate on the &#8220;greatest reductionist&#8221;  comment you made  about Bekenstein? </p>\n<p>That sounded intriguing but I&#8217;m not sure I understood what you meant there.</p>\n]]>", "author": "Rahul", "published": "2015-08-19 12:24:55+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Sniffnoy #10: Thanks for explaining. I&#8217;m an engineer, and I like to think about the units because they provide both an error detection mechanism into my calculations, and insight into what is really going on. Of course, it makes sense to take well-known shortcuts in a blog post; I&#8217;m not so sure about the Wikipedia page linked, though.</p>\n]]>", "author": "Miguel", "published": "2015-08-19 14:23:03+00:00", "title": "By: Miguel"}, {"content": "<![CDATA[<p>Miguel #7, Sniffnoy #10: Actually, I don&#8217;t see any problem with the way Wikipedia or I wrote it.  It&#8217;s comprehensible to a layperson, who can easily get a sense of <i>how many bits we&#8217;re talking about</i> (namely: a lot) for reasonable values of M and R, but it&#8217;s also completely precise for an expert, who could easily convert it to whatever other format they wanted (e.g., keeping mass and length abstract, while collecting all the units in the leading constant).  If I put a constant in front with units of 1/(kg m), it would just befuddle the layperson, with no compensating increase in correctness or precision.</p>\n]]>", "author": "Scott", "published": "2015-08-19 15:08:28+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>In 1990 Bekenstein wrote the following in his paper entitled “Quantum limitations on the storage and transmission of information”:</p>\n<p>“Thus far, as customary in the field, we have treated information storage and communication as separate issues. But clearly they are not. A situation can be described purely in terms of information storage only in the rest frame of the storing device. In another Lorentz frame information flows with the motion of the device, and the communication facet surfaces. In fact, the Lorentz invariance of the laws of physics must mean that information storage and communication are inextricably linked, and proper understanding of one of them suffices for understanding of the other. Thus far no unified treatment of this sort exists. But there are some insights into how information is intertwined with the concept of space-time.”</p>\n<p>Scott, do you think Bekenstein had foreseen a deep relativistic connection between space complexity and communication complexity? If so, is it possible to apply it to complexity theory?</p>\n]]>", "author": "Serge", "published": "2015-08-19 16:14:30+00:00", "title": "By: Serge"}, {"content": "<![CDATA[<p>I was  shocked to hear the sad news and my heart goes to Jacob&#8217;s family. Jacob was a great scientist and I also share Scott&#8217;s impressions about him as a person. I saw Jacob on Campus almost every day, and, as Scott describes, he was always extremely kind and nice. Let me add that Jacob was a member of our quantum information center, gave (like Scott) one of the main lectures in the Center&#8217;s opening conference QSTART, <a href=\"https://www.youtube.com/watch?v=zyMzrS9w87Y&list=PLTn74Qx5mPsQUoi7vsr29rUTzkd_vlv3G&index=19\" rel=\"nofollow\">Black Holes and the Physical Limits of Information</a> (the link is to the video). And here is another videotaped lecture in Hebrew : <a href=\"https://www.youtube.com/watch?v=beXMrgon4eo\" rel=\"nofollow\">Thermodynamics: From Steam Engines to Black Holes</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2015-08-19 16:53:22+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Scott, the constant in front would have to have units of bits/(kg m) to satisfy me <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>I think my confusion arose because I&#8217;m completely mistified by the Bekenstein bound. I work in digital and wireless communications, and I know information theory (Shannon&#8217;s), so I work with bits every day. To see an equation that combines the speed of light, Planck&#8217;s constant, mass, size, pi, and ln 2, and returns bits&#8230; it just blew my mind.</p>\n]]>", "author": "Miguel", "published": "2015-08-19 22:30:32+00:00", "title": "By: Miguel"}, {"content": "<![CDATA[<p>Serge #19:</p>\n<ul>Scott, do you think Bekenstein had foreseen a deep relativistic connection between space complexity and communication complexity? If so, is it possible to apply it to complexity theory?</ul>\n<p>I think the passage you quoted conveys an important insight.  Indeed, I would say that we already use something sort of like it in complexity theory, in that lower bounds on one-way communication complexity are routinely used to get lower bounds on the amount of data storage needed in streaming and online computation, and other related models.  (See, e.g., <a href=\"http://xxx.lanl.gov/abs/quant-ph/0606066\" rel=\"nofollow\">this paper</a> by Francois Le Gall.)  In effect, one thinks about data storage as a &#8220;message&#8221; sent from the past to the future&#8212;so lower bounds on communication can then be used to get lower bounds on the number of bits one needs to store.</p>\n]]>", "author": "Scott", "published": "2015-08-20 02:06:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Rahul #16:</p>\n<ul>Can you elaborate on the “greatest reductionist” comment you made about Bekenstein?</ul>\n<p>I just meant that at that point in my life, Bekenstein was the individual I&#8217;d met who&#8217;d done the most to advance the reductionist vision, of reality as the output of a simple computer program&#8212;particularly through his discovery of the Bekenstein bound, with its implication that any bounded part of the universe can be fully described using a finite number of qubits.  (Since then, I&#8217;ve met Steven Weinberg, and others who could also make strong claims to have advanced reductionism. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> )  Of course, one could reasonably wonder: if a simple computer program accounts for all observable phenomena, then what role could possibly be left for an interventionist deity like that of the Old Testament?  I never talked to Bekenstein about such things, though I&#8217;m sure he would&#8217;ve had an interesting answer.</p>\n]]>", "author": "Scott", "published": "2015-08-20 02:18:29+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Rahul 16, Scott 23:</p>\n<p>For what it&#8217;s worth there are a few tidbits from Jacob Bekenstein and David Eichler on reductionism and the Old Testament creator in an interview on the <i><b>Huffington Post</b></i> <a href=\"http://www.huffingtonpost.com/mario-livio/science-and-religion_b_1724111.html\" rel=\"nofollow\">here</a>.</p>\n<p>Personally, as a non-affiliated philosophical theist with a deep interest in science, a Darwinian without qualification, I think that there is an obvious tension between theism and the scientific assumptions about Nature. This tension is revealed as an uncomfortable feeling that, if the laws of Nature are a simple computer program, then who wrote the program (the position, apparently, of Bekenstein), on the one hand; and, on the other hand, an equally uncomfortable feeling that if we discover anything like this program or think it highly plausible that it could be discovered, then what need is there for any other information on the program, and the question who did or not write the program is meaningless (the position, as far as I can make it out, of Quine and his disciples).</p>\n<p>I share Bekenstein&#8217;s view much more than Quine&#8217;s. Not only is there the question where the simple program came from, there&#8217;s the question how human thinkers came up with the assumptions that justify looking for the simple program. Our contemporary naturalistic view of cause and effect, for example, is radically different from what went under the same name before the Renaissance. You really kind of have to make this assumption of naturalistic, mechanistic cause and effect <i>before</i> you can even get started doing science in the modern sense.</p>\n<p>I would also note that, based on knowing a number of Jewish friends of varying persuasions ranging from haredim to &#8220;Modern Orthodox&#8221; to Reconstructionist to Reform to completely secular, there is a radical loss of interest in science and clinging to Creationism that sets in as one moves from the &#8220;Modern Orthodox&#8221; persuasion further to the right.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gogins:Michael.html\">Michael Gogins</a>", "published": "2015-08-20 13:56:28+00:00", "title": "By: Michael Gogins"}, {"content": "<![CDATA[<p>BD&#8221;E. I was very much hoping I would someday have the chance to meet Bekenstein myself and to talk to him about stuff, but now that won&#8217;t happen in this world.</p>\n<p>Regarding religion, I don&#8217;t imagine Bekenstein was bothered by matters of religion vs. science- we try to understand what we can observe, and what we can&#8217;t observe needn&#8217;t scientifically concern us unduly.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Moskovich:Daniel.html\">Daniel Moskovich</a>", "published": "2015-08-21 00:15:13+00:00", "title": "By: Daniel Moskovich"}, {"content": "<![CDATA[<p>[&#8230;] Shtetl–Optimized: Jacob Bekenstein (1947–2015) [&#8230;]</p>\n]]>", "author": "Whewells Gazette: Year 2, Vol. #06 | Whewell's Ghost", "published": "2015-08-24 15:55:07+00:00", "title": "By: Whewell’s Gazette: Year 2, Vol. #06 | Whewell's Ghost"}]