[{"content": "<![CDATA[<p>fred #35</p>\n<p>The matter just follow geodesics of the spacetime when there are no other interactions. At the single atom level the electromagnetic force is huge compared to the gravitational &#8220;force&#8221; that is trying to separate the electron from the proton (due to the expansion of the universe), not to mention the strong force that keeps the nucleus together.<br />\nIt&#8217;s only at large distances when object can be considered almost isolated from each other that the current dark-energy effects dominate. This of course depends on the rate of expansion. If you start increasing the rate of expansion more and more at some point you will be able separate clusters of galaxies, then galaxies, starts, planets and in the end atoms etc.</p>\n<p>See <a href=\"http://arxiv.org/abs/astro-ph/0302506\" rel=\"nofollow\">http://arxiv.org/abs/astro-ph/0302506</a></p>\n]]>", "author": "Gian Mario", "published": "2015-03-13 03:32:27+00:00", "title": "By: Gian Mario"}, {"content": "<![CDATA[<p>I will make an incorrect analogy just to make it clear. Let&#8217;s assume that atoms are represented by 2 balls connected by a spring that in absence of other forces keeps the 2 balls in equilibrium at a constant distance d, like an elastic dumbbell.</p>\n<p>Now put the dumbbell on the surface of an expanding rubber balloon (the universe), and assume that there is friction between the balls and the surface of the balloon that increase with the relative speed.</p>\n<p>The friction will try to separate the balls when the balloon is inflating, but the spring will keep them together finding a new equilibrium position.</p>\n<p>If the friction is very small will have basically no effect, the dumbbell will be slightly stretched but of a completely negligible amount.</p>\n<p>Nevertheless if you start inflating the balloon faster and faster, the friction will become stronger and stronger, it will start stretching the spring more and more until it will rip the dumbbell apart.</p>\n<p>PS<br />\nWe also do not consider the gravitational attraction between electrons and protons when computing the ground state of the atoms, because it&#8217;s completely negligible. Both their mutual attraction and their tendency of flying apart due to the expansion of the universe are manifestation of exactly the same phenomenon:  objects try to follow geodesics, and other interactions make them deviate from these &#8220;straightest&#8221; paths in spacetime.</p>\n]]>", "author": "Gian Mario", "published": "2015-03-13 03:59:35+00:00", "title": "By: Gian Mario"}, {"content": "<![CDATA[<p>Scott, I&#8217;m really confused about the following two items that I understand to be true:</p>\n<p>1. The net entropy of the universe is ever increasing.</p>\n<p>2. Information can never be created or destroyed.</p>\n<p>If both are true, then it would seem to me that there can be no fundamental relationship between information and entropy &#8230; </p>\n<p>But, if true, that is completely counterintuitive to me. Isn&#8217;t the very essence of increasing entropy the increase of disorder and decrease of order? I have always (mis-)understood increasing entropy to be the dilution of information within an increasing sea of randomness. Obviously I&#8217;m missing it &#8230;</p>\n]]>", "author": "Darrell Burgan", "published": "2015-03-13 04:49:18+00:00", "title": "By: Darrell Burgan"}, {"content": "<![CDATA[<p>Darrell #38: Let&#8217;s consider the living room where I&#8217;m typing this.  Lily has been energetically making a mess here, dumping out boxes, picking things up and throwing them, even taking my and Dana&#8217;s work notebooks and ripping or hiding them&#8212;in general, <i>increasing the room&#8217;s entropy</i> in every way she can.  Even so, it remains beyond her power (for now) literally to <i>destroy the information</i> present in the room&#8212;for example, by setting our work notebooks on fire.  &#8220;All&#8221; she can do is scramble the information up and make it less easily accessible.  And actually, even if she <i>did</i> set our notebooks on fire, physics tells us that that would &#8220;merely&#8221; be a turbocharged version of what she&#8217;d already been doing: the information in the notebooks would still be present in the smoke and ash; it&#8217;s just that it would be much, <i>much</i> harder to access, so much so that no technology that we can realistically envision would do it.</p>\n<p>I hope this makes it clearer how the preservation of information can be consistent with increasing entropy.  (I could try to give you a more technical answer, but it would ultimately amount to the same thing as the above.)</p>\n]]>", "author": "Scott", "published": "2015-03-13 12:02:12+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>fred #35</p>\n<p>OK one last message.</p>\n<p>To clarify, the analogy in #36 and #37 is &#8220;incorrect&#8221; because the friction is 1st order and the gravitational force is 2nd order, so the gravitational force allows you to freely go around at constant speed, friction would not.<br />\nA part from that the analogy is pretty good.</p>\n<p>Also you are mixing special and general relativity. Special relativity is purely &#8220;local&#8221;, and it deals with reconciling the different measurements of observers that look at the dumbbell while moving at different speeds. But everything is happening at the SAME LOCATION of the dumbbell. &#8220;At the same location&#8221; here means a region small enough that the effect of the curvature of the spacetime (gravity) is negligible compared to the effects of other interactions.</p>\n]]>", "author": "Gian Mario Manca", "published": "2015-03-13 16:30:15+00:00", "title": "By: Gian Mario Manca"}, {"content": "<![CDATA[<p>Doesn&#8217;t the process of decoherence lower the entropy of a system?</p>\n]]>", "author": "Job", "published": "2015-03-14 01:49:53+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>Scott #39: okay then there really is no relationship between entropy and information. Information can be increasingly disordered forever, obscured, dispersed, or transformed into increasingly less useful forms, but never destroyed.</p>\n<p>That brings me to another question. The maximum amount of information that can physically fit into a cubic centimeter is a fixed quantity, right? Does that suggest a relationship between the expansion of space with entropy, given the information in any given cubic centimeter is forever being diluted by the expansion?</p>\n]]>", "author": "Darrell Burgan", "published": "2015-03-14 05:52:25+00:00", "title": "By: Darrell Burgan"}, {"content": "<![CDATA[<p>Job #41: Decoherence (being something that happens in the forward time direction) is an overall entropy-<i>increasing</i> process.  Yes, it could decrease the entropy of the specific system being decohered&#8212;for example, if that system was in a quantum mixed state&#8212;but the overall entropy of the system plus its environment always goes up, as the two get entangled with each other.</p>\n]]>", "author": "Scott", "published": "2015-03-14 10:59:31+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>(Off topic) I don&#8217;t know if you do guest posts, but I was thinking of writing something about how we never know as much as we think we do.  This is based on a discovery I made a couple years ago about my life that&#8217;s emerging in neuroscience.  Additionally, this relates to the question of whether we can consciously choose our actions or not.  </p>\n<p>Do you take guest posts, and does this fit in with the theme of your blog?</p>\n]]>", "author": "Yuval L.", "published": "2015-03-15 15:57:22+00:00", "title": "By: Yuval L."}, {"content": "<![CDATA[<p>Yuval #44: You can post it here as a &#8220;guest comment.&#8221;</p>\n]]>", "author": "Scott", "published": "2015-03-15 22:27:06+00:00", "title": "By: Scott"}]