[{"content": "<![CDATA[<p>Scott #38:  I think we&#8217;re in agreement about the trivial side-channel attack.  And I understand also that you&#8217;re waiting for quantum-attributable asymptotic speedup and that constant-factor speedups aren&#8217;t that interesting to you.  But those are two separate issues.</p>\n<p>My concern is that your post frames our work and the work of Mandrà et al. in a way that I think many readers, right or wrong, could go away thinking that D-Wave came out with a big claim and was promptly smacked down, which I think you&#8217;d agree is not at all what happened.  I&#8217;m talking specifically about the two paragraphs starting &#8220;So, when people asked me&#8230;&#8221; and &#8220;As it happened&#8230;.&#8221;</p>\n<p>If you really do believe that the Mandrà et al. note amounts to &#8220;reproducing the observed results classically&#8221;, then that&#8217;s something we&#8217;ll just have to disagree on.  Otherwise, I&#8217;d be very grateful if you&#8217;d consider clarifying this in your post.</p>\n<p>I for one was hoping to see an honest effort from the skeptics to match our performance on the embedded problems.  The HFS algorithm could be multithreaded, run on beefier CPUs, and tweaked beyond Selby&#8217;s implementation to get a speedup of maybe 10x to 30x.  Maybe bit-packing parallelism applied to cluster parallel tempering would make it competitive.  There might be more powerful GPU-based algorithms than SA and QMC.  For example, can cluster parallel tempering be implemented efficiently on GPUs in a way I haven&#8217;t realized?  Beyond that, if parallelism spreads across multiple processing units, there will be significant communication overhead. So can classical methods actually match our results on these simple and well-motivated synthetic inputs without just ignoring the point of the whole exercise and sneaking in the back door?</p>\n<p>This kind of work would actually move the science forward and I&#8217;m still hoping to see some from somebody.</p>\n<p>Helmut #39:  There are two issues with your approach.  The first is that you&#8217;re attacking the logical problems directly, and the second is that you&#8217;re using Barahona&#8217;s reduction to solve the logical problem exactly in polytime.</p>\n<p>If we wanted to prevent the second issue, it&#8217;s easy.  All we&#8217;d have to do is add fields to the logical problem.  The problem then becomes NP-complete [Barahona 1982].  You claim that your solver can also solve the Google problems in polytime but I don&#8217;t see how this can be correct, unless you&#8217;re using a custom reduction for those, because they have fields.</p>\n<p>The bigger issue is the first one, i.e., that you&#8217;re just attacking the logical problems directly.  This has nothing to do with the logical problems being NP-complete or not and would therefore not be affected by the suggestions in your paper.  We could only prevent it by attempting to &#8220;hide the back door&#8221; in the pointless arms race.  And to what end?  Imagine we softened certain clusters in a way that the logical problem could not be attacked directly and nobody could match our performance even with knowledge of the problem class.  All we would have is more highly-contrived synthetic instances that, in my opinion, are a less-valuable testbed than the one we started with.  This would also be an immense waste of time and we all have more important work we should be doing instead.  Playing whack-a-mole with synthetic inputs and tailored solvers does nothing to advance the science.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/King:Jamie.html\">Jamie King</a>", "published": "2017-03-18 22:38:14+00:00", "title": "By: Jamie King"}, {"content": "<![CDATA[<p>Jamie King #41: Again thanks for your constructive engagement.</p>\n<p>I would say that Helmut et al. <i>did</i> reproduce your results, but in such a way that you&#8217;ll almost certainly be able to evade what they did in the next volley&#8212;thereby forcing the skeptics back to the sorts of classical algorithms that are of greater interest to you.  I look forward to seeing that happen, and blogging about the next round.</p>\n<p>But I&#8217;d also add that I think <i>all</i> sides in this debate should be wary of shifting goalposts!  To take an example: I remember a couple years ago, when D-Wave managed to outperform simulated annealing on suitably-designed instances, but the HFS algorithm still beat it.  At that time, certain D-Wave fans explained to me at length why simulated annealing was <i>the</i> relevant comparison, and using the HFS algorithm was just cheating, since that algorithm was preprogrammed to know about the 8-bit clusters, and how they should all be flipped at once.</p>\n<p>But now that you have instances where D-Wave outperforms HFS (at least by some constant factor&#8212;asymptotically is a different question), now we learn that HFS is the key benchmark, the gold standard of classical algorithms against which D-Wave should always have been compared. 🙂</p>\n<p>Of course, none of us want to be the person who (as Stephen Colbert put it) &#8220;believes the exact same thing on Wednesday that they did on Monday, regardless of what happened on Tuesday.&#8221;  E.g., I no longer criticize D-Wave for not having demonstrated quantum tunneling behavior, not subjecting its claims to scrutiny by outside experts, or making absurd statements about quantum computing as a whole, because in all three respects, things really improved substantially in the last decade (which is awesome!).</p>\n<p>But I do think I&#8217;ve been consistent this whole time about what counts as &#8220;success&#8221; for me&#8212;and that&#8217;s a big, unambiguous speedup by a quantum computer compared to all known conventional methods for some task, together with a convincing argument that that speedup arose <b>by virtue of the quantum computer&#8217;s being a quantum computer,</b> and not by virtue of incidental, non-quantum properties that we could reproduce with FPGAs or whatever.  I think such an achievement will be a sufficiently historic milestone for our field, and for science more broadly, that it&#8217;s worth being crystal-clear about it, accepting no substitutes, and trying to keep the press, funding bodies, etc. from crying wolf before we&#8217;re actually there.  I wouldn&#8217;t want to hold D-Wave to any lesser standard. 🙂</p>\n]]>", "author": "Scott", "published": "2017-03-19 04:15:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #42: While I agree with the last paragraph of your comment, I think that D-Wave should actually aim for a different standard; namely, they should demonstrate that solving some type of problem with their devices is <b>cheaper</b> than solving the same problem with ordinary computers. If they can&#8217;t do that, then they&#8217;ll have no hope of widespread commercial adoption of their hardware (which, after all, should be their ultimate goal). Of course this is not in any way specific to D-Wave; if any kind of quantum computer is to be more than just an academic exercise, its operating cost is at least as important as its speed. However, as far as I&#8217;m aware, only D-Wave can actually measure things like the power consumption of their device and get meaningful results.</p>\n]]>", "author": "Aula", "published": "2017-03-19 16:40:49+00:00", "title": "By: Aula"}, {"content": "<![CDATA[<p>Is it possible that Volkswagen has made a deal with D-wave because they want a very fast special-purpose hardware for some computational problem, whether quantum speedups are involved or not?  If they have a real world problem to solve, then they might not care about where the speedups come from.</p>\n<p>Scott: Zach says at <a href=\"http://www.smbc-comics.com/comic/soonish\" rel=\"nofollow\">http://www.smbc-comics.com/comic/soonish</a> that you have written back cover blurb for his new book (which will be released in 2017-10). The actual quote seems somewhat out of character for you, but Zach promises that only one of you were coerced (I believe that means he didn&#8217;t threaten you with torturing a thousand copies of you).  Can you expand on this or anything else about his book?</p>\n]]>", "author": "jonas", "published": "2017-03-19 23:16:54+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>jonas #44: I&#8217;d also find it astonishing if a piece of non-quantum special-purpose annealing hardware were to outperform conventional computers in a fair comparison, not for finding low-energy states for the hardware&#8217;s own connection topology, but for &#8220;real-world&#8221; problems that needed to be embedded into the hardware with considerable losses.  Not saying it&#8217;s impossible, but one should also consider the Occam&#8217;s Razor possibility (quantum traffic optimization sounds cool, Volkswagen is happy, D-Wave is happy, the press is happy, only ones not happy are some pointy-headed academics, what&#8217;s the problem? 🙂 ).</p>\n<p>Yes, I did read an advance copy of Soonish and I did think it was amazing (though what appeared as my jacket blurb was a small truncation of a larger thing I wrote).  I consider Zach and Kelly personal friends at this point, so you should take my recommendation with a large grain of salt, but having said that, yes, you should totally read their book!</p>\n]]>", "author": "Scott", "published": "2017-03-20 01:50:16+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>(I wonder if Scott will reply to this since its posted after another post has already gone up.)</p>\n<p>I can understand why journalists would hype D-wave works!</p>\n<p>I can understand why people at D-wave would hype D-wave works!</p>\n<p>But VW and other companies that have bought a D-wave machine with real money- why are they doing it? Don&#8217;t they have their own scientists look at D-wave honestly and advise them not to?</p>\n<p>I realize this question might not be in your domain but you know folks who know folks- so a pointer to an article or person who might know, in essense, WHY DO PEOPLE WITH ACTUAL MONEY TO LOSE INVEST IN D-WAVE, please point me to them.</p>\n]]>", "author": "GASARCH", "published": "2017-03-20 04:19:25+00:00", "title": "By: GASARCH"}, {"content": "<![CDATA[<p>@GASARCH I guess its because for giant companies like VW, LM, etc the money invested on a D-WAVE machine is probably less than peanuts and it might have some impact on their public image (VW desperately needs ANY kind of positive news&#8230;but I doubt it will help)</p>\n]]>", "author": "GS", "published": "2017-03-20 11:15:34+00:00", "title": "By: GS"}, {"content": "<![CDATA[<p>Please let me second GASARCH&#8217;s request.  </p>\n<p>Sufficiently many, sufficiently broad-ranging answers to his question are possible, that an wonderfully provocative <i>Shtetl Optimized</i> essay could be devoted to it.</p>\n<p>It was Tom Paine who said:</p>\n<blockquote><p>I scarcely ever quote; the reason is, I always think.</p></blockquote>\n<p>Today&#8217;s quantum researchers have it easier than Tom Paine, in that a Paine-style &#8220;age of revolution&#8221; has arrived for quantum research, and fortunately the ArXiv server, Google, and the quantum blog-o-sphere are together supplying us with quotes in sufficient abundance, as to richly and diversely answer GASARCH&#8217;s excellent question.&nbsp;🙂</p>\n<p>&#8212;<br />\n<b>PS</b>  The Paine quote is from Chapter 1, footnote 18 of Bernard Vincent&#8217;s <i>The Transatlantic Republican: Thomas Paine and the Age of Revolution</i> (2005)&nbsp;&hellip; a work that conveys plenty of lessons (as&nbsp;I read it anyway) for quantum researchers.</p>\n]]>", "author": "John Sidles", "published": "2017-03-20 12:53:31+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>[&#8230;] el resumen de la situaci&oacute;n actual de Scott Aaronson, &ldquo;Insert D-Wave Post Here,&rdquo; Shtetl-Optimized, 16 Mar 2017; por ello en esta entrada te resumo su resumen y te recomiendo consultar el original para [&#8230;]</p>\n]]>", "author": "El duro camino de D-Wave hacia la supremaca | Ciencia | La Ciencia de la Mula Francis", "published": "2017-03-20 13:04:51+00:00", "title": "By: El duro camino de D-Wave hacia la supremacía | Ciencia | La Ciencia de la Mula Francis"}, {"content": "<![CDATA[<p>John Sidles #48: I agree with the answer of GS #47.  I would add that for a large organization, just getting experience in playing around with a primitive QC&#8212;even if it&#8217;s not actually faster for anything&#8212;could easily be justified as worth the $15 million price tag.  (And while I don&#8217;t have confirmation for this, I&#8217;ve been told that, the way supercomputer sales work, the buyer pays much much less than the sticker price anyway.)</p>\n]]>", "author": "Scott", "published": "2017-03-20 14:26:29+00:00", "title": "By: Scott"}]