[{"content": "<![CDATA[<p>Scott as a young boy sits on a sofa with his  mother in an old-fashioned, cluttered doctor&#8217;s office.  The doctor stands near the sofa, holding a cigarette and listening.</p>\n<p>\t\t\t\tMOTHER (To the doctor)<br />\n\t\t&#8220;He&#8217;s been depressed.  All off a sudden, he can&#8217;t do anything.&#8221;</p>\n<p>\t\t\t\tDOCTOR (Nodding)<br />\n&#8220;Why are you depressed, Scott?&#8221;</p>\n<p>\t\t\t\tMOTHER (Nudging Scott)</p>\n<p>\t\t&#8220;Tell Dr. Flicker.&#8221; (Young Scott sits, his head down. His mother answers for him)<br />\n\t\t&#8220;It&#8217;s something he read.&#8221;</p>\n<p>\t\t\t\tDOCTOR (Puffing on his cigarette and nodding)<br />\n\t\t&#8220;Something he read, huh?&#8221;  </p>\n<p>\t\t\t\tSCOTT (His head still down)<br />\n\t\t&#8220;The universe is expanding.&#8221;</p>\n<p>\t\t\t\tDOCTOR<br />\n\t\t&#8220;The universe is expanding?&#8221;</p>\n<p>\t\t\t\tSCOTT (Looking up at the doctor)<br />\n\t\t&#8220;Well, the universe is everything, and if it&#8217;s expanding, someday it will break apart and that would be the end of everything!&#8221;</p>\n<p>Disgusted, his mother looks at him.</p>\n<p>\t\t\t\tMOTHER (shouting)<br />\n\t\t&#8220;What is that your business? &#8221;<br />\n\t\t\t(she turns back to the doctor)<br />\n\t\t&#8220;He stopped doing his homework!&#8221;</p>\n<p>\t\t\t\tSCOTT<br />\n\t\t&#8220;What&#8217;s the point?&#8221;</p>\n<p>\t\t\t\tMOTHER (Excited, gesturing with her hands)<br />\n\t\t&#8220;What has the universe got to do with it?  You&#8217;re here in Brooklyn!  Brooklyn is not expanding!&#8221;</p>\n<p>\t\t\t\tDOCTOR (Heartily, looking down at Scott)<br />\n\t\t&#8220;It won&#8217;t be expanding for billions of years yet, Scott.<br />\n\t\tAnd we&#8217;ve gotta try to enjoy ourselves while we&#8217;re here.  Uh?&#8221; (laughs)</p>\n<p>SCOTT (quiet, shakes his head)</p>\n]]>", "author": "fred", "published": "2014-06-18 20:25:27+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Aaron Sheldon #7 (yeah, a bit late <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />  )</p>\n<p>The causal contact loophole has been removed by ingenious experiments whereby the experimental apparatus is randomly switched while photons are inflight from the emitters and spacelike separated from the detectors.</p>\n<p>On Obama&#8217;s speech, a weak point is where he asks if you would rather listen to 97 scientists or just 3 &#8211; er, well I&#8217;d like to know about their backgrounds before deciding &#8211; science isn&#8217;t done by a popularity vote. I&#8217;m sure you also had about 97/100 doctors suggesting blood-letting during the great plague too. And any fool knows Obama wouldn&#8217;t be able to give such a speech if shale gas reserves hadn&#8217;t been discovered. If they spent as much on theoretical and experimental physics research as the Kennedy inspired space program (or just the Iraq war) we&#8217;d almost certainly have quantum computers (if they are allowed by nature) and have advanced particle physics to a point where real-world engineering benefits in energy sources and materials would enable mankind to cope with adverse climate change, random or otherwise. </p>\n<p>I mean, assuming quantum computing is scalable ( <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />  ) &#8211; once we get the almost <i>exact</i> model of microscopic particles &#8211; we could probably discover how to do economically beneficial fusion with QC simulations</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2014-06-18 22:01:54+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>James #50: The argument &#8220;who cares if 97/100 doctors recommend a particular treatment?  the same number probably would&#8217;ve recommended bloodletting during a great plague&#8221; is analogous to the following:</p>\n<p>I&#8217;m trying to sell you a few acres of land, far from any city center.  My asking price is a billion dollars.  You object, &#8220;that&#8217;s a completely ridiculous price!  no nearby piece of land is selling for anything like that!  <i>no one else</i> thinks it&#8217;s worth as much!&#8221;</p>\n<p>You confidently reply, &#8220;Yeah, well, that&#8217;s what everyone said about Manhattan Island in the early 1600s.  But <i>everyone was wrong</i>.  The land in Manhattan really <i>was</i> worth an astronomical amount.&#8221;</p>\n<p>The fallacy should be clear: when making your case, you don&#8217;t get to &#8220;shift the market price by an act of imagination&#8221;&#8212;asserting that, since it&#8217;s <i>possible</i> that the consensus will change in the future, you therefore get to act as if the consensus were whatever you&#8217;d like it to be right now.  At best, you can invest the hard work to try to <i>change</i> the consensus, by convincing everyone else of the value of your property, the efficacy of your cure, or the unreality of human-caused climate change.</p>\n]]>", "author": "Scott", "published": "2014-06-19 01:42:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>If you are in a state of sin for considering arithmetical methods of generating random digits then are you actively evil if you  use QM to exponentially expand randomness? Have they opened a demonic portal?</p>\n<p>John von Neumann save us.</p>\n]]>", "author": "ppnl", "published": "2014-06-19 02:41:25+00:00", "title": "By: ppnl"}, {"content": "<![CDATA[<p>Scott#48:<br />\nThank you. I DO NOT have a strong mind as yours. I try to be rational and am highly educated in US but since I am from third world I have my insecurities. My father saw my astrology when I was a child and this has locked my mind for 20 years now and his words have influenced me. He is predicting scary things now. What would you advice me? Can I break free? Or am I doomed to the prophecies?</p>\n]]>", "author": "J", "published": "2014-06-19 03:43:33+00:00", "title": "By: J"}, {"content": "<![CDATA[<p>more like 30 years.</p>\n]]>", "author": "J", "published": "2014-06-19 03:48:29+00:00", "title": "By: J"}, {"content": "<![CDATA[<p>Alice and Bob stay in a black box, and there is a random string that is obtained from the black box, and Charlie observe the transparent black box (a sphere of photomultipliers); if the measures of Charlie permit to increase the correlation between Alice and Bob of an infinitesimal quantity, then it is possible to correct all the quantum noise (if there is a Bell&#8217;s theorem correction for an infinitesimal, then&#8230;). If this is true, then it is impossible to obtain a true random generator in the physical world, because there are ever a physical laws that describe a system (it could be like a Godel&#8217;s incompleteness theorem).</p>\n]]>", "author": "domenico", "published": "2014-06-19 06:30:03+00:00", "title": "By: domenico"}, {"content": "<![CDATA[<p>Once you&#8217;ve got randomness expansion & laundering, it seems to me that the obvious extension is to seed it with only one bit.</p>\n<p>In the same way that sigma-delta ADCs are more comprehensible using multi-bit DACs, but they&#8217;re most powerful when you take the generalized theorem and extrapolate it to down the 1-bit case.</p>\n]]>", "author": "Patrick", "published": "2014-06-19 18:35:07+00:00", "title": "By: Patrick"}, {"content": "<![CDATA[<p>Dear Scott, I am a long-time reader of your blog, but this is the first time that I am leaving a comment.</p>\n<p>I came across this article today: <a href=\"http://rjlipton.wordpress.com/2013/04/27/sex-lies-and-quantum-computers/\" rel=\"nofollow\">http://rjlipton.wordpress.com/2013/04/27/sex-lies-and-quantum-computers/</a>. I am wondering if you have read it; and if you have, what you think about it. I understand that you are a busy man and might not have time to write a response to it, but I am sure that many of your readers (including me) would be very grateful if you do.</p>\n<p>I became interested in quantum computing because of you; but, alas, my understanding of it still remains at the level of a layman&#8217;s. Therefore, I do not have the expertise needed to evaluate Mr Lipton&#8217;s essay. Since I consider you to be a trustworthy expert, it would be wonderful if you would take the time to share your thoughts about it &#8212; even if just briefly.</p>\n<p>Keep up the fantastic writing &#8212; your blog never fails to edify and entertain me. </p>\n<p>Warmest regards,<br />\nM.</p>\n]]>", "author": "M.", "published": "2014-06-20 07:40:29+00:00", "title": "By: M."}, {"content": "<![CDATA[<p>M. #57: Lipton is <b>totally mistaken</b> that, in the quantum black-box model, the quantum machine gets to see the individual wires and gates (and therefore the comparison to classical is unfair).  The only assumption made is that you get to query the black box in superposition, and the comparison is <i>completely</i> fair.  I see that a commenter on his blog already pointed this out.</p>\n<p>Apart from that mistake, everything he says looks correct&#8212;and not only that, but <i>I&#8217;ve been making many of the same points over and over on this blog!</i>  (Look at the tagline below the masthead.)  But, as often the case, the way he says it annoys me greatly.  He writes:</p>\n<ul>Thus from a mathematical view point it is clear that there is no proof that quantum is better than classical. None. Zero.</ul>\n<p>As Aram Harrow pointed out in the comments, this is true but almost comically beside the point.  One could equally well say: &#8220;From a mathematical viewpoint there is no proof that NEXP doesn&#8217;t have log-depth circuits.  None.  Zero.  So maybe all cryptographers have been wasting their time for the past 50 years.&#8221;</p>\n<p>To his credit, Lipton is at least consistent: he <i>actually believes</i> that maybe P=NP=PSPACE, which helps to put his belief that maybe P=BQP in context.  But it&#8217;s important for other people to understand that this is like a physicist telling everyone:</p>\n<p>&#8220;Hey, the maybe the conservation of energy will be discovered to be violated tomorrow!  Maybe relativity and quantum mechanics will be overturned!  Maybe 20-legged cows will descend on us from space!  After all, there&#8217;s no mathematical proof that any of these things won&#8217;t happen!  See how <i>open-minded</i> I am?&#8221;</p>\n<p>Again and again, Lipton seems to me to conflate the fact that <i>no one can disprove</i> something, with there being any positive reason to take the thing seriously.  The hardness of simulating quantum mechanics on a classical computer hasn&#8217;t been proved&#8212;<i>anyone who knows anything knows that</i>&#8212;but it&#8217;s a statement that&#8217;s withstood decades of attempts to falsify it (indeed, from long before the statement was precisely formulated), to the extent that it would be accepted as a &#8220;law&#8221; in any empirical science.</p>\n]]>", "author": "Scott", "published": "2014-06-20 15:05:45+00:00", "title": "By: Scott"}]