[{"content": "<![CDATA[<p>I may have an answer for your skype question: if your account is attached to an msn account (for example mine is my old hotmail account) they now require you to use the password for your msn account to log in to skype. Another example of msn adding value for skype users 🙂</p>\n]]>", "author": "Chris", "published": "2017-03-20 11:14:56+00:00", "title": "By: Chris"}, {"content": "<![CDATA[<p>My &#8220;password manager&#8221; is a text file where I simply write down the username/password combinations for the websites that do not matter. It contains 63 logins and counting. </p>\n<p>For the very few websites that do matter I can just memorize the login.</p>\n]]>", "author": "Mateus Arajo", "published": "2017-03-20 11:49:49+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Prof. Aaronson: &#8220;I have discovered a truly marvelous proof of P!=NP, which I haven&#8217;t been able to upload because my password manager is down. LOLZ!&#8221;</p>\n]]>", "author": "fred", "published": "2017-03-20 12:35:48+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>scott:<br />\nyou might want to reconsider your decision not to use the pediatrician near you. the doctor may not be responsible, or even aware, of the way you were treated by his staff. as a disabled person who spends a lot of time in medical facilities, i have encountered two types of nurses: those who view their job as one of helping the patient, and those who view their job as one of &#8216;protecting&#8217; the doctor from the patient. if you talk to the doctor about your experience with his staff, he might well talk to his staff about how they should do their job properly. my own criterion for boycotting physicians is that i refuse to talk to doctors who have spent no more than a minute or two reviewing my case as presented in a thin folder which is placed on the wall outside of the examination room, before entering to see me. since my entire medical files are now over 6 feet high due to the complicated medical history i have for my rare disease, no physician can possibly do an adequate examination or treatment based on a cursory glance at my records before seeing me.<br />\nrichard</p>\n]]>", "author": "Richard Gaylord", "published": "2017-03-20 14:31:23+00:00", "title": "By: Richard Gaylord"}, {"content": "<![CDATA[<p>&#8220;In related news, I will no longer patronize any haircut place that turns away walk-in customers.&#8221;<br />\nThis is great. They are too fancy 🙂</p>\n]]>", "author": "ks", "published": "2017-03-21 01:12:01+00:00", "title": "By: ks"}, {"content": "<![CDATA[<p>I hate logons that add no value.<br />\nI hate submitting my email (spam).<br />\nI hate ads with sound or animation.<br />\nI hate popups.<br />\nI don&#8217;t care that the privacy or cookie or whatever has changed.<br />\nI would rather close a site than turn off an ad blocker.<br />\nI am tired of sites that don&#8217;t put the content on one page &#8211; click for next may cause me to click to close.<br />\nI am tired of being trolled.</p>\n]]>", "author": "Grunkle", "published": "2017-03-21 07:19:42+00:00", "title": "By: Grunkle"}, {"content": "<![CDATA[<p>#61: GASARCH<br />\nYOU HAVE TO LOG IN TO LEAVE COMMENTS ON your BLOG.</p>\n]]>", "author": "aram", "published": "2017-03-21 19:12:38+00:00", "title": "By: aram"}, {"content": "<![CDATA[<p>Dear Scott,</p>\n<p>I&#8217;ve recently watched the Arrival movie, and it strongly reminded me of you <a href=\"http://www.scottaaronson.com/papers/ctchalt.pdf\" rel=\"nofollow\">paper</a> (spoiler alert!). In another <a href=\"http://arxiv.org/abs/quant-ph/0502072\" rel=\"nofollow\">essay</a> you explore limits to computation in the physical world. I wonder, have you ever considered the reversal of relations between available computational power and physical laws? </p>\n<p>More specifically, how access to powerful oracle would change the limits of what could be done in a physical world?</p>\n<p>When I think about it, the clue that there is some real-world power behind computational complexity comes from black holes firewall paradox. If I understand it correctly, the answer to what is just above event horizon depends on whether we&#8217;ve performed some immensely complex computations on the outgoing Hawking radiation. So if by any chance one gets an access to oracle for corresponding computational class, it would be possible to toggle firewall on and off.</p>\n<p>I&#8217;m also thinking about NP problems, which have resemblance to the problems of finding the specific low entropy state of a physical system. The whole process looks very much like reversing the second law of thermodynamics to me. But my knowledge of the field is insufficient to go anywhere beyond handwaving arguments.</p>\n<p>And finally, there is quantum mechanics, which allows to win certain games with probability higher than it&#8217;s possible in a purely classical world, although I&#8217;m not sure if this has anything to do with BQP != BPP.</p>\n<p>So, I wonder if you have have some thoughts about this? If anything, I guess explaining faster-than-light travel by access to oracle would give superhuman aliens more credibility 🙂</p>\n<p>P.S. I&#8217;m sorry for off topic and possible misinterpretation of your post as a permission to ask various  P!=NP related questions in comments to this blog.</p>\n]]>", "author": "Oleg S.", "published": "2017-03-21 19:25:39+00:00", "title": "By: Oleg S."}, {"content": "<![CDATA[<p>Let me interrupt the gloom with some good news. </p>\n<p>You know those nagging events when you CANNOT find the LaTeX command for some symbol you want to use? Or are not sure this is the best one? This site </p>\n<p><a href=\"http://detexify.kirelabs.org/classify.html\" rel=\"nofollow\">http://detexify.kirelabs.org/classify.html</a></p>\n<p>lets you draw (with the mouse) something in a box, and lists all the best matches in a wide variety of LaTeX packages. </p>\n<p>This site is also good for when politics or haircuts have got you down, and you need some entertainment, you can make up new math symbols and see what is out there that looks kind of like it.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-03-22 02:54:46+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<blockquote><p>as long as the world gives me any choice in the matter, I will never again struggle to log in to any organization’s website. </p></blockquote>\n<p>Reminds me of the story in <em>Surely You&#8217;re Joking Dr. Feynman</em> where he agreed to give a talk at a college as long as he didn&#8217;t have to sign his name more than 10 times. Turned out it would have taken an 11th signature to confirm receipt of the honorarium check. Hilarity ensues. Anbody who has ever enjoyed anything on this blog would enjoy that book.</p>\n]]>", "author": "RubeRad", "published": "2017-03-22 03:29:51+00:00", "title": "By: RubeRad"}, {"content": "<![CDATA[<p>To expand on that a bit: he then said &#8220;fine, I already gave the talk, so you should be happy; just don&#8217;t pay me&#8221;.  Except!  This is a pretty massive bureaucracy we&#8217;re talking about.  &#8220;We CAN&#8217;T not pay you, we already allocated the funds!&#8221;.</p>\n]]>", "author": "Marvy", "published": "2017-03-22 09:47:12+00:00", "title": "By: Marvy"}, {"content": "<![CDATA[<p>Also: the limit was 13, not 10.</p>\n]]>", "author": "Marvy", "published": "2017-03-22 09:58:14+00:00", "title": "By: Marvy"}]