[{"content": "<![CDATA[<p>Half-way serious question: Would you take something like Roielle&#8217;s claim seriously if he suggested proving that P != PSPACE? What about P ! = Almost-PSPACE? Or what about P != PSPACE^X where X is some oracle that plausibly sits outside PSPACE (like say X accepts a triplet of numbers (m,n,b) if Ackermann(m,n)+b has an even number of distinct prime factors)?  Any one of these looks difficult but not as difficult as P != NP. </p>\n<p>Also, note that if you get two yellow monopoly bills you are still gettting ripped off since yellows are $10s. $100s are beige I think (and Wikipedia agrees with me <a href=\"http://en.wikipedia.org/wiki/Monopoly_money\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Monopoly_money</a> ).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/z/Zelinsky:Joshua.html\">Joshua Zelinsky</a>", "published": "2014-02-11 22:53:45+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Scott #135 (snidely?) remarks that it &#8220;goes without saying&#8221; that I said nothing about Deolalikar &#8220;while the affair was in progress&#8221;.  It also goes without saying that the reason is that I don&#8217;t run a complexity theory blog and hence don&#8217;t publicly comment on most results or claimed results in complexity theory.</p>\n]]>", "author": "matt", "published": "2014-02-11 23:16:52+00:00", "title": "By: matt"}, {"content": "<![CDATA[<p>Matt #181, you could  have easily commented on Scott&#8217;s blog entries at the time or many other locations that Deolalikar&#8217;s work was being discussed.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/z/Zelinsky:Joshua.html\">Joshua Zelinsky</a>", "published": "2014-02-12 00:28:51+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>matt #181: Look, I completely understand if you didn&#8217;t want to be one of the many people commenting on my or Dick Lipton&#8217;s or Timothy Gowers&#8217;s blogs during the Deolalaffair.  What I found funny was simply that you <i>did</i> come to my comments section after it was over, to criticize me for <b>not having come down hard enough on Deolalikar&#8217;s paper</b>&#8212;what with my no-strings-attached $200K offer if the proof turned out to be right.  Given that I was still (figuratively) covered with bruises and stitches, from the online beating dozens of enraged readers gave me over my arrogant, elitist bet against the proof of the century, I hope you&#8217;ll forgive me if I still remember <i>your</i> criticism as one of the defining comic moments in the history of this blog&#8230; (so thanks!)</p>\n]]>", "author": "Scott", "published": "2014-02-12 00:36:32+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Joshua: I could have, but I didn&#8217;t.  Just like I didn&#8217;t comment on the lowering of the matrix multiplication exponent, or on conjoined trees oracle separations, or unentangled multiple provers, or any of a number of similar results.</p>\n]]>", "author": "matt", "published": "2014-02-12 00:38:52+00:00", "title": "By: matt"}, {"content": "<![CDATA[<p>Scott: if you want, you can regard my criticism of you as a form of moral support, saying to all those &#8220;enraged readers&#8221; that some people think you didn&#8217;t go far enough. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "matt", "published": "2014-02-12 00:41:07+00:00", "title": "By: matt"}, {"content": "<![CDATA[<p>Joshua #180: Thanks for the clarification about monopoly money!</p>\n<p>In our current state of knowledge, I&#8217;d be just as incredulous about a P&ne;PSPACE proof as I&#8217;d be about a P&ne;NP proof.  I don&#8217;t know about your other questions, though&#8212;I&#8217;d have to think about them more.</p>\n]]>", "author": "Scott", "published": "2014-02-12 00:41:14+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>matt #185: Thanks, then!  Your moral support is eagerly welcomed. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Scott", "published": "2014-02-12 00:43:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I thought Scott&#8217;s response to Deolalikar’s paper was about right. </p>\n<p>At the time, my guess was that the chances of the claim turning out to be correct were about E-6. And thus, once the press and online yahoos realized it was dross, they would pummel Deolalikar plenty. There is no need to pile on.</p>\n<p>The same thing is likely to happen if (or, when) D-Wave&#8217;s machines turn out to be chazere; Time Magazine, etc., will be on them like binary on an ALU. This is why Scott worries that the entire QC field will garner some disrepute.</p>\n<p>I estimate the likelihood of the D-Wave living up to its billing as about E-2, much better than the likelihood of the Deolalikar paper flying.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-02-12 06:21:33+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Dear Seung Woo, many thanks for your good comment (#137). Certainly what you wrote and also a lovely email exchange yesterday with Daniel Lidar helped me understand some of the technical and conceptual issues. I think we can consider five questions about DWave system or any other:</p>\n<p>1) Is the system genually quantum</p>\n<p>2) Does the system demonstrate large scale/ long range entanglement</p>\n<p>3) Is the system classically simulable</p>\n<p>4) Does the system involve quantum error correction/fault tolerance</p>\n<p>5) Does the system demonstrate computational speed up</p>\n<p>All of these five points are somewhat vague and we can try to make them clearer.</p>\n<p>The way I see it:</p>\n<p>1) As you mentioned question 1 is  vague but  I don&#8217;t see a good reason not to regard DWave machines as genuinely quantum.</p>\n<p>2) I dont see any evidence or claim for a long-range/large scale  entanglement of the kind needed for quantum computing. Daniel claims  <b> nothing </b> about entanglement beyond the 8 qubits entanglement that they report in some other paper. (Of course, this should also be checked critically). It is neither clear to me why Umesh regards Bixio et als as a serious evidence for large-scale (=?long-range) entanglement nor why Umesh claims that this have now been refuted by your paper.</p>\n<p>3) For me not having the possibility of quantum speed up is a very strong reason to think that what the system does is classically simulable<del>.</del> I don&#8217;t see the great difference in this respect between the quantum evolutions Bixio et als consider (and classically simulate) and the ones consider by  you guys. (But maybe I miss something here.)</p>\n<p>4) and 5). Both Daniel Lidar and I agree that DWave machines cannot lead to speed up without fault tolerance. (Daniel is working in this direction; my opinion is that quantum fault tolerance is always necessary for speed up.)</p>\n<p>I must admit, Seung Woo, that when you get into it the specifics, this  debate on statistical tests for quantumness of D-wave machines is more interesting than I initially thought, but overall the statistical claims and tests do not look so convincing.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2014-02-12 06:32:49+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Mike/Rahul #177/178 Thanks for your entrepreneurial inspiration! Will take your advise under consideration <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "quax", "published": "2014-02-12 06:51:10+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>@Roielle Hugh: I&#8217;m betting $200 that Lilly Aaronson solves P vs. NP before you do.  Are we on?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hird:William.html\">William Hird</a>", "published": "2014-02-12 07:35:25+00:00", "title": "By: William Hird"}, {"content": "<![CDATA[<p>@Roielle Hugh: I’m betting $200 that Miley Cyrus solves P vs. NP before you do. Are we on?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-02-12 14:32:27+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Gil #189: Dear Gil,</p>\n<p>Re 2), you may have misunderstood what Daniel Lidar said to you. Here are specific quotes from the <a href=\"http://arxiv.org/pdf/1304.4595v2.pdf\" rel=\"nofollow\">Boixo et al. paper</a>. They begin the paper by asking the following question in the introduction,</p>\n<blockquote><p>In this work we report on computer simulations and experimental tests on a D-Wave One device in order to address central open questions about quantum annealers: is the device actually a quantum annealer, i.e. do the quantum effects observed on 8 and 16 qubits persist when scaling problems up to more than 100 qubits, or do short coherence times turn the device into a classical, thermal annealer?</p></blockquote>\n<p>and end the paper with the following conclusion:</p>\n<blockquote><p>Our experiments have demonstrated that quantum annealing with more than one hundred qubits takes place in the D-Wave One device, despite limited qubit coherence times.</p></blockquote>\n<p>It is quite clear that they are claiming the existence of large scale quantum effects in D-Wave One.</p>\n<p>I very recently learned from personal communications with Daniel Lidar that following our results they withdrew these claims in the final version of their paper, which is currently in press. However, in 2) you are making it sound like they never made such a claim and we refuted a claim that never existed. I hope you can see that you were misinformed.</p>\n<p>One aspect of our paper that has not been discussed here is that it leads to insights into the nature of the native problem of the D-Wave machine. Our results indicate that in the native problem the 8-qubit clusters tend to act like supernodes, and in a sense the effective problem size is the number of clusters, which is 16. This means that the 108-qubit native problem is relatively easy. As the number of qubits is scaled up to 512 and beyond (while leaving the cluster sizes at 8), the effective problem size will increase to 64 and beyond, and that is when we would expect the exponential search space to kick in, and our algorithm and the D-Wave machine to both perform poorly. Indeed, Matthias Troyer told us that the machine struggles to find the solution when the problem size scales up to 512 qubits.</p>\n<p>Scott, actually Gil’s mention of the small scale entanglement results by Daniel Lidar’s group makes me curious how closely you have examined these results. I saw you say in #54 that you think D-Wave probably exhibits small scale quantum entanglement. Do you understand the precise nature of the evidence that they provide?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Shin:Seung_Woo.html\">Seung Woo Shin</a>", "published": "2014-02-13 00:05:52+00:00", "title": "By: Seung Woo Shin"}]