[{"content": "<![CDATA[<p>Cedric #34: Thanks! You&#8217;re right.</p>\n]]>", "author": "Ashley", "published": "2014-05-16 20:12:41+00:00", "title": "By: Ashley"}, {"content": "<![CDATA[<p>I&#8217;m afraid I&#8217;m late to the party, but I&#8217;d like to suggest my favourite annoying question: is the entangled value of a nonlocal game \\(\\omega^*(G)\\) computable?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arajo:Mateus.html\">Mateus Arajo</a>", "published": "2014-05-19 15:23:22+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Mateus #38: Isn&#8217;t that basically equivalent to the problem of upper-bounding QMIP (i.e., problem 1 on my list)?</p>\n]]>", "author": "Scott", "published": "2014-05-19 16:09:42+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #39: I was not aware of this connection. Can you enlighten me?</p>\n<p>My impression is that upper bounds on \\(\\omega^*(G)\\) lead to lower bounds on MIP\\(^*\\), whereas upper bounds on the amount of entanglement that you need to perform the optimal strategy in a nonlocal game lead to upper bounds on MIP\\(^*\\). But I don&#8217;t know how to relate \\(\\omega^*(G)\\) to upper bounds on MIP\\(^*\\).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arajo:Mateus.html\">Mateus Arajo</a>", "published": "2014-05-19 22:24:45+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Annoying problem #8&#8242;:<br />\nFigure out a good way to express what it means for a set of gates to be not universal.</p>\n]]>", "author": "aram", "published": "2014-05-20 02:14:03+00:00", "title": "By: aram"}, {"content": "<![CDATA[<p>Mateus #40: I was simply thinking that, if you had an algorithm to compute &omega;*(G), then you could express an MIP* protocol as a 2-prover game and thereby get a computable upper bound on MIP*.  And aonversely, if you had a computable upper bound on MIP*, then given a 2-prover game G, then you could define a language L such that, for some input x, whether x&in;L depended on whether &omega;*(G) was &ge;2/3 or &le;1/3.  Then deciding whether x&in;L would at least give you a nontrivial approximation to &omega;*(G).  It&#8217;s entirely possible that I&#8217;m missing something, but if so, could you tell me what?</p>\n]]>", "author": "Scott", "published": "2014-05-20 14:27:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #42: Yet again you baffle me. Perhaps I should clarify that my background is in physics and I know these results about MIP* only from hearsay. But I care a lot about this problem, as the computability of ω*(G) is hot topic in the nonlocality community now (or, more specifically, the quality of a particular upper bound on ω*(G)).</p>\n<p>So why the computability of ω*(G) implies that one can reduce the number of provers to 2? And are good upper bounds known for MIP*(2,1)?</p>\n<p>I&#8217;d be glad if you could explain or point me to a reference.</p>\n<p>In addition, do you wish to risk a guess on the computability of ω*(G)? At least from my side (and I believe most physicists agree with me) it&#8217;s clear that it&#8217;s not computable.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arajo:Mateus.html\">Mateus Arajo</a>", "published": "2014-05-20 15:30:24+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Mateus: Sorry, I wasn&#8217;t even thinking about more than 2 provers or more than 1 round.  Let&#8217;s just <i>define</i> MIP* to mean MIP*(2,1)&#8212;in any case, we still don&#8217;t have a computable upper bound even in that case.  Do you still see any difference between the problem of upper-bounding MIP*(2,1) and the problem of giving an algorithm to approximate &omega;*(G), for a 2-prover game G?</p>\n<p>FWIW, my guess is that it might well be undecidable whether &omega;*(G)=1&#8212;I&#8217;m not sure&#8212;but that, in any case, there ought to be an algorithm to <i>approximate</i> &omega;*(G), since you ought to be able to get within &epsilon; of the optimal value &omega;*(G) using an amount of entanglement that scales reasonably with the size of G.</p>\n]]>", "author": "Scott", "published": "2014-05-20 15:53:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Ah! That&#8217;s good to know. I never understood why computer scientists cared about having more than one round.</p>\n<p>So, the converse seems clear to me, but I still don&#8217;t see how being able to approximate ω*(G) (how well? up to a costant?) would give a computable upper bound on MIP*. Does computable upper bound in this context mean including it in a computable complexity class?</p>\n<p>About the conjecture, I don&#8217;t expect to get within ε for a reasonable amount of entanglement. After all, there is strong numerical evidence that even for a particular instance of a game you need infinite-dimensional states: arXiv:1006.3032.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arajo:Mateus.html\">Mateus Arajo</a>", "published": "2014-05-20 20:28:07+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Mateus: Yes, if you could approximate &omega;*(G) up to an additive constant less than 1/2, that would let you simulate MIP*(2,1) in some computable complexity class.  The reason is just that a 2-prover, 1-round interactive protocol is <i>exactly</i> a 2-prover game!  The verifier submits questions to the provers and receives answers from them, the goal of the provers is to cause the verifier to accept with the maximum probability, and the verifier&#8217;s algorithm defines the function that the provers are trying to maximize.  And the provers can use entanglement to coordinate their answers.  Is there anything else that needs to be said?</p>\n<p>Also, the paper you linked to is interesting and not something I&#8217;d seen, so thanks!  However, from a quick scan, I couldn&#8217;t tell whether the paper <i>actually</i> provides any evidence against the conjecture that I made.  Remember, I&#8217;m not saying there aren&#8217;t games (even purely-classical games) where you can win with higher and higher probability the more entanglement you have&#8212;in fact, I think it&#8217;s quite likely that such games exist (and the Pal-Vertesi paper strengthens that belief).  My conjecture says only that:</p>\n<p>(1) As you increase the amount of entanglement, the success probability <i>converges to a limit</i>, which <i>equals</i> the success probability that you can attain using a countably-infinite amount of entanglement.</p>\n<p>(2) A computable upper bound can be given on the rate of convergence.</p>\n<p>So, again, do Pal and Vertesi give any evidence against <i>that</i>?</p>\n<p>(1) and (2) above would clearly suffice for placing a computable upper bound on the QMIP*(2,1) class.</p>\n]]>", "author": "Scott", "published": "2014-05-21 02:07:05+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott: Ah! I see! The point is that a 2-prover game where you know the probabilities of succes is strictly more powerfull than one where you don&#8217;t. I&#8217;m sorry, I should have realized that sooner.</p>\n<p>As for the conjecture, you&#8217;re right, the paper does not provide evidence against that. It&#8217;s just a general feeling that the easiest way for the conjecture to be right would be if you could always get the optimal strategy with an amount of entanglement that would be a function of the size of the input, and this is not true. Certainly you might be able to get within ε for some nice function, but nobody knows any bound on how ε goes with the dimension of the state and the size of the input.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arajo:Mateus.html\">Mateus Arajo</a>", "published": "2014-05-21 12:17:54+00:00", "title": "By: Mateus Araújo"}]