[{"content": "<![CDATA[<p>Matt Strassler (<a href=\"http://profmattstrassler.com/\" rel=\"nofollow\">profmattstrassler.com</a>) has a lot of pretty accessable discussion of LHC triggering strategies, and the risks of missing interesting phenomena, on his blog.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lennox:Jon.html\">Jon Lennox</a>", "published": "2015-01-16 19:48:49+00:00", "title": "By: Jon Lennox"}, {"content": "<![CDATA[<p>Just to clarify the trigger issues. It is true that theorists and not only them worry about the trigger (the 3 levels of them).<br />\nBut I&#8217;d like to say that the trigger is not only 1.<br />\nThere are several logic conditions connected by an &#8220;OR&#8221; that let events go through. For example:<br />\nA: An event with a high energy muon<br />\nB: An event with at least X GeV total energy in the calorimeter<br />\nC: etc etc&#8230;.</p>\n<p>The trigger is then A OR B OR C etc&#8230;</p>\n<p>If the trigger were just 1 condition then one would really worry.<br />\nAnyway, the trigger conditions evolve in time with technology, speed of the chips, level of pileup (linked to LHC luminosity), physics studies and requirements etc etc.</p>\n<p>K.</p>\n]]>", "author": "anon", "published": "2015-01-17 00:20:23+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>&#8220;Meanwhile, your tour guide is carrying a geiger counter to make sure you’re not exposed to too much radiation.&#8221;</p>\n<p>May I ask: is there really a danger from cascade reaction products so far from the beam line?  Or is the source of radiation from something else?</p>\n]]>", "author": "Alex", "published": "2015-01-18 08:58:07+00:00", "title": "By: Alex"}, {"content": "<![CDATA[<p>The thing they carry is not technically a geiger counter but a dosimeter.  You wear it when you work in a radiation area and it keeps track of your exposure.  Every month you have it read out by a machine so that your annual exposure is known (this is required by Swiss and French law to be below some limit).</p>\n<p>So the dosimeter is for the safety of the guide, not the visitors. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />  The visitor itinerary and especially the visitor balcony in the experimental cavern are closely monitored by Radiation Protection.  This allows them to be declassified as radiation areas and accessible to the public.</p>\n<p>But yes, there is very little radiation in the cavern now.  What little there is is decay radiation due to activation of the detector materials.  E.g. neutrons produced in a collision can be captured by atoms in the detector.  Most of the materials are chosen to be radiation-hard, but things like steel screws and copper wiring are hard to control and prone to activation.  And it&#8217;s just a harsh environment in there.</p>\n<p>Of course operation stopped two years ago and the detector has had time to &#8220;cool down&#8221;.  But regulation at CERN is strict; basically any room that has ever had a beam in it is considered a radiation area.  Also anything that has been in a room with beam is considered radioactive until proven innocent.</p>\n]]>", "author": "Panflutist", "published": "2015-01-18 19:30:26+00:00", "title": "By: Panflutist"}, {"content": "<![CDATA[<p>I would love to get a rundown on the computing architecture used in CMS and ATLAS to capture and store all the data from experiments. It certainly puts the capital B in Big Data. Is that information available online somewhere or is it proprietary?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Burgan:Darrell.html\">Darrell Burgan</a>", "published": "2015-01-19 01:35:13+00:00", "title": "By: Darrell Burgan"}, {"content": "<![CDATA[<p>Too bad we can&#8217;t just factor numbers by accelerating them towards each other at great speeds.</p>\n<p>Or maybe we can&#8230;</p>\n]]>", "author": "Job", "published": "2015-01-20 10:22:43+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>Darrel,<br />\nYou can find information about some of those stages here<br />\n<a href=\"http://wlcg-public.web.cern.ch/\" rel=\"nofollow\">http://wlcg-public.web.cern.ch/</a></p>\n]]>", "author": "Jonas", "published": "2015-01-20 13:26:10+00:00", "title": "By: Jonas"}, {"content": "<![CDATA[<p>Job #18: But fortunately, we can&#8217;t just break atoms by shaking them together at normal speed for a long time! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /></p>\n]]>", "author": "Serge", "published": "2015-01-20 17:32:05+00:00", "title": "By: Serge"}, {"content": "<![CDATA[<p>@Job18 &#8220;Too bad we can’t just factor numbers by accelerating them towards each other at great speeds.&#8221;</p>\n<p>I think it should certainly be possible one day to reason about a fundamental amount of required energy to factor a number into its prime components (with some reasoning based on Landauer&#8217;s principle).  And that would be satisfying in the same sense?  However, I have no idea when such a day will arrive.</p>\n]]>", "author": "Alex", "published": "2015-01-21 02:42:53+00:00", "title": "By: Alex"}, {"content": "<![CDATA[<p>It sounds absurd, but in a different context we might be asking about the force which holds a composite number together.</p>\n<p>After all, a composite number doesn&#8217;t simply decay into its prime factors &#8211; the decomposition process has some energy requirements. What&#8217;s holding it together? <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /></p>\n<p>If we interpret the <i>mass</i> of a number as its bit count, then the force holding two primes together into a composite number is kind of like gravity, only stronger.</p>\n<p>The <i>prime force</i>, measured in Hz is roughly given by the expression:<br />\nf(p1, p2) = 2^(mass(p1) + mass(p2)) Hz</p>\n<p>Though i&#8217;m sure we could do alot better than that.</p>\n]]>", "author": "Job", "published": "2015-01-22 01:55:20+00:00", "title": "By: Job"}]