[{"content": "<![CDATA[<p>&#8220;As another example, if we lived in a hyperbolic geometry, one could reach an exponential amount of space in a polynomial amount of time, and could therefore imagine setting up exponentially-many parallel processors and having them all work on your problem at once.&#8221;</p>\n<p>This is amazing&#8230; except that I do not understand this. Could you please explain?</p>\n]]>", "author": "a", "published": "2014-11-28 11:17:36+00:00", "title": "By: a"}, {"content": "<![CDATA[<p>JollyJoker #38:</p>\n<ul>Does 2^n of something “really exist” then?</ul>\n<p>Yeah, that&#8217;s the million-dollar (or 2<sup>n</sup>-dollar?) metaphysical question.  All anyone else can do is lay out the issues for you; ultimately, you need to decide what you want to mean by words like &#8220;exist,&#8221; and which philosophical position you find the least unsatisfying.  For starters, check out Section 8 of my <a href=\"http://www.scottaaronson.com/papers/philos.pdf\" rel=\"nofollow\">Why Philosophers Should Care About Computational Complexity</a> essay.</p>\n]]>", "author": "Scott", "published": "2014-11-28 14:21:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #40: Thanks, I might have to read the whole essay <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /></p>\n]]>", "author": "JollyJoker", "published": "2014-11-28 15:49:20+00:00", "title": "By: JollyJoker"}, {"content": "<![CDATA[<p>Scott #40: Erm, section 8 spells out exactly what I thought. I mean as in completely jaw-dropping &#8220;I didn&#8217;t write this myself, did I?&#8221;. Lol, I had no idea I was this smart <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_wink.gif\" alt=\";)\" class=\"wp-smiley\" /></p>\n]]>", "author": "JollyJoker", "published": "2014-11-28 16:17:09+00:00", "title": "By: JollyJoker"}, {"content": "<![CDATA[<p>It seems that the idea of looking at the Church-Turing thesis as a statement about the laws of physics is due to Robin Gandy, a PhD student of Turing (see wikipedia on the history of the thesis).</p>\n]]>", "author": "Pascal", "published": "2014-11-28 19:56:32+00:00", "title": "By: Pascal"}, {"content": "<![CDATA[<p>Comment #37 amounts to  (see also Bremner-Jozsa-Shepherd, arXiv:1005.1407 [quant-ph], also Aaronson-Arkhipov, arXiv:1011.3245 [quant-ph])<br />\n<blockquote><b>The Collapse Thesis (CT)</b> &#8220;If a classical simulation of quantum mechanics was <em>really, really good</em>, then it would&nbsp;[&hellip;] cause a collapse of the polynomial hierarchy.&#8221;</p></blockquote>\n<p>which naturally generalizes to<br />\n<blockquote><b>The Extended Collapse Thesis (ECT)</b>&nbsp; &#8220;If a classical simulation of a random number stream was <em>really, really good</em>, then it would&nbsp;[&hellip;] cause a collapse of the entire hierarchy of complexity theory.&#8221;</p></blockquote>\n<p><b>Questions</b>&nbsp; Aren&#8217;t the CT and ECT <i>both</i> flawed (as stated)?\\(\\ \\)&hellip; and for similar reasons?</p>\n<p><b>Falsifiable assertion</b>&nbsp; What complexity theorists reasonably regard as a <em>&#8220;really, really good&#8221;</em> sampling simulation differs fundamentally from what experimentalists and statisticians reasonably regard as a  <em>&#8220;really, really good&#8221;</em> sampling simulation\\(\\ \\)&hellip; and this definitional imprecision has fueled public and scientific discourse of deplorable confusion and futility.</p>\n<p><b>`t\\(\\ \\)Hooft&#8217;s advice</b>&nbsp; In view of these definitional ambiguities, `t\\(\\ \\)Hooft&#8217;s advice surely applies (per arXiv:1405.1548)<br />\n<blockquote>&#8220;We should not be deterred by ‘no go theorems’ if these contain small print and emotional ingredients in their arguments.&#8221;</p></blockquote>\n<p>The history of scientific research in general, and of quantum complexity research in particular, shows us plainly that `t\\(\\ \\)Hooft&#8217;s advice is worthy of consideration by complexity theorists, experimentalists, and statisticians alike.</p>\n<p><b>Conclusion</b>&nbsp; The formal complexity-theory barriers to the computational simulation of random-number distributions and boson-sampling distributions should not dissuade us from implementing either one, with reasonable hope that for practical purposes our simulations can be both efficient and &#8220;really, really good&#8221;.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-29 08:17:56+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>I have a problem with the impossibility of warp drive ( only for not superluminary travel).<br />\nIf the Maxwell&#8217;s equations can have a corresponding equation for mass &#8220;charge&#8221; (the new Gauss&#8217;s equations), with charge replaces by masses, some sign replacements (Coulomb&#8217;s law have different sign of the Newton&#8217;s law of universal gravitation), and some different constants for particles-antiparticles field (so that can be possible to write the Einstein field equation for charge particles with the electromagnetic field like a curvature, and the Coulomb constant instead of the Newton&#8217;s gravitational constant, and with White Holes obtained with antiparticles), then it can be possible to obtain a cloud of aligned particles that can give an acceleration.<br />\nI think that a high density cloud of aligned flavourless mesons, with the antiquark-quark dipole that pointing in the same direction is equivalent to an electrostatic double layer, so that a curvature is possible (I am not interested to the technology to obtain the double layer, but it is possible).<br />\nIt is interesting the soapy water like a computer, and there is a system that it is also interesting: I think that the protein folding is a minimization problem that it is obtained quickly in the real word, that can be modified with artificial protein to assign to it a different real word problem (but it is very complex to read the solution), and that it is hard to solve in a computer.</p>\n]]>", "author": "domenico", "published": "2014-11-29 12:17:18+00:00", "title": "By: domenico"}, {"content": "<![CDATA[<p>John Sidles #44: OK, I can specify exactly what I meant by &#8220;really, really good&#8221; simulation.  I meant one that samples from exactly the same probability distribution over measurement outcomes that the ideal physics experiment samples from&#8212;or at least, one where all the probabilities are multiplicatively close to what they were in the ideal experiment.  Even if the simulation only samples a distribution that&#8217;s close in variation distance to the ideal distribution, we <i>think</i> that would still collapse the polynomial hierarchy, though for that we need an additional complexity hypothesis, that estimating the permanent of a matrix of i.i.d. Gaussians is #P-complete.  (Even without that hypothesis, such a simulation would put the Gaussian permanent estimation problem in BPP<sup>NP</sup>.)</p>\n<p>Of course weaker forms of classical simulation, or simulations for more restricted classes of quantum systems, could exist without collapsing PH&#8212;I don&#8217;t need that explained to me.</p>\n]]>", "author": "Scott", "published": "2014-11-29 13:33:01+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> notes (#46) &#8220;Of course weaker forms of classical simulation, or simulations for more restricted classes of quantum systems, could exist without collapsing PH\\(\\ \\)&mdash;\\(\\ \\)I\\(\\ \\)don’t need that explained to me.&#8221;</p></blockquote>\n<p>Scott (#46), please appreciate that my comment (#44) was <i>not</i> intended to explain the PH to you personally, or to explain it to <i>any</i> professional complexity theorist.  </p>\n<p>Rather its intent was to bridge certain confusion-inducing language-gaps between complexity theorists, scientists, mathematicians, and engineers.</p>\n<p>As a concrete example of this language-gap, STEAM students will benefit from studying the engineering-language idioms of the Keysight (formerly Agilent) 81150A application note <b>&#8220;<a href=\"http://literature.cdn.keysight.com/litweb/pdf/5989-9364EN.pdf\" rel=\"nofollow\">Precision digital noise\\(\\ \\)&mdash;\\(\\ \\)new noise technology and its application</a>&#8220;</b>.</p>\n<p>This technical note concludes with the following smile-inducing passage<br />\n<blockquote>The 81150A provides deterministic Gaussian white noise, with signal repetition of 26 days. You can decide on any arbitrary distribution, and trigger the noise to start when you need it.</p></blockquote>\n<p><b>Predictions</b></p>\n<p><b>•\\(\\ \\)Complexity theorists will smile</b>&nbsp; at the naive engineering notion of &#8220;noise&#8221; that is deterministic and repetitive\\(\\ \\)&hellip; obviously these Keysight engineers are far-gone in von Neumann&#8217;s state of sin!</p>\n<p><b>•\\(\\ \\)Mathematicians will smile</b>&nbsp; at the naive engineering notion of &#8220;arbitrary&#8221; distributions that none-the-less can be programmed\\(\\ \\)&hellip; obviously these Keysight engineers have little notion of computable functions!</p>\n<p><b>•\\(\\ \\)Physicists will smile</b>&nbsp; at the naive engineering notion of &#8220;triggering the noise to start when you need it&#8221;\\(\\ \\)&hellip; obviously these Keysight engineers have little notion of a task whose limiting cases are not less subtle\\(\\ \\)&mdash; and even potentially infeasible (<i>e.g.</i>, for relativistic gauge theories)\\(\\ \\)&mdash; than &#8220;triggering large\\(\\text{-}n\\) boson-sampling photon-states when you need them&#8221;.</p>\n<p>&#8212;&#8212;&#8212;&#8212;<br />\n<b>Conclusion</b>&nbsp; Hot crowded planets in urgent need of jobs for young researchers are well-advised to embrace language that fosters discourse among complexity theorists, logicians, physicists, and engineers that is clear, friendly, impersonal, mutually respectful and (most of all) hopeful.  </p>\n<p><b>The virtue of sin</b>&nbsp; The &#8220;state of sin&#8221; that is associated to the blithe disregard of no-go theorems and postulates that are broad yet subtle&nbsp;&mdash; including the broad yet subtle no-go postulates that are grounded in the creed of the Church of Larger Hilbert Space&nbsp;&mdash; has been and will continue to be a viably responsible, creative, and productive professional path for the world&#8217;s engineers, entrepreneurs, scientists, and mathematicians\\(\\ \\)&hellip; and complexity theorists too.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-29 16:18:01+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p><b>Student exercises (for #47)</b></p>\n<p><b>Exercise\\(\\ \\)I\\(\\ \\)(easy)</b>&nbsp; Explain why the Keysight (formerly Agilent) 81150A Pulse Function Arbitrary Noise Generator\\(\\ \\)&mdash; despite its <b><a href=\"http://www.youtube.com/watch?v=yfuM9uF79GI\" rel=\"nofollow\">formidable technical capabilities</a></b>\\(\\ \\)&mdash; fails the fundamental and seemingly simple challenge of generating gaussian noise whose distribution is (in Scott&#8217;s phrase of #46) &#8220;close in variation distance to the ideal distribution.&#8221;</p>\n<p><b>Exercise\\(\\ \\)II\\(\\ \\)(intermediate)</b>&nbsp; Explain why practicing engineers commonly don&#8217;t care.  </p>\n<p><b>Exercise\\(\\ \\)III\\(\\ \\)(intermediate)</b>&nbsp; Give an example in which practicing engineers <i>do</i> care.  Hint:\\(\\ \\)see Wikipedia&#8217;s discussion &#8220;Audiophile controversies.&#8221;</p>\n<p><b>Exercise\\(\\ \\)IV\\(\\ \\)(advanced/open)</b>&nbsp; Briefly summarize the practical and fundamental implications of these considerations for large-scale quantum simulation in general, and large\\(\\text{-}n\\) boson-sampling experiments in particular.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-29 16:54:38+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Nothing against Sidles personally, but to aid with digestion of the blog, do you think it might be worthwhile to limit him to a comment number and comment length maximum?</p>\n]]>", "author": "On-sidles-laught", "published": "2014-11-30 01:12:08+00:00", "title": "By: On-sidles-laught"}, {"content": "<![CDATA[<p>Scott #28,</p>\n<p>That sounds right, but i&#8217;m not totally grasping that second Hadamard.</p>\n<p>Let me step through a simple f(x) so you can see where i&#8217;m going wrong. Suppose that X has n bits and the black-box function f(x) uses CNOT gates to copy the top n-1 bits, while ignoring the least significant bit of X.</p>\n<p>In this case the secret value s is 0&#8230;01, and f(x) is the same for every consecutive pair of x values (2i, 2i+1), e.g. f(0)=f(1)=0, f(2)=f(3)=2, f(4)=f(5)=4, etc.</p>\n<p>Before f(x) is applied, X is in an even superposition of all n-bit values, while Y is constant |000&#8230;0>. After f(x), X is&#8230; well i&#8217;m not sure, and i think that&#8217;s where my confusion begins.</p>\n<p>I&#8217;ve seen how in a QC, controlled gates often modify control bits as much as target bits. I&#8217;m also assuming that the f(x) gate uncomputes f(x) after copying the result to the Y register.</p>\n<p>Looking at X in isolation it seems that it still is in an even superposition over all possible n-bit strings. The amplitudes corresponding to each possible value of X should all be positive and have similar magnitude, because the CNOTs are only shuffling equal amplitudes around (?), given that Y is |000&#8230;0>.</p>\n<p>Looking at the XY system, then we have two possible types of (X, Y) pairs: (2i, 2i) or (2i+1, 2i). If we were to measure X at this stage, i would expect to get a random n-bit value with equal probability. For Y i would expect a random n-bit even value with equal probability. For XY i would expect to get an odd-even pair 50% of the time and an even-even pair 50% of the time.</p>\n<p>If this were true, then applying the second Hadamard to X should yield |000&#8230;0> every time and we would not get interference, so i&#8217;ve gone wrong somewhere. On the other hand, if we were to measure Y before applying the second Hadamard to X, then this would change.</p>\n<p>I wonder, in Simon&#8217;s algorithm, is Y measured before the second Hadamard is applied to X?</p>\n]]>", "author": "Job", "published": "2014-11-30 01:35:58+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>It does look like Y must be measured before the second Hadamard is applied.</p>\n<p>At least according to this lecture by Dave Bacon (in part B):<br />\n<a href=\"http://courses.cs.washington.edu/courses/cse599d/06wi/lecturenotes8.pdf\" rel=\"nofollow\">http://courses.cs.washington.edu/courses/cse599d/06wi/lecturenotes8.pdf</a></p>\n<p>The other online resources that i&#8217;ve seen discussing Simon&#8217;s algorithm (including Wikipedia) don&#8217;t state this explicitly and illustrate the circuit as performing a measurement at the end, e.g.:<br />\n<a href=\"http://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Simons_algorithm.svg/230px-Simons_algorithm.svg.png\" rel=\"nofollow\">http://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Simons_algorithm.svg/230px-Simons_algorithm.svg.png</a></p>\n<p>The math does seem to indicate that there is a measurement before the second Hadamard, but it&#8217;s totally not obvious, especially since i usually just gloss over that stuff.</p>\n]]>", "author": "Job", "published": "2014-11-30 04:04:46+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>Job #50, #51: It doesn&#8217;t matter whether Y is measured or not before the second round of Hadamards.  In textbook presentations, Y is typically measured for purely pedagogical purposes.  But a measurement of Y can&#8217;t nonlocally change the state of the X register&#8212;so if the algorithm works with the measurement, then it must also work without the measurement.  It&#8217;s the computation of f (entangling the X and Y registers) that changes the state of the X register and actually matters for the computation, not the subsequent measurement of the Y register.</p>\n<p>For more, please read (e.g.) Mermin&#8217;s <i>Intro to Quantum Computer Science</i>, or any of the excellent online course lecture notes (e.g., Vazirani&#8217;s).</p>\n]]>", "author": "Scott", "published": "2014-11-30 12:45:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>On-sidles-laught #49:</p>\n<ul>Nothing against Sidles personally, but to aid with digestion of the blog, do you think it might be worthwhile to limit him to a comment number and comment length maximum?</ul>\n<p>Sidles has been banned from this blog several times, but the bans have expired.  I completely agree that <i>something</i> should be done to rein him in and improve this comment section&#8217;s readability.  The trouble with a comment number and comment length maximum is that they&#8217;d take mental effort for me to enforce (I&#8217;d have to count the number of lines, and remember: how many <i>other</i> comments did he post today?).</p>\n<p>But I&#8217;m open to other suggestions.  For example, what do people think of the following policy: any Sidles comment with boldfaced headings and/or BibTeX references goes immediately to the trash.</p>\n]]>", "author": "Scott", "published": "2014-11-30 12:53:59+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>My comments here on <i>Shtetl Optimized</i> are informed by a three-way blend of </p>\n<p>(1)\\(\\ \\)the engineering and medical objectives of &#8220;Spin microscopy&#8217;s heritage, achievements, and prospects&#8221; (2009); </p>\n<p>(2)\\(\\ \\)the mathematical narratives provided by Tim Gower&#8217;s &#8220;Vividness in mathematics and narrative&#8221; (2012) and Barry Mazur&#8217;s &#8220;Visions, dreams, and mathematics&#8221; (2012), and </p>\n<p>(3)\\(\\ \\) the accelerating realization of these practical objectives and mathematical perspectives that is envisioned in the philosophical/fictional STEAM-narratives of recent works like Jacques Roubaud&#8217;s <i>Mathematique:</i> (2012), Andrea Barrett&#8217;s <i>Archangel</i> (2013), Yannick Grannec&#8217;s <i>The Goddess of Small Victories</i> (2014), and Kathleen Goonan&#8217;s &#8220;Girl in Wave: Wave in Girl&#8221; (2014).</p>\n<p>BibTeX references are appended (as usual!).  I&#8217;d be interested to sample the distribution of <i>Shtetl Optimized</i> on the aversion-curiosity-familiarity spectrum:</p>\n<p><b>• Aversion</b>&nbsp; &#8220;These works and ideas have scant  relevance to quantum math, science, and engineering; references to them are unwelcome on <i>Shtetl Optimized</i>.&#8221;</p>\n<p><b>• Curiosity</b>&nbsp; &#8220;Some or all of these works and ideas are unfamiliar to me; references to them are welcome on <i>Shtetl Optimized</i>&#8221;</p>\n<p><b>• Familiarity</b>&nbsp; &#8220;Because these ideas and works are <i>already</i> in my BibTeX database; references to them on <i>Shtetl Optimized</i> have no particular value to me.&#8221;</p>\n<p><b>Note</b>&nbsp; Several of these works are by women and/or center upon women&#8217;s roles in STEAM&nbsp;&hellip; I&#8217;d be <i>very</i> interested to hear from women who read/comment on <i>Shtetl Optimized</i> (are there any?), or alternatively, ideas/explanations regarding the (apparent?) near-saturation of gender imbalance among <i>Shtetl Optimized</i> readers. </p>\n<p>&#8212;&#8212;&#8212;&#8212;<br />\n<b>Readings in quanta, healing, gender, and STEAM</b></p>\n<p> @book{null, Author = {Barrett, Andrea},<br />\nPublisher = {W. W. Norton}, Title = {Archangel},<br />\nYear = {2013}}</p>\n<p>@incollection{null, Author = {Kathleen Ann<br />\nGoonan}, Booktitle = {Hieroglyph: Stories and<br />\nVisions for a Better Future}, Editor = {Finn, Ed<br />\nand Cramer, Karen}, Pages = {38&#8211;73}, Publisher<br />\n= {HarperCollins}, Title = {Girl in Wave: Wave<br />\nin Girl}, Year = {2014}}</p>\n<p>@incollection{null, Address = {Princeton},<br />\nAuthor = {Timothy Gowers}, Booktitle = {Circles<br />\ndisturbed: the interplay of mathematics and<br />\nnarrative}, Editor = {Doxiades, Apostolos K. and<br />\nMazur, Barry}, Pages = {211&#8211;231}, Publisher =<br />\n{Princeton University Press}, Title = {Vividness<br />\nin Mathematics and Narrative}, Year = {2012}}</p>\n<p>@book{null, Author = {Yannick Grannec},<br />\nPublisher = {Other Press}, Title = {The Goddess<br />\nof Small Victories}, Year = {2014}}</p>\n<p>@incollection{null, Address = {Princeton},<br />\nAuthor = {Barry Mazur}, Booktitle = {Circles<br />\ndisturbed: the interplay of mathematics and<br />\nnarrative}, Editor = {Doxiades, Apostolos K. and<br />\nMazur, Barry}, Pages = {183&#8211;210}, Publisher =<br />\n{Princeton University Press}, Title = {Visions,<br />\nDreams, and Mathematics}, Year = {2012}}</p>\n<p>@book{null, Address = {Champaign}, Author =<br />\n{Jacques Roubaud}, Editor = {Ian Monk<br />\n(translator)}, Publisher = {Dalkey Archive<br />\nPress}, Title = {Mathematics: (a novel)}, Year =<br />\n{2012}}</p>\n<p>@article{null, Author = {J. A. Sidles}, Journal<br />\n= {Proc. Nat. Acad. Sci.}, Number = {8}, Pages =<br />\n{2477&#8211;8}, Title = {Spin microscopy&#8217;s heritage,<br />\nachievements, and prospects}, Volume = {106},<br />\nYear = {2009}} </p>\n<p>&#8212;&#8212;&#8212;&#8212;<br />\n<b>PS</b> I&#8217;ll be winter-hiking in the Cascades for the next two days, and will read responses with interest upon my return.  Needless to say, I neither expect nor would welcome uniform responses!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-30 15:07:00+00:00", "title": "By: John Sidles"}]