[{"content": "<![CDATA[<p>Oh! You [still] use (or at least wear!) the wrist-watch!</p>\n<p>&#8211;Ajit</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2017-04-25 13:04:10+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>&#8220;even if a particular march like this one won’t change anyone’s mind (as it likely won’t),&#8221;</p>\n<p>Ah, but we won&#8217;t that until we compare with the results from the Placebo march.</p>\n]]>", "author": "Jr", "published": "2017-04-25 15:05:47+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Jr #47: The trouble is that the <i>intended</i> influence channel of a protest march is purely psychological anyway!  So &#8220;placebo march&#8221; = &#8220;march.&#8221;</p>\n]]>", "author": "Scott", "published": "2017-04-25 17:06:50+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>jonathan: Like, you could be right in everything you say.  But I see the cause of &#8220;pro-science-and-Enlightenment&#8221; as so important that, if we see that cause being taken over by identity politics or mindless fanboyism or something else that it shouldn&#8217;t be, then I think we need to engage the cause all the more, to help move it in the direction we want.</p>\n<p>It&#8217;s kind of like when I talk to laypeople who got all excited about quantum computing because of D-Wave solving NP-hard problems 10 trillion times faster, or something they read in a popular magazine about QCs predicting the weather or traveling backwards in time.  If <i>all</i> I do is pour cold water on their misconceptions, I feel like crap afterwards.  Instead my task is to redirect their very welcome enthusiasm toward the genuine science that&#8217;s happening.</p>\n]]>", "author": "Scott", "published": "2017-04-25 17:26:40+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>jonathan #42 #45</p>\n<p>I didn&#8217;t see the march is mainly anti-Trump except in the sense it is the Trump Administration  and Republicans who are proposing the budget cuts and rollback of EPA rules. Of course, there were some overtly anti-Trump signs but most of the signs were politically neutral in a partisan sense, although many opposed to funding cuts.</p>\n<p>Regarding science 1 and 2, I could agree with in theory but let&#8217;s look at a concrete example.</p>\n<p>I would assume you would think Judith Curry is a good example of a global warming skeptic who is doing science 1. I used to think so myself.</p>\n<p>So look at her &#8220;stadium wave&#8221; theory from 2013:</p>\n<p><a href=\"https://judithcurry.com/2013/10/10/the-stadium-wave/\" rel=\"nofollow\">https://judithcurry.com/2013/10/10/the-stadium-wave/</a></p>\n<p>And notice this quote:</p>\n<p>&#8220;“The stadium wave signal predicts that the current pause in global warming could extend into the 2030s,” Wyatt said, the paper’s lead author.&#8221;</p>\n<p>Okay, It&#8217;s prettymuch  already been proven the theory is garbage. Has she changed her skepticism? Has she produced an alternative theory?</p>\n<p>No. And no.</p>\n<p>At some point the climate skeptics need to produce an alternative theory with a prediction about when the cooling will begin or they are not doing science 1.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2017-04-25 22:05:28+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Thanks for attending the march, and I agree with the sign.</p>\n]]>", "author": "JimV", "published": "2017-04-25 22:05:41+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>Irrelevant heads up: The youtube channel PBS Infinite Series has a video coming out next week on Shor&#8217;s algorithm to follow up last week&#8217;s video on cryptography. The presenter keeps it simple but is very knowledgeable and the videos are beautifully animated. If you feel like checking it out I&#8217;m curious if it will earn the Aaronson seal of approval 🙂</p>\n]]>", "author": "Martin", "published": "2017-04-26 01:39:41+00:00", "title": "By: Martin"}, {"content": "<![CDATA[<p>No need to march literally, science marches on much more effectively as it always has, through theory and experiment 😉</p>\n<p>We may be close a big breakthrough on &#8216;It from Bit&#8217;.</p>\n<p>I think the real puzzle has always been the nature of &#8216;time&#8217;.  The QM notion of time has never squared with the block universe picture of relativity, and of course, neither are consistent with the subjective notion of time as a flowing river of awareness.</p>\n<p>In a flurry of insights, some ideas of mine have connected in a way which could unify the different notions of time.</p>\n<p>I proposed that time is 2-dimensional.  This has been proposed in physics before, but until now, no one was able to supply a coherent interpretation of the extra time dimension.  </p>\n<p>My idea is to move the 2-d time idea to the &#8216;It from Bit&#8217; framework (reality as computation), and redefine the different notions of time entirely in terms of information theory.</p>\n<p>To recast time in terms of information theory, the natural idea is to equate time with entropy increase (thermodynamics).  We know that thermodynamics can be described in terms of information theory, by recasting entropy increase as the spread (or dissipation) of information (increasing correlations) &#8211; see the ideas of Seth Lloyd.</p>\n<p>Now introduce the 2nd time dimension.</p>\n<p>Draw a 2-d graph of time and let the x-axis represent ordinary &#8216;informational entropy&#8217;.   Now I&#8217;m suggesting that we need to define a *new* kind of entropy to represent the 2nd time-dimension (y-axis).  I leave open the question of what this new type of entropy could be.  </p>\n<p>With 2 different definitions of entropy (i.e 2 time dimensions), the concept of &#8216;time flow&#8217; actually makes sense: I&#8217;m defining it as the rate of change in the *ratio* of the 2 types of entropy.</p>\n<p>Note that if there is only a single time-dimension, the concept of &#8216;time flow&#8217; doesn&#8217;t make any sense, but with 2 time dimensions, suddenly it does, since we have a basis for relating two different timescales!</p>\n<p>And since the notion of &#8216;time flow&#8217; is so close to our notion of subjective awareness, the natural next conjecture is to suggest that they&#8217;re related.  Now suddenly we have a way to define consciousness!</p>\n<p>The puzzle of &#8216;It from Bit&#8217; was how to go from pure information to our apparent material world (matter) and then to consciousness (cognition).</p>\n<p>Time-flow seems the natural scale to explain this.</p>\n<p>Define &#8216;ground-state information&#8217; as a state of slow time-flow, matter as a state of medium time-flow, and consciousness as a state of high time-flow.</p>\n<p>Then consciousness would be defined as any region where information has a high time-flow.   </p>\n<p>Interestingly, around the time I was thinking of all this, a great new book on neuroscience has come out; &#8216;Your Brain Is A Time Machine&#8217; , by Dean Buonomano, where Dean investigates the  philosophy, physics and neuroscience of time.</p>\n<p> I feel a huge breakthrough is imminent!</p>\n]]>", "author": "mjgeddes", "published": "2017-04-26 04:16:23+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>Scott 49:</p>\n<p>I mostly agree with your comment. I think it&#8217;s important to avoid cynicism and an excessively critical spirit on these matters, and engage the public on science and other values we hold dear. I will even support and applaud your participation in the march on these grounds, though I would choose otherwise were I free to do so (I was occupied by a prior commitment at the time of the march, so did not face a genuine choice whether to participate myself).</p>\n<p>However, I think that this engagement must be done very carefully. While it&#8217;s great that many people are interested in science, and we can and should engage them even if their interest is driven (as you so aptly put it) by &#8220;identity politics or mindless fanboyism&#8221;, we must also recognize the danger posed by these, especially the first. </p>\n<p>The greatest risk is that the greater interest shown by some will be matched by decreased interest by others (i.e. those on the right), and that the support itself will be shallow and misdirected, since it is founded on political affiliation rather than genuine interest in science. </p>\n<p>Moreover, to the extent the interest is politically motivated, it will tend to redefine &#8220;science&#8221; and elevate politically correct scientists and conclusions, while denigrating politically incorrect views. This has, of course, been ongoing for a long time, but mostly with the opposition rather than the support of the scientific community. Politics is powerful stuff in human affairs, and politicization of science is a very dangerous business.</p>\n<p>I admit that my grumping about science fanboyism is mostly irrelevant to my main concerns (except insofar as the fanboyism arises from political affiliation). Though there was much fanboyism on display in the march, and this did annoy me, I agree that this is no reason not to join or engage with it.</p>\n]]>", "author": "jonathan", "published": "2017-04-26 11:39:59+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>Luca and Scott, (#31,32) prior to Bell (1966) Grete Hermann (in 1935) discovered a problem in vN impossibility (1932) result. </p>\n<p>See  <a href=\"https://en.wikipedia.org/wiki/Grete_Hermann\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Grete_Hermann</a> (and also <a href=\"https://gilkalai.wordpress.com/2013/01/01/symplectic-geometry-quantization-and-quantum-noise/\" rel=\"nofollow\">https://gilkalai.wordpress.com/2013/01/01/symplectic-geometry-quantization-and-quantum-noise/</a> )</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2017-04-26 12:30:59+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>In regard to the mysterious nature of &#8220;time&#8221; (<i>circa</i>&nbsp;#53), the distinguished physicist/mathematician Lee Smolin and the distinguished jurist/philosopher Roberto Unger recently collaborated in publishing a book, <i>The Singular Universe and the Reality of Time</i> (2014).</p>\n<p>It&#8217;s not obvious (to me at least) how the Smolin/Unger ideas translate into practical engineering frameworks&nbsp;&mdash; still the Smolin/Unger ideas are&nbsp;<a href=\"https://www.youtube.com/watch?v=DRuYwurX0_o\" rel=\"nofollow\">plenty of&nbsp;fun and not evidently &#8220;nutty&#8221;</a>.</p>\n<p>Roberto Unger is celebrated too&nbsp;&mdash; celebrated by my wife Connie and me anyway&nbsp;&mdash; as holding the all-time all-culture Demosthenes-record for &#8220;<a href=\"https://www.youtube.com/watch?v=pdb-GTjggTg\" rel=\"nofollow\">speaking&nbsp;without &#8216;ums&#8217; and&nbsp;&#8216;ers&#8217;</a>&#8220;.</p>\n]]>", "author": "John Sidles", "published": "2017-04-26 13:24:27+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>#55 Gil Kalai<br />\nThank you, this is very interesting.</p>\n]]>", "author": "luca turin", "published": "2017-04-27 01:20:48+00:00", "title": "By: luca turin"}, {"content": "<![CDATA[<p>John #56,</p>\n<p>Thanks, I&#8217;ll look into that one.</p>\n<p>Something is definitely not adding up as regards the standard physics picture of time.</p>\n<p>The key point here is that there are actually 3 different notions of time, and they aren&#8217;t consistent with each other (quantum mechanical time , classical physics time  , and subjective time).</p>\n<p>If you imagine an observer &#8216;looking in&#8217; at the block-universe of Einstein, well there&#8217;s an inconsistency right there, because the observer&#8217;s thoughts are still &#8216;flowing&#8217; (changing), whereas the block-universe time dimension is &#8216;frozen&#8217; in place.</p>\n<p>A reasonable way to try to modify this picture is to introduce a &#8216;growing block universe&#8217; model instead, where there is still a block universe of some kind, but it&#8217;s not a complete picture and the block universe itself can evolve.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Growing_block_universe\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Growing_block_universe</a></p>\n<p>But I don&#8217;t think you can really make sense of that unless you introduce a 2nd time dimension (one for ordinary block-universe time), the other to record the evolution of the block universe itself.</p>\n<p>The introduction of a 2nd time dimension is my favored hypothesis at this point, but it&#8217;s difficult to make sense of what that could mean.</p>\n]]>", "author": "mjgeddes", "published": "2017-04-27 02:27:56+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>I&#8217;ve always felt von Neumann was overrated as a mathematical scientist. He dabbled in the foundations of several fields that later grew in importance like axiomatic set theory, quantum mechanics, computing, and nuclear weapons, but (with the possible exception of game theory) it&#8217;s hard to think of a research area where he was the single most important person.</p>\n]]>", "author": "ANG", "published": "2017-04-27 11:59:45+00:00", "title": "By: ANG"}, {"content": "<![CDATA[<p>[&#8230;] in DC, I marched at the satellite march in Atlanta, my daughter Molly in Chicago, Scott Aaronson in Austin, Hal Gabow in New York, and Donald Knuth (pictured) presumably in San Francisco. I thank the many [&#8230;]</p>\n]]>", "author": "So Was I | A bunch of data", "published": "2017-04-27 14:43:55+00:00", "title": "By: So Was I | A bunch of data"}, {"content": "<![CDATA[<p>ANG #59:</p>\n<p>John von Neumann invented the formal theory of self-reproducing machines. In this field he is, in my judgment, the single most important person.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gogins:Michael.html\">Michael Gogins</a>", "published": "2017-04-27 15:32:50+00:00", "title": "By: Michael Gogins"}, {"content": "<![CDATA[<p>ANG #59 I cannot judge whether JvN is scientifically overrated, but I read that he was prone to writing important mathematical papers while conversing with his family at the breakfast table, and that he also enjoyed huge boozy parties with a very diverse crowd. I admire this rare combination of talents in a nerd. </p>\n<p>Also, speaking as a denizen of parochial nation-state Europe, the fact that he became such a big shot in the US despite his exotic background and accent etc. seems to me a wonderful illustration of what made America great. The EU is nowhere near that even now.</p>\n]]>", "author": "luca turin", "published": "2017-04-27 15:57:12+00:00", "title": "By: luca turin"}]