[{"content": "<![CDATA[<p>Scott #38 </p>\n<p>Thanks for clarifying. I hold those same values and yes, I am also a Christian. In fact, Jesus himself could be classified as an Enlightenment figure according to this definition. He was pro separation of church and state (Matthew 22:21), he was definitely tolerant with other religious traditions of his time with teachings such as the parable of the Good Samaritan (Luke 10:25-37) and if there is anybody who knows what&#8217;s like to be killed by religious intolerance, well, that&#8217;s Him.</p>\n<p>I am glad you are making this clear. </p>\n<p>Sniffnoy #39</p>\n<p>Jefferson still went as far as signaling John Locke, the whole person, as a great man. Well, in fact, he even signaled Isaac Newton -whose religious convictions were even more extreme than Locke&#8217;s- as a great man. This notion that he considered in his praise only the ideas from these men that he agreed with is your own editing, not something supported by the quote I provided. A typical example of over-fitting religious animosity into a famous person&#8217;s writing if you were to ask me.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2017-12-19 14:24:26+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>&#8220;Just yesterday, for example, I was absolutely certain that I turned the oven off, just as my wife told me to&#8230;&#8221;</p>\n<p>Little Green Men running amok in your house gaslighting you. Literally. Tee hee.</p>\n]]>", "author": "Atreat", "published": "2017-12-19 17:05:15+00:00", "title": "By: Atreat"}, {"content": "<![CDATA[<p>As for the tax, I&#8217;m a bit late, but I believe Jorge Cham&#8217;s reaction wasn&#8217;t linked in the previous thread about it: <a href=\"http://phdcomics.com/comics/archive.php?comicid=1985\" rel=\"nofollow\">http://phdcomics.com/comics/archive.php?comicid=1985</a></p>\n]]>", "author": "jonas", "published": "2017-12-19 18:32:36+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>Re: Unrelated Update #1</p>\n<p>Let&#8217;s dispel with the myth once and for all that babies / dogs / cats don&#8217;t know what they&#8217;re doing. They know exactly what they&#8217;re doing!</p>\n]]>", "author": "Andrew G", "published": "2017-12-19 18:52:59+00:00", "title": "By: Andrew G"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> asks (<i>circa</i> <a href=\"#comment-1750596\" rel=\"nofollow\">#38</a>)&nbsp; &#8220;Did I miss anything [in summarizing &#8216;Enlightenment Values&#8217;]?&#8221;</p></blockquote>\n<p>The quick answer: Scott&#8217;s list is solidly grounded in Enlightenment history. </p>\n<p>Specifically, in Jonathan Israel&#8217;s <a href=\"https://books.google.com/books?id=GvETDAAAQBAJ&pg=PA866\" rel=\"nofollow\"><i>Enlightenment Contested: Philosophy, Modernity, and the Emancipation of Man 1670-1752</i></a> (p. 866) we read:</p>\n<blockquote><p>Radical Enlightenment conceived as a package of basic concepts and values may be summarized in eight cardinal points:</p>\n<p><b>JI.1</b> adoption of philosophical (mathematical-historical) reason as the only and exclusive criterion of what is true;</p>\n<p><b>JI.2</b> rejection of all supernatural agency, magic, disembodied spirits, and divine providence;</p>\n<p><b>JI.3</b> equality of all mankind (racial and sexual);</p>\n<p><b>JI.4</b> secular &#8216;universalism&#8217; in ethics anchored in equality and chiefly stressing equity, justice, and charity;</p>\n<p><b>JI.5</b> comprehensive toleration and freedom of thought based on independent critical thinking;</p>\n<p><b>JI.6</b> personal liberty of lifestyle and sexual conduct between consenting adults;</p>\n<p><b>JI.7</b> freedom of expression, political criticism, and the press, in the public sphere.</p>\n<p><b>JI.8</b> democratic republicanism as the most legitimate form of politics.</p></blockquote>\n<p>Comparing <i>Shtetl Optimized</i> Enlightenment Values with Jonathan Israel&#8217;s pointwise, we find:</p>\n<blockquote><p><b>Scott Aaron&#8217;s Enlightenment Values (SA.*) &#8230;<br />\n&nbsp;&nbsp;compared to Jonathan Israel&#8217;s (JI.*)</b><br />\n&nbsp;&nbsp;&nbsp;<b>SA.1</b> &lrarr; <b>JI.5</b><br />\n&nbsp;&nbsp;&nbsp;<b>SA.2</b> &lrarr; <b>JI.3&oplus;7</b><br />\n&nbsp;&nbsp;&nbsp;<b>SA.3</b> &lrarr; <b>JI.7&oplus;8</b><br />\n&nbsp;&nbsp;&nbsp;<b>SA.4</b> &lrarr; <b>JI.4&oplus;6</b><br />\n&nbsp;&nbsp;&nbsp;<b>SA.5</b> &lrarr; <b>JI.1</b><br />\n&nbsp;&nbsp;&nbsp;<b>SA.6</b> &lrarr; <b>JI.2</b></p></blockquote>\n<p>The bottom line: <i>Shtetl Optimized&#8217;s</i> enlightened values closely accord with the historical Enlightenment values that Jonathan Israel summarizes.</p>\n<p>A sharply contrasting alt-right critique of Enlightenment values is provided by Andrew Joyce&#8217;s three-part jeremiad &#8220;<a href=\"http://www.theoccidentalobserver.net/2013/03/04/pariah-to-messiah-the-engineered-apotheosis-of-baruch-spinoza-part-1-of-3\" rel=\"nofollow\">Pariah to Messiah: The Engineered Apotheosis of Baruch Spinoza</a>&#8220;, which appeared in the (Putin-assisted?) <i>Occidental Observer: White Identity, Interests, and Culture</i> (March, 2013). </p>\n<p>To refocus our attention on quantum science, let&#8217;s consider the cardinal points of enlightened Quantum Supremacy (QuSu) versus enlightened Quantum Skepticism (QuSP).  Using Jonathan Israel&#8217;s summary as a template yields only two (of eight) cardinal points that differ between QuSu and QuSk:</p>\n<blockquote><p>Enlightened Quantum Supremacy (QuSu) and enlightened Quantum Skepticism (QuSk), each conceived as a package of basic concepts and values, may be summarized in eight cardinal points (here &#8216;QuS*&#8217; labels points in common):</p>\n<p>&#8212;&#8211;<br />\n<b>QuSu.1</b> adoption of unitary dynamics and projective measurements, on Hilbert spaces of countably many dimensions, as the privileged model of computational processes;</p>\n<p><b>QuSk.1</b> adoption of quantum electrodynamics (QED), on Hilbert spaces of uncountably many dimensions, as the privileged model of computational processes;<br />\n&#8212;&#8211;</p>\n<p><b>QuS*.2 (shared)</b> rejection of all hidden variable models;</p>\n<p><b>QuS*.3 (shared)</b> scalability as a <i>sine qua non</i> of technological practicality;</p>\n<p>&#8212;&#8211;<br />\n<b>QuSu.4</b> quantum dynamical &#8216;universality&#8217;, anchored in complexity theory, and chiefly stressing that there exist physically realizable quantum dynamical processes whose classical unravellings are (postulated to be) fundamentally incompatible with the Extended Church-Turing thesis;</p>\n<p><b>QuSk.4</b> thermodynamic &#8216;universality&#8217;, anchored in macroscopically localized entropy-densities, and chiefly stressing that classical unravellings of physically realizable quantum electrodynamical processes are (postulated to be) universally compatible with the Extended Church-Turing thesis;<br />\n&#8212;&#8211;</p>\n<p><b>QuS*.5 (shared)</b> comprehensive algorithmic freedom based on practical hardware engineering;</p>\n<p><b>QuS*.6 (shared)</b> liberty of hardware instantiation of computational processes;</p>\n<p><b>QuS*.7 (shared)</b> freedom of pedagogic discourse and scientific criticism in the public sphere;</p>\n<p><b>QuS*.8 (shared)</b> peer reviewed publication as the most legitimate form of scientific communication.</p></blockquote>\n<p>One take-away lesson for science-popularizers is simple this: from an enlightened scientific perspective, Quantum Supremacy and Quantum Skepticism are, fundamentally, much more alike than different.</p>\n]]>", "author": "John Sidles", "published": "2017-12-19 19:40:14+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>TPWG #43: Right, see, I&#8217;m not talking about what he &#8220;considered in his praise&#8221;, I&#8217;m talking about what he agreed with.  I see no particular reason why the former might be relevant to anything, and as such had not considered it might be something you were talking about.  So like I said we seem to have been talking past each other, and I&#8217;m not really sure this is going anywhere useful.</p>\n]]>", "author": "Sniffnoy", "published": "2017-12-19 20:40:02+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Scott this footage was released by official sources <a href=\"https://www.nytimes.com/2017/12/16/us/politics/pentagon-program-ufo-harry-reid.html\" rel=\"nofollow\">https://www.nytimes.com/2017/12/16/us/politics/pentagon-program-ufo-harry-reid.html</a>!!!!!!!</p>\n<p>Also what is the tex for<br />\n   ?<br />\nP = NP</p>\n<p>???????</p>\n]]>", "author": "boo", "published": "2017-12-19 21:01:42+00:00", "title": "By: boo"}, {"content": "<![CDATA[<p>boo #49: But I remember as a teenager in the 90s, the other teenagers I knew who were UFO buffs were always talking about &#8220;official sources,&#8221; the CIA and the Pentagon, unexplained footage, all the same basic ingredients.  And then I learned, e.g. from reading Carl Sagan, that those have been the basic ingredients of UFOlogy ever since the subject &#8220;took off&#8221; (har har) shortly after WWII&#8212;by complete coincidence, the exact same time when the public was first being inundated with movies about spacemen, and <i>also</i> the exact same time when the Air Force really did start doing all sorts of aerial shenanigans that it tried to keep secret.</p>\n<p>Yet again and again and again, the previous cases, when they could be resolved at all, had ordinary terrestrial explanations.  Of course I don&#8217;t <i>know</i> that the same will be true this time around &#8230; but at some point, it becomes like the story of the guy who used to believe that lightning came from an angry Zeus, but then someone teaches him Maxwell&#8217;s equations, so he revises his belief to say that <i>most</i> lightning is explainable by Maxwell&#8217;s equations, and only <i>some</i> of it comes from angry Zeus.</p>\n<p>It&#8217;s like, try to step back for one minute from the immediate puzzle!  Look instead at the reference class of similar puzzles, and try to find general principles that would give the right answers for most of them!  Think about it like a Bayesian!  (This, not coincidentally, is exactly what I recommended years ago for <a href=\"https://www.scottaaronson.com/blog/?p=1596\">thinking about the JFK assassination</a>.)</p>\n]]>", "author": "Scott", "published": "2017-12-20 00:22:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Gatekeepers #25:</p>\n<ul>Prediction: the moratorium won’t last in any meaningful way. You yourself seem to hint at that when you say “exceptions can be made when and if there’s a serious claim to have achieved quantum supremacy, or in other special cases”.</p>\n<p>That “special case” provision is so vague that it can encompass almost anything.</p>\n<p>The spotlight is addictive. Instead of denying your love affair with the popularization of computer science ideas, you should embrace it wholeheartedly. You could be the Carl Sagan of computer science in this age, if you wanted to.</ul>\n<p>That sounds nice, but if I wanted to achieve even 1% of Sagan&#8217;s productivity at (e.g.) writing popular books, then I&#8217;d indeed need to become much more ruthless at managing my time!</p>\n<p>I <i>will</i> be passing off almost all media requests this year to my colleagues, because that&#8217;s something I want to try, and because this post will let me.  But even if I only passed off (say) half of them, writing the post would still have been a win in terms of time.</p>\n]]>", "author": "Scott", "published": "2017-12-20 00:29:39+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #50:</p>\n<p>Somehow I don&#8217;t think boo actually meant that seriously, and instead was trying to imitate your FAQ&#8230;</p>\n]]>", "author": "Sniffnoy", "published": "2017-12-20 00:44:12+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Scott #51</p>\n<p>I think you should definitely consider becoming &#8220;Carl Sagan&#8221;-like. In fact, forget about &#8220;Carl Sagan&#8221;, each of us is different. I don&#8217;t like when I am asked to be like &#8220;someone else&#8221;, so I don&#8217;t like to ask others to do so.</p>\n<p>My point here is that it seems you have a knack for communicating computer science ideas to the public at large that escapes other experts in the field of theoretical computer science. From personal experience having worked with, and continue to work with, very smart technical people, not everybody in computer science has this gift. It&#8217;s already hard to have experts in computer science understand each other points when they discuss non trivial issues. Having the public know about these issues in very important, particularly given that debates about what AI will accomplish or its limits aside, I have no doubt that we are in a path in that will make the computer systems of tomorrow even more complex than those of today. And their impact in society will also be greater. At the same time, and this is something that Carl Sagan mentioned during one of his last interviews, it seems that the ability of the public at large to understand these issues seems going down. I have stopped counting the number of conversations that I have tried to have with regular folks about the danger of Google, Apple and the like tracking everybody&#8217;s smartphone GPS position data that can be correlated with their identity and online tracking only to be told &#8220;I have nothing to hide, I don&#8217;t care&#8221;. I get the feeling that if these same people were asked to live with a video camera taping their daily lives at home they would not be as understanding and yet, I find the former type of tracking way more dangerous for privacy. My take is that most regular folks do not understand computing on large amounts of data as a technology.</p>\n<p>On a more personal note, when I was growing up, I got a lot of inspiration from Carl Sagan&#8217;s documentaries. Nobody in my family had ever pursued a career in science so other than the encouragement I got from my high school teachers, Carl Sagan was the closest I had as an informal mentor as I navigated college life and beyond.  </p>\n<p>So all this to say that becoming a public computer science intellectual could be, depending on your personal preferences of course, more rewarding than leading an obscure intellectual life that gets rewarded with things like membership in the National Academy of Engineering or the National Academy of Science. The public doesn&#8217;t generally know who these people are and very few of them are remembered after their deaths unless they have done something of significance that affects society at large. I bet Carl Sagan has had more impact for science as a whole through the number of people he inspired to become scientists or engineers than most of the people who were elected to the National Academy of Science at the time he was refused membership to the same.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2017-12-20 06:31:14+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Scott this is my theory. Part of the $22million was spent on this footage to increase credibility of the program?</p>\n<p>Plausible? Or is this one of the rare Zeus jolts (I am taking your exceptional Zeus jolts literally that they come from Zeus (unless you imply something else))?</p>\n]]>", "author": "boo", "published": "2017-12-20 08:23:01+00:00", "title": "By: boo"}, {"content": "<![CDATA[<p>Something that&#8217;s been annoying me about the AI risk community is the use of unnecessary specialized jargon counterproductive to communicating with a wide audience. The worst is &#8220;singleton&#8221;, &#8220;hegemon&#8221; is the term of art everywhere else, and I see no obvious reason not to use it other than a desire to signal one&#8217;s membership in the AI risk community. </p>\n<p>And while I detest the Great Mouse of Darkness as much as anyone, it seems to me that referencing &#8220;paperclip maximizers&#8221; and either explaning what that means at length or hoping that your listeners will be bothered to google the phrase is a bit silly when one could just refer them to the <a href=\"https://www.youtube.com/watch?v=UEYy3osi8Gs\" rel=\"nofollow\">single most famous animated short of all time</a>.</p>\n]]>", "author": "xyz", "published": "2017-12-20 08:45:20+00:00", "title": "By: xyz"}, {"content": "<![CDATA[<p>I think it&#8217;s absolutely imperative that Scott immediately break his moratorium in order to comment on these new revelations about his oven.</p>\n]]>", "author": "Dan Staley", "published": "2017-12-20 19:46:27+00:00", "title": "By: Dan Staley"}, {"content": "<![CDATA[<p>xyz #55:</p>\n<p>Are “singleton” and “hegemon” related?</p>\n<p>I thought  “singleton” was a OOP GOF Pattern (to use some unnecessary jargon), and “hegemon” was something PoMoPoPo&#8217;s (Post Modern Political Posers) yammered about.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-12-20 20:35:34+00:00", "title": "By: Raoul Ohio"}]