[{"content": "You are naughty Michael ;) You could not hold your temptation to write another post on ranking. Postpone the STOC deadline by one more week. This is too much distraction.", "author": "Anonymous", "published": "2014-10-28 13:46:19.245000-04:00", "title": ""}, {"content": "I admit, this ranking post is simply because the others have been so much fun to read, I don&#39;t want it to stop.  Though it appears others (in particular those participating) have had more than their fill...", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-10-28 15:41:31.886000-04:00", "title": ""}, {"content": "Well, Luca has shut down the comments in his blog, so probably those will be spread to your blog!<br /><br />To start fueling the fire, let&#39;s hear your comment on the theory ranking :-)<br /><br />http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-science-schools/computer-theory-rankings", "author": "Anonymous", "published": "2014-10-28 16:13:50.840000-04:00", "title": ""}, {"content": "To help people to invent, prove/disprove new theory of ranking, here is a summary of the lessons we have learnt.<br /><br />1. Never ever post a ranking in which your school stands high. UCSD beware!<br /><br />2. Ranking is worthless. People are obsessed with worthless stuffs.<br /><br />3. Write papers with 4 or 6 authors but never with 5. 5 is evil, it can suddenly reduce your SODA count from 27 to 8.32.<br /><br />4. Posting anonymously is our birth right. Boaz cannot take that away from us.<br /><br />5. If you are not from top-4 schools, be prepared to face selection bias in faculty hiring. Luca thinks this is bullshit citing UC Berkeley hired him from University of Rome.<br /><br />This is a blog post by n anonymous, so the post should only count as 1/n.<br /><br />Finally, a contribution from this blog: postpone STOC deadline due to war of rankings. ", "author": "Anonymous", "published": "2014-10-28 17:47:28.995000-04:00", "title": ""}, {"content": "I found it more amusing than anything, although I am sure the people involved did not appreciate the more personal attacks.<br /><br />I tend to agree with Boaz and Luca, that the number of papers metric is too easily gamable and probably already has too much influence. You can&#39;t completely remove human judgement or reputation out of the loop. <br /><br />Perhaps a good idea is to take the average of the two rankings ... After normalizing for number of faculty, number of co-authors, etc ...<br /><br />Or perhaps it is better to just not take rankings TOO seriously. Yes, MIT is probably a better place to do theoretical computer science than the University of Florida (to pick a random example), but is it really that much of a better place than Stanford, Berkeley or Princeton? My feeling is that a student or professor could more or less do equally well at any of these places, even if some are &quot;lower ranked&quot; than others.", "author": "rweba", "published": "2014-10-28 20:06:36.965000-04:00", "title": ""}, {"content": "To Anonymous@ 5:47 PM:<br /><br />- I don&#39;t get your point 3. Where does the number 5 comes from?<br /><br />- For point 5, I thought the argument was that unless you are a superstar and you are interviewing top school, you probably will face selection bias.<br /><br />- I strongly agree that we should postpone the STOC deadline. There is a war going on!<br />", "author": "Anonymous", "published": "2014-10-28 22:17:11.646000-04:00", "title": ""}, {"content": "Sariel&#39;s deranker is by far the best ranking system that I have ever seen, although it has the drawback that it takes exponential time to converge to the correct ranking.<br /><br />Unfortunately, an average case analysis performed over a random user shows that this is best possible.", "author": "Luca", "published": "2014-10-29 01:44:04.691000-04:00", "title": ""}, {"content": "To continue on the hunorous side, more things we learned:<br /><br />1. US News reputational rankings are perfect except when they are not, which only proves that reputational rankings are perfect.<br /><br />2. Don&#39;t experiment with new ideas, instead we&#39;ll all just pretend that rankings don&#39;t exist.<br /><br />3. If a star researcher at a top university has no need for rankings, then no one else does either.<br /><br />4. If your first ranking attempt fails, quit and never try again.<br /><br />5. When debating, if all else fails just point out that the comment was anonymous.<br /><br />6. A single departmental ranking would be enough for people to profoundly change the way they do research.<br /><br />6. If we were to have a paper count at STOC/FOCS ranking then people would try to get many papers there, whereas presently they don&#39;t. <br /><br />7. If only I had a dime for every time I&#39;ve heard someone say &quot;not another STOC paper again, where did it all go wrong?&quot;", "author": "Anonymous", "published": "2014-10-29 09:24:22.552000-04:00", "title": ""}, {"content": "CS rankings are terrible. I can not believe that Harvard is better than UC Berkley or Stanford in computer science.. no way..", "author": "Anonymous", "published": "2014-10-30 16:38:51.003000-04:00", "title": ""}, {"content": "Anonymous #9:  Quit trolling.  Of course Harvard is better.  :)", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-10-30 17:51:05.760000-04:00", "title": ""}, {"content": "they forgot to add a &quot;0&quot; behind &quot;2&quot; while ranking Harvard. Just because Harvard has other good departments, does not mean it has the best CS or Engineering department. Harvard engineering sucks even more. This USNews ranking is a complete garbage. Even TCS authorities admit that :)<br /><br />Similarly when someone says, hey! Stanford theory group is great comparable to MIT, I just can&#39;t stop laughing. Do you even know how many active theory researchers does Stanford have compared to MIT? Go figure.", "author": "Anonymous", "published": "2014-10-31 10:40:14.806000-04:00", "title": ""}]