[{"content": "heartily agree! the profile is a kind of a breakthru. its so great to see a well adjusted/ thriving genius in contrast to the hollywood variety. or even others who seem to have some &quot;personal challenges&quot; eg Perelman (still a hero). the article didnt even mention his recent $3M millenium prize, a sort of gaping omission.<br />also tao&#39;s blog is an international treasure &amp; really commend his extremely openminded/ light hand commenting policies.<br />his recent contribution on zhangs advance &amp; polymath involvement is also quite notable. it seems the article left out all kinds of juicy stuff. should have been longer. but maybe tao is too humble &amp; writer didnt do all the homework, or newspaper space constraints were too much.<br />see also <a href=\"https://vzn1.wordpress.com/2014/11/14/star-studded-cash-overflowing-2015-breakthru-prizes/\" rel=\"nofollow\">star-studded, cash-overflowing 2015 breakthru prizes</a>", "author": "vzn", "published": "2015-07-25 09:26:19.830000-07:00", "title": ""}, {"content": "The way Hollywood operates we need to drive over his dog for them to do the movie. There has to be some tragedy in there for them to be interested.<br /><br />Maybe some independent filmmaker will take on the challenge, since his personal story is certainly worth filming and very much counter to the mad-scientist stereotype. Terry is a nice, easy going and otherwise normal guy---&quot;otherwise normal&quot; in the sense of &quot;other than perhaps being the most remarkable mathematical mind since Poincare&quot;. ", "author": "Anonymous", "published": "2015-07-25 09:40:33.509000-07:00", "title": ""}, {"content": "@vzn:  I hope the NYT article spurs others to cover the many other facets and factoids of Terry Tao with equal thoughtfulness. <br /><br />@anon: I agree that for an insightful filmmaker, there is a lot to tease out in Terry&#39;s story, within the &quot;otherwise normal&quot; arc the NYT reporter has created, or beyond. <br /><br />-- Metoo", "author": "Anonymous", "published": "2015-07-26 12:39:12.798000-07:00", "title": ""}]