[{"content": "<![CDATA[<p>Stella #18</p>\n<p>I&#8217;m actually looking at things from the simulator&#8217;s point of view 😛</p>\n<p>When it comes to regular smooth functions, I would think that the cost of evaluating the function over a certain small window, for a given number of samples, and for a given relative precision, should be independent of scale/zoom level.<br />\nEspecially considering that given a sufficient zoom level, all smooth functions become linear.</p>\n<p>There should be a way to show that transforming the input dimensions so that the domain of interest is now centered around zero (making sure that all numbers can be expressed more compactly) guarantees a constant cost. But I&#8217;m not sure how to express that yet.<br />\nBasically if you&#8217;re using floats for your simulation, you want the computations to be done around the zero, so that all your bits can be put to good use for maximum precision (instead of &#8220;wasted&#8221; in the distance to origin).<br />\nNote that here I&#8217;m talking about doing things in a small window of interest (x0 +/- dx), I&#8217;m not talking about another type of issue when doing a simulation both at a large scale and small scale at once, e.g. when you try to simulate the entire galaxy, at a precision of a few inches (you then have to use some hierarchical scheme).</p>\n<p>When it comes to fractals (involving non-obvious recursive functions), you would think that the cost of rendering the same relative area at different zoom level should be constant as well (assuming you&#8217;re hitting the average density of interest).<br />\nCreatures living at 10X zoom level or 1,000,000 times zoom level see a world that has roughly the same characteristics, by definition of fractals.<br />\nSo, the cost of rendering the same relative area, at same relative precision, should be independent of scale as well, by some transformation&#8230; I just don&#8217;t want to have to re-implement arithmetic for arbitrary precision!</p>\n]]>", "author": "fred", "published": "2018-07-30 22:04:23+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Rhenium #19: Such outreach sounds like it could be interesting!  But I’m honestly not sure what you’re referring to.</p>\n]]>", "author": "Scott", "published": "2018-07-31 01:19:57+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Dear Scott,</p>\n<p>reading about the complexity of quantum operations reminded me of a question on Stackexchange I bookmarked a long time ago, and which completely puzzled me:<br />\n<a href=\"https://cstheory.stackexchange.com/questions/23766/why-is-bqpspace-in-pspace-if-it-can-have-doubly-exponentially-long-running-times\" rel=\"nofollow\">https://cstheory.stackexchange.com/questions/23766/why-is-bqpspace-in-pspace-if-it-can-have-doubly-exponentially-long-running-times</a><br />\nBasically, say I have a classical TM counting on a tape, it can count to exp(length of the tape). That is clearly in PSPACE. But in BQPSPACE, I could count to exp(exp(length of tape)), no? Or does that again depend on the representation of the number?</p>\n<p>Greetings,<br />\nSven</p>\n]]>", "author": "Sven Gunnarson", "published": "2018-07-31 13:43:51+00:00", "title": "By: Sven Gunnarson"}, {"content": "<![CDATA[<p>Sven #22: You could only do that using a probabilistic/approximate counting algorithm.  And if you were OK with such an algorithm, you could also get one classically, with no QM needed.  For deterministic counting, what’s relevant is not the number of nearly pairwise-orthogonal states (which is indeed doubly exponential in QM), but the number of exactly pairwise-orthogonal states (which is “merely” singly exponential).</p>\n]]>", "author": "Scott", "published": "2018-07-31 15:30:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;&#8230; the Hawking and Penrose singularity theorems &#8230;&#8221; After quantum averaging, are Einstein&#8217;s field equations 100% correct? The empirical successes of Milgrom&#8217;s MOND might indicate that something is seriously wrong with Newtonian-Einsteinian gravitational theory. Google &#8220;kroupa milgrom&#8221;, &#8220;mcgaugh milgrom&#8221;, &#8220;sanders milgrom&#8221;, and &#8220;scarpa milgrom&#8221;.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Brown:David.html\">David Brown</a>", "published": "2018-07-31 23:01:54+00:00", "title": "By: David Brown"}, {"content": "<![CDATA[<p>Scott</p>\n<p>Can you refer to the most up to date survey or a book on quantum computer hardware/design? A text written for physicists would be great.</p>\n<p>thanks<br />\na.</p>\n]]>", "author": "Argyn", "published": "2018-08-02 18:04:47+00:00", "title": "By: Argyn"}, {"content": "<![CDATA[<p>Argyn #25: I&#8217;m not sure.  While the underlying principles haven&#8217;t changed all that much since Nielsen &#038; Chuang, QC hardware is evolving sufficiently quickly right now that I&#8217;m not sure if there&#8217;s <i>any</i> book that&#8217;s really up to date.  (That&#8217;s why we have the arXiv!)  Would anyone else like to field this one?</p>\n]]>", "author": "Scott", "published": "2018-08-03 00:06:10+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, when will you post your take on the work of the recently announced Fields medalists? It would be interesting to hear how and to what extent their work has influenced your own.</p>\n]]>", "author": "Hong-Konger", "published": "2018-08-03 02:35:18+00:00", "title": "By: Hong-Konger"}, {"content": "<![CDATA[<p>Hong-Konger #27: I’m not qualified to comment on the work of any of the four new Fields Medalists.  I was just reading about them today, going back and forth among Quanta magazine, Wikipedia, and the abstracts of some of their papers to try to get a sense.  The problems are obviously very far removed from anything I’ve worked on.</p>\n<p>The Nevanlinna winner, Costis Daskalakis, by contrast, is a former colleague of mine from the theory group at MIT.  I know him quite well, and also know some of his great results—most famously on the hardness of finding Nash equilibria, but also some of his other stuff on e.g. the complexity of auctions.  Huge congratulations to Costis!</p>\n]]>", "author": "Scott", "published": "2018-08-03 04:10:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8216;For your second question: yes, if the Chooser has oracle access to the Predictor, then Newcomb’s problem leads to a flat-out logical contradiction, just as you say. In the usual setup, however, the Chooser does not have access to the Predictor: the Chooser is “ordinary” (we’re to imagine a being much like ourselves), and the Predictor is flat-out more powerful. In that case you don’t get a contradiction (at least, not without some additional assumptions from decision theory), but “merely” a very interesting dilemma faced by the Chooser.&#8217;</p>\n<p>Thanks for your response, I appreciate your time! That makes sense. Is it possible to simply know if the Predictor is or is not &#8220;halted&#8221; within the bounds of the paradox? To me, being able to know the answer to that question at any time T I choose is essentially the same thing as being able to peer inside the Predictor, maybe examine source code, or do other actions to determine if it will &#8220;halt&#8221; in the future. Because, regardless of how much &#8220;access&#8221; I have to the Predictor, the Predictor&#8217;s job is still essentially the same (&#8220;will I halt at time T?&#8221;). I don&#8217;t know how &#8220;time&#8221; formally plays into the bounds of the paradox, but I envision &#8220;reducing&#8221; myself to a very simple &#8220;machine&#8221; w.r.t. the Predictor:</p>\n<p>1.) I walk into the room. There are two boxes and I can pick box b or both a & b.</p>\n<p>2.) I wait some amount of time T which I determine at random in the moment (maybe I pick it beforehand, maybe I just stand around awhile until I feel like making my observation). At the end of that time, I observe if the Predictor has &#8220;halted&#8221;. Maybe there&#8217;s a glowing red LED on the front and I observe whether or not that LED is still lit to determine if it has &#8220;halted&#8221;, or some other set of physical indicators that show the machine&#8217;s current state. This requires me to know &#8220;something&#8221; about the Predictor, but I don&#8217;t need to know anything beyond what I can physically observe in the moment. If the Predictor is some super-intelligent being, then I observe whether or not said being is &#8220;alive&#8221; at the moment.</p>\n<p>3.) If the Predictor has &#8220;halted&#8221;, I take both boxes. Otherwise I take box b.</p>\n<p>It seems that if I want to limit this to a purely decision-theory problem, it&#8217;s necessary to completely isolate the Predictor from me so I can&#8217;t make a decision based on its current observed state. It also seems that by making my decision in this way, I win because an inherent property of the Predictor seems to be that it doesn&#8217;t halt/die at random points in time. Hence predicting that it will be &#8220;alive&#8221;/not halted is a safe bet. Also, this implies that &#8220;oracle&#8221;-like access to the Predictor is, in the context of this problem, essentially the same as being able to observe the Predictor&#8217;s current state in some way.</p>\n]]>", "author": "Andrew", "published": "2018-08-09 05:22:04+00:00", "title": "By: Andrew"}, {"content": "<![CDATA[<p>@Andrew 29:<br />\nAssuming the usual rules, the Predictor has already halted by the time you are offered the choice. Allowing you to choose before then would defeat the purpose, since the eventual &#8220;prediction&#8221; would be of an action you&#8217;ve already taken.</p>\n]]>", "author": "Ben Standeven", "published": "2018-08-09 17:48:04+00:00", "title": "By: Ben Standeven"}]