[{"content": "<![CDATA[<p>Douglas Knight #4, when I spoke with Geordie he told me that the off the shelve fridges were not at all good enough at the beginning, but rather then building their own they partnered with the fridge makers to improve them (I assume using some cross-licensing agreements).</p>\n<p>He also hinted that he wants to lower the temp further.</p>\n]]>", "author": "quax", "published": "2014-02-07 04:59:18+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Scott,  what do you make of the claim, put forward by <a href=\"http://arxiv.org/pdf/1401.1546.pdf\" rel=\"nofollow\">Helmut Katzgraber et al.</a>, that the current benchmarks are using the wrong problem set to possibly find a quantum speed-up with D-Wave&#8217;s machine?</p>\n]]>", "author": "quax", "published": "2014-02-07 05:08:06+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>@quax:</p>\n<p>Is he proposing the benchmark that would be right & fair? I read the paper but wasn&#8217;t sure. </p>\n<p>A lot of this sounds like a religious belief / faith that what we have here is definitely a hammer and only if we look hard enough we are sure to find the right nail.</p>\n]]>", "author": "Rahul", "published": "2014-02-07 05:28:48+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>About the tormented relationship between journalism and quantum computing: I&#8217;ve recently found, on an italian newspaper, <a href=\"http://www.ilfattoquotidiano.it/2014/02/01/pc-quantistici-dalla-astronomia-alla-ricerca-ci-cambieranno-la-vita/863437/\" rel=\"nofollow\">an article about quantum computers</a>.</p>\n<p>There is a picture of some galaxy on the top, and the first 2 sentences of the article are:</p>\n<p><i>&#8220;Potrebbe essere una delle cinque scoperte capaci di trasformare il mondo. Rendere possibile contare le stelle dell’Universo in appena qualche ora&#8230;&#8221;</i></p>\n<p>which means:</p>\n<p><i>&#8220;It could be one of the five discoveries able to change the world. It would make possible to count the stars of the Universe in just few hours&#8230;&#8221;</i></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Camerani:Giorgio.html\">Giorgio Camerani</a>", "published": "2014-02-07 13:33:50+00:00", "title": "By: Giorgio Camerani"}, {"content": "<![CDATA[<p>It isn&#8217;t really important for this discussion, but dilution refrigerators have reached temperature just below 2 mK in continuously operating, macroscopic, solid state systems (if you are willing to ignore atom traps as being microscopic and out of equilibrium).  Nuclear demagnatization refrigerators have reached 10s of microkelvin in thermal equilibrium, but in single shot mode.  Below that temperature, the idea of &#8216;temperature of a block of metal&#8217; breaks down: the lattice vibrations, electrion motion, and nuclear spins decouple.  Nuclear demagnatization can reduce the nuclear spin temperature to below a nanokelvin, but that isn&#8217;t thermalized to the phonons and electrons.  Of course atom traps reach comparable temperatures, and are likewise out of equilibrium.</p>\n<p>The reason commercially available fridges weren&#8217;t suitable for D-wave is probably a number of factors:  The fridges large enough to handle their wiring load didn&#8217;t used to get cold enough &#8212; 20-30 mK was more common, and it could be worse once you add the hundreds of wires needed to operate a complex circuit like their devices.  Also, commercial fridges have usually come with zero or minimal magnetic and RF shielding, leaving that up to individual researchers to add in to their taste.  The d-wave machine, like all squid circuits, is *extremely* sensitive to stray magentic flux, and I believe they use multiple layers of magnetic shielding and also active field cancellation.</p>\n]]>", "author": "Evan", "published": "2014-02-07 17:39:24+00:00", "title": "By: Evan"}, {"content": "<![CDATA[<p>Evan #19: Thanks so much for clarifying!</p>\n]]>", "author": "Scott", "published": "2014-02-08 01:42:03+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, just a question in general, and I&#8217;m curious where you stand on this; let&#8217;s say there&#8217;s a company (not Dwave) that succeeded in creating a quantum computer &#8211; for real, but this will result in some groups losing their funding in quantum research including yours.  What&#8217;s your reaction to losing the research and projects even though the new technology has enormous benefits to humanity?</p>\n]]>", "author": "ramsey66", "published": "2014-02-08 09:18:23+00:00", "title": "By: ramsey66"}, {"content": "<![CDATA[<p>ramsey66, your hypothetical scenario is completely bizarre for the following reason: if someone built a practical QC, that would <i>increase</i> funding for academic QC research, not decrease it!  I mean, it&#8217;s not like classical CS research dried up once the first digital computers were built.  Instead it <i>exploded</i>, from Alan Turing and a few friends to tens of thousands of people.  After all, we still needed to figure out what classical computers were <i>good for</i>, and how to program them.  Likewise, I expect that practical QCs would enormously <i>increase</i> funding agencies&#8217; interest in what we can and can&#8217;t do with QCs, which is the main question that I&#8217;ve been interested in since the beginning.</p>\n<p>Having said that: if, somehow, there would be &#8220;enormous benefits to humanity,&#8221; but only if I abandoned QC research forever, then I like to think that I&#8217;d be man enough to accept that trade, and spend the rest my career studying (say) classical complexity only.  And if I had to abandon <i>all</i> research?  Well, fortunately, I already have tenure&#8230; <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Scott", "published": "2014-02-08 13:15:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Thanks Scott, I think I have a better understanding of your work and what you do.  You should continue being a chief Dwave critic or Quantum critic in general unless your busy that is.  I have a feeling that this debate will only get intense down the road.  My only concern sometimes is when it gets too intense and colourful (that&#8217;s speaking about everybody) that it distracts us from the real science involved and may deteriorate our ability to have a clear conversation. Not to mention the confusion in the media and general public.  But I think it&#8217;s better now compared to how it all started <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "ramsey66", "published": "2014-02-08 22:29:12+00:00", "title": "By: ramsey66"}, {"content": "<![CDATA[<p>I suspect that part of the problem is that D-Wave gets covered by tech-beat journalists, rather than science/&#8217;ideas&#8217; section journalists. If you&#8217;re a tech-beat reporter then you&#8217;re used to justifiably treating NASA and Google as pretty heavy-hitting epistemic authorities in the domain of your reporting, and might see a disagreement between the tech developers of a company backed by NASA and Google and top academics as a standoff.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Grietzer:Peli.html\">Peli Grietzer</a>", "published": "2014-02-11 06:15:57+00:00", "title": "By: Peli Grietzer"}, {"content": "<![CDATA[<p>If quantum computing were to take place it would need to account for paradox&#8230; the second level of paradox at least.  In order to accomplish that the device would need to &#8216;peer&#8217; into a wave&#8230; not just respond to it.  Unfortunately that would require awareness as only awareness can focus its attention &#8216;in&#8217;.  Consciousness, even in a computer, is linear and as such unable to qualify for such attention.</p>\n<p>For more on that see link below&#8230;</p>\n<p><a href=\"http://whoneedsthehiggs.blogspot.com/\" rel=\"nofollow\">http://whoneedsthehiggs.blogspot.com/</a></p>\n<p>Respectfuly<br />\nRobert McCoy<br />\n<a href=\"mailto:bommac123@gmail.com\">bommac123@gmail.com</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/McCoy:Robert.html\">Robert McCoy</a>", "published": "2014-02-11 16:34:40+00:00", "title": "By: Robert McCoy"}, {"content": "<![CDATA[<p>That&#8217;s very interesting, Robert, you keep working on it and don&#8217;t get discouraged by people who may call you a crank. Why would they even say that?</p>\n]]>", "author": "Vadim", "published": "2014-02-11 17:01:20+00:00", "title": "By: Vadim"}, {"content": "<![CDATA[<p>Very good Vadim&#8230; but &#8216;personal&#8217; attacks are not an argument.  Arguments can only occur if an individual is willing to investigate that which they are arguing &#8216;against&#8217;&#8230; so to speak.  So by all means read my &#8216;argument&#8217; and then feel free to disassemble it with logic.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/McCoy:Robert.html\">Robert McCoy</a>", "published": "2014-02-11 17:06:50+00:00", "title": "By: Robert McCoy"}, {"content": "<![CDATA[<p>Robert,</p>\n<p>I&#8217;ve looked at your site and it&#8217;s just metaphysical rambling; there&#8217;s nothing in there worth taking seriously enough to bother arguing. It&#8217;s a lot like the Time Cube thing but at least the text isn&#8217;t as big.</p>\n]]>", "author": "Vadim", "published": "2014-02-11 18:07:15+00:00", "title": "By: Vadim"}, {"content": "<![CDATA[<p>Actually there are several points worth taking on.  One is that linear waves produce linear &#8216;effects&#8217;&#8230; therefore &#8216;non-linear&#8217; effects would have to be the product of something of a &#8216;non-linear&#8217; origin&#8230; IE: coming from a non-linear direction.   So if an individual wishes to create a quantum &#8216;effect&#8217; it stands to reason that they should be &#8216;looking&#8217; in a non-linear direction.  As such the blog has much to offer in that regard for the individual who is interested in a direct experience of such&#8230; in addition to the &#8216;argument&#8217;.</p>\n<p> If it is true that non-linear effects come from a non-linear direction then direct knowledge of such would be profound&#8230; and they would have &#8216;serious&#8217; effects on the discussion of quantum computing&#8230; IMO.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/McCoy:Robert.html\">Robert McCoy</a>", "published": "2014-02-11 19:33:42+00:00", "title": "By: Robert McCoy"}, {"content": "<![CDATA[<p>If there&#8217;s a fast-lane to getting banned on Shetl, Robert McCoy&#8217;s webpage link ought to be self-recommending. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Rahul", "published": "2014-02-11 20:19:12+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul&#8230; once again, ridicule is not an argument.  The question is quite simple&#8230; if a non-linear quantum effect is desired should not &#8216;that&#8217; which is effected be looking in a non-linear direction?&#8230; be it a computer or a human?</p>\n<p> I would submit that if a quantum computer is unable to &#8216;look&#8217; in a non-linear direction then just what is it doing?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/McCoy:Robert.html\">Robert McCoy</a>", "published": "2014-02-11 20:33:42+00:00", "title": "By: Robert McCoy"}, {"content": "<![CDATA[<p>If he is wrong, why exactly?  Vadim? Rahul?</p>\n]]>", "author": "Farmfresh", "published": "2014-02-12 00:19:48+00:00", "title": "By: Farmfresh"}]