[{"content": "<![CDATA[<p>Is there a transcript?</p>\n]]>", "author": "jonas", "published": "2016-07-03 20:26:41+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>jonas #1: Sorry, no!  When I post a transcript, people complain that there&#8217;s no video; this time there&#8217;s video but no transcript.  Anyway, thanks for commenting!</p>\n]]>", "author": "Scott", "published": "2016-07-03 22:15:31+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>It never occurred to me to actually think about why the term &#8220;firewall&#8221; was being used in this context (black hole firewall paradox). I thought your explanation was very clear, and I now appreciate the importance of this question a lot more. Does the involvement of those special one-way functions you described in the possible resolution of the paradox (making the computations take inordinate amounts of time) change how you feel about the possible existence of said functions?</p>\n]]>", "author": "Ian", "published": "2016-07-04 03:31:57+00:00", "title": "By: Ian"}, {"content": "<![CDATA[<p>Ian #3: No, I was and remain extremely confident that OWFs exist.  From a pure theoretical computer science perspective (i.e., ignoring the black hole aspect), this is simply yet another hardness construction based on OWFs, very far from the most surprising or dramatic one.</p>\n]]>", "author": "Scott", "published": "2016-07-04 07:52:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I watched the discussion and enjoyed it well enough.</p>\n<p>I would normally pass on black-hole thought experiments, but the computational argument in there is intriguing.</p>\n<p>I imagine that we can&#8217;t just go from computationally-hard to physically-impossible, though the paper&#8217;s abstract suggests that it was viable in this case:</p>\n<blockquote><p>We argue that the quantum computations required to do these experiments take a time which is exponential in the entropy of the black hole under study, and we show that for a wide variety of black holes this prevents the experiments from being done.</p></blockquote>\n<p>How did they manage that? (No, i don&#8217;t want to read the paper)</p>\n]]>", "author": "Job", "published": "2016-07-06 07:40:28+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>Job #5: In most cases, by arguing that the black hole would&#8217;ve already evaporated anyway, long before the experiment was complete.</p>\n]]>", "author": "Scott", "published": "2016-07-06 13:04:28+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #6</p>\n<p>maybe we could also start to rely more on the argument &#8220;the human race will have vanished anyway, long before experiment xyz is complete&#8221;.</p>\n]]>", "author": "fred", "published": "2016-07-06 13:12:28+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Finally able to take a little bit and watch this video after the 4th of July weekend and glad I did 🙂</p>\n<p>I really enjoyed Scott&#8217;s characteristic humor on display with Harlow cracking up throughout the talk.  Scott being an expert in the, &#8220;field of what we couldn&#8217;t do even with computers we still don&#8217;t have&#8221; haha</p>\n<p>One thing that strikes me about why those who appeal to computational complexity for why they don&#8217;t think the firewall is a problem after all is that this seems to me at base an appeal to the non-existence of counterfactual definiteness.  That we don&#8217;t have to worry about whether spacetime breaks down at the singularity or at the event horizon because even in principle this can never be *observed* and the underlying assumption is that things that can not in principle be observed are &#8220;not a problem.&#8221;</p>\n<p>When it comes to the multiverse and other in principle non-observables a lot of scientists wave there hands and say that this not worth the time even thinking about&#8230; but here we have something in our own universe where lots of folks intuitively believe in counterfactual definiteness and computational complexity is swooping in to put the firewall in the realm of non-existent due to not being observable.</p>\n<p>I don&#8217;t believe in counterfactual definiteness, but I wonder if a lot of the physicists/computer scientists who hold the firewall as &#8220;not a problem&#8221; are introspecting on how they are relying upon the non-existence of counterfactual definiteness.</p>\n]]>", "author": "adamt", "published": "2016-07-06 15:35:31+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<blockquote><p>In most cases, by arguing that the black hole would’ve already evaporated anyway, long before the experiment was complete.</p></blockquote>\n<p>Don&#8217;t you have to exclude the possibility that a given instance might turn out to be efficiently solvable even though the problem is computationally difficult?</p>\n<p>Also, if the problem is in NP you could still try solutions at random. The odds of success would be extremely low, but non-zero, so there would still be a minute possibility of being able to carry out the experiment.</p>\n<p>What would happen then?</p>\n]]>", "author": "Job", "published": "2016-07-07 02:41:20+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>In the same vein as Job #9: what if we construct specific black holes designed such that the odds of success would be high? Should we imagine firewalls appear if and only if the instance turn out feasible?</p>\n]]>", "author": "Jay", "published": "2016-07-07 20:37:47+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>A question I&#8217;ve been pondering is if their is some minimal change to the laws of physics (ie, changes to the speed of light or gravitational constant) that would make the computational complexity of Alice&#8217;s job commensurate with her jumping into the blackhole before it evaporates and thus either running into the firewall or not?</p>\n<p>Kinda like #9 and #10, but different in that if the answer to the above were affirmative, then this would imply that the computational complexity &#8220;answer&#8221; to the firewall problem is just an anthropic argument in disguise, no?</p>\n]]>", "author": "adamt", "published": "2016-07-07 21:11:53+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<p>Job #9 and Jay #10: A 10<sup>10^(-70)</sup> probability of creating a firewall no one really worries about, since quantum mechanics gives similar probabilities for a cheetah materializing in your living room and all sorts of other such events.</p>\n<p>And yes, we can&#8217;t rule out the possibility that the laws of quantum gravity would have some miraculous symmetry that made the &#8220;real&#8221; problem easy with high probability, even though the general case was hard.  But if you look at the problem, it looks more likely that the opposite would be true&#8212;i.e. that the &#8220;real&#8221; problem would be even HARDER than the special cases for which we&#8217;re able to give hardness reductions!  I&#8217;ll have lecture notes online very soon that explain it in more detail.</p>\n]]>", "author": "Scott", "published": "2016-07-07 21:50:03+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #12, that doesn&#8217;t sound very satisfying because cheetahs and firewalls are very different: one is commensurate with known laws of physics while the other seems to present a paradox asking us to give up some of our assumptions.  Infinitesimal probability does not the paradox fix.</p>\n]]>", "author": "adamt", "published": "2016-07-07 22:02:23+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<p>Adam #11: There are changes to the laws of physics (e.g. turning off gravity) that would give you no black holes, let alone no firewalls.  But I don&#8217;t typically regard statements about black holes as anthropic preconditions for my own existence!</p>\n<p>Adam #13: No, they&#8217;re totally commensurate.  I&#8217;ll even make a stronger statement: given what we know about QFT and GR, there&#8217;s a 10<sup>10^(-70)</sup> probability or whatever that a firewall (that is, a breakdown of the geometry of spacetime) will occur right in front of you, right now.</p>\n]]>", "author": "Scott", "published": "2016-07-07 22:37:06+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #14, neither do I, which is why saying it is anthropic is for me another way of saying it isn&#8217;t a very satisfying answer 😉</p>\n<p>If that is indeed what our current knowledge of QFT and GR are saying, then I&#8217;d regard this as pretty good evidence that our current knowledge is&#8230; flawed.  I can&#8217;t abide that the physical laws allow paradoxical solutions.</p>\n]]>", "author": "adamt", "published": "2016-07-07 22:51:28+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<p>Adam #15: A firewall isn&#8217;t literally a paradox.  It&#8217;s just something that you wouldn&#8217;t expect to find at an event horizon, having only made low-energy probes, on a conventional understanding of GR and QFT.  But ultimately, quantum gravity sets the rules.</p>\n<p>(If you accept the Harlow-Hayden argument, it means that the difference between quantum gravity and GR/QFT for this sort of experiment might ultimately not be observable anyway, for reasons of complexity.  But even without that, still, no literal paradox.)</p>\n]]>", "author": "Scott", "published": "2016-07-07 23:56:40+00:00", "title": "By: Scott"}]