[{"content": "<![CDATA[<p>Scott,</p>\n<p>We manage to do computational chemistry to great accuracy using classical techniques from linear algebra and functional analysis to approximate electron wavefunctions involved in chemical bonding, without needing special hardware that can model actual quantum superpositions.</p>\n<p>Could you enumerate some problems for which quantum simulation on a quantum computer would compute something useful in materials science with exponential speedup over a classical approach?</p>\n]]>", "author": "Eric Cordian", "published": "2018-06-09 14:27:27+00:00", "title": "By: Eric Cordian"}, {"content": "<![CDATA[<p>Thank you for sharing the note about Feynman. I read the letter and I was very moved by it. It confirms Feynman was the kind of genius we don&#8217;t see very much these days. In the letter, he pulled the opposite of this <a href=\"https://www.youtube.com/watch?v=ZbFM3rn4ldo\" rel=\"nofollow\">https://www.youtube.com/watch?v=ZbFM3rn4ldo</a> . In the video he was trying to tell viewers that the scientific view of beauty is more complex than the experience the average flower gazer gets. And yet, in his letter to his dead wife, while  acknowledging the incomprehensibility and irrationality of writing a letter to a dead person, he seems to cherish doing so. </p>\n<p>We human beings are too complex to be reduced to chemical reactions. And yet, this reductionist view of human beings is the one that seems to be the most popular among academics and intellectuals.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2018-06-09 19:51:46+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<blockquote><p><b>Eric Cordian</b> observes (circa #30)&nbsp; &#8220;We manage to do computational chemistry to great accuracy using classical techniques from linear algebra and functional analysis&nbsp;&hellip;&#8221;</p></blockquote>\n<p>Alań Aspuru-Guzik, Roland Lindh, and Markus Reiher survey recent radical advances in quantum simulation capability in their engaging review &#8220;<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5832995/\" rel=\"nofollow\">The Matter Simulation [R]evolution</a>&#8221; (<i>ACS Central Science</i>, 2018).  </p>\n<p>Aspuru-Guzik, Lindh, and Reiher&#8217;s analysis richly supports both the hopes of quantum supremacists&nbsp;&mdash; &#8220;It&#8217;s incredible what quantum computers <i>someday</i> will accomplish&#8221;&nbsp;&mdash; and the expectations of quantum skepticists&nbsp;&mdash; &#8220;It&#8217;s incredible what classical computers <i>already</i> can accomplish&#8221;.</p>\n<p>The species of quantum skepticism that Aspuru-Guzik, Lindh, and Reiher&#8217;s review supports might reasonably be termed &#8220;quantum metaskepticism&#8221;, with a view to conveying the notion that quantum metaskepticism relates to quantum&nbsp;skepticism, as metamodernism relates to modernism (for a survey of metamodernism, see <i>e.g.</i> Hanzi Freinacht&#8217;s on-line essay &#8220;<a href=\"https://metamoderna.org/the-difference-between-post-and-metamodernism\" rel=\"nofollow\">The Difference Between Post- and Meta-modernism</a>&#8220;).</p>\n<p>Although metamodernist ideas and objectives are trendy among philosophers nowadays, the roots of metamodernism in scientific metaskepticism date at least as far back as Spinoza (<i>circa</i>&nbsp;1664)</p>\n<blockquote><p>(<a href=\"https://www.gutenberg.org/files/3800/3800-h/3800-h.htm#chap03\" rel=\"nofollow\"><i>Ethics</i>, Part III, Proposition 2</a>)&nbsp; &#8220;No one has hitherto laid down the limits to the powers of the body [that is, matter], that is, no one has as yet been taught by experience what the body [matter] can accomplish solely by the laws of nature, in so far as she is regarded as extension.&#8221; </p>\n<p>&#8220;No one hitherto has gained such an accurate knowledge of the bodily mechanism, that he can explain all its functions; nor need I call attention to the fact that many actions are observed in the lower animals, which far transcend human sagacity, and that somnambulists do many things in their sleep, which they would not venture to do when awake: these instances are enough to show, that the body can by the sole laws of its nature do many things which the mind wonders&nbsp;at.&#8221;</p></blockquote>\n<p>In light of this celebrated Spinoza passage&nbsp;&mdash; oftimes shortened to &#8220;<a href=\"https://issuu.com/aristotelian.society/docs/james\" rel=\"nofollow\">no&nbsp;one knows what matter can&nbsp;do</a>&#8221;&nbsp;&mdash; we can be reasonably confident that Spinoza would have hilariously enjoyed the concrete analysis of Aspuru-Guzik, Lindh, and Reiher.  </p>\n<p>Needless to say, there is plenty more to be said in regard to these richly enlightening, wonderfully entangled topics.  Young researchers especially, are fortunate to be beginning their scientific careers, in an era in which the hopes of quantum supremacists and quantum (meta)skeptics alike are vibrantly alive, and alike are compatibly achievable.</p>\n]]>", "author": "John Sidles", "published": "2018-06-09 21:04:59+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Scott #25:<br />\nYeah, fixing things tends to be a bit less sexy&#8230; The other vulnerability that made a splash and helped to drive getting things fixed was DROWN. In an ironic twist of fate, I accidentally ended up a coauthor of the paper, with my name right next to Alex Halderman&#8230;  [ While working on fixing things, I happened to notice that two separately reported vulnerabilities combined together to enable a much more effective attack. ]</p>\n<p>P.S. There&#8217;s a typo in my previous comment #24, the DANE survey covers 7.6 *million* signed domains, not just 7.6. As in TLS, in DNSSEC there are also opportunities for the unglamorous work of fixing things.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/Dukhovni:Viktor.html\">Viktor Dukhovni</a>", "published": "2018-06-09 22:50:52+00:00", "title": "By: Viktor Dukhovni"}, {"content": "<![CDATA[<p>Eric Cordian #30</p>\n<p>See eg <a href=\"https://cen.acs.org/articles/95/i43/Chemistry-quantum-computings-killer-app.html\" rel=\"nofollow\">Chemistry is quantum computing’s killer app</a></p>\n<p>“If you have 125 orbitals and you want to store all possible configurations, then you need more memory in your classical computer than there are atoms in the universe,” says Matthias Troyer, who develops algorithms and applications for quantum computers at Microsoft Research in Zurich. But a quantum computer could model such a system with just 250 qubits</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2018-06-10 04:00:47+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>Eric #30: You ask an excellent question, and one that&#8217;s been receiving a great deal of concentrated attention over the last few years, by groups like Microsoft&#8217;s Quarc.  You need problems in chemistry or condensed-matter that (1) people are highly economically motivated to solve, (2) they&#8217;ve been unable to solve so far, (3) are difficult for reasons of many-body QM, and (4) a QC could plausibly help with.</p>\n<p>My impression is that, if you look around for situations where the current approximation methods in quantum chemistry fail, it&#8217;s not hard to find examples.  But then you need to ask the further question of how much insight you&#8217;ll get by being able to simulate those systems on a QC, as opposed to just studying them in the lab.</p>\n<p>Without passing judgment on plausibility, I can tell you the main potential examples of problems satisfying (1)-(4) that I&#8217;ve heard <i>talked about</i> in our community:</p>\n<p>&#8211; Designing better solar cells<br />\n&#8211; Designing better batteries<br />\n&#8211; Designing drugs that bind to a target receptor<br />\n&#8211; Designing a way to produce fertilizer that&#8217;s less energy-intensive than the Haber process<br />\n&#8211; Designing high-temperature superconductors</p>\n<p>There are many uncertainties with all of these: most obviously, do there even <i>exist</i> so much better compounds for a better computer search to discover, and which could be economically produced?  If they do, how much is the difficulty of discovering them really related to many-body quantum effects that we can&#8217;t currently simulate?  How much would a QC help?</p>\n<p>As I pointed out, though, these are also areas where a very small number of successes (maybe even <i>one</i> success) might justify the whole pursuit of QC-based quantum simulation.</p>\n<p>John Preskill&#8217;s <a href=\"https://arxiv.org/abs/1801.00862\" rel=\"nofollow\">NISQ article</a> has more on these questions.</p>\n]]>", "author": "Scott", "published": "2018-06-10 11:29:00+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>[&#8230;] Quantum computing for policymakers and philosopher-novelists: Die drei wesentlichen Anwendungsbereiche für Quantencomputer sind 1. Simulation von Quantenphysik und Quantenchemie zur Entwicklung neuer Materialien und Medikamente. 2. Entschlüsselung heutiger kryptografisch gesicherter Informationen. 3. Optimierung von maschinellem Lernen. [&#8230;]</p>\n]]>", "author": "Wochenrckblick 2018/23  Raketenstiefel", "published": "2018-06-10 18:02:31+00:00", "title": "By: Wochenrückblick 2018/23 – Raketenstiefel"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>Do you have any inside info about the 49 and 50 qubit quantum computers that Intel and IBM recently built? IBM announced less than a year ago that they had built one, yet we have not heard anything more.</p>\n]]>", "author": "Craig", "published": "2018-06-11 14:32:51+00:00", "title": "By: Craig"}, {"content": "<![CDATA[<p>Craig #37: No, I don&#8217;t have inside info.  I&#8217;m skeptical that 49-50 qubit devices already exist with anywhere near the level of control and coherence that we&#8217;d like for quantum supremacy experiments based on random circuit sampling.  My sense is that building these things is extremely hard, and that some announcements were made prematurely (or hyped by the press beyond their importance) for PR/marketing reasons.  Does anyone else have additional insight to provide?</p>\n]]>", "author": "Scott", "published": "2018-06-11 19:31:12+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>scott #13. </p>\n<p>i don&#8217;t know what a &#8216;philosopher-novelist&#8217; or &#8216;philosopher novelist&#8217; is. if the term refers to an individual who presents their philosophical ideas in the form of a novel, then the google search of &#8216;philosopher novelist&#8217; (which returns Philosopher > Novelist with no explanation as to what the &#8216;>&#8217; means) lists only one individual who is clearly a philosopher-novelist. That is Ayn Rand, whose novels are simply a poorly written fictional pretext within which she very clearly states her philosophical views (see the 80 page speech by John Galt in &#8220;Atlas Shrugged&#8221;). i have no idea why the authors listed by google are considered &#8216;philosopher novelists&#8217; since they don&#8217;t explicity deal with philosophical issues in their novels. my confusion lies in the term philosopher. i recognize a novelist when i read one but what makes a person a philosopher is unclear unless they are discussing metaphysics or epistemology (or logic?). btw &#8211; the google list inexplicably does not include Hermann Hesse. nor does it include Robert Heinlein, with his depiction of an anarcho-capitalist society in &#8220;The Moon Is A Harsh Mistress&#8221;.</p>\n]]>", "author": "Richard Gaylord", "published": "2018-06-12 07:43:52+00:00", "title": "By: Richard Gaylord"}]