[{"content": "<![CDATA[<p>@Eva Silverstein #136</p>\n<p>What you keep calling a mediocre &#8220;1 sigma&#8221; result is more like an 8 or 18-sigma result as that term is used in physics and in your postings.  It is also an effect size comparable to the difference between the male and female height distribution, where it has easily observed consequences for the disparity in sex distribution of tall people.  Similar effect sizes, also with very high significance levels, are found in other studies and meta-analyses.</p>\n<p>There is a factor of Sqrt(N) lost in the mistranslation between the &#8220;effect size sigma&#8221;, here equal to  about 1, and the &#8220;statistical significance sigma&#8221; that is compared against a normal or t-distribution to obtain a p-value.   Sample size 100 with a Cohen&#8217;s d of 0.99 would mean about 10 sigmas of normal distribution or somewhat lower (converted to a sigma or p-value) when using a t-distribution.   The paper you referenced is paywalled but the abstract suggests the sample sizes were much larger than 100.</p>\n<p>There is a similar change of meaning where you talk about events with &#8220;probability > 0.6&#8221; stuff.    The actual argument (e.g., in Damore&#8217;s memo) about sex differences is that if the male and female distributions are different, there will be a large disproportion of one sex or the other in the upper tail (of height, or interest in computer programming, or desire to work in an elementary school).  You are talking about different probability questions such as what is the probability that a randomly chosen female is more interested in computers than a randomly chosen male, or has higher math test score, or is taller.  Obviously those probabilities will be a lot higher and reflect the fact that the distributions overlap in most of their range (true for most sex differences except physical strength).   But the memo, and Larry Summers, and every similar argument about distributions, is about the upper tails where we find Google programmers and physicists.</p>\n]]>", "author": "Use Siren", "published": "2017-08-17 20:46:51+00:00", "title": "By: Use Siren"}, {"content": "<![CDATA[<p>szopn #228: I find it really hard to buy your argument.  First, you are asserting context and &#8220;well-known suppositions&#8221; that I don&#8217;t think I agree with.  After all, can&#8217;t I claim that in context I just meant that &#8220;Women have a harder time understanding programming&#8221; to follow from the well-known supposition that someone who is more emotional feels discomfort with cold logic, and so may avoid choosing programming positions.&#8221;  I can continue parroting the logic in the rest of your post, but you get the idea.</p>\n<p>I mean, I really don&#8217;t see a substantive difference here.  Leadership is a skill like any other.  Asserting women are going to have a hard time leading because of their biology (without citing any scientific backing) seems pretty equivalent to asserting they&#8217;re going to have a hard time doing anything else due to their biology.</p>\n]]>", "author": "Dan Staley", "published": "2017-08-17 21:18:55+00:00", "title": "By: Dan Staley"}, {"content": "<![CDATA[<p>MW #221: </p>\n<p>This is how you represented what I said: </p>\n<p>&#8220;Sure, we tolerate conservatives here, just as long as they take care to never let their colleagues find out about the shameful views they hold. Otherwise it’s their own fault if they get fired or discriminated against.&#8221;</p>\n<p>Here&#8217;s what I said before the part you quoted: </p>\n<p>begin quote</p>\n<p><i><br />\nI understand that Damore felt isolated as a conservative at google, and agree with him that all should have access to the diversity resources at google. I also believe that political diversity is an asset to most groups, including tech workplaces. I believe he has the right to state his political opinions at google, to ask if their diversity policies help achieve diversity, and to propose others. He also has the right to begin activities, such as support groups, meant explicitly for conservatives.</p>\n<p>I’m guessing you were venting, but in case you weren’t. Do I support institutionalized affirmative action for conservatives? At the moment, no. But I’m open to argument.</p>\n<p>Everything that you say about conservatives in science is plausible to me and is indicative of a difficult environment. ..&#8221;<br />\n</i><br />\nend quote</p>\n<p>I then went on to explain what I think is different. </p>\n<p>So, I&#8217;m struggling to understand how you interpreted my comment as advocating a &#8220;don&#8217;t ask don&#8217;t tell&#8221; policy for conservatives. I&#8217;ve pretty clearly distinguished between not discriminating and affirmative action. I&#8217;ll try to rephrase. </p>\n<p>Note: there&#8217;s no question in my mind about discrimination; not that Damore cares about my opinion, political views are protected by CA law (they are not in the more conservative states).<br />\n<a href=\"https://www.workplacefairness.org/retaliation-political-activity#2\" rel=\"nofollow\">https://www.workplacefairness.org/retaliation-political-activity#2</a></p>\n<p>I am now trying to think through whether affirmative action based on race and gender should imply affirmative action for conservatives. </p>\n<p>I do think there is a difference between discrimination on highly visible unchangeable traits&#8212;such as gender, age and race&#8212;and others such as the beliefs one may hold that are mostly independent of one&#8217;s job (even if one accepts that these beliefs are somehow biologically determined and are unchangeable). You can choose when and who with you will discuss politics, and whether to bring up your views in an interview, and how to present them; you generally have much more control about how they are received. Additionally, some might never want to reveal them for privacy reasons. </p>\n<p>If you&#8217;re arguing for affirmative action for conservatives, because conservative political opinion is as visible and as difficult (or more) for SV techies, and because discrimination against conservatives in STEM has as glorious a history as racism and sexism in STEM, you should absolutely make the case. </p>\n<p>What form would the affirmative action take? Should we hire more? Should we try to find out in an interview? Would conservatives want to reveal this information? What about those who preferred not to reveal their political views? Which category would they fall in? How would we know what anyone&#8217;s category was independent of self-reported claims?</p>\n<p>As we&#8217;ve seen described many times, studies have shown that those female or colored job applicants who &#8220;don&#8217;t tell&#8221; their gender or race are more likely to make it to the next step. Conservatives do have the choice to not tell. </p>\n<p>I&#8217;m unlikely to be able to respond further before Scott&#8217;s deadline. Fun talking to everyone, thanks for your time.</p>\n]]>", "author": "PV", "published": "2017-08-17 21:29:47+00:00", "title": "By: PV"}, {"content": "<![CDATA[<p>szopen #229, MW #221: I read szopen&#8217;s comment after I wrote the recent long one. To spare Scott some more words: thanks for your thoughts. I will think some more about what both of you said. </p>\n<p>Thanks, Eva and Otterbee, too, for your comments. Awww. I&#8217;m going to miss everyone. </p>\n<p>Scott, maybe at some time you can tell us if this discussion served any of the purposes you thought it might?</p>\n]]>", "author": "PV", "published": "2017-08-17 22:02:17+00:00", "title": "By: PV"}, {"content": "<![CDATA[<p>@Dan Staley</p>\n<p>&#8220;From a purely mathematical standpoint, I’m pretty sure passing the interview process does not equal out the priors – if your prior is that the average woman is less qualified, then the typical woman who passed the interview process is more likely to have just barely passed and the typical man who passed is more likely to have passed by a comfortable margin. (Maybe I’m getting this wrong? But I’m pretty sure this is true since the normal curve acts like e^{-x^2} instead of a pure exponential).&#8221;</p>\n<p>Yes, you are getting it wrong, but that&#8217;s totally fine, it&#8217;s pretty much one of the most common mistakes practically every human makes about interpreting probability. As far as I am concerned the only reason racism and sexism exists is because people generally don&#8217;t have good intuition about probability. This is the point I want to clarify and then I think we will basically understand each other. </p>\n<p>So, the way I model the interview process is that it checks for a &#8220;high level engineering and programming competence&#8221; ability. So, once we know that a person &#8220;passed&#8221; the interview, from my perspective this is mathematically equivalent to the prior &#8220;they are in the population who have this high level competence.&#8221; And the reality of the world, as we just observe it, is that among the women who have high level competence in engineering fields, they are distributed over a full spectrum of abilities, all of them passing a bar from &#8220;excellent&#8221; to &#8220;top of the field&#8221;. I can attest to this because I&#8217;ve been lectured by brilliant female professors who are the top by any standard, and have had many female colleagues who are just indisputably the very top of the field.</p>\n<p>Now, you might infer that &#8220;looking at the normal curve&#8221; is appropriate in this case to provide some inference, but the point is humans are distributed according to some distribution, but it is simply not necessarily a normal distribution. It&#8217;s close to it for some traits, but not for others. The only thing for which a normal curve is appropriate for is when you have the sum of a bunch of independent random variables&#8230; human traits and characteristics are obviously far more messy than that.</p>\n<p>Anyways, if you&#8217;d like to carry out your argument for why you think that a statement about &#8220;differences in average in a group&#8221; implies &#8220;distribution over the top performing members is skewed lower,&#8221; which I think is what you are getting at, I&#8217;ll let you do the derivation. Whatever that is though, I consider it irrelevant. The observed reality is that at places like Google, or in academia, the skills of both men and women employees are distributed similarly (with, in some cases, fewer absolute numbers of women). So, if your mathematical argument implied something different than this, it is only something that makes me doubt the validity of the bell curve model for the distribution we are talking about.</p>\n<p>That&#8217;s one of the key points. Don&#8217;t assume something is Gaussian, that&#8217;s just a model. The underlying reality is what we can actually observe.</p>\n]]>", "author": "J J Lin 2003", "published": "2017-08-17 22:28:44+00:00", "title": "By: J J Lin 2003"}, {"content": "<![CDATA[<p>@Dan Staley #232</p>\n<p>&#8221; if your prior is that the average woman is less qualified, then the typical woman who passed the interview process is more likely to have just barely passed [than] the typical man who passed&#8221;</p>\n<p>The interview process isn&#8217;t applied to the whole population (in which case what you say is true), but to a self-selected population of people who became programmers and applied for jobs at Google.    If the self-selection works differently for men and women, for the kinds of reasons that Damore argued in his memo, that could easily lead to a situation where Google&#8217;s female applicants (above the hiring threshold) are more qualified than the males.</p>\n]]>", "author": "Use Siren", "published": "2017-08-17 23:28:26+00:00", "title": "By: Use Siren"}, {"content": "<![CDATA[<p>Dan Staley #203</p>\n<p>>  I find that to be a flimsy shield – if I tell a woman her achievements are all the more impressive because she’s from the **obviously less-intelligent gender**, that’s still sexist, and she has every right to be concerned about how much I respect her.</p>\n<p>Here&#8217;s a study:</p>\n<p><a href=\"http://www.independent.co.uk/life-style/women-better-leaders-men-study-a7658781.html\" rel=\"nofollow\">http://www.independent.co.uk/life-style/women-better-leaders-men-study-a7658781.html</a></p>\n<p>> Women are better leaders than men, study of 3,000 managers concludes</p>\n<p>> &#8220;They are decidedly more suited to management positions than their male counterparts&#8221;</p>\n<p>> The study, led by Professor Øyvind L. Martinsen, head of Leadership and Organisational Behaviour at the BI Norwegian Business School, assessed the personality and characteristics of nearly 3,000 managers.</p>\n<p>> In nearly all areas, they concluded that women were better leaders than their male counterparts.</p>\n<p>> Women outperformed men in four of the five categories studied: initiative and clear communication; openness and ability to innovate; sociability and supportiveness; and methodical management and goal-setting.</p>\n<p>Do you believe that study?</p>\n<p>If you believe that study, what does it say about your understanding of &#8220;intelligent&#8221; as a one dimensional parameter?</p>\n<p>If you believe that intelligence may be measured in many different ways, that is, there are different kinds of intelligence, why is it offensive to ask if on average, women may be the less intelligent sex when it comes to coding?</p>\n<p>Because hell, they probably are better leaders then men, and thus are more intelligent then men along the management scale of intelligence.</p>\n<p>Or do you disbelieve that study because like the studies that Damore claims supports his views, the conclusion that male and female intelligences can be different is obviously wrong?</p>\n<p>What would you think of someone using the study above in a memo justifying diversity programs at Google? Studies show women are more intelligent then men along the management scale, hence we clearly need more female managers.</p>\n<p>Would that be something worth firing over, even if it does insult all the men at Google?</p>\n<p>Of the two memos, James and one citing the above, published in the Google+ internal Skeptics forum (or wherever it was published), which memo contributes to a hostile work environment?</p>\n]]>", "author": "Ash", "published": "2017-08-17 23:41:49+00:00", "title": "By: Ash"}, {"content": "<![CDATA[<p>Hi Scott,</p>\n<p>Thank you for the reply! Just a couple of things before you close this thread:</p>\n<p>1. The 56% you cited is only a few hundred(?) people who responded to the poll. It is most likely heavily biased and not at all a strong support of what you would like to say. I suspect you may have glossed over this, since you would have most likely not used it as evidence otherwise, so just wanted to let you know.</p>\n<p>2. Regarding #200&#8212;I completely agree with you that whether or not the world should be this way is the correct question to ask. I just wish you would ask that instead of blaming Google. Or at least explicitly claim that if you were Google, you would have done differently, despite all the obvious caveats regarding the health of your company&#8217;s workplace and possible legal threats/issues.</p>\n<p>Thanks for writing this!</p>\n]]>", "author": "user778451", "published": "2017-08-18 04:35:44+00:00", "title": "By: user778451"}, {"content": "<![CDATA[<p>anonymous #158:</p>\n<ul>Glad to hear you thought Piper’s post was inflammatory; I found the Google memo (which was also never apologized for) inflammatory.</ul>\n<p>A member of group A writes a memo about the nature and extent of special consideration given to members of group B.  A member of group B demands that all members of group A should leave the field permanently.  Do you not see the disanalogy between the two situations?</p>\n<p>user778451 #238: It actually wasn&#8217;t central to my point whether 56% of Googlers opposed Damore&#8217;s firing.  Suppose the number is only 30%; then the question still stands: <i>should Google root out and fire that 30%, for creating a hostile work environment?  if not, why not?</i></p>\n<p>For whatever it&#8217;s worth, the people who emailed me or left comments here, saying they work at Google, seemed roughly evenly split between those who supported and those who opposed the firing, consistent with the poll results.  Of course Googlers who opposed the firing are less likely to say so under their real names, especially now that we know that the wrong stance on these questions can get you fired.</p>\n<p>Were I a Google executive, I <i>hope</i> I&#8217;d have the courage to speak out internally against this firing, as apparently some executives did from the accounts I read.  But, again according to those accounts, they were overruled by YouTube CEO Susan Wojcicki, who sets out her reasons <a href=\"http://fortune.com/2017/08/09/google-diversity-memo-wojcicki/\" rel=\"nofollow\">here</a> (without disclosing her own apparent role in the firing).  Basically, views like Damore&#8217;s are dangerous because they could discourage girls like her daughter from entering technology; the question of truth or falsehood never really enters into it.  Even if I <i>were</i> a Google executive who spoke out against, I expect that those making a calculation like Wojcicki would win out in the end.</p>\n]]>", "author": "Scott", "published": "2017-08-18 05:14:00+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>OK, I&#8217;m closing this thread now.  Thanks to everyone for participating.</p>\n]]>", "author": "Scott", "published": "2017-08-18 05:17:26+00:00", "title": "By: Scott"}]