[{"content": "<![CDATA[<p>TrumpSupporter #27, </p>\n<p>I live in a European country where most of the population is convinced it is the greatest country in the world (you would not like it. Partial birth abortions are illegal but taxes are skyhigh) but where most don&#8217;t feel the need the demonstrate it in the American way. If you are really confident about how great your country is there is no need to keep repeating it. From that perspective Obama and Clinton seem over the top patriotic so it is amusing that you think they are unpatriotic. </p>\n<p>Also, to be correct, what Trump promised was to &#8220;Make America Great Again&#8221;. I have two points to make regarding that. For one thing it rather implies that America is not great at the moment, or at least it wasn&#8217;t until Trump was elected. Some people seem to portray any left-wing criticism of America as unpatriotic but think it is totally fine for right-wingers to come with harsh criticism. (If you really hate abortion so much, should you not view Ireland, where abortion is almost totally illegal, as a greater country than the US?) </p>\n<p>The second point I wish to make is that &#8220;Make America Great Again&#8221; suggests America used to be great. No, I don&#8217;t know if Trump has said at exactly which date America was great but do you, TrumpSupporter, accept that a black person or gay person might wonder if the time Trump is nostalgically looking back to might not be perceived as less great by them?  Do you accept that America has never really been great for African-Americans and that for all we know Trump is pining for the 1950 or 60ies, which were great in some ways, but when black people were also actively oppressed?</p>\n]]>", "author": "Jr", "published": "2017-05-28 17:44:50+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Jr #51</p>\n<p>It would help to name the country you are talking about. It seems to me the only country in Europe that bans abortion entirely is Malta which at the same is regularly accused of being a tax haven.</p>\n<p>I know my share of Europeans, some of my closest friends are. Their very human tendency is to try to understand the politics of the United States under the prism of European politics. It is never a good idea to try to understand one complex society using the parameters that work to understand another.</p>\n<p>So you understand the difference. The United States was founded by people who were running away from political and religious prosecution in Europe. The US constitution was designed to be the &#8220;anti-Europe&#8221; of the XVIII&#8217;th century: Europe was totalitarian then, and each kingdom/principality had its own official religion imposed on its subjects. Thus, the US was founded of the idea that &#8220;all men are created equal&#8221; and the Constitution protected a set of individual freedoms early on -chief among them are freedom of religion and freedom of speech. Most Europeans I have talked to about these issues are amazed that the United States is such a hot bed for religious cults and by the vitriol they perceive in the political discourse. Both are as old as the American republic.  Throughout the years, there have been several waves of immigration to the United States. In each case, the people who came via these waves, and particularly their descendants, have made theirs the American ideal. so in continues to live on.</p>\n<p>On the other hand, the people who live in Europe today have the DNA of the people that thought that putting up with a totalitarian ruler was a better proposition than risking leaving it behind to find who knows what in America. Thus, the political cultures of the United States and the different European countries could not be more different. In general Americans do not have the faith in rulers (ie, government) that the average European has. The average American doesn&#8217;t look up to government to solve his problems, rather, expects government to get out of the way and focus on the things it was setup up for: the military, administration of justice and protection of basic individual rights such as private property. </p>\n<p>This is not to say that the United States was born perfect. Clearly it wasn&#8217;t because of the issue of slavery first, and legalized racism later. The United States is a dynamic nation that has been adapting throughout the centuries with basically the same legal framework whereas take a country like France. Their revolution took place around the same time as the American Revolution. They had a series of kings and different political systems in the next 200 years. Now they have the V-th Republic and who knows what will happen in 2022 given that I have little hope that Macron will be able to change the old ways.</p>\n<p>All this to say that when Trump says he wants to &#8220;Make America Great Again&#8221; it is not understood in the terms you mention. I do not know any Trump supporter who would like to restore racist laws or to criminalize homosexuality. The issue of gay marriage is a totally different topic. I believe the European Court of Human Rights struck the right balance where the US Supreme Court didn&#8217;t: it recognized that criminalizing homosexuality was incompatible with individual freedom but it also said that gay marriage was a new thing and that it was up to each member state to figure out how to handle it <a href=\"https://en.wikipedia.org/wiki/Schalk_and_Kopf_v_Austria\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Schalk_and_Kopf_v_Austria</a> .</p>\n<p>To me &#8220;Making America Great Again&#8221; meant:</p>\n<p>&#8211; Stop being the laughing stock in the world, as we were with Bush -because he didn&#8217;t have the guts to question the judgement of the deep state when he was asked to invade Iraq- and Obama -whom Europeans love because they see in him what Americans saw in Gorbachev: the best fifth columnist America has ever produced. You take a look at the video of Trump lecturing the ineffectual NATO leaders and you get an idea what being &#8220;great again&#8221; means.</p>\n<p>&#8211; Stop piling up debt. Seriously. Both Bush and Obama doubled the national debt in their respective presidencies. That is unsustainable.</p>\n<p>&#8211; Stop using the coercive force of government to impose secular ideology -such as abortion on demand or gay marriage- on individual states whose voters said explicitly in the their own elections that they don&#8217;t want. I am not going to defend slavery, but the way slavery was ended was via a constitutional amendment. Same thing with legalized racism: it was ended with a constitutional amendment -the XIV-th amendment- but the statist Democrats back then nullified it for almost 100 years with Plessy v Ferguson until Republicans helped overturn it with the Civil Rights Act of 1964. In the case of gay marriage, the US congress passed in 1996 with veto proof majorities the Defense of Marriage Act in 1996. By a 5-4 majority, liberal ideologues overturned the decision made by the representatives of the people. </p>\n<p>&#8211; Stop over-regulating the economy to the point that it grows at 2% due to lack of new business creation. Most Americans rather have plenty of opportunity than government paychecks (that&#8217;s something that divides the American and the European mindsets). Basically we the need to reverse this trend <a href=\"http://money.cnn.com/2016/09/08/news/economy/us-startups-near-40-year-low/\" rel=\"nofollow\">http://money.cnn.com/2016/09/08/news/economy/us-startups-near-40-year-low/</a> .</p>\n<p>I hope you get the idea.</p>\n]]>", "author": "TrumpSupporter", "published": "2017-05-28 18:48:39+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>TS #47,</p>\n<p>I wonder whether you recognize the similarity in what you are saying about being uncomfortable having a boss with political views that differ from your own, and what the SJW activists are saying? Do you accept that a woman graduate student might be uncomfortable discussing the situation of women in science with a male supervisor or colleague, especially someone who has had outspoken non-feminist views? </p>\n<p>TS #15,</p>\n<p>I don&#8217;t believe something without a functional nervous system has human rights and that includes a foetus in early stages of development. I also believe a pregnant woman has human rights and her right to life takes precedence over the foetus and her right to her body takes precedence in the early stages of pregnancy. But in the latter stages restrictions in non-life threatening situations are another thing, as current American law recognizes. </p>\n<p>I do find it interesting that you would speak of &#8220;constitutional&#8221; rights. The American constitution makes no mention of foetuses having rights, and I don&#8217;t see it as implied in an obvious way from the text either. And since the constitution only regulates state action, with one exception, it would not stop abortions anyway even if an absolute right to life was read into the document. Your focus on seeing your preferred policies in the constitution surely mirrors the people who support Roe v. Wade.</p>\n]]>", "author": "Jr", "published": "2017-05-28 18:50:46+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Jr #52:</p>\n<p>How on Earth you make the connection between left-wing bias and misogyny is beyond me. Do you realize that the liberals that overwhelmingly populate academia also believe in identity politics and therefore should be welcoming to opening their ranks to women? Perhaps somebody who is currently a male in academia should be able to address your question better than me.</p>\n<p>On the issue of abortion.  You say </p>\n<p>&#8220;I don’t believe something without a functional nervous system has human rights and that includes a foetus in early stages of development&#8221;. </p>\n<p>Would that also apply to people who have neurodegenerative diseases? I am trying to understand your position better. So for example, do you believe that people in advanced stages of Alzheimer do not have human rights either and that therefore can be disposed of? If you believe that having had first a functioning nervous system that degenerates later into a non functional nervous system is different, then I ask you to explain. </p>\n<p>My position is the following: once sperm and egg meet, a new human life is created via a continuous process that only ends with the death of said new human life. Terminating that life at any stage of the process is morally wrong. I am on record saying that I agree with exceptions such as when the life of the mother is in danger or the usage of the day after pill in the case of rape. However, how we think about this is of utmost important: a new human life with rights vs a &#8220;thing&#8221; that can be disposed when it is an inconvenience. </p>\n<p>Note that the delineation of having a &#8220;functional nervous system&#8221; is totally arbitrary -as an aside, here I believe we have an example of somebody that doesn&#8217;t understand the concept of <a href=\"https://en.wikipedia.org/wiki/Continuous_function\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Continuous_function</a> with the y coordinate being the status of development of a human life and the x coordinate being time. There are no bright lines after conception happens.  I can, for example, imagine the day when we have artificial wombs so that the entirety of a pregnancy can be carried out outside a human body. You sound no different to me from Peter Singer, who believes that parents should be free to kill their newly born children because they lack the autonomy of a full fledged human being. Both &#8220;having a functional nervous system&#8221; and &#8220;autonomy&#8221; seem totally arbitrary criteria to me. What these two criteria have in common is that they have been conceived from a position of strength (a non aborted person) to punish an innocent human life when said human life is most vulnerable.</p>\n]]>", "author": "TrumpSupporter", "published": "2017-05-28 19:26:40+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>Well, they way we define death is that the central nervous system has stopped working.</p>\n<p>The lines we draw will be somewhat arbitrary, but I am comfortable that someone without feeling or sensation is not to be treated as a person with rights.</p>\n]]>", "author": "Jr", "published": "2017-05-28 20:37:18+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Jr #55</p>\n<p>So to be clear, when you say &#8220;I am comfortable that someone without feeling or sensation is not to be treated as a person with rights&#8221; you are fine with disposing of people with neurodegenerative diseases or in a coma, correct?</p>\n<p>If the answer is &#8220;Yes&#8221; then that&#8217;s a position I can respect on intellectual grounds, just as I respect Peter Singer&#8217;s. With this said, I find your and Singer&#8217;s position morally reprehensible. It is very ironic that Trump supporters&#8217; get accused regularly of being neo-nazis when in fact it is people with a point of view similar to yours that started and executed <a href=\"https://en.wikipedia.org/wiki/Aktion_T4\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Aktion_T4</a> .</p>\n<p>As a personal anecdote I would like to share that a good friend of mine who is a card carrying liberal, pro-Obama, pro-Clinton, certainly anti-Trump and who in general loves to work with very smart people confessed to me once that he is a secret admirer of William Shockley&#8217;s dysgenics agenda. I didn&#8217;t judge him when he said that because indeed, the logical conclusion when one thinks that not all human lives are intrinsically valuable regardless of any other consideration is to try to rank these lives according to some arbitrary criteria -in his case intelligence- and to try to get rid of those deemed less valuable.</p>\n]]>", "author": "TrumpSupporter", "published": "2017-05-28 21:06:32+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>Also, I don&#8217;t think my point came across clearly (or at least it was not understood) about the female grad student. What I mean is that when you say that the presence of outspoken liberals make science an uncomfortable environment for conservatives, it sounds very similar to when left-wing snowflakes think the presence of conservatives creates a hostile environment.</p>\n]]>", "author": "Jr", "published": "2017-05-28 21:16:28+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Jr #55</p>\n<p>So to be clear, when you say &#8220;I am comfortable that someone without feeling or sensation is not to be treated as a person with rights&#8221; you are fine with disposing of people with neurodegenerative diseases or in a coma, correct?</p>\n<p>If the answer is &#8220;Yes&#8221; then that&#8217;s a position I can respect on intellectual grounds, just as I respect Peter Singer&#8217;s. With this said, I find your and Singer&#8217;s position morally reprehensible. It is very ironic that Trump supporters&#8217; get accused regularly of being neo-nazis when in fact it is people with a point of view similar to yours that started and executed <a href=\"https://en.wikipedia.org/wiki/Aktion_T4\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Aktion_T4</a> .</p>\n<p>As a personal anecdote I would like to share that a good friend of mine who is a card carrying liberal, pro-Obama, pro-Clinton, certainly anti-Trump and who in general loves to work with very smart people confessed to me once that he is a secret admirer of William Shockley&#8217;s dysgenics agenda. I didn&#8217;t judge him when he said that because indeed, the logical conclusion when one thinks that not all human lives are intrinsically valuable regardless of any other consideration is to try to rank these lives according to some arbitrary criteria -in his case intelligence- and to try to get rid of those deemed less valuable.</p>\n]]>", "author": "TrumpSupporter", "published": "2017-05-28 22:16:00+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>Jr #53:</p>\n<ul>I wonder whether you recognize the similarity in what you are saying about being uncomfortable having a boss with political views that differ from your own, and what the SJW activists are saying? Do you accept that a woman graduate student might be uncomfortable&#8230;</ul>\n<p>That&#8217;s an excellent point, and one I&#8217;d been thinking about as well.  I now have the &#8220;honor&#8221; of having been accused in this same comment section, in both cases by people who never met me, of</p>\n<p>(1) being unfit to mentor conservative students because of my pro-choice (and more generally progressive) views, but ALSO</p>\n<p>(2) being unfit to mentor female students because of having voiced some disagreements with one specific version of feminism.</p>\n<p>In both cases, I think people who know me would say that my actual experiences, mentoring both conservative and female students over a decade, put the lie to both charges.</p>\n<p>Thinking it over, I wonder if the people who level these sorts of accusations genuinely can&#8217;t imagine that two people would get so engrossed working on a research problem together that differences in their political views, or for that matter their sexes, would seem trivial by comparison.  If so, then I daresay that lack of imagination says more about the accusers than about the accused.</p>\n]]>", "author": "Scott", "published": "2017-05-28 22:46:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>TrumpSupporter #28, #35:</p>\n<p>It is nearly impossible to predict which mathematics will turn out to be popular or practically applicable. I wondered since a long time, why the aliasing formula for DFT (which is closely related to the Shannon/Nyquist sampling theorem) is rarely stated explicit, and almost never proved. Motivated by your strong statements, I condensed my perplexity now into an explicit question: <a href=\"https://math.stackexchange.com/questions/2300625/is-the-aliasing-formula-for-dft-a-folklore-result\" rel=\"nofollow\">Is the aliasing formula for DFT a folklore result?</a> If anybody knows the answer, I really would like to hear. One partial answer might be that the phenomenon can be explained by looking at each separate frequency individually one at a time, and that this local explanation is preferred (by nearly everybody) over the global formula as more intuitive.</p>\n<p>And I can&#8217;t resist to quote <a href=\"https://en.wikipedia.org/wiki/A_Mathematician%27s_Apology\" rel=\"nofollow\">Hardy&#8217;s famous misprediction</a></p>\n<blockquote><p>No one has yet discovered any warlike purpose to be served by the theory of numbers or relativity, and it seems unlikely that anyone will do so for many years.</p></blockquote>\n]]>", "author": "gentzen", "published": "2017-05-29 00:23:51+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>gentzen #60</p>\n<p>I agree that it is hard to predict which mathematics will turn out to be popular or result in revolutionary applications. As I said earlier, I am making a value judgement based on my own experience.</p>\n<p>The answer to your question is that real life signals are analog and the DFT does its magic in the DFT-frequency domain so you need to approximate these samples of the DFT from what you can do in real life. Typically doing the DFT magic would require designing some sort of high precision analog filter bank, something that is very hard to build.</p>\n<p>On the other hand, there are decades of experience doing low pass analog filters. So the formula &#8220;low pass filter + sampling at the Nyquist rate&#8221; is better understood, implementation wise, than alternatives, including the idea using analog filter banks sub-sampled to then reconstruct the signal in the digital domain as if that been sampled using the Nyquist rate.</p>\n<p>When it comes to sampling, what engineers know how to build matters. It&#8217;s a similar problem that happens in computer science with algorithms. It is one thing what the theory says you can do, quite another what is practical in terms of implementation. Take Google&#8217;s MapReduce for example. For all the hype it generated both inside Google as well as in the open source world, it turned out to be a restrictive way of doing batch processing and Google ended up abandoning it <a href=\"http://the-paper-trail.org/blog/the-elephant-was-a-trojan-horse-on-the-death-of-map-reduce-at-google/\" rel=\"nofollow\">http://the-paper-trail.org/blog/the-elephant-was-a-trojan-horse-on-the-death-of-map-reduce-at-google/</a> .</p>\n]]>", "author": "TrumpSupporter", "published": "2017-05-29 06:03:37+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>TrumpSupporter #46: You don&#8217;t need to keep reiterating that the discoveries of Euler, G&ouml;del, Feynman, Knuth, Wiles, Perelman, and I-forget-who-else were all of a higher caliber than mine.  I PLEAD GUILTY.  As, of course, must virtually all of humanity.</p>\n<p>Even imagining that I had the ability to make discoveries at that level, you can see how I instead spend my time: arguing with anonymous commenters like yourself! 😉</p>\n<p>I can say only that I&#8217;m grateful for every second I&#8217;ve been able to spend doing research, both alone and in collaboration with students and colleagues; that outside friends and family that&#8217;s been the highlight of my life; that even if a problem isn&#8217;t the center of the world, it becomes that <i>for you</i> while you&#8217;re working on it; that my enjoyment would remain even if there were no external recognition whatsoever (as there basically wasn&#8217;t in the &#8220;first phase&#8221; of my research career, ages 15-20&#8230;); and finally, that even if only 20 people care enough to read and understand my proof of a theorem, that probably brings me greater satisfaction than if 20,000 people read my blog post.</p>\n<p>And to return to the point, I don&#8217;t see how any of this has any bearing on your arguments about leftism in academia!  You yourself brought up Knuth as a true great.  Well, did you know that Knuth uses his homepage to voice <a href=\"http://www-cs-faculty.stanford.edu/~knuth/iaq.html\" rel=\"nofollow\">political views</a> that could be characterized as noticeably more leftist than mine?  In general, while as we both agree, scientists as a whole are markedly more leftist than the general population, within science I&#8217;ve noticed no correlation whatsoever between &#8220;greatness&#8221; of achievements and intensity/outspokenness of leftism, anywhere on the greatness spectrum from Einstein down.  (Does anyone know of studies directly addressing that?)</p>\n]]>", "author": "Scott", "published": "2017-05-29 06:30:17+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #62</p>\n<p>I am sorry I offended you with my repetitions. You have been very kind with letting me commenting anonymously here.</p>\n<p>But here is what I will say too. Do you think is fair to have leftist scientists who, in most cases, get their work funded by the American tax payer -either via government grants or via federal loans for the students that pay tuition at their schools- constantly call the 63 million people who voted for Donald Trump all sorts of names. In this thread John Sidles wasted no time to insinuate that we are a bunch of neo-Nazis and Raoul from Ohio wasted no time asking about solving cubic algebraic equations. You yourself said <a href=\"http://www.scottaaronson.com/blog/?p=2777\" rel=\"nofollow\">http://www.scottaaronson.com/blog/?p=2777</a> &#8220;I think people support Trump for the same reason why second-graders support the class clown who calls the teacher a fart-brain to her face.&#8221; That&#8217;s certainly an aspect of it, but I also enumerated a set of reasons of what &#8220;making America great again&#8221; means for me beyond that. </p>\n<p>Reasonable people can disagree about many things, including politics and religion. However, there is a difference between disagreeing in a respectful way and assigning epithets (racist, ignorant, having the mindset of a second year old) to those who don&#8217;t agree with our politics. The latter is not constructive. </p>\n<p>You speak of Donald Knuth. As I said, I met him once in person. He is a true gentleman. Even his website lists his political opinions in the form of questions without imputing motives to those who would answer the questions differently than he does. I have met other great scientists of that era who are also leftists. Same thing. It is not the issue of being a leftist, rather, the patronizing effect of creating an environment in which only left wing ideas are welcome in public. That, I believe, is the real problem. And that is what people like you or Terry Tao did in the lead to the 2016 election: to remind everyone that if you want to be &#8220;cool&#8221; in 2016 academic science, your duty is to denounce Donald Trump and to call his supporters all sorts of names, including, that these supporters lack the judgement to decide for themselves the leader they want for their country.</p>\n<p>One of the lines that touched many hearts in Trump&#8217;s speech at the 2016 RNC was,</p>\n<p>&#8220;Remember: all of the people telling you that you can’t have the country you want, are the same people telling you that I wouldn’t be standing here tonight. No longer can we rely on those elites in media, and politics, who will say anything to keep a rigged system in place. &#8221;</p>\n<p>That&#8217;s what we are talking about here.</p>\n]]>", "author": "TrumpSupporter", "published": "2017-05-29 15:48:10+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>>> pro-life</p>\n<p>I assume TrumpSupporter is also against the death penalty and in favor of universal healthcare? </p>\n<p>If not why not?  </p>\n<p>Btw this is an honest question about one aspect of US politics I never understood &#8230;</p>\n]]>", "author": "wolfgang", "published": "2017-05-29 16:49:23+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>I&#8217;m also from Europe, so I neither would call me a Trump opponent nor a Trump supporter but rather an outside observer with interest and some level of anxiety. The anxiety is not new, though. Obama being a lame duck maybe was a bigger topic in Europe than in the U.S. (judging from watching the news in the U.S. while being there on conferences and talking to my American colleagues). So I understand that one of the main concerns of TrumpSupporter is the future of a country close to bankruptcy.</p>\n<p>But I also get his point about the way a professor expresses his (political) views publicly. I wouldn&#8217;t mind at all if my professor openly promotos leftism while I prefer the right side or vice versa. As Scott explained so well, when working together and getting lost in math and cs problems, things like that just don&#8217;t matter. The same applies for being pro or against SJW and so on. BUT there is a huge difference between expressing own (political) views and insulting all those who don&#8217;t agree. If I would support Trump I would never apply for a position under Scott&#8217;s supervision because he expressed repeatedly that one has to be dumb to support Trump. And while race, political opinion, and whether you are a Linux or Windows person might not get in the way of a fruitful collaboration, thinking the other person is dumb certainly is an obstacle. Especially for a brillant person like Scott. I was actually shocked when Scott blogged that he saw a student on campus wearing a Trump shirt and he wanted to go there to congratulate him for his bravery. If I would be a student on that campus I would feel mocked by such words. I get all of Scott&#8217;s arguments against Trump, most of them are totally reasonable. But I don&#8217;t understand how someone with that level of intelligence totally neglects that there might be also reasonable arguments on the other side and just judges everyone based on one single political view. This is especially disturbing in my eyes as this is basically a binary decision in the U.S. &#8211; and both candidates seemed to be not ideal choices. So yes, please feel free to express your views and opinions. I think they are always inspiring and raise attention to important problems. But although this is your blog and obviously your rules, ranting in such a way might affect people and decisions in a way you might not intend.</p>\n]]>", "author": "Anonymous", "published": "2017-05-29 17:14:07+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>I see a comment  from Anonymous awaiting moderation explaining the situation. I have another from myself that basically says the same thing. Hard to work for somebody who thinks you are dumb for supporting Trump. I had to experience a similar situation recently at work and thanks God it was fixed with my boss leaving the company for his own reasons. While his leaving had nothing to do with me being pro-Trump and he being anti-Trump, my general well-being at work increased dramatically.</p>\n]]>", "author": "TrumpSupporter", "published": "2017-05-29 17:27:47+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>wolfgang #64</p>\n<p>Among pro-lifers (understood as anti abortion on demand) there are very different views about these other issues, at least in the circles I do my prolife work. What unites us is a deep desire for the recognition that unborn children have constitutional rights and that we see as a great injustice to terminate a new human life who have committed no crimes for reasons of convenience to somebody else (be it the mother, the father who pressures the mother to have an abortion, social pressure, etc).</p>\n<p>My personal opinion on the other two issues is that I am in favor of the death penalty for extreme cases. For example, had Bin Laden been arrested in the US, I would see the death penalty as an appropriate punishment for having ordered 9/11. Which crimes are so outrageous as to deserve the death penalty as a punishment is a matter of ongoing debate, but on the principle I am in favor of the death penalty for serious crimes. Note that I don&#8217;t see any connection whatsoever with being prolife on the abortion debate. For a criminal to be convicted of the death penalty, said criminal has had to commit a horrendous crime. An aborted unborn children has committed no crime whatsoever other than being an inconvenience to somebody. It is hard for me to understand how &#8220;being an inconvenience&#8221; to a third party justifies terminating one&#8217;s life. Yet, Peter Singer thinks that way and Jr above too. I do not buy the &#8220;inconvenience&#8221; rationale but I am perfectly comfortable with &#8220;having been convicted of a heinous crime&#8221; as a reason to terminate another human being&#8217;s life.</p>\n<p>On the issue of universal healthcare. I think this is more related to the issue of being prolife/prochoice. A common criticism I hear from the proabortion crowd, one that I consider it a legitimate one, is that many prolifers are really pro-birth. Meaning, that both during the pregnancy and after the pregnancy they don&#8217;t want to spend a dime on expecting mothers and their kids. Don&#8217;t count me among them. Although I do not believe that socialized medicine systems like those they have in Europe in Canada are good -mostly because they free-load the research necessary to develop new treatments on the US-, I do believe in using government funds in one way or another to help those that through not fault of their own are going through a rough time. My thinking is one of &#8220;safety net&#8221; vs &#8220;entitlement&#8221;. This is another reason I liked Donald Trump vs the other Republicans: he said several times in the debates that he wouldn&#8217;t let people die in the streets for lack of health insurance as a code word for this thinking.</p>\n<p>There is no unanimity about these issues among prolifers. For example, Roman Catholics are very active in prolife circles and organize a lot of the big prolife events. Devote Roman Catholics follow the Vatican doctrine against the death penalty and the Roman Catholic Church&#8217;s social teaching that kind of favors government funded universal healthcare as an entitlement. I am not a Roman Catholic, so I don&#8217;t feel bound by these positions. I have reached my own through my own thinking.</p>\n]]>", "author": "TrumpSupporter", "published": "2017-05-29 18:47:10+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>Just to illustrate my point for you, Scott: You complain right here in that comment section that people judge you just for what you blog here without knowing you personally; assuming things about you that &#8211; as you say &#8211; are just plainly wrong. That&#8217;s an excellent point. But you judge millions of people just by their decision in the last election. And Raoul Ohio did nothing else with his comment on cubic equations. So how is that justified? And yes, of course, people form an opinion about you by reading your blog. I guess that&#8217;s not surprising news. And students might make decisions based on that &#8211; for example not to attend your courses because they are afraid to be labeled as unfit or dumb. You talked about the importance of getting the best students (also from foreign countries) not that long ago. So why not promote open discussions on controversial topics like that instead of prejudging people with different opinions? I guess both sides could benefit from that.</p>\n]]>", "author": "Anonymous", "published": "2017-05-29 19:11:32+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>TrumpSupporter and Anonymous: Ironically, my actual views are extremely mainstream and moderate compared to the views of many other academics.  So then why, in your view, should a student be afraid to work with me but not afraid to work with them?</p>\n<p>The only answer I&#8217;m getting is: because I discuss and defend my views openly on my blog.</p>\n<p>Not once did I call Trump supporters stupid.  Some of them, like Peter Thiel, surely have high IQs.  But it&#8217;s impossible to convey the substance of my position without saying I think they made one of the most grievous mistakes in the country&#8217;s history, eroding civil democratic norms and paving the way for ethnic-nationalist authoritarianism.  That doesn&#8217;t mean they should be punished in the workplace, as I also said clearly in my post about Thiel (and took flak from the far left for saying&#8212;the usual, that I&#8217;m an entitled white male douchebro, etc etc.  I can&#8217;t win, can I?)</p>\n<p>Look, the student/adviser relationship can be personal and idiosyncratic.  There might be students who don&#8217;t want to work with me because they dislike the shape of my nose, or my habit of rocking back and forth in my chair.  So I suppose I can only be grateful that, through a decade of expressing sometimes controversial views on this blog, I&#8217;ve continued to attract students from a wide variety of backgrounds, who often disagree with me about important things, but who share a passion for tackling CS theory problems.  May I continue to do so.</p>\n]]>", "author": "Scott", "published": "2017-05-29 19:31:14+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>>> I don’t see any connection [between death penalty] whatsoever with being prolife on the abortion debate.</p>\n<p>In many cases there is a non-zero probability that an innocent human being gets put to death &#8211; this is the connection imho.</p>\n]]>", "author": "wolfgang", "published": "2017-05-29 19:39:19+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Scott #69</p>\n<p>I don&#8217;t know you personally, and it is not possible for me to judge what kind of adviser you are one-on-one. During my own career as graduate student, there were professors with stellar research output who were known to be a-holes as research advisers but people were willing to put up with them for the prestige of having been a student of professor X. My own advisor is a great person and it was the honor of my life to work with him during my PhD. One of the reasons I do not regret having done the PhD and for which I would do it again is that it was the privilege of a lifetime to work with him. To this day I do not know what his politics are. It wasn&#8217;t possible for me or other students who had worked for or with him to discern them from his teaching or his way of talking to students. From some comments you might think he is a liberal from others that he is a conservative, but no official clue where he lies. If I had to make a bet, using maximum a posteriori estimation, given the prior distribution of party registration among academics, my money is that he is a liberal, but I do not know for a fact. </p>\n<p>At the same time, I know what is like to be among the few non liberals in an environment where everybody who is loud about his politics is a liberal, anti-Trump and thinks that voting for Trump is for dumb people -that would be my current work environment. After my former anti-Trump boss left, my new boss is totally shut about his politics. Again, using maximum a posteriori estimation and given the prior distribution that can be obtained from the political donations database in my field of work, I would assume he is a liberal, but I have no clue.</p>\n<p>I personally don&#8217;t care about people&#8217;s politics. My significant other is an anti-Trump liberal you see, so I know what a respectful relationship between two people who disagree on politics look like. My own experience in academic and professional environments is that whenever you have an outspoken majority on politics, the minority is shut out of the most important things. That doesn&#8217;t mean you are one of those who does these things, all I am saying is that based on my experience and your public pronouncements, I would try to avoid being your PhD student (or Terry Tao&#8217;s) if I were in the position of having to choose an advisor at UT Austin of UCLA. </p>\n<p>And with this said, I am saying good bye for good. It has been great to talk to you and to have this discussion. I thank you for publishing my comments and engaging me.</p>\n]]>", "author": "TrumpSupporter", "published": "2017-05-29 19:59:24+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>Please, Scott, I made it totally clear that I really appreciate and respect you for &#8216;discussing and defending your views openly on your blog&#8217;. And I&#8217;m happy for you that you think this never affected your work experience with anyone in a negative way. But you also cannot guarantee that there are indeed no students who feel threatened by what you say. And this is very much different from disliking your appearance or some charming habits. Maybe you did not literally called Trump voters dumb but you can hardly claim that you don&#8217;t prejudge them. And you let Julia write on your blog that<br />\n&#8220;People are fucking morons whose brains are not built to see through bullshit.” in that very context. So yes, me as a student would be anxious to let you know about my political views because I would think that you would not consider me intelligent or fit enough only based on those. But not because of your own views (with which I actually mostly agree) but for all your insults of people not in line with you.  I think you are intelligent enough (by far) to explain and debate your views and arguments on a more civilized level. And I certainly share your passion for CS theory problems, and I advise PhD students of my own. I just don&#8217;t share your passion for blind judgment. And  regarding your &#8216; I can’t win, can I?&#8217;: A dialogue normally is not about winning. It&#8217;s about understanding the other party better and maybe finding consensus in unexpected corners or inspiration to rethink the own position. But that requires some respect and a certain level of openness from both sides. It&#8217;s not about belittling the others or twist their words until they give up. It&#8217;s about learning from each other.</p>\n]]>", "author": "Anonymous", "published": "2017-05-29 19:59:25+00:00", "title": "By: Anonymous"}]