[{"content": "<![CDATA[<p>a: Who has time for sleep? I&#8217;ve worked 27 hours already this week and it&#8217;s only Tuesday night.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/f/Fitzsimons:Joe.html\">Joe Fitzsimons</a>", "published": "2014-11-18 15:55:04+00:00", "title": "By: Joe Fitzsimons"}, {"content": "<![CDATA[<p>1. Oh we are philosophers? Cool, now I know why there is a Ph next to the D. I used to find that confusing.</p>\n<p>2. Isn&#8217;t the NSA guy&#8217;s terminology odd? There is something old-fashioned about the sound of &#8220;cryptology&#8221; as opposed to &#8220;cryptography&#8221;. And I don&#8217;t think Silvio Micali&#8217;s research is really cryptanalysis, so how was he the leader of any wing of the East Coast cryptanalytic community?</p>\n<p>3. Given recent-ish revelations about the NSA, I am relieved we have been useless to them.</p>\n]]>", "author": "Sasho", "published": "2014-11-18 19:38:54+00:00", "title": "By: Sasho"}, {"content": "<![CDATA[<p>What the heck is the difference between cryptography and cryptology? I understand -ography vs -ology, but what&#8217;s the difference when it comes to the modern usage of the words? I think I remember reading in Simon Sing&#8217;s The Code Book that cryptology is cryptography together with cryptanalysis, but I&#8217;ve seen other explanations too, and Shaso&#8217;s comment about cryptology sounding old-fashioned is making me wonder.</p>\n]]>", "author": "Vadim", "published": "2014-11-19 00:25:31+00:00", "title": "By: Vadim"}, {"content": "<![CDATA[<p>Err, that&#8217;s Simon Singh, not Sing.</p>\n]]>", "author": "Vadim", "published": "2014-11-19 00:26:19+00:00", "title": "By: Vadim"}, {"content": "<![CDATA[<blockquote><p>Given recent-ish revelations about the NSA, I am relieved we have been useless to them.</p></blockquote>\n<p>Sour grapes?</p>\n]]>", "author": "Rahul", "published": "2014-11-19 00:39:38+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Cryptology, Sasho, is defined as the scientific or mathematical study of cryptography and cryptanalysis, therefore it is not the same as cryptography <i>per se</i>, because cryptography is defined as the discipline concerned with communication security, which is broader than the scientific or mathematical study of itself subset of itself. Cryptography, for example, would logically include things like jurisprudential concerns related to the matter of communication security, while cryptology would not. Wouldn&#8217;t the valid question then be whether or not the guy was using the term &#8220;cryptology&#8221; correctly, rather than whether or not it sounds old-fashioned to your ear? Or is the argument I&#8217;m missing that the <a href=\"http://www.iacr.org/jofc/\" rel=\"nofollow\"><i>Journal of Cryptology</i></a> actually is old-fashioned?</p>\n]]>", "author": "Vitruvius", "published": "2014-11-19 01:40:55+00:00", "title": "By: Vitruvius"}, {"content": "<![CDATA[<p>[&#8230;] follow Schneier&#8217;s Security Blog. Today, he alerted his readers to this post about an NSA member&#8217;s take on the cryptography session of a mathematics conference. The whole [&#8230;]</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/t/Teaching:Tension_between_practitioners_and_theoretical_mathematicians_|_College_Math.html\">Tension between practitioners and theoretical mathematicians | College Math Teaching</a>", "published": "2014-11-19 02:01:26+00:00", "title": "By: Tension between practitioners and theoretical mathematicians… | College Math Teaching"}, {"content": "<![CDATA[<p>Beyond the admittedly entertaining zingers, I think this article says more about its author than about academic cryptography.</p>\n<p>I hope this is not representative of the NSA since the article is extremely narrow-minded, starting with the premise that the less relevant cryptographic research is to practice, the better it is for the NSA. This only makes sense if one views NSA&#8217;s mission as trying to access as much of the world&#8217;s communication as possible, as opposed to trying to make the U.S. more secure. </p>\n<p>Some of these academic &#8220;cryptologists&#8221; (scare-quotes in original) such as Adi Shamir and Ron Rivest have done a great deal to secure the Internet, and hence U.S. interests as well.</p>\n<p>BTW one of the most interesting passages to me was the discussion on MD-5 on page 14. We often wonder whether the NSA is ahead of open research in factoring algorithms etc.. but one area where it seems that they should have far outpaced open researchers is cryptanalysis of symmetric algorithms including MD4, MD5, SHA-0, SHA-1 etc.. Indeed it seems likely that they have far many more people working on this than academic researchers in this area. But at least from this passage it doesn&#8217;t seem that they were aware in 1994 of the attacks that would come only few years later.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barak:Boaz.html\">Boaz Barak</a>", "published": "2014-11-19 06:52:09+00:00", "title": "By: Boaz Barak"}, {"content": "<![CDATA[<p>Although the material was an interesting read, I have to say that  the comments have been even more entertaining!  <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /></p>\n]]>", "author": "Dart", "published": "2014-11-19 16:56:21+00:00", "title": "By: Dart"}, {"content": "<![CDATA[<p>There is a difference between the US and Europe regarding areas of cryptography/cryptoanalysis that are funded. Cryptoanalysis of specific cryptographic systems (say those of cell-phones or car-keys) seems more popular/fundable in Europe. (Of course, there is also a difference between Euro-CS-theory and US-CS-theory but here there might be a specific non-funding policy.)</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2014-11-19 22:46:00+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Gil Kalay #33: What is the difference between Euro-CS-theory and US-CS-theory?</p>\n]]>", "author": "Michele", "published": "2014-11-20 10:08:55+00:00", "title": "By: Michele"}, {"content": "<![CDATA[<p>It seems the guy that wrote this just doesn&#8217;t have a clue. Either this post is from some clueless lower-ranking employee or it is a display of extreme arrogance on the part of the NSA (which bodes well for public crypto since arrogance doesn&#8217;t tend to create much progress).</p>\n<p>I wouldn&#8217;t think/hope it is representative of any of the undoubtly brilliant cryptographers NSA has at its disposal. Just take his description of Oracles &#8220;essentially an Omniscient Being that complexity theorists like to turn to when they can’t solve a problem&#8221; raises the question if this guy knew anything about what he was talking about.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Andersen:Morten.html\">Morten Andersen</a>", "published": "2014-11-20 10:13:39+00:00", "title": "By: Morten Andersen"}, {"content": "<![CDATA[<p>Vitruvius #29: Thanks, this was very informative. Please don&#8217;t read anything into my comment, I am sure it shows my ignorance more than anything else.</p>\n]]>", "author": "Sasho", "published": "2014-11-20 19:11:42+00:00", "title": "By: Sasho"}]