[{"content": "<![CDATA[<p>@Scott#156- I&#8217;m just curious- has Scott Alexander explained to you what reassurance seeking is and why it&#8217;s unhealthy?</p>\n]]>", "author": "Michael", "published": "2018-08-14 00:31:17+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Here is a puzzle: by any normal standards, this would’ve been an extremely left-wing post.  It is, after all, about the dangers of over-aggressive policing and about empathetic understanding for those accused of petty crime; it even includes digs at Trump and Manafort and Ted Cruz if anyone wasn’t sure.  Yet the leftists on SneerClub and other social media, instead of being delighted that I agree with them about something, are out with their usual knives.  What gives?  To me, this seems like an interesting illustration of the difference between the “original” leftism rooted in Enlightenment ideals, and the “new” kind that’s all about smashing class and gender and race enemies by any means possible—a kind that owes less to Spinoza, Mill, or MLK than it does to Lenin, Stalin, and Mao (figures who a subset of the SneerClubbers explicitly endorse as heroes).  One SneerClubber is arguing that, in an ideal world, I would not be allowed to be a CS professor—I’d be fired and replaced by someone with less white male nerd privilege—even (so this person adds) if that meant that the world would make slower progress toward solving P vs NP.  Well, I suppose I should be grateful for the implied compliment in that last part, even though it’s probably undeserved! 🙂  But this goes a long way toward resolving the puzzle: if that’s really how these commenters feel about me, then how could they <i>not</i> feel disappointed that I wasn’t imprisoned over a trivial misunderstanding—no matter how hard such a wish might be to square with their supposed radical beliefs?</p>\n]]>", "author": "Scott", "published": "2018-08-14 00:40:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Fillipo Riccio #155</p>\n<p>People wonder why this thread has gone on so long, and here is one answer: some people just are not paying attention to the facts of the case. You write: </p>\n<p>&#8220;Really a cop in the USA can arrest and handcuff you out of the alleged accusation of stealing 4$ by a store manager in an airport??? This is ridiculous, and it is really scary that so many people find it “normal” and even “right”.</p>\n<p>At the minimum, you should leave a review on tripadvisor, google et al. where you explain what happened, and that the store manager has the tendency to call the cops to arrest bona fide customers. The shop should be severely punished for doing so (instead of the normal and civil course of action, which is to insist with you politely to clear the misunderstanding and nothing else).&#8221;</p>\n<p>The alleged accusation? The cashier witnessed the money being taken and identified Scott, and there was in addition a video of Scott taking the money, being informed he took the money, indicating that he was aware that the cashier was talking to him, and not returning the money. That is hardly an &#8220;alleged accusation&#8221;.</p>\n<p>Look, I get that people on this blog like Scott. I am fond of Scott myself. But that is neither here nor there. Stop trying to make Scott the victim here. He wasn&#8217;t. A manager who calls the cops when someone takes money that does not belong to him and, when informed of that, does not give it back is not being unreasonable. And once the cops get involved, as I said, they follow SOP. Bunsen Burner chooses to ask what if it was a 5-year-old child or a disabled person. But what in the world is the point of such a question? The point of handcuffs is restraint: if the disabled person cannot flee or do any harm, then for all any of us knows they would not be handcuffed. Nor a 5-year-old. But that is entirely conjectural: Scott is neither 5-years-old nor disabled. He is perfectly physically capable or fleeing, fighting, pulling a weapon, etc. So what is the point of Bunsen Burner&#8217;s question except to play a plainly rhetorical trick? It would be nice if people could take serious questions seriously.</p>\n<p>Complaining about the manager on Trip Advisor is doubly or triply silly. Scott took money out of their tip jar! Scott—quite appropriately—offered the manager $40 for all the trouble he caused and the manager graciously declined. That is called polite and civilized behavior. Would there were more of it.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Maudlin:Tim.html\">Tim Maudlin</a>", "published": "2018-08-14 00:52:16+00:00", "title": "By: Tim Maudlin"}, {"content": "<![CDATA[<p>Maudlin #149: I don&#8217;t see a problem with requiring officers to do judgement calls. On the contrary, I think a critical part of the training of a police officer is being able to identify threats and respond accordingly. Judgement calls are simply unavoidable. We don&#8217;t want our police officers to be mindless thugs that simply apply overwhelming force to every situation. Think of a police officer that stopped a car in the street, and the driver leans forward and opens the glove box. Is the driver reaching for his documents, or pulling a gun on the officer? There are people who indeed shoot police officers that stop their cars, but barring some evidence that the driver is in fact a cannibalistic axe-murderer with a warrant out for his arrest, I don&#8217;t think the police officer should shoot people who reach for their glove box.</p>\n<p>In the case of Scott, I think any police officer, even in the US, would correctly conclude that a middle-aged man with wife and children carrying a lot of luggage in an airport poses no risk of fight or flight (well, the other kind of flight yes).</p>\n<p>About &#8220;force&#8221;, I think you are being sidetracked by semantics. Would you agree if I rephrased the sentence as &#8220;I hope everybody agrees that the police used excessive restraints in Scott’s situation.&#8221;?</p>\n<p>The discussion is then about whether we can generalise from Scott, who we know poses a danger only to shoddily-proven theorems, to more general arrest situations. I think the answer is clearly yes, as the Austrian law shows. Moreover, I would bet that in Germany and the UK the police procedure is similar to the Austrian one, and that even in more dangerous countries like France or Belgium the generic Scott wouldn&#8217;t be handcuffed.</p>\n<p>A final point about escalation: I think it is obvious that there is an escalation from talking to someone to handcuffing them. Another story that might be relevant: several years ago, I was driving at night in middle-of-nowhere, Brazil. The police was looking for a thief that had just committed armed robbery and was fleeing in a car of the same model and colour than mine. They stopped my car, and ordered me to face the wall with the hands over my had, as they angrily shouted questions at me. I was so scared and confused that I didn&#8217;t really understand what was going on, and followed my instinct of looking at the person who is talking to me. Bad idea. The police officer had the gun in his hand already, but luckily made the correct judgement that I was not about to pull a gun on him, and did not shoot me. I think if this had happened in the US I wouldn&#8217;t be writing here tonight.</p>\n<p>Going back to the airport, I don&#8217;t doubt that in the shock of being handcuffed I would flail around, which would be interpreted as resisting arrest, and things would go downhill from there.</p>\n]]>", "author": "Mateus Arajo", "published": "2018-08-14 01:04:38+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<blockquote><p> To me, this seems like an interesting illustration of the difference between the “original” leftism rooted in Enlightenment ideals</p></blockquote>\n<p>I&#8217;d just call that liberalism, Scott.  I think it&#8217;s much simpler if we all just refer to the Enlightenment thing as &#8220;liberalism&#8221; and this other thing as &#8220;leftism&#8221;.  That&#8217;s how the leftists call it, at least, and on this at least I think their terminology makes sense.</p>\n<p>(Well, kind of.  I&#8217;m being a bit broad with my use of &#8220;leftism&#8221; here, I dunno that SJers are necessarily leftists proper, but to my mind there is, as you&#8217;ve also noticed, an essential similarity of thought between them, so whether we use that label or another one, it is useful to group them together, in a way that it is not useful to group them with liberals.)</p>\n<p>(Once again, see my <a href=\"https://slatestarcodex.com/2018/02/15/five-more-years/#comment-601638\" rel=\"nofollow\">triangular model</a>, which has liberalism, leftism, and traditionalism-authoritarianism as its three poles&#8230;)</p>\n]]>", "author": "Sniffnoy", "published": "2018-08-14 01:18:13+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Scott #161: The solution to your puzzle is rather obvious, and contained within your own comment: SneerClub is not a leftist community, but rather a community founded explicitly to sneer upon Yudkowsky and Pinker and etc. It is the place to go if one wants to badmouth people, not the place to go if you want to discuss left-wing politics.</p>\n]]>", "author": "Mateus Arajo", "published": "2018-08-14 01:22:02+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Tim Maudlin #158</p>\n<p>I hope I submit the comment before the thread closes :).</p>\n<p>I see you speak the bureaucrat language -you know the very thing most people seem to agree on this thread sucks as a defense of anything related to government. Like &#8220;those policemen that handcuffed Scott were following standard operating procedures&#8221;. In addition I see you use left wing sources to confirm your beliefs. Not the best way to show your analysis is impartial.</p>\n<p>1) The IG is part of the government dear. It&#8217;s not like hiring some external party who has access to relevant information. It&#8217;s government investigating itself. It&#8217;s like you know, some corporation that commits securities fraud telling the SEC: don&#8217;t send your investigators here, our internal people will conduct an investigation and will send you their report. I can&#8217;t believe anyone, including committed liberals, buys any argument based on government investigating itself. Apparently you don&#8217;t understand how large bureaucracies protect themselves. In the case of the targeting of the Tea Party groups by the IRS, the Department of Justice agreed to a settlement. Giving a leftist outlet opinion that supports your own preconceived opinion might work when you talk to other liberals, but it doesn&#8217;t work here. So &#8220;why did the Trump administration (not the Obama administration) settle these lawsuits and give the right-wing groups piles of taxpayer money&#8221; because the Obama administration was corrupt to admit any of its own wrong doing. I am amazed that I have to explain this!</p>\n<p>2)  You are mixing apples and oranges here. The hacking of the DNC/Podesta files was done by a third party (who exactly we don&#8217;t know because Wikileaks -whom I give more credibility than any state actor including -actually particularly- the United States government- denies that their source is a state actor). Unless you live in a world where nefarious spy government agencies are run by angels (I don&#8217;t live in that world), it&#8217;s hard to conclude anything other than DNC/Podesta were hacked by the third party and that evil US spying agencies are trying to assign blame to Russia. And in the case of Podesta, his using a weak password had a lot to do with the hacking. I am talking about, on the other hand, the US government spying on a US political campaign. Very different. All information we have available at this point suggests an attempt at spying the Trump campaign through Carter Page. The FBI even went as far as leaking part of the fabricated dossier, generate news about it and use said news to give further ammunition to the FISA court. This is the kind of things the US government spy agencies have done for years (check operation MK Ultra for example or the dirty tricks employed by J. Edgar Hoover).</p>\n<p>3) and 4) they were fired by Trump sure, and he made the nation a big favor for getting rid of such corrupt individuals who had been making a living out of our tax dollars. </p>\n<p>5) Anyone of us commits, on average, 3 felonies a day. Nobody was ever sent to jail for what Dinesh did. If you want a technical explanation as to why what the Obama administration did was political corruption of the first order, here is somebody explaining it better than me <a href=\"https://www.nationalreview.com/corner/dinesh-dsouza-pardon-just/\" rel=\"nofollow\">https://www.nationalreview.com/corner/dinesh-dsouza-pardon-just/</a> . It comes from a Never Trumper, so hardly suspect of being blindly loyal to Trump. </p>\n<p>Finally,</p>\n<p>&#8220;I have no more interest in responding to you than to the Flat Earth Society, not because there are not powerful responses to all this nonsense but because rational people would never fall into such nonsense to begin with, and trying to argue rationally with irrational people is a fool’s mission.&#8221;</p>\n<p>Treating disagreement with your dogmatic liberal views as membership in the Flat Earth Society just confirms what I have been saying all along: you live in a liberal bubble immune to reasoning when it comes to anyone who tries to challenge your political dogmas. One thing you don&#8217;t seem to understand clearly is the difference between personal beliefs, facts , the way prosecution decisions are made and the law. When it comes to actual guilt, most of us could potentially be prosecuted for a long list of dirt because we live in an over criminalized society. Proprietorial discretion is the idea pf the prerogative prosecutors have when it comes to using the resources at their disposal to prosecute those crimes. They can pick and choose as they see fit (this is the legal theory Obama used to justify DACA and other similar programs that benefit illegal immigrants). The notion that the decisions on who to prosecute are made in the vacuum, irrespective of political context and according to some predetermined impartial algorithm is very naive. Thus both the decision to prosecute Dinesh and the decision to give a pass to Hillary Clinton were politically motivated and on both cases there is evidence in the public domain that indeed politics played a role. If your personal beliefs are aligned with Obama&#8217;s you see these decisions as fair. If they are not -and mine certainly aren&#8217;t- it&#8217;s perfectly legitimate to see both decisions as politically motivated and corrupt.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2018-08-14 01:32:55+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Mateus,</p>\n<p>I am sort of bending over backward here to try to have a rational discussion of what are difficult issues, and I can&#8217;t understand why you are refusing. I have said over and over that every point where you invite or require the police to make a judgment is of necessity a place where the police can make a misjudgment and where the police can make a biased judgment. You give a long description of the features of Scott that make him &#8220;obviously&#8221; not a risk of fight or flight. OK: now how about providing us with a description of an individual who did exactly what Scott did—took the tip money, was informed of that, and did not return it—who is a risk of fight or flight. Describe the contrast case in detail, and then we can put your two descriptions side-by-side and see what sorts of people you think ought to be handcuffed when arrested and what sorts of people should not. And let&#8217;s then ask ourself if we want to live in a society where the police treat these two groups differently in what is legally exactly the same situation. I think that put blankly like that we would not be happy to endorse your suggestion.</p>\n<p>I appreciated you taking the trouble to look up the procedures in Austria. I do not appreciate just making stuff up about what you would bet. That is not evidence of anything except your own prejudices. If you want to check the facts, check them and if not then don&#8217;t idly speculate.</p>\n<p>Finally, if you really would not be cooperative if you were arrested, I suggest you work on that flaw in your character. Because if you happen to be arrested in circumstances like Scott&#8217;s, your best bet is to do what Scott did. Anything else will lead to a worse result, maybe dramatically worse.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Maudlin:Tim.html\">Tim Maudlin</a>", "published": "2018-08-14 01:32:58+00:00", "title": "By: Tim Maudlin"}, {"content": "<![CDATA[<p>Scott #161</p>\n<p>Remember that a conservative is a liberal who has been mugged? Or that other saying something like if you are not a communist at the age of 20 you don&#8217;t have a heart but if you continue to be one at 50 you don&#8217;t have a brain? </p>\n<p>The reason leftism consistently loses is because it always degenerates. You cannot really decouple the two forms of leftism you describe. Stalin didn&#8217;t rule over Western Europe after World War II and yet the social democracy attempted there is bankrupt. Inevitably, the leftists running the European governments have used their powers to benefit powerful lobbies. The human heart is corrupt and if you give anyone power, that power will be misused sooner or later. It&#8217;s human nature. The Wall Street Journal had recently an article on this topic (it&#8217;s behind the paywall and I think I am still operating under fair use protections by publishing this extended quote) <a href=\"https://www.wsj.com/articles/the-eu-spent-a-bundle-to-unify-the-continent-its-not-working-1533743729\" rel=\"nofollow\">https://www.wsj.com/articles/the-eu-spent-a-bundle-to-unify-the-continent-its-not-working-1533743729</a>  &#8220;The European Union has spent nearly $1 trillion to unify the continent by delivering highways and trains into places where there were once gravel paths. In current dollars, that is over eight times the Marshall Plan that rebuilt Europe after World War II. The EU has bought airports and bridges, trams and swimming pools. It has repaired castles and medieval churches. It hasn’t bought love. To the vexation of European leaders, some of the biggest recipients of funding are now hotbeds of discontent, brimming with voters disquieted by the cultural and political pressures that have accompanied European integration, and threatening the bloc’s cohesion.&#8221;</p>\n<p>Leftism has always been more interesting in the world of ideas than in the world of having actual humans implementing it.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2018-08-14 01:50:07+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Maudlin #167: I&#8217;m afraid I will mostly repeat what I wrote before, but I&#8217;ll try to more explicitly address your points: I understand you want to reduce the situations where the police is required to do a judgement call, but I&#8217;m arguing that they are unavoidable, and it is better to train the police officers to do them, instead of trying to codify everything in a rigid procedure. I&#8217;m pretty sure that every procedure would have called for the Brazilian police to shoot me in that encounter a few years ago, and I&#8217;m happy they used their judgement instead. I&#8217;m offering the Austrian law as an example of how this works in practice, and I think it is the ideal solution.</p>\n<p>I don&#8217;t think we should codify into law who is a risk of fight or flight, as this is better addressed in police training. But to answer your question, I would be happy for unaccompanied young men not carrying luggage to be classified as a flight risk. For a fight risk, I would add being strong and/or carrying a weapon or clothes that could conceal a weapon. This obviously still leaves a large grey are between them and the mythical Scott, so again I think a judgement call is unavoidable.</p>\n<p>About looking stuff up, I did also search about the police procedures in Germany, but didn&#8217;t get anything as cut and dried as in Austria, but just the general principle of Verhältnismäßigkeit (loosely speaking, that the police is not allowed to infringe on the rights of a suspect more than is necessary to protect the rights of those the suspect is threatening). I&#8217;m not willing to research the police procedures of more countries, and specially not of those whose languages I do not speak. Instead of considering my bet an idle speculation that only reveals my own prejudices, maybe you could consider it as an invitation to do research yourself, and an opportunity to get some bottles of single malt scotch? I&#8217;d take the bet at three-against-one odds.</p>\n<p>Finally, I find it hard to rework my jumpy character. I&#8217;d rather avoid the US until the police there gets less trigger-happy. But please note that I didn&#8217;t say that I would be uncooperative, but that I could inadvertently flail around from the shock.</p>\n]]>", "author": "Mateus Arajo", "published": "2018-08-14 02:43:08+00:00", "title": "By: Mateus Araújo"}]