[{"content": "<![CDATA[<p>Three of our favorite topics &#8212; Trump, IQ tests, and Mensa &#8212; might collide in a perfect storm:</p>\n<p><a href=\"https://www.usatoday.com/story/news/politics/onpolitics/2017/10/10/trump-says-hes-willing-compare-iq-tests-rex-tillerson/749112001/\" rel=\"nofollow\">https://www.usatoday.com/story/news/politics/onpolitics/2017/10/10/trump-says-hes-willing-compare-iq-tests-rex-tillerson/749112001/</a></p>\n<p>You can&#8217;t make this stuff up!!</p>\n]]>", "author": "Raoul Ohio", "published": "2017-10-10 18:47:13+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>#3 and #4: The best way to communicate to Donald Knuth is to find a few math mistakes in TAOCP, write up the corrections, mail it to him, and put in a PS at the end of the letter.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-10-10 18:51:00+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<blockquote><p>Conditioned on that happening, I have a very hard time guessing whether the protesters would be feminists, antifa, anti-Zionists, white-nationalist antisemites, Trump supporters, quantum mechanics deniers, D-Wave investors, anti-Platonists, or people who believe that P=NP or that black hole evaporation is non-unitary.</p></blockquote>\n<p>It&#8217;ll be Bell&#8217;s-Inequality-violation-deniers, for sure. 😛</p>\n]]>", "author": "Sniffnoy", "published": "2017-10-10 18:59:09+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Learning that Michael Cohen chose to work on hard problems in practical linear algebra encourages me to ask the theorists out there to consider such a problem that seems to me to be hard. </p>\n<p>Definitions. Matrix B majorizes matrix A iff A \\leq B, and the spectral radius of B, \\rho (B), is the maximum of the absolute values of the eigenvalues of B. </p>\n<p>Raoul Ohio Challenge Problem:  For a given n x n nonnegative matrix A, and a positive integer r less than n, find or otherwise characterize the rank r matrix B of minimum spectral radius that majorizes A.</p>\n<p>Note 1: Rank 1 is of special interest. </p>\n<p>Note 2: An easy solution to the related question, “Find the L2 closest B to A”, is given in Volume 1 of Horn & Johnson in terms of the Singular Value Decomposition.</p>\n<p>Note 3. If you attack with lagrange multipliers, you will find “Matrix Differential Calculus” by Magnus & Neudecker to be useful. This invaluable reference is available as a .pdf at Magnus’s web site.<br />\nNote 4: Alternative and similar versions of this problem are of interest.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-10-11 04:30:37+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Scott, &#8220;continuous observables would seem to open up the possibility of physical hypercomputers&#8221; &#8230; could you sketch this argument out or have a handy link?</p>\n]]>", "author": "atreat", "published": "2017-10-11 08:08:42+00:00", "title": "By: atreat"}, {"content": "<![CDATA[<p>atreat #42: If you could measure time to infinite precision, you&#8217;d then need to explain why you couldn&#8217;t construct a computer that did the first step in 1 second, the second in 1/2 second, the third in 1/4 second, etc., so that it would do infinitely many steps in 2 seconds.  Likewise, if physical observables were fundamentally continuous, you&#8217;d need to explain why infinitely many bits couldn&#8217;t be stored in a finite region of space.</p>\n]]>", "author": "Scott", "published": "2017-10-11 14:33:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #42, Doesn&#8217;t the free energy cost for constructing computers at progressively smaller scales, specifically relative to human length, free energy, and entropy scales, rule out *us* making and being able to use infinitely finely constructed computers? Alternatively, one can just say that we talk about models, not about &#8220;how the world really is&#8221;, to resolve the problem. Alternatively again, even if the entropy of even a finite region of space-time is infinite, still one can talk about other measures that might be finite, distinguishing, say, between the number of words in this comment and the perhaps infinite details of the chemistry and nuclear physics and turtles-all-the-way-down in my head that were wasted to make it (then we can talk about how much smaller my thought processes are than other people&#8217;s and how IQ is or is not a good measure).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Morgan:Peter.html\">Peter Morgan</a>", "published": "2017-10-11 15:02:49+00:00", "title": "By: Peter Morgan"}, {"content": "<![CDATA[<p>Peter #44: Saying that we only talk about models, not the world as it really is, is <i>obviously</i> a cop-out, which contributes nothing whatsoever to resolving the problem.  If your model says hypercomputing is possible, but you don&#8217;t think it&#8217;s possible in reality, then you need a better model, because your current model fails to explain something that it needs to explain.</p>\n<p>Yes, energy limitations and so forth are possible ways to resolve the problem, even in a universe with continuous observables.  But crucially, the burden is on the advocate of such a theory to explain why the problem is not a mere engineering limitation, and why it makes their theory consistent with the physical Church-Turing Thesis even in principle.  Either that, or else come out and clearly say they deny the CT Thesis, and ideally suggest how to build a physical hypercomputer.  But don&#8217;t pussyfoot around the issue with circumlocutions.</p>\n]]>", "author": "Scott", "published": "2017-10-11 16:33:21+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Wow, I hadn&#8217;t expected the comp sci version of Zeno&#8217;s paradox!</p>\n<p>&#8220;But crucially, the burden is on the advocate of such a theory to explain why the problem is not a mere engineering limitation&#8221;&#8230;</p>\n<p>Forget comp-sci, why not just harken back to Zeno and place the burden on someone to explain how we walk from point a to point b since we are forced to do a binary search of the infinitely many points in between?</p>\n]]>", "author": "Atreat", "published": "2017-10-11 19:25:17+00:00", "title": "By: Atreat"}, {"content": "<![CDATA[<p>Scott #45: I would say my approach to continuum physics more-or-less does not allow the axiom of choice. One can have infinite sequences, but they have to have finite constructions. One can have \\pi, \\sqrt{2}, closure of finitely constructed sequences in a norm, but nothing that makes measure theory fall apart. This doesn&#8217;t preclude always being able to introduce a more elaborate, better model (or a better theory). In particular in QFT, where measure theory is essential to allow a probability interpretation, allowing the axiom of choice is problematic. My apologies if this still seems like pussyfooting. I&#8217;m very much out of my depth, but does hypercomputing require the axiom of choice to get off the ground? I would take storing infinite information in a finite (or infinite) volume of space-time to require the axiom of choice.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Morgan:Peter.html\">Peter Morgan</a>", "published": "2017-10-11 19:28:43+00:00", "title": "By: Peter Morgan"}]