[{"content": "<![CDATA[<p>Collected responses to &#8220;roystgnr&#8221;:</p>\n<blockquote><p>If the underprivileged can’t afford to cut their carbon footprint voluntarily, making it involuntary will not be an improvement.</p></blockquote>\n<p>The nominal point of your comment is defend capitalism, yet you begin the argument with a nearly Marxist interpretation of lower incomes.  It is not actually the case that the &#8220;underprivileged&#8221; have a fixed set of needs, which they either &#8220;can afford&#8221; or &#8220;can&#8217;t afford&#8221;.  Poor people respond to economic incentives and disincentives just like everyone else does.   In US states with wise energy policies, poor people emit less CO2 along with everyone else.  These states do not have more poverty or more income inequality.  Actually, many of them have less poverty, because states that care more about the environment also tend to care more about poverty.</p>\n<blockquote><p>Perhaps the plan is to teach everyone who votes enough about turbulence modeling that they’ll be able to validate GCMs themselves and skip the middle-men?</p></blockquote>\n<p>Ostensibly the point here is about how to persuade people, but you slip in one of the tell-tale red herrings of global warming pseudo-skepticism.  Namely, you talk as if global warming is a scientific <i>deus ex machina</i> that rests only on fancy computer models.   Of course, yes, scientists make computer models, because why shouldn&#8217;t they, if they have computers?   However, you do not need any very fancy models to interpret infrared absorption by CO2, directly measured by satellites; nor the summer collapse of the Arctic ice sheet; nor the fact that Glacier National Park is losing its glaciers and Alaska&#8217;s snow season has shortened.   These things aren&#8217;t hard to understand even when they are explained by hypocrites.</p>\n<blockquote><p>Preaching to the choir doesn’t change the mind of the median voter, who may be more easily swayed “to believe it’s a crisis when the people who keep telling me it’s a crisis start acting like it’s a crisis”.</p></blockquote>\n<p>On the other hand, despite Scott&#8217;s hyperbole, the accusation of hypocrisy is also a complete red herring.  If you consider <a href=\"http://en.wikipedia.org/wiki/List_of_U.S._states_by_carbon_dioxide_emissions\" rel=\"nofollow\">CO2 emissions per capita by US state</a>, you can see a clear pattern that state politics is correlated with greenhouse gas emissions.   Californians and New Yorkers believe in global warming, and they aren&#8217;t hypocrites.  But the thing about accusations of hypocrisy is that it is routine to argue by anecdote, rather than comprehensive statistics.  Citing travel to &#8220;faraway conferences&#8221; is just a smart-aleck remark; it&#8217;s not data.</p>\n<p>Besides, even when smart-alecks don&#8217;t find any shred of hypocrisy, they turn smug instead of changing their minds.  A typical reaction is:  &#8220;Sucker!  Masochist!   You may enjoy wearing a hair shirt, but I&#8217;m glad I&#8217;m not you.&#8221;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2015-06-10 16:25:15+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Jane, you should consider that animals in nature suffer even more than poor humans, on average. Life predation is terrible and most environmentalists have a view that is too rosy in this regard.</p>\n<p>So a reduction of population should also aim at reducing the number of individuals per non-human animal species, both in the wild and domesticated, without necessarily reducing biodiversity too much, and without destroying sustainability of human civilization.</p>\n<p>Another factor to consider are economies of scale. For every useful human talent, we should expect a certain small percentage of people born with it. Networking these people may have a disproportionate influence on innovation and problem solving. A higher population is more effective in this regard, simply due to the large numbers. If, out of 1000 additional people, we get one additional genius and 300 medium-talented people, we can surely afford 300 more net-neutral, 250 slightly costly people and 50 petty criminals.</p>\n<p>Economies of scale also mean that every invention, innovation, cultural product, and so on, can be shared by more people: The ratio of fixed costs to marginal costs of any product goes down.</p>\n]]>", "author": "Devil's Advocate", "published": "2015-06-10 16:48:21+00:00", "title": "By: Devil's Advocate"}, {"content": "<![CDATA[<p>Greg Kuperberg #150:</p>\n<blockquote><p>&#8220;Citing travel to “faraway conferences” is just a smart-aleck remark; it’s not data.&#8221;</p></blockquote>\n<p>Are you denying that academics travel to &#8220;far away&#8221; conferences, whatever &#8220;far away&#8221; means? Or are you saying that they do but that activity is not a significant contributor to Global Warming on a personal footprint basis?</p>\n<p>In any case, that is a comment about the &#8220;average&#8221; academic. Does not mean there aren&#8217;t exceptions. </p>\n<p>Here&#8217;s another way to look at it: The US CO2 emission was approx 17 tons per capita (2012 data).  The world average was 5 tons per capita. Obviously there&#8217;s something &#8220;you&#8221; are doing wrong? Let&#8217;s say it isn&#8217;t flying to &#8220;far away&#8221; conferences it is something else?</p>\n]]>", "author": "Rahul", "published": "2015-06-10 16:59:59+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Collected responses to &#8220;jonathan&#8221;:</p>\n<blockquote><p>My concern is that the divestment movement perpetuates an anti-capitalist and anti-corporate narrative.</p></blockquote>\n<p>I don&#8217;t think that a divestment movement is necessarily intrinsically anti-corporate.   The South African divestment movement eventually succeeded; the turning point came when it was backed by powerful national governments.   However, almost anyone who is anti-corporate would naturally support divestment; the movement has to have more to it than that, or else it will be entirely futile.</p>\n<p>On the other hand, it would not be futile because it might &#8220;alienate moderates&#8221;.  It would be futile because, as you say, denouncing companies as evil without changing fundamental incentives doesn&#8217;t solve anything.</p>\n<p>I also note that the South African divestment movement asked companies to do something relatively simple for them.   Despite talk about Exxon changing its business model, it would have to change so much that it would afterwards be Exxon in name only.   This particular divestment movement has the rather grandiose goal of expecting Exxon to curl up and die.  Which in fact is what is happening to US coal companies to some extent, thanks to the natural gas boom and to new environmental policies.  But it&#8217;s not happening to Exxon, and I&#8217;m not sure that it&#8217;s really possible.</p>\n<blockquote><p>As an aside, are there any charities devoted to funding basic research on renewable energy?</p></blockquote>\n<p>It&#8217;s a noble question, and one answer is that some of the best such charities are universities themselves, MIT notably among them.  You can make earmarked donations to universities.   However, another answer is that it&#8217;s not really the point.   The countries that emit the most CO2 have vast opportunities to emit less with existing technologies, and endorsing research as the one thing that everyone likes amounts to procrastination.</p>\n<blockquote><p>Fossil fuels have done a lot of good in the larger scope of history. They enabled the industrial revolution, and thus living standards above subsistence for the first time in human history.</p></blockquote>\n<p>There is a lot more to the industrial revolution than just fossil fuels.  Moreover, most of world&#8217;s anthropogenic CO2 comes from the second stage of industrialization in the 20th century, and not the primitive industrial revolution in the 19th century.   In this second stage, we have had plenty of chances to emit less carbon dioxide, if only we had understood global warming earlier, and if only more people would take it seriously.</p>\n<p>In fact, we have punished ourselves with various regrettable externalities of coal combustion all along, including <a href=\"http://en.wikipedia.org/wiki/Chronic_obstructive_pulmonary_disease\" rel=\"nofollow\">COPD</a>, acid rain, and environmental mercury.   Now you could always wax philosophical about this with abstract statements such as, &#8220;every technology comes with side effects&#8221;.   But the truth is that coal is a very primitive technology that has always been a dirty way to generate energy.  We&#8217;ve had hydroelectric power for 130 years, natural gas for about a century, and nuclear power for 60 years.  We&#8217;ve had a lot of time to switch to better choices than coal.  What has happened with transportation fuel is more complicated, but it&#8217;s been clear since the 1970s that the US has been a short-sighted pig with oil consumption.</p>\n<blockquote><p>Ironic that an inert byproduct of combustion could be the agent of society’s destruction.</p></blockquote>\n<p>Okay, yes, I have talked about hard choices, but I really did mean <i>politically</i> hard choices more than <i>economically</i> hard choices.   The choice in front of us is not actually, &#8220;do we sacrifice now or destroy ourselves later&#8221;.   Rather, it&#8217;s &#8220;do we as the human race cooperate now, or do we sorely regret it later&#8221;.</p>\n<blockquote><p>One nice thing about market-based solutions, like a carbon tax, is that we don’t need to make the decision in particular cases. We just need to put the right price on carbon, and let individuals, and individual nations, decide how to proceed.</p></blockquote>\n<p>For sure, carbon taxes (or greenhouse taxes) are by far the best economic approach to this problem.  Yet at another level, they aren&#8217;t any solution at all.   In between an overarching government and individuals, you have an array of large public and private institutions.  They have to respond to a carbon tax (or similar) with specific choices.   When a state opens or closes a power plant of any given kind, that&#8217;s not actually an individual choice or even a free-market choice.  It&#8217;s a hybrid of market forces and public policy.</p>\n<p>It&#8217;s easy to fall into the trap of supposing that no one has to worry about a problem, if there is an abstract framework to encourage someone to worry about it.   All of the free-market axiomatics in the world won&#8217;t get you to a hospital after a car crash, if for whatever reason the only nearby hospital closed.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2015-06-10 17:14:50+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>#150</p>\n<p>Actually if you look here</p>\n<p><a href=\"http://environment.yale.edu/poe/v2014/\" rel=\"nofollow\">http://environment.yale.edu/poe/v2014/</a></p>\n<p>The people in Texas, Alaska, and Wyoming believe in global warming too although perhaps not so much as the people of New York and California. </p>\n<p>The states with high per capita CO2 tend to rural and agricultural.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2015-06-10 17:24:18+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>James Cross &#8211; First of all, if many people in Texas, Alaska, and Wyoming also believe in global warming, more specifically in anthropogenic global warming and its consequences, then so much the better as far as politics is concerned.   It shows you that Republican ideology on this issue is not very representative.   To some extent, what voters admire in the Republican camp is simply sounding resolute and ideological, even when the specifics aren&#8217;t all that convincing.</p>\n<p>The fact remains that liberal states whose leaders profess to care about global warming, sure enough, sometimes do something about it.  There is a difference between the kind of hypocrisy that actually defeats a cause, and the kind that is only fodder for smart-alecks.</p>\n<p>I agree that if a state is rural or agricultural, then its greenhouse gas emissions per capita are likely to be higher.   The oil industry itself also has high greenhouse emissions, which is a reason to partially excuse North Dakota, for example.   However, these attributes are not the whole story by any means.   Coal electricity is a major correlate.   To a large extent, you can think of the state government itself as the market agent that selects the mode of electricity production.   There really is a dichotomy between state governments that say that coal is crud that should be left in the ground, vs state governments that say that coal is a marvelous way to generate electricity.  That in turn is increasingly connected to the red-blue divide in American politics.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2015-06-10 18:06:24+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>There are some odd stats on that Yale page.</p>\n<p>For people in Texas</p>\n<p>63% think GW is happening<br />\n49% think it is caused by humans<br />\n40% think scientists believe GW is happening<br />\n73% think we should regulate CO2 as a pollutant (huh?)</p>\n<p>As a matter of fact in every state people by a majority think we should regulate CO2 but only two states by a majority think scientists believe GW is happening.</p>\n<p>Ultimately, however, believing something in the abstract and becoming convinced to take a concrete action (especially if the dreaded word &#8220;tax&#8221; is raised) are two different things. </p>\n<p>I think the fear-mongering, even if it has any basis in science, is counter productive.  The problem is that the negatives of climate change are likely to accumulate subtly, slowly, and inconsistently. Take hurricanes, for example. How many years since a major category 4 or 5 hit the U.S.? In this sort of scenario is hard to convince anybody to take drastic immediate action. It is also easy to point out that scientists have been wrong before and the track record on long-term predictions of any sort has not been good.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2015-06-10 21:19:09+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>roystgnr  #2,</p>\n<p><i>If the underprivileged can’t afford to cut their carbon footprint voluntarily, making it involuntary will not be an improvement.</i></p>\n<p>The plan isn&#8217;t to force involuntary cuts int he same way as voluntary cuts would go. For example, funding research for better solar cells or more funding for public transit will help decrease carbon footprints without the same problems that changes by individuals would incur on themselves.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2015-06-11 00:13:08+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Devil&#8217;s Advocate #151</p>\n<p>So a reduction of population should also aim at reducing the number of individuals per non-human animal species, both in the wild and domesticated, without necessarily reducing biodiversity too much, and without destroying sustainability of human civilization.</p>\n<p>Interesting : many non-human species are already in steep decline,while others-both domesticated and those we consider pests -are proliferating.</p>\n<p>Here I will confess to some typically human double standards,since in my vicinity we have problems with urban gulls and feral pigeons; we treat them as pests and neighbours and I are trying to solve what we see as an mounting problem. All this while I worry about species loss!</p>\n<p>Another factor to consider are economies of scale. For every useful human talent, we should expect a certain small percentage of people born with it. Networking these people may have a disproportionate influence on innovation and problem solving. A higher population is more effective in this regard, simply due to the large numbers. If, out of 1000 additional people, we get one additional genius and 300 medium-talented people, we can surely afford 300 more net-neutral, 250 slightly costly people and 50 petty criminals.</p>\n<p>THis amounts to the more people means more progress argument,if I understand you correctly.</p>\n<p>However,is it not likely that in a smaller population, geniuses and lesser talents would still appear,given human variablity and adaptability?</p>\n<p>Look at the Renaissance and the Industrial Revolution ; admittedly the latter did lead to the rapid development and consequent pollution which we now have to deal with,but it also saw significant progress and innovation,as did the Renaissance.</p>\n<p>All this with a much smaller human presence.</p>\n<p>Newtons and Einsteins will continue to appear won&#8217;t they? </p>\n<p>Isn&#8217;t it also true that if we provided more opportunities in terms of education, and investment in training by committing the funds that a smaller stable population could still progress and develop?</p>\n<p>Isn&#8217;t a better standard of living for more people likely to be achieved if there are fewer of us?</p>\n<p>I would say that human and non-human viablity would be better served by gradual reduction and stabilisation in a healthier and less stressed environment.</p>\n<p>BTW I&#8217;m not a tree hugger nor do I envisage an agrarian &#8216;golden age&#8217; ; I just think we should accept some limits and proceed accordingly,with all the ingenuity of which are capable.</p>\n]]>", "author": "jane", "published": "2015-06-11 01:19:51+00:00", "title": "By: jane"}, {"content": "<![CDATA[<p>James &#8211; </p>\n<blockquote><p>I think the fear-mongering, even if it has any basis in science, is counter productive.\n</p></blockquote>\n<p>Uh sure, that&#8217;s what <a href=\"http://en.wikipedia.org/wiki/Harry_Randall_Truman\" rel=\"nofollow\">Harry R. Truman</a> could have said when they told him to evacuate from Mount St. Helens.</p>\n<blockquote><p>The problem is that the negatives of climate change are likely to accumulate subtly, slowly, and inconsistently. </p></blockquote>\n<p>There is nothing subtle or inconsistent about sea level rise from global warming, although yes it is slow.</p>\n<blockquote><p>It is also easy to point out that scientists have been wrong before and the track record on long-term predictions of any sort has not been good.\n</p></blockquote>\n<p>No, actually the long-term predictions for various comets have been excellent.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2015-06-11 01:38:09+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Jane #158: Yes, in a smaller human population, genuises and lesser talents would still appear, but in smaller numbers. If it were true that no innovation can deal with the consequences of climate change, or make more resources available to humanity in general, then this would not matter much.</p>\n<p>But under the model that innovation can make a huge difference and more networked talents from the extreme upper ends of the bell curves are disproportionately more conductive to innovation, this effect can more than outweigh the resource costs of a larger population.</p>\n<p>I don&#8217;t know which effect dominates.</p>\n]]>", "author": "Devil's Advocate", "published": "2015-06-11 02:59:56+00:00", "title": "By: Devil's Advocate"}, {"content": "<![CDATA[<blockquote><p><b>James Cross</b> states [without evidence]: &#8220;the track record [of scientists] on long-term predictions of any sort has not been good.&#8221;</p></blockquote>\n<p>Scientific disciplines vary in predictive power.  In the case at hand, namely anthropogenic climate change, the main line of scientific reasoning is grounded:</p>\n<p>(1)&nbsp; <i>primarily</i> in thermodynamics,<br />\n(2)&nbsp; <i>secondarily</i> in the palaeo evidence, and<br />\n(3)&nbsp; <i>tertiarily</i> in computer models and recent observations. </p>\n<p><b>Question</b>&nbsp; How long has it been since a major scientific prediction that was grounded in primarily in thermodynamics has failed?</p>\n<p><b>Answer</b> One hundred fifty+ years.  The failed prediction was Kelvin&#8217;s 1862 estimate that the age of the Earth was 98 million years, based on a thermodynamic model of the rate of cooling of the earth&#8217;s core.  Kelvin&#8217;s earth-age prediction was wrong because energy-release associated to radioactive decay had not then been discovered.</p>\n<p>In the ensuing century-and-a-half <i>no major scientific prediction that was solidly grounded in thermodynamics has ever failed</i> (to my knowledge).  </p>\n<p>In particular, despite enormous economic incentives, precisely zero of the thousands of claimed perpetual motion machines have <i>ever</i> disproved the fundamental thermodynamic principle&nbsp;&mdash; the so-called Second Law&nbsp;&mdash; that no such machine can exist.</p>\n<p><b>Conclusion</b>&nbsp; The historical record, together with the threefold grounding of our present climate-change understanding in thermodynamics, in observations, and in computational simulations, provides ample reason for the scientific community to be confident that anthropogenic climate-change is real, serious, and accelerating.</p>\n<p><b>Question</b>&nbsp; Do arch-skeptics, similarly to perpetual-motion inventors, question the accepted principles of thermodynamics, and propose vastly different laws? </p>\n<p><b><a href=\"https://books.google.com/books?id=G197OA8Vd4sC&pg=PP1\" rel=\"nofollow\">You bet they do</a>!</b></p>\n]]>", "author": "John Sidles", "published": "2015-06-11 04:00:48+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Devil&#8217;s Advocate # 160</p>\n<p><a href=\"http://mahb.stanford.edu/blog/discussion-fate-earth/\" rel=\"nofollow\">http://mahb.stanford.edu/blog/discussion-fate-earth/</a></p>\n<p>Read the link and see what you think</p>\n<p>I would say that&#8217; the more is best&#8217; model would not provide the benefits predicted if human pressure on the world continues at its present rate,regardless of how many very clever and talented people appear.</p>\n<p>The discussion at the link goes into some depth; there is also plenty of other compelling material available on the MAHB site.</p>\n]]>", "author": "jane", "published": "2015-06-11 10:52:57+00:00", "title": "By: jane"}, {"content": "<![CDATA[<p>Jane #162: I followed your link and searched for terms like &#8220;economy/economies&#8221;, &#8220;scale&#8221;, &#8220;talent&#8221;, &#8220;efficiency&#8221;, &#8220;prosperity&#8221;, &#8220;population&#8221; and &#8220;margin&#8221; and found nothing of value.</p>\n<p>What I did find were gems like, &#8220;You ask why habitat loss and species extinction matters? Which is like, in my mind, the equivalent of wondering whether or not we should care about Hitler or Stalin.&#8221;</p>\n<p>And much more related language. The pattern is, humans are reckless, selfish and our hubris is a sin against Mother Gaia for which we should be punished.</p>\n<p>In other words, moralizing without scientific analysis. I suggest you use better sources in the future.</p>\n]]>", "author": "Devil's Advocate", "published": "2015-06-11 12:54:18+00:00", "title": "By: Devil's Advocate"}, {"content": "<![CDATA[<p>John Sidles @#120, re mistaking gantlet for gauntlet:</p>\n<p>First, thanks for your comments on this thread. which I have appreciated. However, I was going to correct my copy of #60 based on your remark, but checked first. Merriam-Webster&#8217;s online dictionary gives the meaning used on #60 as a secondary definition, and says this about gantlet: variant of gauntlet. So I won&#8217;t be correcting my copy. Of course, meanings, usage, and spelling of English words varies among English-speaking countries, and this may annoy some people, but this is not a good basis for critiquing an argument, in my view.</p>\n<p>While I&#8217;m wasting electrons, in response to another commenter on #60 whose name and number I am too lazy to verify (for which I sincerely apologize), I don&#8217;t hold the IPCC in quite the same light as, for example, the scientific consensus on evolution, because it seems to me it is partly political. However, I agree a) that the IPCC should be supported  and b) that standards cut both ways. I guess the issue is whether a public dissent of any degree with the IPCC is trying to affect public policy without changing the scientific consensus, or trying to change the scientific consensus.</p>\n]]>", "author": "JimV", "published": "2015-06-11 15:37:30+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>Devil&#8217;s Advocate #162</p>\n<p>Try this <a href=\"https://www.populationmedia.org/issue/human-rights/\" rel=\"nofollow\">https://www.populationmedia.org/issue/human-rights/</a></p>\n<p>The PMC is a well established organisation and its various programmes are all positive in terms of human well being.</p>\n<p>I cannot find anything in their website which blames or makes punitive statements about humanity but their message is clear.</p>\n<p><a href=\"http://www.unfpa.org/publications/population-matters-sustainable-development\" rel=\"nofollow\">http://www.unfpa.org/publications/population-matters-sustainable-development</a></p>\n<p>UN reports at this link</p>\n]]>", "author": "jane", "published": "2015-06-11 16:55:39+00:00", "title": "By: jane"}, {"content": "<![CDATA[<p>JimV #164,</p>\n<p>I guess my point is that many environnementalists do not realise there own position is not according to the scientific concensus. </p>\n<p>Best example are the several rants we could read here about overpopulation. &#8220;Hello Malthusian fearers, could you please realise this concern was, in the 90s or thereabout, postponed to some distant future by the demographs themself?&#8221; </p>\n<p>But that apply to the petition also. IPCC ask for a 40% cut in greenhouse emission by 2050. For USA this wouldn&#8217;t implicate any grand technological shift: France emits 5, Germany 9, USA 17. Just put the same tax on oil as europeans, or construt as much nuk as France or Japan, and voilà. (last one seems the way China is taking)</p>\n<p>That said, the petition also included &#8220;fossil fuel companies have a proven record (&#8230;) of actively working to obscure the scientific consensus around climate change.&#8221; Imho this would be enough to justify divesting MIT’s endowment from fossil fuel compagnies. But is it true that all fossil fuel compagnies behave the same?</p>\n]]>", "author": "Jay", "published": "2015-06-11 17:30:43+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Scott #131 &#8211; I&#8217;m not sure a majority, or even a very large plurality, need buy in, so long as they&#8217;re well-placed. Again, I think of differences 1975-2015 in ordinary civic life. Fewer of us smoke &#8211; why? Because of taxes, yes, but taxes don&#8217;t often deter addicts. It&#8217;s simply much harder to smoke now than it was in 1975, or 1985. When I first worked in a city room, people smoked there (and were furious when the &#8220;go outside&#8221; edict finally came down). People smoked in college classrooms. People smoked everywhere. Ashtrays were everywhere, cigarette butts were all over the floor, the street. Everybody knows that smoking ain&#8217;t allowed in school &#8212; unless it&#8217;s lunchtime and you&#8217;re out in Cancer Court. Cigarette vending machines were everywhere. Cigarette *ads* were everywhere. Now? </p>\n<p>Yesterday my daughter told me she&#8217;d just realized the name of the cigarette &#8220;behind the cashier&#8221; wasn&#8217;t &#8220;Malibu&#8221; but (and here she mangled &#8220;Marlboro&#8221; in a way I can&#8217;t reproduce). She has no idea who the Marlboro Man is. Has never seen anyone smoking in a restaurant. Never been in a car or a house with a smoker. Has never picked up a butt off the sidewalk to peel it apart and see what the filter&#8217;s made of. Never seen a cigarette vending machine. Does not know any adults who smoke. Does not recognize ashtrays. Would not recognize the veracity of the scene in My Name is Asher Lev where the very young Asher used ash from his mother&#8217;s ashtray as charcoal, to make the shadow of her cheek in a drawing. The change in the world was piecemeal &#8212; first you couldn&#8217;t smoke in college classrooms, then at work, then on buses and airplanes, then in theatres and official public buildings, then the vending machines disappeared (sorry, kids), then, then, then. The last to go has been smoking in bars (ending a 10-year run of unsociability for asthmatic me). The current battles are over smoking around children in child-custody cases. </p>\n<p>If it were up to the public we&#8217;d still be going around wreathed in smoke. Along the way, though, as the piecemeal social changes were worked for a multitude of reasons, it became rude to smoke. It simply isn&#8217;t done, if you&#8217;re above a certain social class &#8212; and it&#8217;s done less than it was, even if you aren&#8217;t. And even if you were furious at the nanny state for interfering with your right to give yourself and your kids lung cancer. I think this, rather than the wallet, is what really cements the social changes. </p>\n<p>Much of conservation is about &#8220;don&#8217;t&#8221;. Don&#8217;t run the furnace or the a/c. Don&#8217;t leave that on. Don&#8217;t leave the door hanging open. Don&#8217;t fly to Canberra, don&#8217;t buy the enormous house, don&#8217;t have a third child you can&#8217;t afford anyway. One of the civic don&#8217;ts I&#8217;ve seen lately is &#8220;don&#8217;t idle&#8221; &#8212; you&#8217;re sitting outside the school waiting for your kid; please turn off the car. A sign reminds you; you have to be a bit obstinate, socially antagonistic, to keep running the engine after that. If &#8220;don&#8217;t&#8221; is not only easy and relatively palatable but standing right in front of you, then it becomes your way of life, meaning you don&#8217;t have to be a conservation nerd to do it, and high-emission living begins to look a bit filthy, antisocial. So I think this is, like the anti-smoking campaigns, a slow thing, and one pushed by multiple interests, but probably not ineffectual.</p>\n<p>Apropos of Joshua Zelinsky&#8217;s #157, there are many ways of makaing what are effectively involuntary changes that do allow the underprivileged, brains-or-moneywise, to participate. For instance: My house is poorly insulated for my climate, and poorly situated, with no southern exposure at all, windows facing east and west. Change building codes, and, if necessary, go on subsidizing mortgages (as we already do), and the better-insulated, more passively-solar-heated house requires, say, 30% less natural gas to heat and some large chunk less in air-conditioning and furnace-blower electricity. And we&#8217;ve seen this before. The underprivileged here mostly do drive cars, but now the cars get 26 mpg, not 11 mpg. (Too bad we&#8217;ve done our urban planning so that they drive many more miles annually than they used to.)</p>\n]]>", "author": "Amy", "published": "2015-06-11 18:58:08+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Devil&#8217;s Advocate #162 and anyone else who might be interested.</p>\n<p>How about this :</p>\n<p><a href=\"http://research.microsoft.com/en-us/people/semmott/\" rel=\"nofollow\">http://research.microsoft.com/en-us/people/semmott/</a></p>\n<p>I have his book,which needless to say,attracted much publicity/discussion/dispute and which has since been revised.</p>\n<p>Details of the revisions on the website.</p>\n<p>He is a leading scientist in C ambridge and has a number of research interests.</p>\n<p>I&#8217;ve got his book.</p>\n]]>", "author": "jane", "published": "2015-06-11 19:17:39+00:00", "title": "By: jane"}, {"content": "<![CDATA[<p>@jane and Devil&#8217;s Advocate (various #s):</p>\n<p>I&#8217;m not so sure the math on talented and clever people works out so well if such traits are, as they seem to be, (1) correlated with longer generations, and (2) partially hereditary.</p>\n<p>On the other hand, there&#8217;s also a lot which is culture- and income-based when it comes to the length of generations (and the number of kids per), and those fronts <i>do</i> look promising overall. The question is whether they&#8217;re enough, or if we&#8217;ll have to resort to brain hacking.</p>\n]]>", "author": "Stephen V", "published": "2015-06-11 20:45:55+00:00", "title": "By: Stephen V"}]