[{"content": "See http://arxiv.org/abs/1104.0961 for a two-player version of this problem.  It lists the multi-player version as an open problem at the end.", "author": "Anonymous", "published": "2015-01-04 11:17:17.673000-08:00", "title": ""}, {"content": "Thanks for that pointer! I should have read the full version of the Brams et al paper (which is linked-to from the short version I found), which mentions the paper you pointed out. The paper assumes the cardinal utilities are known, while I thinking more in terms of using just the rankings of the items, however the &quot;crossout strategy&quot; seems to apply given just the players&#39; rankings of the items. (My solution, if it works, looks different; maybe I should now check it more carefully.)", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Goldberg:Paul.html\">Paul Goldberg</a>", "published": "2015-01-04 14:00:06.996000-08:00", "title": ""}, {"content": "Here are more pointers to the literature:<br /><br />Computing the subgame perfect Nash equilibrium is PSPACE-complete:<br /><br />http://www.nicta.com.au/pub?id=6902<br /><br />Assuming the manipulator knows the preferences of the other agents, his optimal manipulation can be computed in polynomial time. The optimal manipulation does not depend on the cardinal utilities:<br /><br />www.cs.cmu.edu/~arielpro/comsoc-14/papers/BouveretLang2014.pdf<br /><br />The cross out strategy only works for the case of 2 agents as far as I know but your solution works for  any number of agents. Both strategies work for any cardinal utilities consistent with the ordinal preferences.  This stems from a general insight of Bouveret and Lang that for computing the best response under sequential allocation, the cardinal utilities do not matter.<br /><br />Your solution works for the &quot;strict alternating&quot; sequence 123123123. It can be suitably formalized to also work for arbitrary sequences:<br />Initialize all preferences list to empty. If agent i&#39;s turn is next, his most preferred among the remaining objects is appended to his preference list and well as the preference lists of all other agents. The argument for PNE is still the same.<br /><br />I like your idea to compute a PNE for sequential allocation. It also gives the same allocation as the truthful preference profile.<br />Up till now I have only seen hardness results such as PSPACE-completeness for computation of pure equilibria for sequential allocation or polynomial-time algorithms for constant number of agents. We used a somewhat similar idea of &quot;threats&quot; for the case of 2 agents and different allocation mechanism for divisible goods:<br /><br />http://arxiv.org/abs/1401.6523<br /><br />", "author": "Haris", "published": "2015-01-04 17:22:34.326000-08:00", "title": ""}]