[{"content": "To be clear, the highlighted sentence refers only to the part before it.   The parts after are interpretations not from the leadership.", "author": "Paul", "published": "2014-08-23 13:53:54.955000-04:00", "title": ""}, {"content": "Perhaps the solution is for STOC to leave the ACM as well.", "author": "Anonymous", "published": "2014-08-23 14:35:36.078000-04:00", "title": ""}, {"content": "I second anonymous #1. As an example, cryptographers have been largely independent of ACM/iEEE (with the exception of those works appearing at STOC/FOCS) via the IACR, and this never harmed the community, rather the opposite. <br /><br />Maybe it is time for the theory community to start their own organization, running STOC/FOCS as well as other conferences, like SODA/SoCG/CCC, following the IACR model.", "author": "Anonymous", "published": "2014-08-23 15:00:19.907000-04:00", "title": ""}, {"content": "Paul,<br /><br />Thank you for the clarification.  Perhaps, then, the interpretations after the highlighted sentence (wherever they came from) are or could be deemed incorrect, in order to ameliorate the situation?", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-08-23 18:50:44.651000-04:00", "title": ""}, {"content": "I am both an ACM Fellow and a strong advocate of open access. My main scholarly communities, computational linguistics and machine learning, are largely independent from ACM, and have led in open access (ACL, NIPS, and ICML are all open access, as are the leading journals in those fields, JMLR and Computational Linguistics). If ACM&#39;s attack on SoCG is confirmed, I&#39;ll be the first to sign up on to a strong community response against such reactionary policies.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/Pereira:Fernando.html\">Fernando Pereira</a>", "published": "2014-08-24 01:36:35.386000-04:00", "title": ""}, {"content": "Michael, unfortunately the part you removed from the quotation contains the most *potentially* inflammatory statements, namely <br /><br />&quot;ACM will be scrutinizing materials for the new conference to see that it is not trying to leverage any connection with ACM conferences.&quot;<br /><br />as per Paul&#39;s comment, is this also merely an inference and not something explicitly stated by ACM ? Because it sounds awfully specific. ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/v/Venkatasubramanian:Suresh.html\">Suresh Venkatasubramanian</a>", "published": "2014-08-24 01:52:14.008000-04:00", "title": ""}, {"content": "Suresh:   It was my error in  including that phrase in my original e-mail.    ", "author": "Paul", "published": "2014-08-24 03:49:25.143000-04:00", "title": ""}, {"content": "Suresh --<br /><br />Paul stated to me that the removed sentence was not from the ACM but was an inference on his part and, at his request, I removed the sentence, as he felt its inclusion was misleading.  <br /><br />As I said in the original post, &quot;I await more information and do not want to rush to judgment&quot;.  Perhaps we will receive further information and clarification.  <br /><br />My hope would be that the ACM would respond with a clear list of what it can&#39;t do (along with pointers to either legal constraints or policy constraints based on similar previous situations), along with a list of what it can and is willing to do to encourage joint participation in these conferences for the benefit of both communities.  That would help give some evidence that the ACM is aiming to support the theory SIG, and is amenable to positive interaction.   ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-08-24 09:09:43.170000-04:00", "title": ""}, {"content": "I am a member of the IACR (crypto/eurocrypt) and SIGACT (stoc/focs) communities. I don&#39;t attend or publish at SOCG, but it is clear to me that SIGACT is shooting itself in the foot if it fails to endorse any kind of cooperation with its former member communities. <br /><br />I would <br /><br />a) sign a letter to the ACM, of which I am a member, encouraging it to change positions (assuming we understand its position correctly). <br /><br />b) support the creation of an umbrella society consisting of SIGACT, whichever part of IEEE organizes FOCS, and any non-ACM-affiliated TCS organizations that would actively encourage cooperation between the various three- and four-letter acronyms that we think of as the heart of our communities: STOC, FOCS, SOCG, CCC, IACR (especially TCC and crypto), PODC, etc.<br /><br />c) go out of my way to attend SOCG in 2016, even though I don&#39;t normally go. I will have to think of a good slogan to print on a t-shirt to wear that week. Extra points for a bad pun on sausage.<br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Smith:Adam.html\">Adam Smith</a>", "published": "2014-08-24 14:58:42.156000-04:00", "title": ""}]