[{"content": "<![CDATA[<p>Jay #161:</p>\n<p>Yes, certainly.</p>\n<p>I said &#8220;list&#8221;, unqualified, because it seems to me that the informal idea of a list doesn&#8217;t include uncountable sets.  I figure that most people think of a list as being the sort of thing that has a first item, a second item, a third item, etc.</p>\n]]>", "author": "yme", "published": "2015-09-09 18:21:45+00:00", "title": "By: yme"}, {"content": "<![CDATA[<p>Scott 163 you are being silly there. Check PalGD’s answer here <a href=\"http://cs.stackexchange.com/questions/9813/are-there-subexponential-time-algorithms-for-np-complete-problems\" rel=\"nofollow\">http://cs.stackexchange.com/questions/9813/are-there-subexponential-time-algorithms-for-np-complete-problems</a></p>\n<p>3SAT is special</p>\n<p>Padding is not necessary since there are natural problem classes</p>\n]]>", "author": "TeenWolf", "published": "2015-09-09 19:18:50+00:00", "title": "By: TeenWolf"}, {"content": "<![CDATA[<p>TeenWolf #168: Thanks for the link, but I never said there were no natural subexponential examples.  Certainly, if ETH holds, then <i>many</i> &#8220;natural&#8221; NP-complete problems (not all of them) require 2<sup>&Omega;(n)</sup> time.  In particular, this includes anything that you can reduce 3SAT to via a reduction with linear blowup.</p>\n]]>", "author": "Scott", "published": "2015-09-09 19:33:05+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Sniffnoy #166<br />\nThanks!</p>\n]]>", "author": "fred", "published": "2015-09-09 19:54:48+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Also for $NL\\neq PSPACE$, I was actually thinking there may be a physical obstruction that may explain</p>\n]]>", "author": "TeenWolf", "published": "2015-09-09 20:31:00+00:00", "title": "By: TeenWolf"}, {"content": "<![CDATA[<p>Sniffnoy #166</p>\n<p>About considering an infinite number of steps as a useful abstraction, there&#8217;s also the Zeno paradox (still the source of a lot of debates it seems), but I&#8217;m not clear if there&#8217;s any useful connection to Cantor&#8217;s proof and such.<br />\nFrom the wiki:</p>\n<p>&#8220;This presents Zeno&#8217;s problem not with finding the sum, but rather with finishing a task with an infinite number of steps: how can one ever get from A to B, if an infinite number of (non-instantaneous) events can be identified that need to precede the arrival at B, and one cannot reach even the beginning of a &#8220;last event&#8221;?&#8221;</p>\n<p>But I guess no-one really knows whether this tells us anything about moving from point A to point B in &#8220;real&#8221; physical space, or whether motion in a discrete medium is any less mysterious than motion in a continuum. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "fred", "published": "2015-09-09 20:32:19+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott # 78:</p>\n<p>Hmmm&#8230; Looks like you fully qualify to be an Indian. &#8230;. You eat mediocre food; talk, argue and sometimes even philosophize. You don&#8217;t do any regular physical exercises; don&#8217;t mind developing a pot belly right in the 30s (or at least don&#8217;t find it so disconcerting that you will immediately hit a gym); and you are a dad. Further, your views often align with those of the Democrats; you like mathematics but work in computer science; and you plan to remain in the USA. &#8230; What more could anyone possibly ask for? &#8230; In fact, you *are* an Indian.</p>\n<p>&#8211;Ajit<br />\n[E&OE]</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2015-09-10 06:14:24+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Nicholas #21 and Scott #28, &#8220;about food wastage&#8221;<br />\nI think there is a big problem particularly in peoples` minds about what is good to eat and what not. This leads to supermarkets always overstocking, and people`s behavior of buying only the section which is full. [Actually, that one is easily observable in your local supermarket, wherever you are, and I lifted that from some youtube documentary about food wastage].<br />\nAnother angle is food wasted in the farm. Think about third world countries: large percentage of food produced goes to waste before reaching the market due to poor infra. This is also exacerbated by lack of simple food processing industries. For example, at the moment I live in a first world country. I can get first rate fruits at an expensive price. But I know that in my country (third world), similar fruits are rotting in the farm for want of infra. People toiled to care for the plant, and they cannot get a return for want of selling.<br />\nI also second the idea given by Scott #28. That, different portions to cater for different needs. That idea of electronic pre-ordering is cool.　Except that, who will deal with the chaos in the supply and demand satisfaction? I can see, there is a possibility to hike costs with this procedure. But maybe this is just my tired mind refusing to see the solution to this.<br />\nBy the way, this AMA is so cool. I will keep reading all the other responses.</p>\n]]>", "author": "Aviti", "published": "2015-09-10 12:11:12+00:00", "title": "By: Aviti"}, {"content": "<![CDATA[<p> On the subject of the fantasies of Donald Trump, which you raised in #134, Scott, you may wish to consider this <a href=\"http://news.nationalpost.com/full-comment/rex-murphy-dont-blame-trump-blame-america\" rel=\"nofollow\">essay by Rex Murphy</a>, one of Canada&#8217;s senior public-affairs observers.</p>\n<p> Further, you may wish to note that there are no remaining descendants of the &#8220;original inhabitants&#8221; (as you referred to them in #134) of the US, as they were all replaced <i>c.</i> 1000 to 700 years ago by modern Amerindians, as explained in &#8220;The genetic prehistory of the New World Arctic&#8221; in <i>Science</i> magazine, as reported in this <a href=\"http://www.bbc.com/news/science-environment-28965227\" rel=\"nofollow\">essay at the BBC</a>.</p>\n<p> Of course, that&#8217;s just my opinion, you may not, I&#8217;ve been wrong before. (And to those Americans opposed to foreigners meddling in their affairs, my apologies.)</p>\n]]>", "author": "Vitruvius", "published": "2015-09-10 21:00:24+00:00", "title": "By: Vitruvius"}, {"content": "<![CDATA[<p>re #110 Scott (may be #109?) re age 40 and academic burn-out.</p>\n<p>I think you will get one or two more second-winds, where, armed with much more powerful abilities/experience/knowledge than you had as a younger man, you will have a chance to make major contributions. Einstein was 35 when his greatest work, General Relativity, was published, Schrödinger was 40, Planck was 43. More recently, Yitang Zhang was in his late 50s when he published his remarkable contribution to the Twin-Prime conjecture.</p>\n<p>PS. I wonder if you can arrange all the comments posted above about Cantor&#8217;s argument in a such way so that along the diagonal you&#8217;ll get  a consensus</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2015-09-10 21:15:25+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>DJW #145</p>\n<p>&#8220;Theorem: Any mapping f: S -> P(S), from the elements of a set S to subsets of S, must miss (fail to map to) at least one subset of S. &#8221;</p>\n<p>If there are n elements in S, then you only have n mappings, and obviously that&#8217;s not enough to map all the possible 2^n subsets of S, no? (2^n &#8211; n subsets are missed)</p>\n<p>But I&#8217;m not clear how that&#8217;s just the same thing as Cantor&#8217;s proof.</p>\n]]>", "author": "fred", "published": "2015-09-11 12:37:39+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott #169</p>\n<p>What I still don&#8217;t get is that if we consider the 2 problems:</p>\n<p>(1) I give you m &#8220;unrelated&#8221; keys, and you have to find the one that opens a lock<br />\nE.g. I give you the m numbers {4,11,293,&#8230;45} and ask if 57 is in the set.</p>\n<p>(2) I give you n elementary building blocks, and they can be combined to generate 2^n possible keys, and then you have to find the one that opens a lock.<br />\nE.g. I give you the n numbers {3, 5, 9,..} and ask if any subset of these sums up to 57.</p>\n<p>What N!=NP is saying is that if m=2^n, then (2) is just as hard as (1), i.e. it really doesn&#8217;t help that the keys are composed from n sub-elements?</p>\n]]>", "author": "fred", "published": "2015-09-11 12:58:39+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #178: In some sense, yes, that&#8217;s exactly what P&ne;NP is saying.  But with one important caveat: we know that it can help <i>somewhat</i> that &#8220;the keys are composed from sub-elements&#8221; (as you put it).  For example, we know that 3SAT is solvable in ~1.3<sup>n</sup> time rather than 2<sup>n</sup>.  P&ne;NP merely says that, for NP-complete problems, the structure isn&#8217;t going to help <i>so much</i> as to enable a polynomial-time solution.</p>\n]]>", "author": "Scott", "published": "2015-09-11 13:33:18+00:00", "title": "By: Scott"}]