[{"content": "Nice to have you back blogging (and thanks for the interesting advice", "author": "Mohammad", "published": "2014-10-19 11:07:09.165000-04:00", "title": ""}, {"content": "Just at the point: find a problem, &quot;one foot from a trivial away&quot;, try to solve it by yourself. If you already here face big problems - ask some expert in this stuff. The &quot;one foot from a trivial away&quot; here is important: asking questions experts are trying to answer for years is a very bad deal. <br /><br />Another way is to try to solve some special (not-so-trivial) case of a &quot;big&quot; problem, and contact an expert you know is working on it. This will definitely wake an interest. This happened with one student who just came to me with a sketch of a proof that so-called &quot;multilinear&quot; boolean circuits for CLIQUE are no more efficient than DNFs. None of &quot;experts&quot; has probably looked at this question before (&quot;too special&quot;, &quot;too simple&quot;). But to make a rigorous proof was not such a simple deal at all. Many hidden aspects of multilinear circuits were detected by us both along the way. He then published a nice paper on it (of course, alone because initial ideas were entirely his).<br /><br />Also, one high-school student from Russia has had some ideas on how to prove Sperner&#39;s lemma about antichains for multisets. This also immediately waked my attention (and Razborov&#39;s - he told me about this). Etc. This way seems to be even better than just asking questions (not to speak about sending CVs or work experience).", "author": "Stasys", "published": "2014-10-19 12:51:51.562000-04:00", "title": ""}, {"content": "I agree, coming up with ideas to solve a standing open question can be more impressive than just asking new questions.  But, it&#39;s also harder :-)   And I am addressing people who might not have the readiness to do this yet.  <br /><br />I think asking questions is a very good practice for young researchers, and it creates opportunities for them to apply problem-solving on problems that haven&#39;t already been scrutinized by experts.  And as I say, when sharing a question with an expert it&#39;s best to include whatever partial progress you can manage.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/D:Andy.html\">Andy D</a>", "published": "2014-10-19 18:39:47.138000-04:00", "title": ""}, {"content": "Andy, I meant not &quot;coming up with ideas to solve a standing open question&quot;. Nobody expects this from a beginner. I rather meant &quot;coming up with ideas to solve a SPECIAL CASE of a standing open question&quot;. So called &quot;experts&quot; are usually too busy to spend time for &quot;special cases&quot;. Hence, they are happy seeing that some student had done this. And want that student have in the team.", "author": "Stasys", "published": "2014-10-20 13:58:57.212000-04:00", "title": ""}, {"content": "Got it, thanks Stasys.<br /><br />In some cases identifying a good special case to solve is itself a challenge, and requires the sort of questioning skills I discussed.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/D:Andy.html\">Andy D</a>", "published": "2014-10-20 14:49:05.937000-04:00", "title": ""}]