[{"content": "<![CDATA[<p>#118: I think it&#8217;s fair to call Shockley a racist and an asshole, but I don&#8217;t think it&#8217;s fair to call him a Nazi&#8212;particularly since he was apparently a spectacularly effective operations research manager <i>fighting</i> the Nazis during WWII.</p>\n]]>", "author": "Scott", "published": "2017-08-29 18:57:39+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>TPWG #110: Glad to see you are learning about normed linear spaces, one of the truly fundamental ideas in science. </p>\n<p>But I think you are going to have trouble proving that a norm exists on the space of nut case political theories.</p>\n<p>If you can construct such a norm, please let me know, because some of my research involves extending norms to more general spaces, and I might be able to work with Complex nut case political theories. An imaginary dimension would be cool.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-08-29 19:00:57+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Scott #120 </p>\n<p>I can&#8217;t believe a man of your intelligence said that, specially since you recently wrote an entire entry justifying why Kolmogorov never publicly confronted Communism nor Stalin.</p>\n<p>The entry of the United States in World War II was a complex affair. It was not an idyllic crusade of the free world against the Nazis since what happened is that in fighting the Nazis the US picked what it perceived the worst of two very bad options (the two totalitarian options we have discussed here) when decided which side to be on. Then the United States spent 40 more years fighting the Soviet Union on intellectual and defensive -by way of nuclear testing- grounds. Shockley probably didn&#8217;t have any choice but to join the war efforts when called to do so.</p>\n<p>In addition, in Shockley&#8217;s case, we don&#8217;t have to make any assumptions. He made his Nazi-like views pretty clear during his lifetime in interviews and debates like this one <a href=\"https://www.youtube.com/watch?v=V-9jtRx5iGk\" rel=\"nofollow\">https://www.youtube.com/watch?v=V-9jtRx5iGk</a> . Not only he made racist arguments, but one of his best known proposals was a dysgenics program that would have paid blacks to undergo voluntary sterilization. Shockley was a very smart guy so if he didn&#8217;t propose an outright Nazi agenda is because he probably knew too well that he would have become even more ostracized than he already was in the 1970s.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2017-08-29 20:03:08+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Raoul Ohio #121</p>\n<p>Good that you are an expert on norms. Please, work out my cardinality metaphor and see if you can come up with a meaningful way to use a log argument to make the Nazism/Communism difference work. Hint: it has to do with how multiplying aleph 0 by any number (such as the base of a log) still gives you aleph 0.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2017-08-29 20:12:13+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Joshua #115: No, if P=NP, then P/poly=NP/poly.  To see this, given a language L&isin;NP/poly, let M be a nondeterministic TM that decides L with advice strings a<sub>n</sub>.  Then let L&#8217; be the set of pairs of the form (x,a) (i.e., input and advice) that M accepts.  Clearly L&#8217;&isin;NP.  So if P=NP, then L&#8217;&isin;P.  But that means in particular that L&isin;P/poly.</p>\n]]>", "author": "Scott", "published": "2017-08-29 20:15:57+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Ah, TPWG, find me one, one! disillusioned Nazi-sympathizer of Bertrand Russell stature and I&#8217;ll concede your point. But as I see it, there were a lot of genuinely good people who believed or at least hoped that Communist experiment could yield a just society, while there was no one  similar on the Nazi side. Scientific/engineering-only luminaries don&#8217;t count, as their stature has nothing to do with ethics. Show me philosophers/intellectuals/writers who are respected for their views now and who at any point in their lives supported or were sympathetic to Nazism but then got disillusioned.</p>\n]]>", "author": "Peter D", "published": "2017-08-29 21:28:27+00:00", "title": "By: Peter D"}, {"content": "<![CDATA[<p>The problem with gatekeepers #122:  In your opinion (I&#8217;d be interested in Scott&#8217;s as well), what&#8217;s the difference between a racist/white supremacist and a Nazi?  Do you believe all white supremacists are Nazis?  Do they only count if they self-identify as Nazis, carrying around swastikas and the like?  Or is there there some middle-ground acid test that distinguishes some people as Nazis?</p>\n]]>", "author": "Dan Staley", "published": "2017-08-29 22:37:47+00:00", "title": "By: Dan Staley"}, {"content": "<![CDATA[<p>Dan #126: The fact that the Nazis had their one specific time in the sun&#8212;and that they used it to make it so horrifically crystal-clear who they were and what they stood for&#8212;makes your distinguishing problem easier than it would be otherwise.</p>\n<p>If a racist / white supremacist expresses any sort of admiration for Hitler, the Third Reich, or specifically the Nazi extermination of Jews and other undesirables: fair to call them a Nazi themselves.  (I&#8217;ll also put Holocaust deniers into this category&#8212;since famously, and paradoxically, the brain-damaged notion that the Holocaust <i>never happened</i> almost always functions as just a convoluted way of saying that it <i>should have</i>.)</p>\n<p>If, on the other hand, a racist / white supremacist explicitly <i>condemns</i> Hitlier and the Final Solution: well, OK, they might still be racist or white supremacist, but unlike much of the modern left, I&#8217;m not going to use the word &#8220;Nazi&#8221; for absolutely anyone whose views I find abhorrent.  So for example, I&#8217;m perfectly able to distinguish someone who wants to kill all Jews from someone who merely wants to rough them up, or take their money, or bar them from universities, or force them all to live in Israel, or force them all to <i>leave</i> Israel, and who stops there.</p>\n<p>If a racist / white supremacist refuses to say one way or the other what they think about Hitler and the Final Solution, or offers slimy equivocations, then it&#8217;s safe to assume they&#8217;re a &#8220;closet Nazi&#8221; according to this scheme.</p>\n]]>", "author": "Scott", "published": "2017-08-29 23:59:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Peter D #125</p>\n<p>I reject the premise that Bertrand Russell is somebody whose opinion on what&#8217;s good or bad is important to me. He shared with the Communists a vision of a society without religion. As a Christian believer, I definitely don&#8217;t think such a world is a good idea. Surely, Russell was probably willing to give the Communists a pass initially despite the fact it is unquestionable that Karl Marx&#8217;s original vision included the use of political violence to reach the goal of an atheist society. Many contemporary people in the humanities had a better moral compass than him. I understand that Bertrand Russell is some sort of demigod among the atheistic intelligentsia but you have to understand too that outside that world, he doesn&#8217;t enjoy much respect beyond his work as logician. If you want a contemporary reference who had all figured out with respect to both Communism and Nazism, read the work of Tolkien in his capacity as public intellectual. He didn&#8217;t need to see empirical horrors to despise both Communism and Nazism. Even among today&#8217;s atheistic intelligentsia you have better guides than Russell. You don&#8217;t have to be a Christian to reach the conclusion -that escaped Russell- that Jurgen Habermas reached that the Western values of equality, love and justice do not come from Karl Marx but from the Judeo-Christian tradition. More here <a href=\"https://en.wikipedia.org/wiki/J%C3%BCrgen_Habermas#Religious_dialogue\" rel=\"nofollow\">https://en.wikipedia.org/wiki/J%C3%BCrgen_Habermas#Religious_dialogue</a> .</p>\n<p>To summarize, I think your question is ill-posed and I stand by my point that the world of intelligentsia of the first half of the XX-th century -which included the hard scientists and engineers you want to exclude- was filled of very sick people, intellectually speaking. There were both Communists and Nazis among them, and I do not respect the personal option of embracing either from these intellectuals. I still respect their work in their respective areas of expertise -such as Shockley&#8217;s invention of the transistor- but do not have to respect them as human beings.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2017-08-30 00:57:01+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Dan Staley #126</p>\n<p>My definition of Nazi and white supremacist is the same as Scott&#8217;s on #127.</p>\n<p>I want to clarify one thing though. I do not consider the labels &#8220;Nazi&#8221; and &#8220;neo Nazi&#8221; to be equivalent. With &#8220;neo Nazi&#8221; we are talking about a bunch of losers, like the Charlottesville&#8217;s killer, who perpetrate or threaten to perpetrate randoms act of violence which, sometimes as in Charlottesville, result in murder. As horrific as these acts of violence are, I have personally nothing to fear from neo-Nazis in 2017 America. I know where they are or where they threaten to be with one of their farcical demonstrations and they are easy to avoid. </p>\n<p>For a contemporary version of &#8220;Nazi&#8221; thinking, I would point to people like William Shockley or James Watson. These two go beyond white supremacy. If people like them every gained political power, they would enact Nazi policies like those we saw in Nazi Germany but perhaps using more sanitized ways, such as high bonuses for people to go voluntary sterilization, abortion -as Iceland is doing to eliminate Down Syndrome people <a href=\"http://www.torontosun.com/2017/08/27/why-are-we-trying-to-eliminate-people-with-down-syndrome\" rel=\"nofollow\">http://www.torontosun.com/2017/08/27/why-are-we-trying-to-eliminate-people-with-down-syndrome</a> &#8211; or euthanasia to ensure that only non-undesirables populate the Earth. Nazism is at its core social Darwinism, ie, the survival of the fittest. I definitely fear these &#8220;Nazi&#8221; thinkers way more. And if you want to find them, all you need to do is to attend a high profile academic conference or meeting that includes members of NAS or NAE and pay attention to what they say when they believe that they are talking among themselves and nobody else is listening. To be clear, I am not saying that all academics are Nazi or that all NAS/NAE members are Nazi, only that you are more likely to find Nazi sympathizers you should be afraid of among them than among the so called &#8220;neo Nazi&#8221;.</p>\n]]>", "author": "The problem with gatekeeper", "published": "2017-08-30 01:25:29+00:00", "title": "By: The problem with gatekeeper"}, {"content": "<![CDATA[<p>@tpwg#116- Aktion T4 was targeted at people that had specific illnesses, not at &#8220;losers&#8221; in general. Although many of the &#8220;asocials&#8221; sent to the camps were &#8220;losers&#8221;.</p>\n]]>", "author": "Michael", "published": "2017-08-30 03:01:47+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Gatekeepers #104, </p>\n<blockquote><p>  “there is only one way in which the murderous death agonies of the old society and the bloody birth throes of the new society can be shortened, simplified and concentrated, and that way is revolutionary terror”</p></blockquote>\n<p>I haven&#8217;t read any Karl Marx but Thomas Jefferson wrote stuff like &#8220;The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants&#8221;.  Sounds kind of similar.  Question is what kind of society you want to end up with afterwards.  Also now that we have the internet, maybe instead of bloodshed we can just type in all caps when we get angry.</p>\n]]>", "author": "asdf", "published": "2017-08-30 08:56:30+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>This <a href=\"http://cris.teiep.gr/jspui/bitstream/123456789/1482/1/The_3rdClay_version1_Conference.pdf\" rel=\"nofollow\">P!=NP paper from 2017</a> contains a nice reference section of P vs NP proofs which actually managed to get published in some seemingly serious journals, like IEEE Latin America Transactions. The proof itself is of course wrong, but the introduction is funny and contains gems like the quote </p>\n<blockquote><p>A correct proof in mathematics is considered a proof only if it has passed the social barrier of being accepted and understood by the scientific community and published in accepted Journals</p></blockquote>\n<p>It was published in the proceedings of some conference on <a href=\"https://books.google.de/books?id=BSUsDwAAQBAJ&lpg=PP1&hl=de&pg=PA170#v=onepage&q&f=false\" rel=\"nofollow\">page 170</a>, but have a look at <a href=\"https://books.google.de/books?id=BSUsDwAAQBAJ&lpg=PP1&hl=de&pg=PA22#v=onepage&q&f=false\" rel=\"nofollow\">page 22</a> for a special laugh.</p>\n]]>", "author": "gentzen", "published": "2017-08-30 09:46:57+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>DLI #117:</p>\n<ul>Why not a list of (intellectually honest attempts but otherwise) failed p vs np papers and a brief synopsis as to why the paper is wrong?</ul>\n<p>Gerald Woeginger <a href=\"https://www.win.tue.nl/~gwoegi/P-versus-NP.htm\" rel=\"nofollow\">already has</a> a webpage that functions as a &#8220;graveyard of wrong P vs. NP solutions,&#8221; so that would be the obvious starting point to create what you wanted.</p>\n<p>Among experts, I&#8217;m guessing that you&#8217;d find roughly as much enthusiasm for curating this list as you&#8217;d find among NASA JPL engineers for curating all the different designs for interstellar spacecraft that kids have drawn wth construction paper and crayon.  (So in particular, probably a <i>nonzero</i> amount!)</p>\n]]>", "author": "Scott", "published": "2017-08-30 11:07:56+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #133</p>\n<p>but interstellar spacecrafts at least can be built and they either fly or they don&#8217;t!</p>\n]]>", "author": "fred", "published": "2017-08-30 12:40:35+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott # 124,</p>\n<p>Doh! I was going off of <a href=\"https://cstheory.stackexchange.com/questions/529/does-vp-neq-vnp-imply-p-neq-np\" rel=\"nofollow\">https://cstheory.stackexchange.com/questions/529/does-vp-neq-vnp-imply-p-neq-np</a> which claimed that P/poly != NP/poly didn&#8217;t immediately imply P != NP, but your logic shows that it does. So my entire question is uninteresting.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2017-08-30 13:19:49+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>TPWG #118: At the very least, you are wrong about Heisenberg. Read this: <a href=\"http://www.nybooks.com/articles/2016/12/22/private-heisenberg-absent-bomb/\" rel=\"nofollow\">http://www.nybooks.com/articles/2016/12/22/private-heisenberg-absent-bomb/</a></p>\n]]>", "author": "Arko Bose", "published": "2017-08-30 13:55:38+00:00", "title": "By: Arko Bose"}, {"content": "<![CDATA[<p>Arko Bose #136</p>\n<p>Look, I get one thing, and that is, that for people who worship intellects (I know, I have a past life as intellect worshiper too) it is very hard to accept that somebody can be a very brilliant mind and be immoral. As I mentioned above, my current thinking is that these two qualities are orthogonal (and I would say even continuous, not discrete). In the bivariate graph (intellect, ethics) you can find all sorts of people, and that&#8217;s OK because human beings are complicated. Even Einstein -who is generally portrayed as the best of both- was at the very minimum an avowed adulterer, and some would even say a bad father to his children, although the latter is still under contention. </p>\n<p>I see the reference you mention as an attempt to clean Heisenberg&#8217;s legacy. These are draft letters that Bohr never send describing his side of the story that your article refers to,</p>\n<p><a href=\"https://www.aps.org/publications/apsnews/200208/viewpoint-seitz.cfm\" rel=\"nofollow\">https://www.aps.org/publications/apsnews/200208/viewpoint-seitz.cfm</a></p>\n<p>&#8220;While we do not know full details about their discussions, the record makes it clear that Heisenberg brought up &#8211; in what appears to be a heavy-handed way &#8211; two issues that were guaranteed to raise Bohr&#8217;s ire. Since German victory in the war now seemed assured, Heisenberg suggested that Bohr takes steps to promote friendly relations between Denmark and Germany. Bohr could only have been incensed at the proposal. He was a very loyal Dane, a notable distinguished father-figure in his country, and he well knew that his fellow citizens were outraged by the German occupation. The notion that Bohr would support any official form of friendly relationship was simply beyond comprehension under the circumstances. On the more personal side, Bohr was partly Jewish and must have despised the German leadership for promoting the anti-Semitic Nuremberg Laws.</p>\n<p>In a similar manner, Heisenberg stated that he and a group of colleagues were in the process of developing a nuclear chain reaction based on the fission of uranium. If we can trust Bohr&#8217;s memory a decade and a half later, Heisenberg implied that he had a fairly complete understanding of the steps needed to achieve such a reaction, but would not go into details. He also stated that work of this kind would ultimately lead to the development of some form of nuclear bomb that would probably play a crucial role in bringing the war to an end if they succeeded. He could not at that time have realized how fully prescient he was, since the Pacific war was far away and the US was not yet engaged. Clearly such an admission would have angered Bohr at least as much as the proposal that he cooperate with the existing German government.&#8221;</p>\n<p>Who do you believe? Based on everything we know about how cozy not only many German scientists, but many prominent German intellectuals, had been with the Nazi government, I believe Niels Bohr. </p>\n<p>After World War II was over there was a great effort from many former Nazis to clean their past and I see what you bring up as part of that effort.</p>\n<p>I remember when I first learned about Nazi Germany in high school, I just saw it as part of something I had to know by heart to gain a good grade in my history class. Years later, like in my 20s, when I began to think deeper about these issues it seemed incomprehensible to me that anything of that sort could have happened. We are all &#8220;good people&#8221; after all. I never had a &#8220;negationism&#8221; phase, but I did have a skeptical phase with the official version of the events I was told because, after all, history is always written by the winners. Then, in my early 30s, I stumbled into this documentary <a href=\"https://en.wikipedia.org/wiki/The_Nazis:_A_Warning_from_History\" rel=\"nofollow\">https://en.wikipedia.org/wiki/The_Nazis:_A_Warning_from_History</a> in Netflix (I watched all episodes of it). Everything that the official history tells about Nazi Germany is true, including that most Germans were completely oblivious to the suffering of the Jews and other undesirables. We should not fall for any attempts to minimize or sanitize what happened there. It was humanity at its worst and there is no other way to see that. Heisenberg was not the Oskar Schindler of Nazi Germany&#8217;s nuclear program.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2017-08-30 16:05:49+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Hi Scott,</p>\n<p>If you could you tolerate another &#8220;good naive commies&#8221; discussion, I&#8217;d like to challenge the assertion that they exist. If I understood you correctly, you distinguish Nazis from Marxists in that Nazi vision of ideal future is inherently abhorrent while Marxist vision is not, so one can imagine a nice person who is not familiar with the history of Marxist regime, never read Marx, but supports Marxism based solely on the proclaimed vision of the ideal future it promises.</p>\n<p>I think you completely misinterpret what drives modern Marxist: it&#8217;s not charity, it&#8217;s *envy*, an instinct as base as the hate that drives Nazis. Here&#8217;s a glimpse into that: &#8220;Millennials &#8230; Prefer Venezuela&#8217;s Food Lines Over America&#8217;s Income Inequality&#8221; <a href=\"http://www.dailywire.com/news/20027/watch-woke-millennials-say-theyd-prefer-venezuelas-james-barrett\" rel=\"nofollow\">http://www.dailywire.com/news/20027/watch-woke-millennials-say-theyd-prefer-venezuelas-james-barrett</a><br />\nThey don&#8217;t want to improve the life of poor, they want to make sure that nobody is better off than them. </p>\n<p>There is a joke about the devil offering a person whatever he wanted under one condition: the person&#8217;s neighbor would get twice more. And the person asks for a semi-fatal heart attack. This is what Marxist envy is: you don&#8217;t want a society that&#8217;s better off on average or better off for the poor; you want to make sure that nobody sticks out, and that&#8217;s more important than anything yet.</p>\n<p>Here&#8217;s one of the jokes I&#8217;ve heard as a child back in USSR:<br />\nThe Devil inspects the Hell and sees that one of frying pans is not guarded. &#8220;Why don&#8217;t they escape?&#8221; &#8211; he asked. &#8220;These are Nazis, they were ordered to sit there and nobody dares to disobey.&#8221; &#8211; was the answer. The Devil proceeds and finds another unguarded frying pan, and here&#8217;s the explanation: &#8220;These are the communists; whenever somebody is trying to escape the others pull him back.&#8221;</p>\n<p>I&#8217;ve got to add that IMO the root of the problem, although extreme in Marxist minds, is also present in mainstream American left: it&#8217;s prioritizing equality over prosperity. Democrats are hammering the idea that equality trumps everything for quite a while. Marxist took that a step further by asserting that equal misery is better than unequal prosperity. And that step further is in my eyes is inherently evil.</p>\n<p>You probably heard the horrible story about a former chimp owner who got brought a birthday cake to the place where chimps were kept. Alas, there wasn&#8217;t enough cake for *all* chimps there, so he got most viciously attacked:<br />\n<a href=\"http://articles.latimes.com/2005/mar/05/local/me-chimp5\" rel=\"nofollow\">http://articles.latimes.com/2005/mar/05/local/me-chimp5</a></p>\n<p>Why did the chimps attack somebody who brought some of them a cake? He didn&#8217;t take anything away from them. The answer is obvious: in the eyes of the chimps he did take something away from them: he decrease the amount of equality in the group. </p>\n<p>But these were just chimps; would people wouldn&#8217;t behave like that, even equality-prioritizing Marxists? Alas they would, and they did. Russian and Chinese revolution proved that. And here&#8217;s a quite hilarious case of chimp-like behavior from 2017: a baker in Russia decided to help poor by distributing bread for free in his home town. Alas, there wasn&#8217;t enough bread for everybody. The enraged citizens verbally assaulted him and filed complains at the city hall.<br />\n<a href=\"http://informat.com.ua/shhedryj-pekar-razdaet-hleb-besplatno-i-dorogo-za-jeto-platit/\" rel=\"nofollow\">http://informat.com.ua/shhedryj-pekar-razdaet-hleb-besplatno-i-dorogo-za-jeto-platit/</a><br />\n25 years after the fall of Russian communism, but equality-worshiping Marxism is still strong in the hearts of many.</p>\n<p>That&#8217;s why I find it necessary to challenge the assumption that good naive Marxists exist. No, they don&#8217;t: Marxism implies extreme envy, and that&#8217;s incompatible with niceness.</p>\n]]>", "author": "Michael P.", "published": "2017-08-30 16:21:38+00:00", "title": "By: Michael P."}, {"content": "<![CDATA[<p>Arko Bose, wow, thanks for that link! If true, this casts Heisenberg in a completely new light!</p>\n]]>", "author": "Peter D", "published": "2017-08-30 16:49:02+00:00", "title": "By: Peter D"}, {"content": "<![CDATA[<p>&#8220;OK, but totality is “only” to eclipses as orgasms are to sex.  There’s also the whole social experience of standing around outside with friends for an hour&#8230; &#8221;</p>\n<p>You seem to have a quite &#8220;healthy&#8221; and open approach to sexuality, kudos! 😉 Just don&#8217;t get arrested for public indecency 😉</p>\n]]>", "author": "Jo", "published": "2017-08-30 17:11:25+00:00", "title": "By: Jo"}, {"content": "<![CDATA[<p>I bet $200,000 P vs NP is not resolved until after there is a mobile version of Shtetl Optimized 😉</p>\n]]>", "author": "Dave R", "published": "2017-08-30 20:45:39+00:00", "title": "By: Dave R"}]