[{"content": "<![CDATA[<p>Hi Scott! Thank you for using your platform here to help publicly state that Kavanaugh is unsuitable for a SCOTUS position. I&#8217;ve spent all week fretting and soul-searching about a future where people can tell obvious lies to the US senate and still be nominated to the Supreme Court. I hope that there&#8217;s enough like-minded people who still think honesty is a virtue, and that we can be loud enough together to actually make a difference this time.</p>\n]]>", "author": "Adam Chalmers", "published": "2018-10-03 16:16:31+00:00", "title": "By: Adam Chalmers"}, {"content": "<![CDATA[<p>I just donated $100 to Beto.  I probably wouldn&#8217;t have without your post, too.</p>\n]]>", "author": "Dan Staley", "published": "2018-10-03 18:54:00+00:00", "title": "By: Dan Staley"}, {"content": "<![CDATA[<p>FWIW, apart from general partisan nastiness these days, and apart from huge culture war we live in, I think the root problem here is the Ginsburg rule and it&#8217;s abuse, which keeps the Senate from getting straight answers to the candidate&#8217;s theory of law and how it applies.</p>\n<p><a href=\"https://www.google.com/search?q=site%3Ajonathanturley.org+ginsburg+rule\" rel=\"nofollow\">https://www.google.com/search?q=site%3Ajonathanturley.org+ginsburg+rule</a></p>\n<p>Jonathan Turley discusses how to reform the entire process, it sounds reasonable and easy to enact though it might require non-politicians in the Senate or politicians who could cross an aisle.</p>\n<p><a href=\"https://jonathanturley.org/2018/10/01/kavanaughs-mad-as-hell-moment-should-not-pass-without-serious-reforms-of-the-confirmation-process/\" rel=\"nofollow\">https://jonathanturley.org/2018/10/01/kavanaughs-mad-as-hell-moment-should-not-pass-without-serious-reforms-of-the-confirmation-process/</a></p>\n]]>", "author": "anon", "published": "2018-10-03 18:58:56+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>Regarding Judge Kavanaugh&#8217;s nomination, imo his partisan statements disqualify him regardless of the sexaual assault allegation.  It was really over-the-top, and lacked balance.  Whatever Democrat partisan motivations are present, they are more than offset by the fact that Judge Kavanaugh&#8217;s nomination would most likely not even be under consideration if the Republicans had allowed Judge Garland&#8217;s nomination to move forward.</p>\n<p>Regarding the standard for adjudicating sex-related allegations, we need a more nuanced way of determining penalties.  I have two daughters.  If one of them were to be aggressively groped at a high school or college party by a drunk with no previous history, I wouldn&#8217;t want that person&#8217;s life to be ruined (and I doubt that she would either).  However, I would want the incident reported so that a less-than-life destroying penalty could be meted out, and the incident documented.<br />\nrob</p>\n]]>", "author": "Rob5289", "published": "2018-10-03 19:55:21+00:00", "title": "By: Rob5289"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> opines (circa <a href=\"https://www.scottaaronson.com/blog/?p=3983#comment-1788509\">#29</a>)  &#8220;&#8216;The Dao that can be spoken is not the true Dao&#8217;, <i>i.e.</i>, as soon as something becomes ossified and rigidified into a named -ism (Judaism, Marxism, Objectivism, feminism, rationalism&nbsp;&hellip;), it will inevitably accrete shibboleths that are at variance with just looking at the damned individual situation as a human being and applying conscience and reason and compassion.&#8221;</p></blockquote>\n<p>With this single well-crafted sentence, Scott concisely deconstructs the social notion of justice, arriving at substantially the same conclusions as Jacques Derrida&#8217;s celebrated essay/interview/treatise <i>Deconstruction in a Nutshell</i> (1997, entire transcript <a href=\"http://hydra.humanities.uci.edu/derrida/vill1.html\" rel=\"nofollow\">here</a>, Derrida&#8217;s remarks specifically relating to &#8220;justice&nbsp;in a&nbsp;nutshell&#8221; <a href=\"http://hydra.humanities.uci.edu/derrida/vill3.html\" rel=\"nofollow\">here</a>, amusing <i>Existential Comics</i>&nbsp;<a href=\"http://existentialcomics.com/comic/185\" rel=\"nofollow\">summary&nbsp;here</a>).</p>\n<blockquote><p>What is this problem of justice &#8216;in&nbsp;a&nbsp;nutshell&#8217;?&nbsp;&hellip; Justice is&nbsp;not reducible to&nbsp;the&nbsp;law, to&nbsp;a&nbsp;given system of&nbsp;legal structures.&nbsp;&hellip; That is, I think, what gives deconstruction its movement, that is, constantly to&nbsp;suspect, to&nbsp;criticize the given determinations of a culture, of institutions, of the legal systems not in order to&nbsp;destroy them or&nbsp;simply to&nbsp;cancel them but to&nbsp;be&nbsp;just, give justice, to&nbsp;respect this &#8216;relation&nbsp;to the&nbsp;other&#8217; as&nbsp;justice.&nbsp;&hellip; </p>\n<p>Justice and the gift [of the human drive for justice-by-democracy] should go beyond calculation, which doesn&#8217;t mean that we shouldn&#8217;t calculate, we should calculate it as rigorously as possible but there is a point or a limit beyond which calculation must fail and we must know it and must fail.</p></blockquote>\n<p>My bibtex database features a special keyword, &#8216;nutshell&#8217;, for works like Derrida&#8217;s <i>Deconstruction in a Nutshell</i>; other &#8216;nutshell&#8217; entries include Tony&nbsp;Zee&#8217;s <i>Quantum Field&nbsp;Theory&nbsp;&hellip;</i> together with his <i>Group&nbsp;Theory&nbsp;&hellip;</i>, Luca Peliti&#8217;s <i>Statistical Mechanics&nbsp;&hellip;</i>, Gerald Mahan&#8217;s <i>Condensed Matter&nbsp;&hellip;</i>, and Edward Shuryak&#8217;s <i>Quantum Many-Body Physics&nbsp;&hellip;</i> (the&nbsp;latter due this&nbsp;coming November).</p>\n<p>What do these various &#8216;nutshell&#8217; works have in&nbsp;common&nbsp;&mdash; aside&nbsp;from their&nbsp;all requiring slow, careful, thoughtful reading?  For&nbsp;me, the&nbsp;video that&nbsp;won Nikon&#8217;s Small&nbsp;World in&nbsp;Motion Competition for&nbsp;2018, namely, Elizabeth Haynes&#8217; <a href=\"https://www.nikonsmallworld.com/galleries/2018-small-world-in-motion-competition/zebrafish-embryo-growing-its-elaborate-sensory-nervous-system\" rel=\"nofollow\"><i>Zebrafish</i></a>, demands of&nbsp;our understanding every kind of&nbsp;cognitive nutshell that&nbsp;we can&nbsp;bring to&nbsp;bear, from&nbsp;Derrida&#8217;s to&nbsp;Zee&#8217;s.  </p>\n<p>In&nbsp;an&nbsp;&#8216;avocado&#8217;&nbsp;&mdash; to&nbsp;borrow Grothendieck&#8217;s celebrated counter-nutshell deconstruction&nbsp;&mdash; the&nbsp;era in&nbsp;which humanity&nbsp;cracked each nutshell separately is&nbsp;nearing its&nbsp;end.<br />\n&#8212;&#8212;<br />\nPS: there is ample medical evidence that growing neurons are best not&nbsp;pickled in&nbsp;alcohol&nbsp;&mdash; as&nbsp;Brett Kavanaugh&#8217;s regrettably&nbsp;were pickled, severely and repeatedly&nbsp;&mdash; on&nbsp;the&nbsp;grounds that the resulting cognitive and empathic impairments are slow&nbsp;to&nbsp;present, subtle&nbsp;to&nbsp;diagnose, and (at&nbsp;present)&nbsp;infeasible to&nbsp;remediate.</p>\n]]>", "author": "John Sidles", "published": "2018-10-03 20:55:09+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Do you see any tension between your embrace of Beto, whose drunken driving at age 26 could easily have killed people, and your view that Brett&#8217;s alleged drunken behavior at 17 is disqualifying?</p>\n]]>", "author": "jonathan", "published": "2018-10-04 01:33:39+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>jonathan #45: Honestly, somewhat, yes.  On the other hand, setting political considerations aside, I do think that attempted rape seems worse than drunk driving on some deontological scale, regardless of what a utilitarian calculus might say (they&#8217;re both bad).  Also&#8212;this is maybe the most salient difference, <i>if</i> you think Kavanaugh is likely guilty&#8212;O&#8217;Rourke has admitted and apologized for his behavior while Kavanaugh hasn&#8217;t in the slightest.  And in any case, Republicans don&#8217;t get to claim any moral high ground on DWI after their embrace of George W. Bush.</p>\n]]>", "author": "Scott", "published": "2018-10-04 02:02:38+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>OK, summing the contributions that people told me about by comments and email: someone just needs to donate $33 tonight to reach my $853 limit!  Russ Abbott #9: since you&#8217;d previously offered, how about you?</p>\n]]>", "author": "Scott", "published": "2018-10-04 02:08:16+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>With respect to the SCOTUS circus, I think that if we are looking for anybody to blame, nobody deserves the blame more than the justices themselves, particularly Anthony Kennedy. If the Supreme Court looks libertarian since 2005 is because Anthony Kennedy himself is libertarian. He has been a &#8220;de facto&#8221; dictator for 13 long years. Ever since &#8220;judicial supremacy&#8221; became the accepted view on judicial decisions, liberals have made sure that their nominees were reliable liberals. There hasn&#8217;t been any David Souters or Anthony Kennedys among the left&#8217;s nominees. Ginsburg, Kagan and Sotomayor are as hard left as they come. In the case of Ginsburg she is on the record bashing the nominee of the Republican Party during the 2016 election, something that was totally unprecedented in terms of protocol until she broke it.</p>\n<p>The right is now playing the same game, and understandably so, the political party who believes to have a God given right to political power at any cost is going to let it go without a fight. Destroying the reputation of a man and attacking his family is irrelevant to the goal of keeping the seat open until 2020. </p>\n<p>Unfortunately for the left, Trump is as much of a street fighter as they are. There is already a procedural vote set for Friday that will force senators to vote. The word of Lindsey Graham is that the confirmation of Kavanaugh will be the issue used to excite Republican voters in November if he fails to be confirmed within a week, something that won&#8217;t play well in states like North Dakota or West Virginia that now have Democratic senators but whose voters support Trump in overwhelming margins. In fact, recent polling by respected firms already see a so called &#8220;Kavanaugh effect&#8221; of Republican voters being as excited as those of &#8220;the resistance&#8221;.</p>\n<p>In reality, only the Supreme Court can fix itself by abandoning its self appointed role of being a de facto &#8220;super legislature of nine&#8221;. That was never the intention of the framers. They said that the US Constitution is the supreme law of the land, not the opinions of the Supreme Court on how the constitution must be interpreted. The other branches, particularly the executive branch, could as well ignore its opinions with a &#8220;I agree to disagree&#8221; and let the voters decide at the next election who&#8217;s right: the executive of the supreme court.</p>\n<p>The American people will emerge the winner of the current circus.</p>\n]]>", "author": "the problem with the gatekepers", "published": "2018-10-04 02:30:17+00:00", "title": "By: the problem with the gatekepers"}, {"content": "<![CDATA[<p>With respect to Ford, it seems clear that she believes that something terrible happened to her in high school. It is impossible for me to say whether Kavanaugh had anything to do with it. It is well known that victims of horrible events can become convinced that famous people did them wrong. It is also well known that people can pass polygraph tests for alien abductions <a href=\"https://en.wikipedia.org/wiki/Travis_Walton_UFO_incident\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Travis_Walton_UFO_incident</a> . Not to mention that people can create false memories that can end up sending innocent people to jail as it happened with the so called satanic panic <a href=\"https://io9.gizmodo.com/a-brief-history-of-satanic-panic-in-the-1980s-1679476373\" rel=\"nofollow\">https://io9.gizmodo.com/a-brief-history-of-satanic-panic-in-the-1980s-1679476373</a> in the 1980s. </p>\n<p>As evidence that academics -who lean to the left overwhelmingly- are as petty as the rest of us when it comes to their politics, one would expect that skeptics would be as aggressive questioning Ford&#8217;s version -given the lack of evidence for her story- as they are questioning Travis Walton&#8217;s alien abduction account. Alas, when it comes to politics, reason and logic tend to not matter that much.</p>\n]]>", "author": "the problem with the gatekeepers", "published": "2018-10-04 02:41:44+00:00", "title": "By: the problem with the gatekeepers"}, {"content": "<![CDATA[<p>Why are we even discussing whether Kavanaugh sexually assaulted Ford?  As others have already pointed out, at this point it&#8217;s pretty clear that Kavanaugh lied or was deliberately misleading about a number of things, regardless of whether that particular incident actually happened.  So, the question of whether Kavanaugh ought to be confirmed can basically already be decided in the negative due to other factors.  I mean, people can argue over the original question if they really want, sure, but I should hope they realize that at this point it has little bearing on the question of whether Kavanaugh ought to be confirmed.</p>\n]]>", "author": "Sniffnoy", "published": "2018-10-04 05:53:30+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>@Lawrence D&#8217;Anna #3: &#8220;Has anyone, ever, in the entire history of politics and human conflict, ever thought that their own side started a scorched-earth, all-defect equilibrium?&#8221;</p>\n<p>I have thought so twice. In one case, I left my side as a result. In the other, I&#8217;m still on that side, though I try to keep the aggressive tactics restricted to one issue and not burn down all of society.</p>\n]]>", "author": "Leo", "published": "2018-10-04 06:38:19+00:00", "title": "By: Leo"}, {"content": "<![CDATA[<p>Scott #39:<br />\nYes you are right, it is a dangerous slope, when part of how you define people that you criticize, is what they are. I would be much more comfortable with &#8220;whiny people should go to hell&#8221; than with &#8220;whiny white males should go to hell.&#8221;<br />\nInteresting about some Jews before WW2 &#8220;It does not apply to me&#8221;. Problem is, antisemites think like this: &#8220;This person is Jewish therefore he/she is greedy&#8221; (which apart form being stupid places the emphasis on what the person is, the supposed behavior is just a by-product). I think that &#8220;whiny white males&#8221;  criticizes white males who happen to be whiny, but does not imply strict causality. I may well be wrong and see the world with pink-tinted glasses.<br />\nAs for what you had to suffer at the hands of twitter vigilantes, first of all it should never happen but unfortunately does happen. My (remote) view on this is that it is mob mentality, pure and simple. It is only vaguely correlated with social justice or contemporary feminism. To wit, a lot of people are harassed by *right wing* morons à la 4chan, because they dared speak out for women, or they happen to be a non-white female in a commercial movie (see: Kelly Marie Tran, or the latest &#8220;Ghostbusters&#8221; movie). Or maybe you have two poles of attraction for trolls, the &#8220;social justice&#8221; scene and the &#8220;right-wing&#8221; scene. Don&#8217;t assume that the &#8220;SJWs&#8221; are winning. See who is in the White House, witness the immigration policies getting stricter by the day everywhere&#8230; This is what frightens me. The right-wing. The morons on the &#8220;other side&#8221; are also a problem but less pressing, in my view. Maybe I&#8217;m wrong to prioritize so much, I do&#8217;t know.</p>\n<p>And Facebook reinforces the mob mentality, reinforces the endless hate messages&#8230; You are absolutely right about the effect of an endless wall of hate. Both on the intended (or not) target and on the people who are encouraged to hate such-and-such. If you see endless &#8220;social justice warrior&#8221; messages on you wall, that is because of your Facebook friends and your interests (what you &#8220;liked&#8221;, which sites you visited&#8230;) But Facebook only surfaces the basest, dumbest content that vaguely aligns with you interests, because this is what has viral potential. I hope you realize that other people, in their Facebook bubble, do in fact see endless messages about &#8220;greedy Jews&#8221;, or Rohyingas&#8230;</p>\n<p>Finally, I don&#8217;t think white males deserve to suffer, to right some wrong, but I think they may have to suffer (to some extent&#8230;), to achieve some balance.</p>\n]]>", "author": "Jo", "published": "2018-10-04 08:58:15+00:00", "title": "By: Jo"}, {"content": "<![CDATA[<p>Jo #52:</p>\n<ul>I would be much more comfortable with “whiny people should go to hell” than with “whiny white males should go to hell.”</ul>\n<p>Frankly, I&#8217;m not that comfortable with the former either. 🙂  Often people have legitimate grievances to &#8216;whine&#8217; about&#8212;picture the thermonuclear outrage that would understandably follow any statement of the sort, &#8220;whiny black/disabled/trans people should go to hell.&#8221;  And even if not, it seems infinitely more useful to focus on someone&#8217;s actual grievance and why you think it&#8217;s unjustified, than on their &#8216;whining&#8217; about it.  In practice, I find that the latter typically functions as a way to ridicule a speaker, build up a social alliance against them, and <i>insinuate</i> that their grievance must be unjustified, without needing to answer anything on the merits.  Even the left-wing writer Nathan Robinson, in an <a href=\"https://www.currentaffairs.org/2018/09/how-we-know-kavanaugh-is-lying\" rel=\"nofollow\">article</a> that (unsurprisingly) is withering toward Kavanaugh, condemns the constant focus on his emotional state, anger, self-pity, etc. as unacceptable &#8220;tone policing.&#8221;</p>\n]]>", "author": "Scott", "published": "2018-10-04 09:57:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Sniffnoy #50: I confess that, in the specific case of Kavanaugh, there would be an infinitely delicious historical irony to voting him down with the argument, &#8220;no, this has nothing to do with the original sex-related allegation, it&#8217;s only about the later lying under oath.&#8221; 😀</p>\n<p>On the other hand, regarding Kavanaugh&#8217;s apparent lying on the central issue of his teenage drinking habits, he might be able to answer honestly that his <i>definitions</i> of moderate drinking, heavy drinking, blackouts, etc. are just shifted relative to yours or mine!  He could even insist that, in his mind, he had only respectful feelings toward Renate and he <i>thought</i> boofing meant vomiting: without a contemporaneous record, it would seem almost impossible to prove he was lying.</p>\n]]>", "author": "Scott", "published": "2018-10-04 10:10:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Sniffnoy #50: What you&#8217;re saying basically supports Jonathan Turley&#8217;s argument that this was all just a perjury trap. <a href=\"https://youtu.be/G57NgSoo4cQ\" rel=\"nofollow\">https://youtu.be/G57NgSoo4cQ</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/Nivasch:Gabriel.html\">Gabriel Nivasch</a>", "published": "2018-10-04 11:03:33+00:00", "title": "By: Gabriel Nivasch"}, {"content": "<![CDATA[<p>FFF&#8230;<br />\nundoubtedly stood for the ForgetFul Functor, or some higher power thereof.</p>\n]]>", "author": "sf", "published": "2018-10-04 11:37:51+00:00", "title": "By: sf"}, {"content": "<![CDATA[<p>@the problem with gatekeepeers#49- Ordinary claims require ordinary evidence, extraordinary claims require extraordinary evidence. Drunken men commit rape every day, no one has ever proven the existence of extraterrestrial abductions. If a woman told me she had been raped by a drunken guy, I would be more inclined to believe her than if she said she was abducted by aliens.</p>\n]]>", "author": "Michael", "published": "2018-10-04 12:07:50+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Michael #57 </p>\n<p>Spare me of your moralizing. It is very clear what is going on in the Kavanaugh investigation. The Democrats would have pulled a similar stunt on any male nominated by Trump to replace Anthony Kennedy: find somebody from a distant past to accuse the nominee of having done something horrible. Gang rapists and drunks don&#8217;t stop being so at the age 17. </p>\n<p>The &#8220;left&#8221; has a history of creating these stunts since time immemorial if necessary to grab political power. Winston Churchill already noticed “Socialism is the philosophy of failure, the creed of ignorance, and the gospel of envy.”</p>\n<p>A normal, &#8220;non left leaning&#8221; Supreme Court is a threat for the left&#8217;s plan of controlling the United States via a &#8220;super legislature of 9&#8221; as they have been doing since the 1970s.</p>\n<p>You might find this hard to believe, but the average Joe -even those with left leaning sympathies- is not as obsessed with controlling other people&#8217;s lives as the hard left activists behind the Ford stunt or those who are happy with the stunt. </p>\n<p>The &#8220;Kavanaugh effect&#8221; is real. As usual with the left, it has overplayed its hand and it will pay dearly at the polls in one month.</p>\n]]>", "author": "the problem with the gatekeepers", "published": "2018-10-04 14:15:52+00:00", "title": "By: the problem with the gatekeepers"}, {"content": "<![CDATA[<p>Michael #57</p>\n<p>I learned this after sending my other reply. Here is a fresh data point supporting the Kavanaugh effect</p>\n<p><a href=\"http://www.rasmussenreports.com/public_content/politics/political_updates/prez_track_oct04\" rel=\"nofollow\">http://www.rasmussenreports.com/public_content/politics/political_updates/prez_track_oct04</a></p>\n<p>&#8220;The Rasmussen Reports daily Presidential Tracking Poll for Thursday shows that 50% of Likely U.S. Voters approve of President Trump’s job performance. Forty-nine percent (49%) disapprove.&#8221;</p>\n<p>Trump&#8217;s approval rating as measured by Rasmussen -which granted has a Republican spin but it was also the most accurate of the public polls in 2016- is at the highest point is has been in months. Another clear sign of Republican voters excitement as we approach the midterms. If the Republicans were to pick up 2 or 3 US senate seats (as I have heard some commentators say this morning) as a result, Kavanaugh will be confirmed after the midterms should he be rejected in the upcoming vote for whatever reason.</p>\n]]>", "author": "the problem with the gatekeepers", "published": "2018-10-04 14:27:55+00:00", "title": "By: the problem with the gatekeepers"}, {"content": "<![CDATA[<p>&#8220;the 85-year-old Willie Nelson, headlining the first political event of his 60-year music career&#8221;. you mean his first event for a political candidate. His annual Farm Aid concert is definitely a political event.</p>\n]]>", "author": "Richard Gaylord", "published": "2018-10-04 15:35:01+00:00", "title": "By: Richard Gaylord"}, {"content": "<![CDATA[<p>Richard #60: OK thanks for clarifying.</p>\n]]>", "author": "Scott", "published": "2018-10-04 16:34:57+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>OK, my $853 matching donation has been made!  Thanks everyone!</p>\n]]>", "author": "Scott", "published": "2018-10-04 16:56:08+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>here&#8217;s $35 more, happy even though no match!</p>\n]]>", "author": "Hal Gabow", "published": "2018-10-04 19:55:23+00:00", "title": "By: Hal Gabow"}, {"content": "<![CDATA[<p>So &#8211; interesting thing on the subject of believability. </p>\n<p>I&#8217;m pretty sure that, had I seen Kavanaugh&#8217;s performance as a 19-year-old, I&#8217;d have bought the whole thing. Not a 1980s 19-year-old, which was when I was 19, but as a 2018 19-year-old. I&#8217;d have bought it because here&#8217;s a guy in a suit and he&#8217;s upset and he&#8217;s *crying*, for god&#8217;s sake, and he&#8217;s angry about it, and you just don&#8217;t see grown professional men in suits behaving like that unless something&#8217;s terribly wrong. </p>\n<p>I&#8217;m also pretty sure that had I watched that as a 19-year-old in a college lounge in the 1980s, there would have been two or three women undergraduates and a few guys saying he was bullshit, and I&#8217;d have been very confused, because these people would have seemed very savvy, like superior-being savvy, but I just wouldn&#8217;t have been able to see where they were getting this from. Had I watched it in a college lounge in 2018 and heard the jeering, I&#8217;d have assumed that was partisan baloney and that my take was accurate. </p>\n<p>As a 50-year-old, though, holy cow, have I seen a lot of guilty-as-hell snuffling guys with self-pity stories and the rage shtick and the convenient Mitty syndrome. And there&#8217;s a limit to how many times even someone as thick as me will fall for that. I&#8217;ve also seen what middle-aged men look and sound like when they&#8217;re really being framed, and it&#8217;s not that. So I don&#8217;t buy this anymore, and neither did the 63-year-old woman I was watching part of this thing with, because we couldn&#8217;t neither of us bring ourselves to watch the whole show. When he had a little breakdown over someone&#8217;s sending him a note to call him a good guy, we both just shouted and she closed the window. It was lost on neither of us that what he was really concerned with was reputation, and the whole thing was just angling for that. </p>\n<p>I still don&#8217;t understand how those few college kids manage to get wise so fast, but there you go. Some people are just better than spotting motive than others? They understand people better? They have specifically horrible childhoods? I dont know. </p>\n<p>As for Blasey Ford&#8230;well, there are good reasons why people were quiet and crying all over the country. The thing is, sexual assault has never been rare. There are a lot of people who know what it&#8217;s like. Everything she said rang true &#8212; including the details of 80s midatlantic rich-kid party culture. (Swetnick got too much wrong there and had other problems; I didn&#8217;t believe her.) Her little tiny girl voice made me sad, but I understand where that comes from, too. </p>\n<p>I think the midterms will be unremarkable, that the Republicans will view it as endorsement, and that we&#8217;ll go over some cliffs. My sense throughout this, though, is that it kind of doesn&#8217;t matter, because the fireworks I&#8217;m seeing in a generational sense are just spectacular, and the demographics are just not on the GOP&#8217;s side. (Even before you talk age, white right-wing Christian men make up a pretty small slice of the population, under 20%. You go looking for the millennial/Z slice of that and it&#8217;s a minority slice, and they tend not to marry as much as the X/Boomer men did, meaning they don&#8217;t have so many women there to back them up and stand by them.)  I think this process has catalyzed things that would&#8217;ve taken decades to get to otherwise, just because it&#8217;s been so concentrated and so very visible in front of the faces of young women and men &#8212; so many of whom seem to be much sharper about all this than I would have been at their ages. And the young men are not unimportant there. So I think that in 20, 25 years, this place is going to look radically different in terms of gender representation, discourse, and power distribution &#8212; and as gender goes, so goes race in this country. We&#8217;ve been heading strongly in that direction anyhow for the last, what, 50 years, but I think this week&#8217;s imparted a certain determination to young people who&#8217;re already pissed off about what&#8217;s being done with their futures. </p>\n<p>I have actually not felt this optimistic in a long time. I do believe we&#8217;re in for a bad time immediately, but I&#8217;ve not felt this good about the country in&#8230;maybe ever. I&#8217;m seeing a lot of democracy. It&#8217;s very interesting how the idea of the institutions is stronger than the view of the current state of the institutions. Rather like the way the idea of America is actually more important than the country itself is.</p>\n]]>", "author": "amy", "published": "2018-10-04 20:17:32+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>The substance of Amy&#8217;s comment (<i>circa</i> <a href=\"#comment-1788762\" rel=\"nofollow\">#64</a>), in regard to sexual assault and the Kavanaugh nomination, holds true equally,  in regard to denial of alcoholic&nbsp;/ substance abuse and the Kavanaugh nomination.</p>\n<p>Such denial is <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/3183644\" rel=\"nofollow\">sadly common</a>, as&nbsp;all-too-many alcoholic families know.</p>\n<p>In a nutshell, that Kavanaugh seriously abused alcohol has been factually established.   By&nbsp;all reasonable standards of&nbsp;judicial fitness, the associated fact, that while under oath, Kavanaugh vehemently sustains his denial of serious alcohol abuse, is disqualifying.</p>\n]]>", "author": "John Sidles", "published": "2018-10-04 21:25:48+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Kevin #10: I mean, Yudkowsky has argued that this in fact exactly the correct way of reasoning about such problems, and that the only reason the formula seems absurd is because our puny meat brains are unable to intuitively comprehend morality when N gets big enough (a.k.a. the &#8220;shut up and multiply&#8221; decision theory). Note that the required &#8220;large enough&#8221; N may be vastly more than the number of humans that exist in the universe, though&#8230;</p>\n<p>Scott #54: Nate Silver gave a response to this argument on Twitter earlier today: &#8220;if you say 7 or 8 things that are very likely but not quite certain to be lies, it&#8217;s essentially certain that at least one of them is a lie.&#8221;</p>\n]]>", "author": "Aaron Rotenberg", "published": "2018-10-04 21:37:39+00:00", "title": "By: Aaron Rotenberg"}, {"content": "<![CDATA[<p>Amy #64</p>\n<p>There is plenty of data to support the fact that generation Z (those following millennials which happen to be the children of Gen X-ers) are more conservative than both millennials and baby boomers were at their comparable ages. I won&#8217;t be quoting those. Suffice it to say that Susan Rice&#8217;s son (you know the Susan Rice of Obama&#8217;s fame) is one of them <a href=\"https://www.thecollegefix.com/the-conservative-leader-at-stanford-is-susan-rices-son/\" rel=\"nofollow\">https://www.thecollegefix.com/the-conservative-leader-at-stanford-is-susan-rices-son/</a> </p>\n<p>John Sidles #65</p>\n<p>The issue of Kavanaugh&#8217;s alleged lie under oath has been debunked elsewhere. But while we are on topic, excuse me if I am skeptical of all this sudden outrage by the left when it comes to lying under oath and character issues. These are the same left wing people who 2 years ago were asking that we vote for a rapist enabler (Hillary Clinton) who stood by his man (Bill Clinton) when the latter not only lied under other on the Lewinsky affair but, more importantly, couldn&#8217;t care less about destroying the life of a young woman (Lewinsky) who to this day has been unable to rebuild her life as a result of the incident. The way the liberal mind is able to live with these contradictions is beyond my limited brain&#8217;s ability to understand.</p>\n<p>And since I see it coming, again, when I voted for Trump, I voted for chemotherapy to treat a corrupt system. I didn&#8217;t vote for a pastor or a spiritual leader. I have those elsewhere. He is doing the work for which millions like me voted for him beautifully. Nobody was surprised by the alleged affairs associated with Donald Trump. At the same time, I still have to see an instance in which Trump viciously destroyed the life of a young woman the way Bill Clinton destroyed Monica Lewinsky&#8217;s.</p>\n]]>", "author": "the problem with the gatekeepers", "published": "2018-10-04 21:48:20+00:00", "title": "By: the problem with the gatekeepers"}, {"content": "<![CDATA[<p>Well, Kavanaugh *was* telling the truth about &#8220;Devil&#8217;s triangle&#8221;: <a href=\"https://mobile.twitter.com/jaketapper/status/1047924963611750400\" rel=\"nofollow\">https://mobile.twitter.com/jaketapper/status/1047924963611750400</a></p>\n<p>But I still want to know what those three asterisks mean on line 3 of his yearbook page: <a href=\"https://images.dailykos.com/images/594955/large/180925090604-kavanaugh-yearbook-photo-exlarge-169.jpg\" rel=\"nofollow\">https://images.dailykos.com/images/594955/large/180925090604-kavanaugh-yearbook-photo-exlarge-169.jpg</a></p>\n<p>*That* is obviously a reference to some kind of sex act&#8230;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/Nivasch:Gabriel.html\">Gabriel Nivasch</a>", "published": "2018-10-04 22:07:54+00:00", "title": "By: Gabriel Nivasch"}, {"content": "<![CDATA[<p>Aaron #66: I’m only seeing Silver’s point if the events are independent!</p>\n]]>", "author": "Scott", "published": "2018-10-04 22:14:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #69: Perhaps Silver&#8217;s point was less about the statistical probability of the events as if they were independent coin flips, and more that people telling the truth typically don&#8217;t repeatedly say things that sound like lies on their face but are nonetheless unfalsifiable.</p>\n]]>", "author": "Aaron Rotenberg", "published": "2018-10-04 23:25:29+00:00", "title": "By: Aaron Rotenberg"}, {"content": "<![CDATA[<p>Gabriel Nivasch #55:</p>\n<p>Once again, for the sake of argument, let&#8217;s suppose that&#8217;s true.  That still doesn&#8217;t make Kavanaugh any more qualified; it still has no bearing on the question at hand.</p>\n<p>Focus, man.</p>\n]]>", "author": "Sniffnoy", "published": "2018-10-04 23:33:43+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Problem with Gatekeepers #67: What, exactly, did Bill Clinton do that viciously destroyed Lewinksy&#8217;s life?  Was it the incident itself? Do you think she didn&#8217;t give consent? Or that he said he did not have sexual relations with her? Do you think things would have been better for her if he had said she had?</p>\n<p>I&#8217;m really having trouble understanding how anything Clinton did to Lewinsky could compare to, say, calling on the &#8220;second amendment people&#8221; to deal with a political opponent.</p>\n]]>", "author": "Dan Staley", "published": "2018-10-05 00:12:16+00:00", "title": "By: Dan Staley"}]