[{"content": "Michael Kearns&#39; class on &quot;Networked Life&quot; seems to be somewhat down that alley of a softer introduction to algorithmic thinking... http://www.cis.upenn.edu/~mkearns/teaching/NetworkedLife/nwlife12.html<br /><br />I&#39;m not sure how relevant it is though to algorithms per se, than to quantitatively thinking about ideas that have been bouncing around in the social sciences for a while (Schelling models, Six Degrees of Separation, etc.). However, if you are thinking of something down that path, Michael&#39;s probably someone you would want to talk to, as he has taught it over nine iterations since 2004.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/Narayan:Arjun.html\">Arjun Narayan</a>", "published": "2013-12-05 16:47:54.441000-05:00", "title": ""}, {"content": "<a href=\"http://www.cs.princeton.edu/courses/archive/fall13/cos226/info.php\" rel=\"nofollow\">Algorithms and Data Structures</a> attracts about one-third of all Princeton undergraduates. It covers the basics like sorting and searching, as well as graph processing, string processing, and a gentle introduction to intractability.", "author": "Anonymous", "published": "2013-12-05 21:12:32.631000-05:00", "title": ""}, {"content": "If the audience is non-cs folk, how about<br />Algorithms unplugged<br />http://www.springer.com/mathematics/book/978-3-642-15327-3<br />?<br /><br />I don&#39;t think I&#39;ve seen a course based out of this book, but I think it is feasible.  <br />", "author": "Meena", "published": "2013-12-05 21:59:12.814000-05:00", "title": ""}, {"content": "Anonymous #2 -- is that really 1/3 of all undergraduates, or 1/3 of all undergraduates in the college of engineering?  <br /><br />Meena -- I like the idea of an Algorithms Unplugged type course.  I&#39;d have to think about coherency -- what are the big lessons I want students to get out of the course, and can the topics be suitably laid out coherently to cover the themes -- to make sure it wasn&#39;t just a hodgepodge of things.  And I&#39;d have to find the appropriate breadth/depth tradeoff.  Really nice idea for a starting point though.  ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2013-12-06 13:50:33.198000-05:00", "title": ""}, {"content": "@Michael<br />Yes, 1/3 of all Princeton undergrads will take the course at some point - 400+ a year and still increasing in popularity. ", "author": "Anonymous", "published": "2013-12-07 16:37:39.625000-05:00", "title": ""}]