[{"content": "<![CDATA[<p>@ Charles Stromeyer Jr. #43, BLANDCorporatio #46:</p>\n<p>Note that Scott&#8217;s freebits are actually not free in the sense of Colbeck and Renner, since their observed state is correlated with their state at any earlier time.</p>\n]]>", "author": "Ben Standeven", "published": "2016-09-22 05:36:32+00:00", "title": "By: Ben Standeven"}, {"content": "<![CDATA[<p>Hi Prof.Aaronson et al.,</p>\n<p>First time commenter here&#8230;reading through GIQTM at the moment&#8230;</p>\n<p>&#8220;Look—I don’t know if any of you are like me, and have ever gotten depressed by reflecting that all of your life experiences, all your joys and sorrows and loves and losses, every itch and flick of your finger, could in principle be encoded by a huge but finite string of bits, and therefore by a single positive integer. (Really? No one else gets depressed about that?) It’s kind of like: given that this integer has existed since before there was a universe, and will continue to exist after the universe has degenerated into a thin gruel of radiation, what’s the point of even going through the motions? You know?&#8221;</p>\n<p>I am not entirely sure this picture, if it were true, would lead to depression. It actually sounds beautiful to me&#8230;<br />\nIs it due to a loss of the sense of there being some value to personal identity and subjective experience while we are around? Maybe such evaluation is within the Big Integer too, and knowing all the ingredients of the finest Belgian chocolate would not diminish the experience of tasting it?</p>\n<p>As does your poetic assertion regarding the eternal(ly recurring) marriage of transcience and uniqueness&#8230;<br />\nAnd I do not know enough to be make a judgment of truth here&#8230;<br />\nApologies if that was entirely unhelpful&#8230;</p>\n]]>", "author": "Concerned 3rd Party", "published": "2016-09-22 21:08:23+00:00", "title": "By: Concerned 3rd Party"}, {"content": "<![CDATA[<p>Hello again Scott,</p>\n<p>Since what I call &#8216;my big breakthrough&#8217; on the consciousness puzzle a few months back,  my views seem to have been rapidly crystallizing in a flurry of insights as I move from the initial vague intuitions towards something more precise and formal.  </p>\n<p>I feel I&#8217;m really starting to close in definite answers &#8211; my intellectual wagons are circling around the concepts of &#8216;personal identity&#8217; and &#8216;time&#8217;  and the circles are getting smaller as I tighten the noose&#8230;</p>\n<p>You see, I really think the puzzles of &#8216;consciousness&#8217;, &#8216;time&#8217; ,  &#8216;personal identity&#8217; and &#8216;free will&#8217; are all strongly related, in the sense that if you fully understood one of them, you&#8217;d grasp the secret to all of them.  I get the impression you think the same thing, although you&#8217;ve never explicitly said so.</p>\n<p>Some of my views of the &#8216;triple-aspect&#8217; theory of reality have crystallized, so I have to say a few things about that just to update what i said in the earlier thread.</p>\n<p>  Earlier I was still considering some weak forms of dualism.  My update is that I now fully reject all forms of dualism as wrong-headed.   I had said that there were 3 fundamental properties of reality<br />\n(information, matter (fields), consciousness).</p>\n<p>I now think there is *one* fundamental element of reality, which I call the &#8216;Info-Cognition Field&#8217;.   This manifests itself as 3 *apparent* properties (information, fields and consciousness), but there&#8217;s really only 1 thing there (neutral monism).  It&#8217;s analogous to the way that &#8216;electromagnetism&#8217; manifests as &#8216;electricity&#8217; and &#8216;magnetism&#8217;.</p>\n<p>I had earlier made the claim that consciousness was &#8216;the arrow of time&#8217;.  I think this was right on the money.  The secret is &#8216;time&#8217;!</p>\n<p>I now think that &#8216;qualia&#8217; is a basic fundamental unit of &#8216;time&#8217; or &#8216;causality&#8217;.  It&#8217;s a unit of &#8216;causal continuity&#8217; and this also defines an &#8216;identity&#8217;.</p>\n<p>You see, every object in the universe has an &#8216;identity&#8217;, which we can *define* as the degree of localization in space and time.  In other words, the &#8216;identity&#8217; of the object is only defined to the extent that we can &#8216;pin down&#8217; the location of the object in the multiverse.   </p>\n<p>So that then is &#8216;consciousness&#8217; (or &#8216;qualia&#8217;).  It&#8217;s the fundamental unit of &#8216;identity&#8217; or &#8216;causal continuity&#8217;, present to some degree in all things.</p>\n<p>More complex identities (or consciousness) are built up from simpler ones, exactly analogous to the way that more complex forms of matter are built from simpler ones.</p>\n<p>The &#8216;combination problem&#8217; for qualia is resolved by seeing that you &#8216;paste together&#8217; smaller units of &#8216;causal continuity&#8217; into larger ones&#8230;. a unit of &#8216;causal continuity&#8217; is simply a thermodynamic &#8216;propensity&#8217; for events to happen in one way rather than another way.   </p>\n<p>Decision theory can be interpreted as a theory of how to &#8216;paste together&#8217; different preferences or &#8216;qualia&#8217; into a coherent whole.  So &#8216;decision theory&#8217; is really a high-level theory of &#8216;qualia&#8217;!    Similarly, at an each higher level of abstraction, values or ethics would emerge as &#8216;qualia&#8217; get pasted together into ever more complex minds.  In this picture, axiology (theory of values) emerges as a higher-level form of decision theory.</p>\n<p>What is the relationship between information, matter and consciousness?</p>\n<p>Each &#8216;contains&#8217; the other 2, just as I thought.   Each property can be *approximately* defined as a combination of the other 2.  They&#8217;re not separate, but they&#8217;re not identical either.  Reductionism is an *approximation* , not an absolute principle.  So the 3 properties (information, matter and consciousness) are still ontologically distinct, even though they can be approximately defined in terms of each other.</p>\n<p>How does all this relate to your ideas as regards GIQTM? I think my ideas match up well with yours!</p>\n<p>If qualia (consciousness) is indeed the basic unit of &#8216;time&#8217; or &#8216;causal continuity&#8217;, and is a &#8216;thermodynamic propensity&#8217;, then indeed, consciousness directly participates in the thermodynamic arrow of time, just as you claim!</p>\n<p>Furthermore, if consciousness is also the basic unit of &#8216;identity&#8217;, then again, the puzzle of free will would be directly linked to that of &#8216;identity&#8217;.</p>\n<p>On the basis of this, I regard GIQTM as a real candidate for a possible solution to these puzzles!</p>\n<p>However, although I like the general ideas in GIQTM, I&#8217;m still skeptical of the specific QM mechanism proposed (no-cloning).</p>\n<p>Something still isn&#8217;t quite right.  In particular, I still really can&#8217;t see why &#8216;identity&#8217; should be unique&#8230;the problem is that according to MWI of QM, we are being &#8216;forked off&#8217; all the time into multiple copies, so doesn&#8217;t this suggest that low-level quantum states aren&#8217;t really that important for personal identity?</p>\n<p>But Scott, I certainly think you are  on the right track overall.</p>\n]]>", "author": "mjgeddes", "published": "2016-09-23 05:47:09+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>Sniffnoy: the first page of the PDF has a link back to the abstract page on ArXiv.  Most PDFs on ArXiv have such a link.</p>\n]]>", "author": "jonas", "published": "2016-09-23 20:07:26+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p><a href=\"http://algorithmicassertions.com/2016/04/24/eves-quantum-clone-computer.html\" rel=\"nofollow\">http://algorithmicassertions.com/2016/04/24/eves-quantum-clone-computer.html</a></p>\n<p>I&#8217;m not sure whether or not you&#8217;ve seen this. In short, no-cloning can be broken in exponential time when the quantum state is interacting with the environment.</p>\n<p>I&#8217;m not sure how the contents of this article affect or don&#8217;t affect your speculations regarding no-cloning and personal identity.</p>\n]]>", "author": "Psycicle", "published": "2016-09-26 00:17:16+00:00", "title": "By: Psycicle"}, {"content": "<![CDATA[<p>Psyclicle #54,</p>\n<p>This is indeed very interesting, and I wish Scott would discuss it for its own. However, I&#8217;m not convinced it causes any problem for the freebit picture. </p>\n<p>More specifically, what Craig Gidney showed is that there exists some combinations of (quantum computations+partial measurements) which allow guessing the quantum state post-measurement even without knowing the initial state. However, he also noted that this is not true for all computations.</p>\n<p>In terms of the freebit picture, if you have long-lived freebits that contribute only in some specific situations (say, when more freebits have just arrived or when there&#8217;s some important decision to make or both), then this completly escapes Craig Gidney&#8217;s demonstration.</p>\n]]>", "author": "Jay", "published": "2016-09-27 17:54:37+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>#45</p>\n<p>Thanks for sharing the Constructor Theory link, Daniel Bilar.  I think it will have more appeal to me than most others around here.  Questioning Bell&#8217;s theorem has cause some kerfuffles in the past. 😉</p>\n]]>", "author": "Jon K.", "published": "2016-09-28 19:04:17+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p><a href=\"http://www.theverge.com/2016/9/28/13057414/quantum-computer-d-wave-2000-qubit-chip\" rel=\"nofollow\">http://www.theverge.com/2016/9/28/13057414/quantum-computer-d-wave-2000-qubit-chip</a></p>\n]]>", "author": "Marnie Dunsmore", "published": "2016-09-29 16:14:51+00:00", "title": "By: Marnie Dunsmore"}, {"content": "<![CDATA[<p><a href=\"http://www.ibtimes.co.uk/japanese-scientists-develop-quantum-entanglement-control-technology-make-qubits-last-longer-1583827\" rel=\"nofollow\">http://www.ibtimes.co.uk/japanese-scientists-develop-quantum-entanglement-control-technology-make-qubits-last-longer-1583827</a></p>\n]]>", "author": "Marnie Dunsmore", "published": "2016-09-29 16:32:42+00:00", "title": "By: Marnie Dunsmore"}, {"content": "<![CDATA[<blockquote><p>What if unclonability is our universe’s way around the paradoxes of self-reference, like the unsolvability of the halting problem and Gödel’s Incompleteness Theorem?</p></blockquote>\n<p>In a certain sense, this is a well-known result (in the mathematical sense of &#8220;well-known&#8221; meaning &#8220;there are people who know it&#8221;). (I say &#8220;certain sense&#8221;, because of course this is an informal question, and there are multiple ways to formalize it.) </p>\n<p>The paradoxes of self-reference are all instances of the Lawvere fixed point theorem, which states that in a cartesian closed category, if there is a point-surjective morphism A -> (X^A), then every endomorphism X -> X has a fixed point. &#8220;Clonability&#8221; (which logicians call &#8220;contraction&#8221;) amounts to the condition that the category is cartesian. If you drop that condition, then his fixed-point theorem doesn&#8217;t go through.</p>\n<p>In fact, you can prove that for a set theory over linear logic (ie, monoidal closed categories), the naive comprehension axiom is sound. See (e.g.) Kazushige Terui&#8217;s <em>Light Affine Set Theory: A Naive Set Theory of Polynomial Time</em>.  </p>\n<p>Basically, it takes all three of self-reference, contraction, and closure to get the fixed point theorem to go through. Drop any one of them and the proof fails. For the proof theorist, it is certainly most elegant to drop contraction, so it is nice the universe agrees.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Krishnaswami:Neel.html\">Neel Krishnaswami</a>", "published": "2016-09-30 08:51:59+00:00", "title": "By: Neel Krishnaswami"}]