[{"content": "<![CDATA[<p>Scott#75:<br />\nYou are absolutely correct, my responses show my bias towards gadgets, being a retired electronics engineer, you have the correct scientific interpretation.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hird:William.html\">William Hird</a>", "published": "2014-04-13 20:26:30+00:00", "title": "By: William Hird"}, {"content": "<![CDATA[<p>anon #69:</p>\n<p>Ah that&#8217;s really cool, thanks for the opinion and the link : ) Sorry if it came across as pedantic, just think that the interesting stuff is usually in the details, right along with the devil ;).</p>\n]]>", "author": "A", "published": "2014-04-13 20:36:39+00:00", "title": "By: A"}, {"content": "<![CDATA[<p>Scott #59<br />\n&#8220;a completely ideal NAND gate with no side-effects would violate quantum mechanics!&#8221;<br />\n&#8220;[...] real NAND gates don’t work like that. They do give off heat, and the heat encodes the information about the input bits x and y.&#8221;</p>\n<p>I was looking again into this and was quite surprised to find out that Maxwell Demon type of question were still being explained well into the 50s (Brillouin) and the 70s (Landauer) &#8211; and those discussions actually do not involve QM, right? It&#8217;s all in terms of thermodynamics, brownian motion, and information theory.</p>\n<p>I guess the simplest example of a non-dissipative gate would be an AND gate using billiard balls (ideas from Toffoli) <a href=\"http://tinyurl.com/nsw2zky\" rel=\"nofollow\">http://tinyurl.com/nsw2zky</a><br />\nIt&#8217;s clear that no information is lost and you can always distinguish the cases (0,0)->0, (1,0)->0, (0,1)->0 (by looking at the 0-out and 1-out outputs).</p>\n]]>", "author": "fred", "published": "2014-04-14 14:02:31+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>&#8220;Ask me anything, but only one thing&#8221;. OK. </p>\n<p>If the concept of a multiverse is correct (per Susskind), when matter (or anything else for that matter) does &#8220;disappear&#8221; into a Black Hole&#8217;s (Bekenstein-Hawking) singularity in one of many universes but reappears as a &#8220;white hole&#8221; in another universe, does this resolve the information loss paradox?</p>\n<p>BTW: Is, &#8220;Today, I usually code in an extremely high-level language called “undergrad.” in P (pun)?</p>\n<p>Math, Physics, Algorithms, and (yes, humor) can all be effective tools for teaching and learning.</p>\n]]>", "author": "Jerry", "published": "2014-04-14 14:25:09+00:00", "title": "By: Jerry"}, {"content": "<![CDATA[<p>Jerry #79: Your &#8220;resolution&#8221; of the information paradox&#8212;that information that falls into a black hole reappears in a baby universe spawned by the singularity&#8212;is the one actually advocated by Lee Smolin!  (Susskind, on the other hand, doesn&#8217;t advocate that resolution at all; he believes in parallel universes, but not <i>that kind</i> of parallel universe.)</p>\n<p>Personally, I regard it as a possible but extremely strange solution&#8212;one that I would only consider if there were compelling evidence from quantum gravity that black hole singularities really <i>do</i> spawn these baby universes, and if their existence could be given some sort of operational meaning in <i>this</i> universe.  At present, my understanding is that there&#8217;s no good evidence that black hole singularities really work this way; and furthermore, by preventing Poincare recurrences even within a bounded region of space, this scenario seems to violate &#8220;the spirit if not the letter&#8221; of quantum mechanics.  My preference is certainly for the information to reappear in <i>this</i> universe!</p>\n]]>", "author": "Scott", "published": "2014-04-14 15:50:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>fred #78: Yes, you can discuss the Maxwell Demon paradox purely in terms of classical thermodynamics and classical reversible computation!  The laws of physics are reversible, and phase-space volume is conserved, already classically, and that&#8217;s pretty much all you need to explain both the paradox and its resolution.</p>\n]]>", "author": "Scott", "published": "2014-04-14 15:54:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #80</p>\n<p>Thank you, Scott. Excellent answer!</p>\n]]>", "author": "Jerry", "published": "2014-04-14 16:21:14+00:00", "title": "By: Jerry"}, {"content": "<![CDATA[<p>Off topic:  I just read &#8220;Additively efficient universal computers,&#8221; and, assuming you read it in detail, I was curious about your take on its conclusions.</p>\n]]>", "author": "Mike", "published": "2014-04-14 16:35:16+00:00", "title": "By: Mike"}, {"content": "<![CDATA[<p>Mike #83: I liked that paper and found the notion of additive universality to be interesting.  Of course, what one really wants is a set of &#8220;candidate physical laws&#8221; (e.g. a cellular automaton) for which additive universality can be proved to hold, rather than just constructing a model for which it holds almost by definition.  But it&#8217;s a nice start.</p>\n]]>", "author": "Scott", "published": "2014-04-14 16:57:14+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, you write &#8220;So the right way to put the question is not whether we can actually build a machine to reverse the NAND gate or the black hole, but whether we can explain the NAND gate or the black hole without postulating fundamental physical laws that, at any point in time, ever “delete” the state of a particle out of the universe. For the NAND gate, we know the answer to that question is yes.&#8221;</p>\n<p>There are indeed several basic ways in which we &#8220;know&#8221; the answer is yes classically, but it is quite subtle IMO to specify in which way the quantum situation is less satisfactory than the classical one.  I&#8217;ll give some specific examples, but overall I&#8217;d say there&#8217;s still a lot to understand classically, in the same way that pseudo-random number generators are still not fully understood in computer science.  For a computer science analogue, giving a general proof of thermalization for a large variety of classical systems would probably be on par with proving P=BPP; actually, my guess is it would be harder as the standard arguments for thermalization roughly rely on assuming that certain events in a deterministic process can be treated as if they were random so they almost assume that good PRGs exist.</p>\n<p>For example, there is a line of research that dates back to Boltzmann, in which he shows that irreversible dynamics can emerge from reversible microscopic laws.  However, the original derivation makes an assumption originally called &#8220;molecular chaos&#8221; in which one assumes that pairs of particles that scatter off each other are drawn independently from the single particle distribution, giving the Boltzmann equation.  This does give irreversible dynamics, but requires an assumption.  Under similar assumptions, one can argue that irreversible quantum dynamics can emerge.  So, perhaps we would like to better justify this assumption.</p>\n<p>There is some rigorous work by Lebowitz and collaborators showing thermalization for certain initial conditions for specific systems.  This is extremely elegant work, but currently limited in which systems it can be applied to.  Conversely, there are some simple quantum systems (like free fermions) in which one can (much more straightforwardly) derive thermalization for certain initial conditions to a generalized Gibbs ensemble.  I&#8217;d say that currently the knowledge of the quantum setting is much less satisfactory here, but maybe there is no sharp qualitative difference in which we can say that classically this general problem is understood at the level of rigorous math and quantum mechanically it is not.</p>\n<p>There are also numerical studies.  Some of these numerical studies were in fact controversial classically, where certain systems were thought not to thermalize but were later learned to thermalize at extremely long time.  The quantum numerics are much worse of course, but thermalization can be seen in some of those numerics (but not all&#8230;.)</p>\n<p>A final interesting point is that we know from numerical studies using Monte Carlo on classical systems that good PRGs really are needed.  There are some famous cases where a poor choices of PRG led to inaccurate results in classical Monte Carlo, even though the PRG was considered good at the time.  So, the relation between thermalization and pseudorandomness is subtle.</p>\n]]>", "author": "matt", "published": "2014-04-15 00:52:09+00:00", "title": "By: matt"}, {"content": "<![CDATA[<p>Scott #84<br />\nConsidering the number of papers referencing it, it&#8217;s too bad John Conway named his cellular automaton thing &#8220;Game of Life&#8221; and not &#8220;Pokemon Mystery Dungeon: Explorers of Time and Darkness&#8221;.</p>\n]]>", "author": "fred", "published": "2014-04-15 15:28:47+00:00", "title": "By: fred"}]