[{"content": "<![CDATA[<p>The deliberate avoidance in your list of any instances which might challenge <i>your own</i> views (and those of the majority of your readers, in all probability) is suggestive, to say the least. It&#8217;s almost as if you want to wallow in your preconceived beliefs, rather than challenging yourself.</p>\n<p>May I add one or two things you forgot?</p>\n<p>&#8211; direct Russian interference in American politics<br />\n&#8211; antisemitic incidents following Trump&#8217;s candidacy (and later election)<br />\n&#8211; (more general) racist incidents following Trump&#8217;s candidacy (and later election)</p>\n]]>", "author": "Tuesday", "published": "2018-04-22 02:32:31+00:00", "title": "By: Tuesday"}, {"content": "<![CDATA[<p>Tuesday #38,</p>\n<p>That seems like a very strange claim to make given that Scott has expressed concern before about American gun culture, and and also has expressed concern about censorship on college campuses. So at least two of the issues he listed are explicitly issues he&#8217;s discussed.</p>\n<p>It is also is worth noting that in fact the examples you gave largely are examples where the actual data does show that the situations have gotten worse, and that&#8217;s actual data, not just attention. The number of anti-semitic incidents in the US did increase in 2017 for example <a href=\"https://www.adl.org/news/press-releases/anti-semitic-incidents-surged-nearly-60-in-2017-according-to-new-adl-report\" rel=\"nofollow\">https://www.adl.org/news/press-releases/anti-semitic-incidents-surged-nearly-60-in-2017-according-to-new-adl-report</a> . Similar remarks apply to the other two examples you gave- Russian interference in elections is a very new thing since large-scale ability to interfere with elections using social media wasn&#8217;t even possible a decade ago for pretty obvious reasons. Similarly, official US stats show an increase in hate crimes following Trump&#8217;s candidacy <a href=\"https://www.washingtonpost.com/news/post-nation/wp/2017/11/13/hate-crimes-in-the-united-states-increased-last-year-the-fbi-says/?utm_term=.274f389dd56a\" rel=\"nofollow\">https://www.washingtonpost.com/news/post-nation/wp/2017/11/13/hate-crimes-in-the-united-states-increased-last-year-the-fbi-says/?utm_term=.274f389dd56a</a> . This is actual data not just media paying more attention to specific incidents and blowing them out of proportion with extra focus.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2018-04-22 15:45:28+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Tuesday @#38:</p>\n<p>From what I know of Scott&#8217;s views, I think you&#8217;re wrong to say that suggesting that the possibility that &#8220;SJWs silencing free speech on campus&#8221; doesn&#8217;t challenge them, and possibly also the same of &#8220;Unemployment in heartland America&#8221;. </p>\n<p>&#8220;More of the things you&#8217;ve listed support your own prejudices than don&#8217;t&#8221; would be a fair comment, but that&#8217;s much weaker than what you&#8217;re alleging.</p>\n<p>Conversely, there is good evidence that all the three things you list *have* increased in frequency in recent years, so none of them belongs on this list: a quick google throws up the following; you could easily find better if you could be bothered, but I&#8217;m afraid I can&#8217;t.</p>\n<p><a href=\"https://www.theguardian.com/us-news/2018/feb/16/robert-mueller-russians-charged-election\" rel=\"nofollow\">https://www.theguardian.com/us-news/2018/feb/16/robert-mueller-russians-charged-election</a> (technically only provides evidence of existence, not of increase, but since there is essentially no evidence it was a thing until recently, the difference is moot).</p>\n<p><a href=\"https://www.adl.org/sites/default/files/documents/Anti-Semitic%20Audit%20Print_vf2.pdf\" rel=\"nofollow\">https://www.adl.org/sites/default/files/documents/Anti-Semitic%20Audit%20Print_vf2.pdf</a></p>\n<p><a href=\"https://www.washingtonpost.com/\" rel=\"nofollow\">https://www.washingtonpost.com/</a></p>\n]]>", "author": "Jacob Steel", "published": "2018-04-22 17:58:27+00:00", "title": "By: Jacob Steel"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>the SoS phenomenon raises two questions &#8230;</p>\n<p>i) Why those particular topics?<br />\nI suspect there is a difference between political examples (voting by immigrants) and spontaneous cases (sharks) and they would spread differently.</p>\n<p>ii) Did the internet make this worse ?</p>\n<p>On the one hand it makes it easier to spread rumors etc. on the other hand it makes those cases visible quickly and therefore makes it possible to argue against them (as you just did).</p>\n]]>", "author": "wolfgang", "published": "2018-04-22 19:55:40+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Happy Earth day (April 22nd) to <i>Shtetl Optimized</i> (SO) readers!  </p>\n<p>Today&#8217;s Google-link is to <a href=\"https://www.youtube.com/watch?v=q8v9MvManKE\" rel=\"nofollow\">a two-minute encomium by Jane Goodall</a> on the values that Earth Day celebrates.</p>\n<p>An opposing perspective on EarthDay is presented by the conservative(?) news-aggregator RedState, in an essay by Susan Wright titled &#8220;<a href=\"https://www.redstate.com/rachelfromohio/2018/04/22/earth-day-me-too/\" rel=\"nofollow\">Hashtag &#8216;#MeToo&#8217;: Remembering Girlfriend Murdered By Earth Day Founder</a>&#8220;.</p>\n<blockquote><p>Teality dictates acceptance of the fact that he [activist Ira Einhorn] was an integral leader on the first Earth Day. There is no denying that inconvenient truth.</p></blockquote>\n<p>Wright&#8217;s essay goes on to characterize the <a href=\"https://www.youtube.com/watch?v=Qrq2H0d9crI\" rel=\"nofollow\">1960s pesticide-critic</a> Rachel Carlson as a mass-murderer.</p>\n<p>Is there any path by which these two, vastly differing, Earth Day perspectives can be reconciled?  Speaking personally, it seems to me that the burgeoning growth of citizen-science offers one such path.   </p>\n<p>Here in Seattle, 2018 is shaping up to be a very good year for the local urban raptor population: Bald Eagles, Ospreys, Merlins, Perigrine Falcons, Kestrels, Coopers Hawks, Sharp-Shinned Hawks, Red-Tailed Hawks, etc.  Already in 2018 my wife and I have seen all of these species.</p>\n<p>Seattle wasn&#8217;t always so rich in raptors.</p>\n<blockquote><p><b><a href=\"http://mailman1.u.washington.edu/pipermail/tweeters/2018-April/242962.html\" rel=\"nofollow\">URBAN MERLINS</a></b><br />\nby <a href=\"https://www.falconresearch.org/about-us\" rel=\"nofollow\">Bud Anderson</a></p>\n<p>Lynn Oliphant was the first person to document Merlins moving into a North American city back in 1971 in Saskatoon, Saskatchewan. The next year they found 2 pairs and by 1982, there were 16. Lynn estimates that there are now around 30-40 pairs in that city.  A similar Merlin expansion also took place about that time in Edmonton, Alberta.</p>\n<p>Here in Washington, nesting Merlins had always been very rare despite many experienced raptor people looking for them for decades. There is very little historic information about them for our state. That all started to change in the 1980&#8217;s thanks to people like Tom Gleason, Jim Fackler and others who started finding nesting pairs on the Olympic Peninsula and up the Skagit and Stillaguamish Rivers among other locations.</p>\n<p>The first known city pair that I am aware of was found in a neighborhood in Bellingham in 2000. The number increased to at least four pairs in Bellingham over the next few years. Then Merlins started a slow southward &#8220;colonization&#8221;, showing up over the next few years in Burlington, Mt. Vernon, Anacortes, Stanwood, Everett, Edmonds and finally Seattle. Fortunately, we have had Ben Vang-Johnson and Kim Mc Cormick documenting and studying this expansion in Seattle since 2013.</p>\n<p>This phenomenon of raptors moving into cities is, of course, not just limited to Merlins. We first saw it in Red-tailed Hawks after the I-5 freeway opening back in the mid-60&#8217;s, Bald Eagles showed up in Kirkland and Seward Park shortly afterwards, peregrines arrived in 1994, and who knows when the first Cooper&#8217;s Hawks started to breed in Seattle. Butch Olendorff had a pair on the hillside west of the Duwamish Slough in the late 1960&#8217;s. Ospreys are likely to have been nesting on Lake Washington even further back in time.</p>\n<p>This colonization involving raptors moving into urban habitats is happening all across our continent. It is also underway in Europe with goshawks and sparrowhawks also moving into cities. So Merlins are likely to keep increasing in numbers locally, and Seattle should be no exception. </p>\n<p>How wonderful is that?</p></blockquote>\n<p>For Seattle biophilians, the ongoing resurgence of raptor populations definitely IS pretty darn wonderful&nbsp;&hellip; and the strict regulation of persistent toxins has been vital to that success.  </p>\n<p>For the joy that attends returning raptors, the world&#8217;s citizen-scientists are grateful to you, Rachel Carlson!&nbsp;🙂</p>\n<p>In contrast, it&#8217;s far from clear (to conservationists anyway) what sort of world Susan Wright/<i>RedState</i> is advocated&nbsp;&hellip; seemingly it is a world of few joys and fewer raptors. </p>\n<p>Now if we could only figure out why the Seattle&#8217;s pollinator population is crashing&nbsp;&hellip; with attendant disastrous fruiting-failure of our urban trees.  Plausibly, further and stricter pesticide regulations are indicated?  </p>\n<p>Certainly Seattle&#8217;s conservation-minded citizen-scientists do not dismiss this scientific possibility!<br />\n&#8212;&#8212;<br />\nPS: this month&#8217;s preprint &#8220;Strawberry Fields: A Software Platform for Photonic Quantum Computing&#8221; (arXiv:1804.03159) is commended to <i>Shtetl Optimized</i> readers, as a significant step toward infusing the quest for Quantum Supremacy with the vigor of citizen-science that Jane Goodall advocates.  </p>\n<p>Also to mention, the Xanadu Corporation&nbsp;&mdash; the startup company that is releasing the Strawberry Fields quantum simulation software&nbsp;&mdash; is&nbsp;presently advertising job&nbsp;openings for quantum optitions, photonics engineers, electrical engineers, mathematicians, and machine learning scientists.</p>\n]]>", "author": "John Sidles", "published": "2018-04-22 23:06:29+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>This is definitely a useful phrase to point to a concept somewhere between a moral panic and the chinese robber fallacy, I like it. Thank-you kindly. </p>\n<p>That said:<br />\n>Crime by illegal immigrants<br />\n>Fraudulent voting by non-citizens<br />\n>SJWs silencing free speech on campus<br />\n>Unemployment in heartland America<br />\n>Outrageous treatment of customers by airlines<br />\n>Mass school shootings<br />\n>Sexism in Silicon Valley<br />\n>Racism at Starbucks</p>\n<p>When I was being very careful to &#8220;not be tribal,&#8221; I&#8217;d have made a comment much like Joshua Zelinsky, #3. But today, well, what I want to say is: there are &#8216;object-level&#8217; answers for the degree to which each of these (or indeed *any* SotS) is a problem; the degree to which that problem is overstated; and the degree to which discussion of that problem may be necessary to effect any improvement. When people disagree over which are real and which are SotS/Chinese Robbers/Moral Panics, chances are they disagree on the answers to those real questions. The thing to do is to hear and discuss those answers, even if you think the &#8220;real&#8221; reason is that they were bombarded by saturation-media and are now a culture warrior.</p>\n]]>", "author": "Dirdle", "published": "2018-04-23 08:29:50+00:00", "title": "By: Dirdle"}, {"content": "<![CDATA[<p>Given that there&#8217;s about 150,000 deaths on average *per day* worldwide (to renew the entire population given the average life span), it&#8217;s hard to make any specific issue (deaths by terrorism, mass shooting, aids, car crashes, mud slides, drug overdoses, &#8230;) look that important from a quantitative point of view.</p>\n<p>Obviously Quality matters as much (if not more) than Quantity &#8211; it&#8217;s what defines our values&#8230; but the main issue is that the media never addresses this in any way.<br />\nE.g. they make it even worse by reporting on a given bus crash that kills 10 people, but don&#8217;t mention that the daily car crash death rate is 80, giving people the impression that 10 deaths in a freak accident is just a blip.<br />\nThen they report on a fatality by a self-driving car, but again never mention it in the context of the 32,000 deaths per year in US traffic accidents.</p>\n]]>", "author": "fred", "published": "2018-04-23 14:05:26+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Whether things are getting better or getting worse, I think it is a bit like one of those Escher staircases. I created a musical analogy: <a href=\"http://interdependentscience.blogspot.com/2014/03/rise-and-fall.html\" rel=\"nofollow\">http://interdependentscience.blogspot.com/2014/03/rise-and-fall.html</a></p>\n]]>", "author": "Jim Kukula", "published": "2018-04-24 03:33:34+00:00", "title": "By: Jim Kukula"}, {"content": "<![CDATA[<p>Oh that&#8217;s easy.  If you emotionally react to something before you think about it, that means that you&#8217;re wrong.<br />\nIt boils down to a simple phenomenon of how the brain works.</p>\n<p>The brain has within itself a model of reality which is used to make predictions of reality.  This model of reality is a simplification, so that the brain doesn&#8217;t have to do NP-harder math for every little thing.  The brain simplifies everything down into component parts and makes comparisons and groups with other components.  The brain uses this to approximate NP-harder calculations in a greatly simplified manner.</p>\n<p>There&#8217;s a problem with this, though.  You see, the brain uses this so much that if there&#8217;s a problem with the model, then that means that the brain has made more than just a small mistake.  If there&#8217;s a problem, that means the brain&#8217;s model is flawed in a deep way.  As a result, the brain has a defense mechanism in place in order to deal with small problems.  The defense mechanism is to: get angry at anyone who thinks otherwise, blame other people, and desire revenge against them.</p>\n<p>SotS plays into that behavior by enticing the brain to change it&#8217;s model to accommodate the shark attacks.  People like you buy into it because you think that the model in your brain is a good approximation of reality.  And it is, a lot of the time.  Except it&#8217;s not some of the time.</p>\n<p>Okay now for part 2:<br />\nThe internet has graced us with it&#8217;s ability to transmit information to us 24/7.  Problem is, the brain can handle only so much information going through it all at once.  So what happens when too much information finds it&#8217;s way into our brains?  We simplify the information.  Our brain does all of the work for us.  The brain uses the model of reality in our heads as a reference, and deliberately rejects information that contradicts our model of reality, because that information requires time and effort to process, and ain&#8217;t nobody got time for that.</p>\n<p>As a result, everyone is now wrong about everything.  There&#8217;s way too much information to process, and our brain&#8217;s reliance on our internal model of reality directly causes our interpretation of everything to be wrong.  Sometimes it&#8217;s only slightly wrong, and other times completely wrong.</p>\n<p>Okay now for part 3:<br />\nThe reason Trump won is because the left and the right are both completely submerged in their model of reality.  Trump supporters were annoyed at that.  The reason Trump haters hate Trump supporters is because of the defense mechanism that comes up when one&#8217;s model of reality is challenged by reality.  Trump haters&#8217; model of reality is wrong.  The reason Trump supporters get mad at Trump every time he does something they didn&#8217;t think he would do is because of the defense mechanism that comes up when [you get the idea].   Trump supporters&#8217; model of reality is wrong.</p>\n<p>Okay now for part 4:<br />\nThink of information as a fluid, with a viscosity.  Think of the brain as a series of tubes.  Because of the internet, the rate of information flow through our brains is increasing, and the rate of increase is accelerating.</p>\n<p>There&#8217;s a model of fluid dynamics that explains this.  Prior to 1995 (windows 95 and Internet Explorer), the information flow through our brains was in laminar flow.  Afterward, it entered the transitional stage.  We are currently in the transition stage.  I predict that in 2022, we will reach turbulent flow.  At that point, this trick of the brain which is increasingly becoming a problem will enter center stage whether you&#8217;re ready for it to or not.  I suggest you get ready.</p>\n<p>I&#8217;m honestly kind of tired of waiting at this point.  It&#8217;s annoying seeing everyone react so much to their own imagination as if it were reality.  It&#8217;s boring, too.  The model of reality in your head isn&#8217;t nearly complex enough to be interesting.</p>\n]]>", "author": "Elliott Kelley", "published": "2018-04-25 15:14:29+00:00", "title": "By: Elliott Kelley"}, {"content": "<![CDATA[<p>Meanwhile, there&#8217;s reports of someone demonstrating entanglement of two macroscopic-sized vibrating metal discs (paywall):</p>\n<p><a href=\"https://www.nature.com/articles/s41586-018-0038-x\" rel=\"nofollow\">https://www.nature.com/articles/s41586-018-0038-x</a></p>\n<p>Scott, any comment?  I hear they have it solving NP-hard problems by testing all the possible solutions in parallel ;-).</p>\n]]>", "author": "asdf", "published": "2018-04-27 02:58:00+00:00", "title": "By: asdf"}]