[{"content": "<![CDATA[<p>I get 404s on these resources, which prevents the second diagram or the table from rendering:<br />\n<a href=\"http://bit-player.org/2015/extras/webgraph/d3/d3.min.js\" rel=\"nofollow\">http://bit-player.org/2015/extras/webgraph/d3/d3.min.js</a><br />\n<a href=\"http://bit-player.org/2015/extras/webgraph/packages.js\" rel=\"nofollow\">http://bit-player.org/2015/extras/webgraph/packages.js</a><br />\n<a href=\"http://bit-player.org/2015/extras/webgraph/whales.js\" rel=\"nofollow\">http://bit-player.org/2015/extras/webgraph/whales.js</a><br />\n<a href=\"http://bit-player.org/2015/extras/webgraph/sorttable.js\" rel=\"nofollow\">http://bit-player.org/2015/extras/webgraph/sorttable.js</a></p>\n<p>Interesting post, though &#8211; thanks!</p>\n]]>", "author": "xtian", "published": "2015-04-27 16:37:13+00:00", "title": "By: xtian"}, {"content": "<![CDATA[<p>Thanks for letting me know. WordPress was mucking about with relative URLs. Fixed now, I think.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2015-04-27 17:57:28+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>I&#8217;ve been thinking about your &#8220;too big to fail&#8221;, and I have a theory.  I suspect that sites with many incoming links are much more valuable, and are less likely to simply shut down.  However, sites with many outgoing links and few incoming links aren&#8217;t necessarily &#8220;big&#8221; in any meaningful sense &#8212; now that I&#8217;ve read about the Common Crawl data, I could create such a site myself in a few hours.</p>\n<p>So if you look at the 10% of the sites that don&#8217;t respond any more, what does their &#8220;% Inbound&#8221; look like?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/w/Witty:Carl.html\">Carl Witty</a>", "published": "2015-04-28 18:17:22+00:00", "title": "By: Carl Witty"}, {"content": "<![CDATA[<p>Pleases take a look on scale-free networks and its vulnerability.<br />\nThe topic has been extensively studied by physicists.<br />\nThe power-law that you observe in the connectivity (links) per node (sites) shows that the web is scale-free which has some specific proprieties.</p>\n]]>", "author": "eduardo colombo", "published": "2015-04-28 20:37:56+00:00", "title": "By: eduardo colombo"}, {"content": "<![CDATA[<p>Spot on! All but one of the defunct sites had very few inbound links; they were mainly web directories. The exception is posterous.com, a blog-hosting service that shut down in 2013. They had 53,000 inbound links.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2015-04-28 21:18:39+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>A high number of websites with hardly any inbound/outbound links does not surprise me, because many domains are only registered in order to sell them. Those “for sale” domains have hardly content and hence no or only a few links. Other domains are only registered to defend a trademark and do nothing or forward to the main domain of the company. Then there are single-serving sites which typically don’t have many links either.</p>\n<p>The high number of such sites could be surprising, because we don’t encounter them very often. But that seems plausible actually. When browsing the web, you’d expect that we click more often on links to sites that have many inbound links, because, well, there are more links to them. And search engines use the number of inbound links as an important ranking factor, so we are much more likely to be sent to highly connected sites by search engines, too.</p>\n<p>(Note: I’ve not verified these thaughts by looking at collected data. Other factors that I’ve not considered could be more important.)</p>\n]]>", "author": "Martin", "published": "2015-04-28 23:44:03+00:00", "title": "By: Martin"}, {"content": "<![CDATA[<p>The mystery, if there is one, is not so much why those isolated sites exist as how they got into the Common Crawl data set. A crawl starts with an initial set of <em>seed</em> URLs, then follows links found at those sites to explore the rest of the Web. Thus if a site has no inbound links, it can appear in the crawl results only if it is one of the seed URLs. Which leads to the further question: Why would 6.7 million of the seed URLs be sites that no one ever bothers to link to?</p>\n<p>My best guess is that the answer lies in some form of web spam or search-rank manipulation. There&#8217;s an underworld of web sites that aren&#8217;t really meant for human consumption. There are <a href=\"http://en.wikipedia.org/wiki/Link_farm\" rel=\"nofollow\">link farms</a> and <a href=\"http://en.wikipedia.org/wiki/Content_farm\" rel=\"nofollow\">content farms</a>, and doubtless other schemes I could never dream up. Maybe the nature of the linkless sites will become clearer if I get around to actually looking at some of them.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2015-04-29 13:06:37+00:00", "title": "By: Brian Hayes"}]