[{"content": "Perhaps the &#39;High Cost of Disorganization&#39;", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/f/Filannino:Michele.html\">Michele Filannino</a>", "published": "2015-07-04 11:06:48.655000-04:00", "title": ""}, {"content": "Are flights really that expensive if you buy them in the US? The first nonstop flights I found from Boston to London and back were about €1450/$1600, and flights with reasonable connections would have been even cheaper. Of course this may be because of my travel preferences. I try to have a rest day between a long flight and the conference, and I never fly back on the day the conference ends.<br /><br />Rigid schedule is definitely one thing that drives flight prices up. When I was on a personal grant and had to pay for conference trips myself, I attended more conferences than these days. Instead of just going to a conference on whim, spending extra days at the destination, and even combining the conference trip with a vacation, I now have to justify everything to my employer. As a result, the number of attended conferences has gone down, while the price of attending a conference has gone up.", "author": "Jouni Sirn", "published": "2015-07-04 12:48:26.629000-04:00", "title": ""}, {"content": "I was surprised that even your travel is subject to the US-carrier-only restriction. I thought that was largely restricted to publicly-funded universities, and not private universities. Assuming you can charge your travel to a non-federal grant, would you still be subject to the US-flag-carrier restriction? And how easy is it to apply and get internally-funded grants at Harvard? Just curious.", "author": "Curious", "published": "2015-07-04 17:42:11.097000-04:00", "title": ""}, {"content": "Michele : maybe.  Not sure why they don&#39;t have a schedule yet, though <br />I don&#39;t like to judge the complexities of logistics, having suffered<br />through conference organization myself.  But yes, the lack<br />of schedule may mean I don&#39;t attend, which is a high cost (from my point of view).<br /><br />Jouni :  was that looking today?   I&#39;ll look again.  <br /><br />Curious :  I thin you have a misunderstanding of how &quot;private universities&quot;<br />work.  I don&#39;t have any magical supply of Harvard money.  (Well, I have some<br />Harvard money, leftover from my &quot;startup package&quot;.)  Most of my money<br />is NSF money, which has the US-flag-carrier restriction.  Sure I could use<br />my limited non-NSF money, but at much greater than a thousand dollars a ticket,<br />that&#39;s a tough choice of a use for my non-federal grants.<br /><br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2015-07-04 17:53:52.190000-04:00", "title": ""}, {"content": "One correction about NSF and flying to Europe: Since 2012, Because of the Open Skies agreement, you CAN use European carriers to fly from the US  directly to any EU country and use an NSF grant to pay for it, provided you can&#39;t USE the US GSA city-pair rates.  (There was an earlier interpretation by the US that one can use the European carrier only if the city-pair fare existed, even if you couldn&#39;t make use of it.   The EU appealed to the WTO and the current rule is the result of that appeal.)   Lots of universities haven&#39;t figured this out yet.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Beame:Paul.html\">Paul Beame</a>", "published": "2015-07-06 02:48:57.217000-04:00", "title": ""}]