[{"content": "<![CDATA[<p>Scott, hope you have a great time in Brazil!</p>\n]]>", "author": "Jordan", "published": "2013-12-16 23:05:36+00:00", "title": "By: Jordan"}, {"content": "<![CDATA[<p>The disagreement over who is a physicist or a mathematician reflects to some extent that the boundary  between them can be extremely difficult to distinguish. Mathematician and physicist may not be natural categories. The Gauss example is particularly interesting because his early work was almost completely what would normally be called math. But the last 20 years of his life his work was almost completely in the physics category <a href=\"http://en.wikipedia.org/wiki/Gauss#Later_years_and_death_.281831.E2.80.931855.29\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Gauss#Later_years_and_death_.281831.E2.80.931855.29</a></p>\n<p>To some extent arguing over whether Gauss was a physicist or a mathematician has some similarity over arguing over what Einstein&#8217;s religious views were. Einstein&#8217;s views changed over time which is part of why there are so many dueling quotes. In a similar fashion, what Gauss was depends on when in his life one is looking. However, it does seem fair to say that he was overall more in the mathematician camp than the physicist camp. At minimum, while Gauss was a first rate physicist, he was a zeroth rate mathematician.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/z/Zelinsky:Joshua.html\">Joshua Zelinsky</a>", "published": "2013-12-17 00:44:23+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Jordan #51:</p>\n<ul>Scott, hope you have a great time in Brazil!</ul>\n<p>Thanks!!  Just went up Sugarloaf today, and have been stuffing my face with the mashed acai sweetened with guarana that they sell at juice stands (as soon as I tasted it, I felt like I&#8217;d have to make up in one week for a whole lifetime of not eating it).</p>\n]]>", "author": "Scott", "published": "2013-12-17 00:51:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Joshua #52:</p>\n<ul>At minimum, while Gauss was a first rate physicist, he was a zeroth rate mathematician.</ul>\n<p>Thank you for that zeroth-rate distillation of what I&#8217;d been trying to say far less felicitously, which caused me a surprising amount of amusement at the end of a long and exhausting day.</p>\n]]>", "author": "Scott", "published": "2013-12-17 00:55:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Instructing Lubos in etiquette is futile.</p>\n]]>", "author": "edmeasure", "published": "2013-12-17 03:45:29+00:00", "title": "By: edmeasure"}, {"content": "<![CDATA[<p>Interesting interview! A couple of brief remarks:</p>\n<p>(1) I think it&#8217;s fair to say that contemporary philosophy is largely ahistorical. That is, most articles in most of the top journals mostly contain citations of articles written in the past couple of decades, and most departments have an ahistorical focus (Cornell is an exception).</p>\n<p>(2) My own main interest is in the philosophy of science (I&#8217;m a graduate student in philosophy). However, I still think the history of philosophy is very important and valuable. True, the history of philosophy is not that important for the purposes of understanding the empirical world; but I hardly think understanding the empirical world is the only business of philosophy. One of the valuable things that comes from studying the history of philosophy (and I could mention others) is that it forces you to come to grips with very alien ways of viewing the world. This makes you aware of just how contingent your own way of seeing the world is. For example, today we take the conceptual distinction between the mind and the body for granted (I&#8217;m not saying that everybody thinks there is a mind distinct from the body &#8212; I&#8217;m just saying that the conceptual distinction is taken for granted). However, if you read Aristotle, you won&#8217;t find any such distinction. Aristotle does talk of &#8220;body&#8221; and &#8220;soul,&#8221; but these terms mean something completely different to him than they do to us.</p>\n]]>", "author": "Olav", "published": "2013-12-17 03:55:28+00:00", "title": "By: Olav"}, {"content": "<![CDATA[<p>Olav #56:</p>\n<p>I think you make an important point in (2). I especially like your example about the historical recentness of the mind-body duality.</p>\n<p>I hadn&#8217;t even realized how ingrained this worldview is in me and what consequences that has until I read these fantastic essays by Kevin Simler reviewing Julian Jaynes&#8217; book on the Origin of Consciousness:</p>\n<p><a href=\"http://www.meltingasphalt.com/mr-jaynes-wild-ride/\" rel=\"nofollow\">http://www.meltingasphalt.com/mr-jaynes-wild-ride/</a><br />\n<a href=\"http://www.meltingasphalt.com/accepting-deviant-minds/\" rel=\"nofollow\">http://www.meltingasphalt.com/accepting-deviant-minds/</a></p>\n]]>", "author": "Sid", "published": "2013-12-17 06:10:56+00:00", "title": "By: Sid"}, {"content": "<![CDATA[<blockquote><p><b>Lubos Motl</b> asserts (uncompromisingly) &#8220;Mathematics is solely the enterprise of deciding whether some propositions logically follow (can be proven or disproven) from some assumptions i.e. axioms.&#8221;</p></blockquote>\n<p>Certainly this assertion has plenty of historical precedent.  And yet, if we call to mind the philosophical progression:</p>\n<p>(1)&nbsp; <b>early Wittgenstein</b><br />\n(of the <i>Tractatus</i>), then</p>\n<p>(2)&nbsp; <b>late Wittgenstein</b><br />\n(of the <i>Investigations</i>), then </p>\n<p>(3)&nbsp; <b>post-Wittgenstein</b><br />\n(the PostModernism of <b><a href=\"http://mindfulpleasures.blogspot.com/2011/01/noam-chomsky-on-derrida-foucault-lacan.html\" rel=\"nofollow\">Derrida, Foucalt and Lacan</a></b>)</p>\n<p>we appreciate that these philosophical themes are recapitulated in the mathematical literature</p>\n<p>(1)&nbsp; <b>traditional mathematical formalism</b><br />\n(per Jaffe and Quinn <i>Theoretical Mathematics</i>, <b><a href=\"http://arxiv.org/abs/math.HO/9307227\" rel=\"nofollow\">arXiv:math/9307227 [math.HO]</a></b>), then</p>\n<p>(2)&nbsp; <b>early Thurston informalism</b><br />\n(of <i>On Proof and Progress</i>, <b><a href=\"http://arxiv.org/abs/math/9404236\" rel=\"nofollow\">arXiv:math/9404236 [math.HO]</a></b>), then </p>\n<p>(3)&nbsp; <b>late Thurston informalism</b><br />\n(of <b><a href=\"http://mathoverflow.net/questions/43690/whats-a-mathematician-to-do/44213#44213\" rel=\"nofollow\"><i>What&#8217;s a mathematician to do?</i></a></b> and <b><a href=\"http://mathoverflow.net/questions/43690/whats-a-mathematician-to-do/44213#44213\" rel=\"nofollow\"><i>Thinking and explaining</i></a></b>)</p>\n<p><b>Conclusion</b>&nbsp; It is well to keep in mind that (as it seems to me) philosophy and mathematics alike would be grievously impoverished if everyone agreed in these matters (no matter what that agreement was), and that is why <i>all</i> of the above works are recommended&nbsp;&mdash; to young researchers especially&nbsp;&mdash; <i>despite</i> their obvious mutual incompatibility.</p>\n<p><b>Recommended Reading</b>&nbsp; Bill Thurston in his last decade of life wrote introductions to many fine mathematical textbooks, and those introductions and textbooks are (as they seem to me) uniformly  worth reading and reflecting upon.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/SIdles:John.html\">John SIdles</a>", "published": "2013-12-17 16:19:54+00:00", "title": "By: John SIdles"}, {"content": "<![CDATA[<blockquote><p>JAS provided links to Bill Thurston&#8217;s (highest-rated)  <i>MathOverflow</i> answer <b><a href=\"http://mathoverflow.net/questions/43690/whats-a-mathematician-to-do/44213#44213\" rel=\"nofollow\"><i>What&#8217;s a mathematician to do?</i></a></b>, and his (also highest-rated)  <i>MathOverflow</i> question <b><a href=\"http://mathoverflow.net/q/38639\" rel=\"nofollow\"><i>Thinking and explaining</i></a>.</b></p></blockquote>\n<p>A typo in the latter link now has been corrected.  </p>\n<p>Thurston&#8217;s foreword to Princeton University Press&#8217; <i>The Best Writing on Mathematics 2010</i>&nbsp;&mdash; a collection that includes considerable philosophical material&nbsp;&mdash;  is  recommended too (Amazon&#8217;s <b><a href=\"http://www.amazon.com/The-Best-Writing-Mathematics-2010/dp/0691148414#reader_0691148414\" rel=\"nofollow\">&#8220;Look Inside&#8221;/Table of Contents</a></b> feature shows it).</p>\n<p><b>Conclusion</b>&nbsp; There&#8217;s plenty of nourishing mathematical meat on these philosophical bones.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/SIdles:John.html\">John SIdles</a>", "published": "2013-12-17 17:49:53+00:00", "title": "By: John SIdles"}, {"content": "<![CDATA[<p>Might there be some dichotomy between math and physics, or science and philosophy? Say top down (math, philosophy?), versus bottom up(physics, science?).<br />\n We need to edit the signals from the noise, yet all noise is signal at some frequency and amplitude. Physics and science seem to be about sorting through all the input, while math is the emergent algorithms and philosophy is the general conclusions.<br />\n?<br />\n One thought I keep trying to push is that if we think of time, not as a passage or measure from prior to succeeding events, but the process by which these events come into being and dissolve, ie. not of the present moving from past to future, but the changing configuration of what is, turning future into past. For example, not the earth moving along some flow or dimension from yesterday to tomorrow, but tomorrow becoming yesterday because the earth rotates.<br />\n This would make the concept of time much more dynamic and not just a static, scalar measure, which would tie it to thermodynamics, in which time is the linear structure within the non-linear dynamic. The timeline of the emergent entity within the dynamic context.<br />\n We exist as particular points of perspective within this sea of activity and so experience it as a series of encounters and our brains function by sequences of thoughts, yet metabolically, non-linear thermodynamics is more elemental.<br />\n One could say that time is to temperature what frequency is to amplitude.<br />\n So the reason clocks run at different rates is simply because all actions are their own clocks. If time were a vector from past to future, than the faster clock would logically get to the future more rapidly, but the opposite is true, they age/burn/process quicker and so recede into the past faster.<br />\n So rather than thinking in a normal, linear cause and effect manner and trying to figure how to go from a determined past, into a probabilistic future and ending up in multiworlds, or a consciousness generated reality(we do pick the signal, but not create the noise), it is a process of letting nature decide, with probabilities preceding actualities. There are ten potential winners before a race, but only one actual winner after it.<br />\n We still see the sun moving east to west, even though we now know it&#8217;s the earth spinning west to east.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Merryman:John.html\">John Merryman</a>", "published": "2013-12-18 02:44:29+00:00", "title": "By: John Merryman"}]