[{"content": "Harvard is a business.  They have to protect the idea that going to Harvard and sitting in classes is extremely valuable.", "author": "Anonymous", "published": "2014-09-15 05:00:17.013000-04:00", "title": ""}, {"content": "It seems that having just one section of a class with 800 people makes it much more likely students will have time conflicts.  Why not have 4 sections of 200 people each that are at different times?", "author": "Anonymous", "published": "2014-09-15 10:43:32.612000-04:00", "title": ""}, {"content": "A very young Val Kilmer was in a movie some years ago set at an elite technical university.  The first-year student dutifully comes to class, but notices one day that a classmate has skipped class, leaving a tape recorder instead.<br /><br />Later, more and more students are replaced by tape recorders.<br /><br />Finally, the student shows up one day to find that the professor, too, has been replaced, and except for our hero we have nothing but one tape recorder playing a lecture to a room of other tape recorders.<br /><br />A thought experiment: What happens in our classes that keeps us from being replaced by (tape) recordings of ourselves, or students with &quot;listening&quot; recorders?<br /><br />In my classes, quite a lot, I think.  But maybe that&#39;s exceptional???", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Calvert:Wesley.html\">Wesley Calvert</a>", "published": "2014-09-16 11:19:47.293000-04:00", "title": ""}, {"content": "Anon #1:  There&#39;s nothing to suggest it was the &quot;business&quot; side of Harvard that made this decision, for what that&#39;s worth. <br /><br />Anon #2:  There are tons of &quot;sections&quot; (and office hours, oh so many office hours) for students for CS50.  The &quot;800&quot; is that there is a single lecture.  It&#39;s not clear why you think having 4 lectures of 200 is better than a recording of the lecture.  Yes, it&#39;s better for students to be at lecture, but the work/interaction with others is outside the lecture.<br /><br />WC:  This is obviously a larger discussion.  I think professors offer a lot;  I think the experience of being in lecture is, generally, much better than from a recording.  However, despite that, there may be cases where a recording is the best outcome.  (e.g., better than taking another class.)", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-09-16 14:21:04.992000-04:00", "title": ""}]