[{"content": "<i>   I think an ongoing question about ITCS is how well it lives up to its &quot;mission statement&quot;.  </i><br /><br />Rather poorly. I&#39;ve submitted two conceptual papers to ITCS both of which were refereed using the standard &quot;how many theorems?&quot; &quot;how difficult are the proofs?&quot; measures rather with &quot;are the conceptual contributions valuable?&quot; yardstick.<br /><br />In the second submission one of the reviews pointed this out in frustration with the other PC members. I paraphrase but the comment was &quot;if this is not what ITCS is about then what is it for?&quot;. Since the paper got rejected it speaks volumes about the failure of ITCS to embrace conceptual contributions. <br /><br />People are so used to refereeing in the traditional way, that unless they are presented with a completely different review form and reminded consistently to use conceptual parameters, the refereeing will devolve into a SODA/STOC/FOCS clone. <br /><br />Mind you, there is nothing wrong with adding a fourth conference to the above, given that STOC/FOCS are bursting at the seems. All we need to do is remove the mission statement since we are not abiding by it.", "author": "Anonymous", "published": "2014-05-29 05:51:28.852000-04:00", "title": ""}, {"content": "What you (Anonymous 5/29, 5:51AM) describe is not that surprising if you look at the program committees of ITCS in the last few years. There are very few people on the PCs that have actually ever done &quot;conceptual&quot; work. <br /><br />The obvious solution would be for ITCS to start choosing more appropriate PCs. The problem, of course, is that the TCS community as a whole undervalues conceptual work. It recruits and attracts people who are more &quot;technically-inclined&quot; so it makes the recruiting pool very small. Most people in TCS don&#39;t even really get what the whole &quot;conceptual&quot; argument is about and have no idea what a conceptual paper is.  ", "author": "Anonymous", "published": "2014-05-29 13:04:51.093000-04:00", "title": ""}, {"content": "I like both comments above.<br /><br />I&#39;ve never submitted a paper to ITCS but my feeling of the program in the past was that there was very little innovation, it was more like a 2nd tier SODA/STOC/FOCS, with a few pearls.<br /><br />But in fact, would we expect there are 48 papers (so many papers were accepted last year) every year that one could fit well to this mission statement? Perhaps we have too high ambitions? Or maybe I don&#39;t understand what is the mission of this conference, especially after looking at papers accepted there in the past and after reading the CFP.", "author": "Anonymous", "published": "2014-05-29 19:38:32.092000-04:00", "title": ""}, {"content": "Thanks all Anons for comments.  (Though I&#39;d love to see names!)<br /><br />If the chair allows, perhaps I&#39;ll blog about what I find being on the PC this year.  I do think the questions of both how many &quot;conceptual&quot; papers are there and does the reviewing process work for such papers in this context are interesting questions.<br /><br />Anon 1 says:  &quot;Mind you, there is nothing wrong with adding a fourth conference to the above, given that STOC/FOCS are bursting at the seems. All we need to do is remove the mission statement since we are not abiding by it.&quot;<br /><br />I understand and agree with this in spirit, although my feeling (as I&#39;ve stated on this blog in the past) is that if it is the case that ITCS is just another SODA/STOC/FOCS conference at this point, aren&#39;t we better off making (at least) one of STOC or FOCS larger?  <br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-06-01 10:09:06.176000-04:00", "title": ""}, {"content": "<i>I understand and agree with this in spirit, although my feeling (as I&#39;ve stated on this blog in the past) is that if it is the case that ITCS is just another SODA/STOC/FOCS conference at this point, aren&#39;t we better off making (at least) one of STOC or FOCS larger? </i><br /><br />Yes, we are. But currently the people who call the shots on this are obsessed with competition, prestige and authority, and they will never let this happen.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/A=:Dan.html\">Dan A.</a>", "published": "2014-06-01 23:48:19.978000-04:00", "title": ""}]