[{"content": "<![CDATA[<p>[&#8230;] recomiendo leer a Scott Aaronson, &ldquo;Bell inequality violation finally done right,&rdquo; Shtetl-Optimized, 15 Sep 2015. Su descripci&oacute;n divulgativa de las desigualdades merece la pena, as&iacute; como su [&#8230;]</p>\n]]>", "author": "Un experimento tipo Bell libre de loopholes | Ciencia | La Ciencia de la Mula Francis", "published": "2015-09-18 11:45:07+00:00", "title": "By: Un experimento tipo Bell libre de loopholes | Ciencia | La Ciencia de la Mula Francis"}, {"content": "<![CDATA[<p>Lou #72</p>\n<p>If time travel does exist, then the future could be &#8220;interfering&#8221; destructively with the past:<br />\nWhen the effects can influence their own causes, then only &#8220;stable/self-consistent&#8221; time loops can exist, i.e. loops were all the influences/side-effects of the time travel are already accounted for in the entire history. This also would require the universe to be truly deterministic (no free will, no intrinsic randomness).</p>\n]]>", "author": "fred", "published": "2015-09-18 12:54:52+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #77<br />\nTo clarify, I doubt that time travel is possible.<br />\nE.g. if some mass M for the future (time t) can be sent to the past (time t-T), the universe as of t would see an excess of mass/energy of M, and the universe as of time t-T would see a deficit of M.<br />\nHow would we account for this?</p>\n<p>But I&#8217;m more curious to understand the relation between &#8220;Time Reversal&#8221; (i.e. known laws of physics being symmetrical with t, when t -> -t) and QM. It would be nice if some aspects of QM (like interference) could be explained by the necessity to respect some symmetries.</p>\n]]>", "author": "fred", "published": "2015-09-18 13:45:49+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>So do you have a probability estimate of when this experiment will be done? Let me put it this way: if someone offered to make you a $200 bet on whether this experiment or any other experiment will be generally accepted as showing FTL signaling in the next ten years, would you take it?</p>\n]]>", "author": "Joshua Zelinsky", "published": "2015-09-18 15:07:16+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Clarification: My last comment was directed at Flavio.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2015-09-19 00:03:10+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Now I&#8217;m more confused; what strategy do Alice and Bob adopt knowing that they have entangled particles but without sharing any information acquired after x and y are determined?</p>\n<p>Has the possibility that the photons will not interact and be measurable unless they are coincidentally entangled been rejected?</p>\n]]>", "author": "Decius", "published": "2015-09-19 00:49:21+00:00", "title": "By: Decius"}, {"content": "<![CDATA[<p>&#8220;intrinsic randomness&#8221;</p>\n<p>If this experiment helps establish that there is such a thing as this, where effects happen without a cause, then doesn&#8217;t this ultimately undermine determinism?</p>\n]]>", "author": "Darrell Burgan", "published": "2015-09-19 01:04:43+00:00", "title": "By: Darrell Burgan"}, {"content": "<![CDATA[<p>Thanks. I&#8217;ve never seen an explanation of the Bell inequality I understood before. Not that I fully understand how entanglement gives 85%, but&#8230; <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "JollyJoker", "published": "2015-09-19 22:19:40+00:00", "title": "By: JollyJoker"}, {"content": "<![CDATA[<p>William Hird #70</p>\n<p>Ok, that’s a viewpoint.</p>\n<p>But you get so far away from simplicity requirements with that kind of stuff. Yes the world could be due to that and the randomness might be illusory to us poor stupid humans.</p>\n<p>But let’s assume us humans are not being fooled by a bad demon, and we simply evolved, randomly, due to evolution, to have a very good understanding of the world.</p>\n<p>If we are in a huge cellular automata then why is there a speed limit? Who set the speed limit for the automata?</p>\n<p>You see, how silly this gets?</p>\n<p>If we have random processes, then we can talk about an average for those processes, so some occur at rates smaller than any time imaginable, some occur on really long googols of years time, BUT MOST occur on, say a planck timescale, 10^-43 seconds.</p>\n<p>I have posted such a model, previously, I don’t want to spam Scott’s blog with reposts of that, but I do think a model built on fundamental randomness is easier and more natural.</p>\n<p>edit: correct spelling of be to by</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2015-09-20 01:19:15+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>Travis #77: OK, thanks very much for clarifying.</p>\n<p>So it sounds like we should reserve the term &#8220;local realism&#8221; for the &#8220;a(x,w), b(y,w)&#8221; condition.  And it&#8217;s perfectly <i>correct</i> that local realism implies the Bell inequality, and that still strikes me as a fine way to explain the Bell inequality to beginners, since &#8220;a(x,w), b(y,w)&#8221; is an extremely natural first guess as to how the universe should work.</p>\n<p>However, one could then add that <i>actually</i>, there&#8217;s a weaker condition called &#8220;local causality&#8221; that already implies the Bell inequality, and that this was well-understood by Bell himself.</p>\n<p>As it happens, in 2002 I wrote a <a href=\"http://www.scottaaronson.com/papers/nks.pdf\" rel=\"nofollow\">review of Stephen Wolfram&#8217;s <i>A New Kind of Science</i></a>, in which one of the main points I made was that there was a weaker condition than local realism that&#8217;s already enough to imply the Bell inequality&#8212;and that that observation killed Wolfram&#8217;s proposals for a classical CA underlying physics.  (In particular, it doesn&#8217;t matter if you have &#8220;long-range threads&#8221; in the CA, if you want the classical signals sent across those threads not to violate special relativity by picking out a preferred reference frame.)  I didn&#8217;t know where, if anywhere, this point had been made in the literature before, but at any rate, didn&#8217;t regard it as particularly novel.  Later, in 2006, Conway and Kochen made an extremely-related point in their famous paper on the &#8220;Free Will Theorem.&#8221;</p>\n<p>So let me ask you point blank: did Conway, Kochen, and I simply rediscover what Bell himself already said explicitly?  I.e., is there any difference between what we assume and his &#8220;locality&#8221; / &#8220;local causality&#8221;?</p>\n]]>", "author": "Scott", "published": "2015-09-20 02:45:16+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>@Evan</p>\n<p>The quantum eraser experiment can be done with ordinary non-entangled photons, the one in Wikipedia uses entagled photons but it isn&#8217;t necessary&#8230; Why would a coincidence counter be needed?</p>\n<p>Or are you saying that entangled photons are distinguishable from ordinary photons?</p>\n<p>Let&#8217;s play an alternative game: Alice provides Bob as many photons as he wants, she will send either all photons with entangled partners (Alice won&#8217;t do anything to her partners) or all ordinary photons. Is Bob able to distinguish if he is receiving entangled photons? How?</p>\n<p>If he simply did the quantum eraser and no interference patterns appeared simply because they are entangled, then he can distinguish ordinary photons from entangled ones&#8230;</p>\n<p>@Joshua Zelinsky I hate bets, but I would do it just to put money where my mouth is.</p>\n<p>People talking about time traveling, I don&#8217;t believe in it. Jus</p>\n]]>", "author": "Flavio", "published": "2015-09-20 03:39:30+00:00", "title": "By: Flavio"}, {"content": "<![CDATA[<p>@James Gallagher #86</p>\n<p>Sorry for the late response James, I will try and answer some of your points, I am not a professional scientist, I&#8217;m just giving my opinion based on a casual study of physics and philosophy.<br />\nSo who or what sets the speed limit for the cellular automata? Who sets the speed limit for our heartbeats, why does it beat 60-70 times a minute instead of say 300 times a minute or 15 times a minute? Silly, right?<br />\nI can&#8217;t prove that there is an ether but to me it is a pretty good theory to explain how E/M radiation propagates, the curvature of spacetime ( I wish I could have asked Albert if there is no ether, then WHAT is being curved or bent by large objects in space, how can nothingness (no ether medium) have the physical property of curvature?). So I&#8217;m guessing that this ether is propagating all kinds of waveforms in space and that this big jumble of noise is responsible for the complex standing wave pattern that gives rise to the randomness associated with a quantum measurement. So I guess it would be considered a hidden variable theory but would be considered a local and non local variable theory because the ether is everywhere, am I making sense ? <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "William Hird", "published": "2015-09-20 05:54:51+00:00", "title": "By: William Hird"}, {"content": "<![CDATA[<p>Hi Scott<br />\nThanks for the interesting explanation. Naive question, does<br />\nthe recent EPR=ER discussions have anything to do with this, could it be argued that the Bell violation comes from changes in the topology of space time caused by the creation of entangled particles, i.e., changes in the notion of locality, so that parts of the lab are not really a mile apart any more since they are connected via wormholes?<br />\nObviously I dont have a clue what I am talking about, but perhaps you could deconfuse me a bit.</p>\n]]>", "author": "eitan bachmat", "published": "2015-09-20 10:47:56+00:00", "title": "By: eitan bachmat"}, {"content": "<![CDATA[<p>&#8220;So it sounds like we should reserve the term “local realism” for the &#8216;a(x,w), b(y,w)&#8217; condition. And it’s perfectly correct that local realism implies the Bell inequality, and that still strikes me as a fine way to explain the Bell inequality to beginners, since &#8216;a(x,w), b(y,w)&#8217; is an extremely natural first guess as to how the universe should work.&#8221;</p>\n<p>Especially if one has noticed the perfect EPR correlations.  That is, what you say is &#8220;natural&#8221; here is I think exactly what Einstein et al were saying:  this kind of determinism is *required* by the perfect EPR type correlations, if you want to avoid nonlocality.  And this is worth stressing, because Bell took himself to be adding something to the EPR argument, i.e., as building on their earlier identification that locality requires determinism.  If you think of Bell&#8217;s argument in this &#8220;two-part&#8221; way, it is much easier to appreciate that the ultimate upshot is that locality is untenable, without getting into a lot of complicated discussions about exactly how he formulated &#8220;locality&#8221;, etc.</p>\n<p>In any case, it&#8217;s not clear to me why one would want to use/preserve the terminology of &#8220;local realism&#8221; at all.  Surely beginners can be helped to understand the EPR argument from locality to (local) deterministic hidden variables, and can then be helped to understand Bell&#8217;s proof that local deterministic hidden variable theories can&#8217;t make the right predictions for a wider class of correlations, so that locality is untenable.  If you just acknowledge and remember the first, EPR, part of Bell&#8217;s two-part argument, everything is simple and clear, including the fact that &#8220;local realism&#8221; is at best some &#8220;middle term&#8221; in the argument that isn&#8217;t actually of any particular importance.  What&#8217;s important is that locality is incompatible with the (now very well confirmed) QM predictions.  </p>\n<p>Let me say this again from another perspective.  You said that local determinism is a natural first guess about how the universe works and suggested that it&#8217;s worth knowing and sharing the proof that this can&#8217;t be right.  That&#8217;s all fine and good, but it would be a shame if you then bury what is to me an equally important thing:  if your second guess about how the universe works is that it is local but indeterministic (or, ridiculously, &#8220;unreal&#8221;) that too doesn&#8217;t work!  Basically what upsets me about the whole &#8220;local realism&#8221; terminology is that everybody who uses it seems to think that if only we jettison &#8220;realism&#8221; (which really always comes down to meaning deterministic hidden variables) then we can preserve locality.  That is everybody&#8217;s standard view of ordinary QM:  it&#8217;s local, and it&#8217;s only if you foolishly try to muck it up by restoring determinism that you run into problems with nonlocality.  But this is simply wrong.  Ordinary QM is already nonlocal, and you don&#8217;t even need anything remotely as fancy as Bell&#8217;s theorem to see this.  Just look at the theory (especially the collapse postulate!).  (Of course it&#8217;s nice to have a formal definition of &#8220;locality&#8221; that we can use to unambiguously diagnose ordinary QM as nonlocal.  But once you know where to look the nonlocality is so blatant and obvious that you don&#8217;t really need any of this fancy stuff to see it.)  </p>\n<p>As to Wolfram, I never got around to reading his book, so it was a little hard to follow all the details of your argument in the book review.  But in so far as Wolfram claimed that the QM correlations could be reproduced with a deterministic and relativistic model, I think I would agree with you that that is problematic.  But then it seems like the heart of your counter-thesis is that one needs irreducible indeterminism and/or superposition.  To me these options also both seem problematic and I would want to press you to explain how even the perfect EPR correlations (just a subset of the general QM predictions after all) can be explained in a local (or is it just a relativistic?) way by introducing indeterminism and/or superposition.  My sense is that this kind of claim tends to arise when people focus too narrowly on just the second part of Bell&#8217;s two-part argument (the part showing that local deterministic hidden variables imply a Bell inequality) while forgetting the first (EPR) part (the part showing that locality requires local deterministic hidden variables already for the simpler sub-class of QM predictions).  </p>\n<p>But the relationship between locality and relativity is subtle, and I kind of lose sight of what exactly both you and Wolfram are even claiming to argue for here.  So take this with a large grain of salt.  But my sense is indeed that there is nothing new here that wasn&#8217;t already known to Bell.  (For sure that is my opinion of Conway/Kochen &#8212; I don&#8217;t think they proved anything new at all; they just made a big mess with words regarding the so-called free will assumption of Bell&#8217;s inequality.)</p>\n]]>", "author": "Travis", "published": "2015-09-20 13:46:03+00:00", "title": "By: Travis"}, {"content": "<![CDATA[<p>Flavio,</p>\n<p>Well, I wouldn&#8217;t want you to do something you hate, I am genuinely curious if you, as you put it, put your money where your mouth is. Based on that, I&#8217;m willing to make the following proposal: if any form of FTL signaling is discovered in the next 10 years (either of the form you outline or something else) I will pay you 200 USD, and if not, you pay me 50 USD. Want to take it?</p>\n]]>", "author": "Joshua Zelinsky", "published": "2015-09-20 15:38:20+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Travis #77 and #91:</p>\n<p>Thank you for pointing out your article (arxiv:0707.0401) in comment #77, it did clarify the meaning of the terminology you were using in this context a lot! Also, it does provide a nice introduction to J.S. Bell views &#8211; whose writings I definitely have to read, sooner or later.</p>\n<p>Indeed, the EPR paradox and Bell inequalities are tricky subjects, which may be more suited for a discussion among philosophers then among physicists (and computer scientist? 😉 ). The EPR paradox in particular is an archetypical example of a problem which in itself is almost a mathematical triviality, and yet it is extremely difficult to achieve a widespread consensus about its interpretation.</p>\n<p>IMHO, what Bell experiments have shown is that the &#8220;realism&#8221; assumption given by EPR is demonstrably false, and that quantum physics is indeed a local theory! The point is that, for me at least, &#8220;local&#8221; simply is the statement that superluminal communication is impossible! And I cannot really understand which are the other interpretation of the word &#8220;local&#8221;. Probably, there is some metaphysical confusion going around, stemming from the fact that in order to simulate a Bell inequality violation with a classical system, one would need faster-than-light communication&#8230;</p>\n<p>So, Travis, following your paper: it is evident that the EPR argument is sufficient to rule out the possibility that the (quantum mechanical) world satisfies the &#8220;local causality condition&#8221;, as given in equation (1) of your paper. Let me explain and comment over that here, for those who have not read it.</p>\n<p>Let&#8217;s suppose that exist `entities&#8217; which provide an `objective&#8217; description of the state of reality, i.e. what Bell called &#8220;beables&#8221;; in which be-able is used in contrast to observ-able, to denote something which `is&#8217;, rather than something which is merely `observed&#8217;. Ok, this seems to be a pretty metaphysical definition; but I think it can be described more concretely as follows. By beable, it is meant a description of the state of reality, at a given time, which:</p>\n<p>1) is not necessarily observable;<br />\n2) is correlated with the `future evolution of the system&#8217;: by this, we mean that the measurements made in the future will have outcomes which are probabilistically correlated with these beables;</p>\n<p>and moreover, if these beables are &#8220;complete&#8221;, then:</p>\n<p>3) these beables provide all possible information about the future measurement outcomes: that is, the beables completely determine, given the measurement which will be performed, the probability of obtaining a certain future measurement outcome.</p>\n<p>Well, with these assumptions, the beables seem to me to be pretty similar to a set of &#8220;hidden variables&#8221;; also, it seems to me that the &#8220;realism&#8221; hypothesis has been implicitly introduced, as the measurement outcomes are determined by these beables&#8230; but let&#8217;s move on.</p>\n<p>Now, we suppose that Alice and Bob are far away from each other, and that we have a complete beable for Alice&#8217;s experiment, which however is disjoint form Bob&#8217;s past light-cone (represented in Fig. 2 in your paper). Then, the condition 3) above can be expressed as:</p>\n<p>P( a | Beable, b ) = P( a | Beable )</p>\n<p>in which &#8220;a&#8221; is Alice&#8217;s outcome and &#8220;b&#8221; any experiment that Bob can perform in a causally disjoint region of space, so that by the no-faster-than-light-communication principle, it cannot influence Alice&#8217;s results. And this is exactly equation (1) of your paper, i.e. the &#8220;local causality condition&#8221;.</p>\n<p>This condition seems to be very natural, almost obvious&#8230; but it is bluntly violated by Quantum Mechanics, as shown by EPR. For a maximally entangled pair of qubits we get P(a|Beable) = 1/2 and P(a|Beable,b) = 1; i.e., Bob&#8217;s measurement is completely correlated with Alice&#8217;s measurement!</p>\n<p>Ok, so this &#8220;local causality condition&#8221; is violated&#8230; what can one learn from it? There are three possible way-out, as far as I can see:</p>\n<p>1) Quantum Mechanics is incomplete (the solution supported by Einstein, Podolsky and Rosen); pictorically, it could be represented as a hole in the &#8220;beable&#8221; reagion in Fig. 2 in your paper, which allows information to flow from the common past of Alice and Bob to influence Alice&#8217;s experiment, without being `comprehended&#8217; by the standard Quantum Mechanics theory.</p>\n<p>2) Locality is violated (supported by JS Bell himself), however without violating the no-faster-than-light-communication principle. However I cannot understand this position&#8230; for me no-superluminal signalling is just the definition of locality, so what are we talking about? If one can give me a satisfying alternative definition of locality, I would be very happy&#8230;</p>\n<p>3) The beables/hidden-variables/realism assumption is wrong (and standard quantum mechanincs is right). Just to elaborate a little bit further: it is assumed that the beables determine Alice&#8217;s measurements, but the beables themselves are never measured! If, instead, one tries to observe these beables by preventively measuring Alice&#8217;s quantum system, this will give a (complete) description of Alice&#8217;s system, but then it will be unentangled from Bob&#8217;s system! So we end up with having P(a|Beable) = P(a|Beable,b) = 1.</p>\n<p>Ok, so far I have talked only about the EPR paradox. </p>\n<p>Conceptually, what the violation of Bell inequalities adds to the argument is that it precludes point 1) above to be a valid argument. Any hidden-variable/realistic (local) theory which assigns a definite value (at least probabilistically) for Alice&#8217;s and Bob&#8217;s measurements, cannot violate Bell&#8217;s inequalities!</p>\n<p>Since also point 2) is extremely well verified, it seems to me that the problem has been pretty much resolved, in favour of solution 3) above&#8230;</p>\n<p>Finally, I apologize for the length of this comment&#8230; But I have wanted to write a little bit about Bell inequalities for ages!</p>\n]]>", "author": "Davide Orsucci", "published": "2015-09-20 18:09:08+00:00", "title": "By: Davide Orsucci"}]