[{"content": "<![CDATA[<p>> (By undergrad, [teaching quantum theory is] not only possible, but maybe should become standard for both physics and CS majors.)</p>\n<p>Scott: should it be standard for mathematicians who aren&#8217;t studying physics or CS?  I studied mathematics in university, and learned very little about quantum theory.  I was taught a lot of the particular prerequisites that you mention.</p>\n]]>", "author": "jonas", "published": "2018-11-22 20:25:21+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>jonas #1: I guess it’s not my place to say.  I think that some exposure to QI will increasingly be part of being an educated computer scientist, and I’ll also go to the mat that for many students, this is the best way ever discovered to introduce students to QM, which of course the physicists already care about.  But it’s for mathematicians to decide whether this (as far as we know) exact realization of complex linear algebra by the deepest level of physical reality should be part of the core of math education.</p>\n<p>I’ll say this, though: when I learned about eigenspaces, diagonalization, trace, matrix exponentiation, etc. in my Honors Linear Algebra class, as a 16-year-old at Cornell—well, I could do it, but I didn’t get the motivation for any of it.  Had I been better at math, I would have, but I didn’t.  Then, a couple years later, I learned quantum information, and suddenly it all snapped into place.  And to this day I often use ket notation even for doing linear algebra that has nothing to do with QM.</p>\n]]>", "author": "Scott", "published": "2018-11-22 20:43:17+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>My copy of <a href=\"https://www.amazon.com/Q-Quantum-Terry-Rudolph/dp/0999063502\" rel=\"nofollow\"><i>Q is for Quantum</i></a> is scheduled for Monday delivery&nbsp;&hellip; and thank you, Terry, for so thoughtfully providing free public access to <a href=\"<a href=\"http://qisforquantum.org/wp-content/uploads/2018/11/PART-I-draft-Q-is-for-Quantum.pdf&#038;quot\" rel=\"nofollow\">http://qisforquantum.org/wp-content/uploads/2018/11/PART-I-draft-Q-is-for-Quantum.pdf&#038;quot</a>; the first half!</p>\n<p>PS: thoughtful public discussion(s) of any book, when shared with librarians, concretely motivates libraries to acquire the book boring discussed&nbsp;&hellip; so if a few <i>Shtetl Optimized</i> readers are willing to post their thoughts, then I am entirely confident that both the Seattle Public Library system and the University of Washington library system (for example) can be induced to stock <i>Q is for Quantum</i>&nbsp;&hellip; to the considerable long-term benefit of young readers.</p>\n]]>", "author": "John Sidles", "published": "2018-11-22 21:17:47+00:00", "title": "By: John Sidles"}]