[{"content": "<![CDATA[<p>Bill #85: As I said above, on November 7, if FiveThirtyEight and the other sites are counting Texas as a swing state, then I won&#8217;t go through with a swap.  My participation is conditional on living in a non-swing state.</p>\n]]>", "author": "Scott", "published": "2016-09-13 19:18:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Cain #84: This post was about stopping an unstable racist madman from taking over the US.  Nothing in it depended on the claim that Hillary is in any way preferable to Bernie Sanders.</p>\n<p>I <i>did</i> support Hillary over Bernie in the primaries (without any enormous enthusiasm), but that&#8217;s a separate discussion we could have.  Basically, by the standards of academia or many European countries, I&#8217;d probably be considered a centrist (or in Berkeley, a right-winger 🙂 )&#8212;it&#8217;s only in the context of the US that my politics are liberal.  But even that&#8217;s an oversimplification, since on some issues (e.g. stopping climate change, legalizing drugs) I&#8217;m well to the left of the Democratic Party, while on other issues (Israel, SJW shaming campaigns&#8230;) I sharply dissent from what liberals nowadays are supposed to think.</p>\n<p>To take some of Bernie&#8217;s issues: on student debt, I think a huge part of the problem is that too many vocations now require college degrees when they really shouldn&#8217;t, when there&#8217;s no real reason for them to.  In such cases, what the college degree certifies might have nothing to do with anything the student learned in college, but simply that the student was smart and conscientious enough to get in.  But if the latter is all you care about, there are much faster ways to certify it, which would let millions of people join the workforce earlier and not saddle them with crippling debt.</p>\n<p>On wealth inequality, I agree with <a href=\"http://paulgraham.com/ineq.html\" rel=\"nofollow\">Paul Graham</a> that &#8220;inequality&#8221; is the wrong way to describe the problem.  The real problem is <i>poverty</i>.  So for example, if we could lift millions out of poverty, but only at the cost of making a few hundred obscenely rich people so much more obscenely rich that we&#8217;d increase the total inequality by some metric, I&#8217;d consider that to be a good trade.  And this is relevant, because very broadly speaking it&#8217;s what capitalism tends to do.</p>\n<p>Having said that, I think the experience of other countries clearly shows that the US could do more wealth redistribution than it does now, and also have a single payer healthcare system that would work better than our current Byzantine and broken one.  And rich people should also bear the brunt of the cost of fighting climate change and of modernizing our transportation system, electrical grid, etc to be smarter and more sustainable (an enormous, necessary undertaking on which we&#8217;ve barely even started).  From what I understand, the theoretically best way to raise funds for such things would be a massive tax on <i>consumption</i>, especially luxury consumption and environmentally damaging consumption (like beef).  But in the world as it is, higher corporate taxes, estate taxes, and capital gains taxes would do.</p>\n<p>On your last question: given how viciously I was attacked for discussing what one might have considered an orders of magnitude less incendiary topic (nerds and dating), and how much of my limited social capital I used up on that, there are various things I&#8217;d rather do right now than host a discussion about race and IQ on this blog.  For example, remove my own fingernails with a dull knife. 😉</p>\n]]>", "author": "Scott", "published": "2016-09-13 20:21:50+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Alas, Scott&#8217;s views on Trump so thoroughly accord with mine, that&nbsp;considerable zest has gone from life.  Can&#8217;t <i>Shtetl Optimized</i> talk about tensor network geometries and/or Lindbladian quantum dynamics for awhile?  At least until after the debates?  There&#8217;s plenty of great preprints coming out!</p>\n<p>On the other hand, if the polls are close after the debates, that will light a fire under lots of folks (my&nbsp;entire family&nbsp;for&nbsp;one).</p>\n]]>", "author": "John Sidles", "published": "2016-09-13 22:23:30+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>#82, let me just very quickly comment on what I think is one of your main fallacies. Put in a simplistic form: leadership is not a morality contest. There are other aspects to consider in leadership, i.e., the interest of the country you lead.<br />\nAs far as I&#8217;m aware of, Obama was elected to be the president of the US, not of the UN. He needs, and must, prefer the lives of Americans over the possibly tragic collateral damage caused by fighting aggressively against its enemies. </p>\n<p>I also do not see how Obama advanced the interests of the US within the middle east. You seem to be claiming that he has done many things with good intentions. Since we seem to agree that the middle east is in a complete chaos we now know that all his actions failed. You claim that this failure is not on Obamas&#8217; shoulders, because the chaos was inevitable, if I understand correctly. So my question: why did Obama even make all these actions, if the fate of the middle east was doomed from the start? He certainly seemed to believe otherwise in 2008. Showing his weakness in understanding international politics. I claim this is an outcome of his post colonial world view, shared to a certain degree by the upcoming Clinton admin, if she wins.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Richardson:Dan.html\">Dan Richardson</a>", "published": "2016-09-14 00:08:21+00:00", "title": "By: Dan Richardson"}, {"content": "<![CDATA[<p>Scott, </p>\n<p>I&#8217;m very disappointed in this hyperbolic, apocalyptic rhetoric coming from liberals establishment, the press, etc.  </p>\n<p>Recall &#8220;The Boy Who Cried Wolf&#8221;.<br />\nYou all really do yourself no favors when you use the same rhetoric to describe Nazi&#8217;s and Republicans. Before Trump, Joe Biden declared Mitt Romney was going to put Blacks back in chains. Eventually people will become desensitized and numb, and risk missing veridical evils. </p>\n<p>Donald Trump has been a reasonably competent, and well-liked executive and celebrity for almost half a century. He has built a real estate empire. In his personal and business life, he seems to have shown some reasonable level of discipline and self-control. For someone born rich, he could have easily idled and partied his money away.  From all appearances, he&#8217;s raised decent kids. He&#8217;s worked with all sorts of people, from all walks of life, with no persuasive claims of animus. He&#8217;s promoted women and minorities in his organization for decades. </p>\n<p>Yet very little of this lengthy and  deep history seems to inform your priors. Instead you seem content to engage in wild, dramatic language about the likely end of the world should Donald assume the presidency.  </p>\n<p>It&#8217;s just not even remotely likely.<br />\nUnlike Hillary, I&#8217;m reasonably confident Donald will be held accountable. Donald will have motivated, fierce opposition from the Left and the Right. The media, the academy, and the deep state and Fed bureaucracy will be set against him. And in the very worst case, there are means of removing him.  </p>\n<p>As Jon Haidt has made pains to communicate, liberals consistently have an extremely poor theory of the conservative mind. They&#8217;re awful at passing an ideological Turing Test. In calling Trump a racist, lunatic, etc. etc. you seem to evidence the same problem. </p>\n<p>Why don&#8217;t you stop taking the easy way out? Why don&#8217;t you stop straw-manning Donald Trump, his supports, and his policies? Instead, why don&#8217;t you take some of your formidable brain power and really contribute a few cycles to steel-manning Trumpism? Why don&#8217;t try hard to generate cogent even novel arguments for why he might be right?</p>\n<p>Like myself, there are many reasonably well-informed, sane, and benign Americans who will be voting for him. Enthusiastically.</p>\n<p>I think you live in live in an ideological ghetto. I think you have your own unexamined, dogmatic pseudoreligion of Equality. And I don&#8217;t think you understand us&#8211;where, say, us is defined notionally as those who hold the best, most intelligent, good-faith reasons, i.e., your intellectual and moral peers who are supporting Trump&#8211;at all.</p>\n]]>", "author": "Emmy Noether", "published": "2016-09-14 01:48:10+00:00", "title": "By: Emmy Noether"}, {"content": "<![CDATA[<p>Cain Jewett, </p>\n<p>The information you seek can be found in the ground breaking 2015 paper by David Piffer: </p>\n<p><a href=\"http://emilkirkegaard.dk/en/wp-content/uploads/PifferIntelligence2015.pdf\" rel=\"nofollow\">http://emilkirkegaard.dk/en/wp-content/uploads/PifferIntelligence2015.pdf</a></p>\n]]>", "author": "Emmy Noether", "published": "2016-09-14 02:03:55+00:00", "title": "By: Emmy Noether"}, {"content": "<![CDATA[<p>Let&#8217;s hope the 2000 debacle doesn&#8217;t repeat. I sincerely believed Bush the 2nd was the worst possible candidate I&#8217;d ever see in my lifetime &#8230; boy was I wrong.</p>\n]]>", "author": "quax", "published": "2016-09-14 04:25:26+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>&#8220;Emmy Noether&#8221;, you are a disgrace to the name you are using to post here.  </p>\n<p>The real Emmy Noether suffered at the hands of fascism, and she would have known what minority scapegoating looks like.</p>\n<p>It is deeply unsettling that you would use her name to espouse your rhetoric here.</p>\n]]>", "author": "quax", "published": "2016-09-14 04:32:31+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Emmy #92: Did you read <a href=\"http://www.scottaaronson.com/blog/?p=2777\">Daddy Why Didn&#8217;t You Blog About Trump</a>?  Roughly half the post was</p>\n<p>(1) explaining why Trump DOESN&#8217;T strike me as a Hitler figure, but &#8220;merely&#8221; as a Putin, Pinochet, or Berlusconi on the long continuum of awfulness with Hitler at its end, and</p>\n<p>(2) urging my fellow Democrats to better understand the Trump supporters&#8217; legitimate grievances&#8212;and as an example, to disavow our own militant social-justice wing, which has become obsessed with moral preening and with persecuting people over verboten ideas and thoughts rather than with solving real problems, and which has thereby generated the predictable backlash that we now see.</p>\n<p>Indeed, what&#8217;s ironic to me is precisely that the SJWs have wasted so much vitriol on invisible molecules of racist, sexist, and xenophobic bias in otherwise decent people that require an electron microscope to detect, when this past year has proven that the US still has robust &#8220;macro&#8221; versions of all these things.</p>\n]]>", "author": "Scott", "published": "2016-09-14 06:17:27+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>There are a number of ironies here. While this vote-swapping may or may not literally be vote buying, the biggest issue in this election is indeed a gigantic vote buying scheme. The Democrats would like to give citizenship and voting rights to more than ten million illegal immigrants, with the expectation that they will be rewarded with most of those votes. The financial benefit to each illegal immigrant could be hundreds of thousands of dollars each, and so a total cost of trillions of dollars taken from American citizens and given to illegal immigrants so that the Democrats can try to steal elections for decades to come. </p>\n<p>Trump and the Right keep being labelled racists and bigots, but the reality is that most of them form their views with little or no reference to racial issues. Instead it is the Leftists who are obsessed with ideologies dominated by issues of race, groups and identities. It is the Leftists who are the racist bigots, yet they hurl such accusations against sensible reasonable people merely because they have formed different beliefs.</p>\n<p>Trump is labelled &#8220;dangerous&#8221;. Yet Leftists who blame antisocial behavior on society, direct their sympathies towards criminals, terrorists and illegal immigrants, and make society a more dangerous place. Leftists are seeking to undermine free speech, meritocracy and opportunity, tearing down earned success and rewarding deserved failure. Obviously not all on the Left hold such hardcore beliefs, but there is definitely a powerful &#8220;progressive&#8221; movement with these really scary, crazy, dangerous ideas. </p>\n<p>If the Democrats succeed in buying millions of votes from illegal immigrants (and felons too), then democracy may be gone for generations. Their main fear is that Trump could win and thwart their plans. That&#8217;s what this election is really about.</p>\n]]>", "author": "Another Trump Democrat", "published": "2016-09-14 06:17:29+00:00", "title": "By: Another Trump Democrat"}, {"content": "<![CDATA[<p>Oh what an ignorant gaffe, that a Putin-loving Donald Trump supporter should post as &#8220;Emmy Noether&#8221; (#92), given <a href=\"https://books.google.com/books?id=GC7aBAAAQBAJ&pg=PA60\" rel=\"nofollow\">the&nbsp;brutal murder of Emmy&#8217;s brother Fritz at Russian&nbsp;hands</a>.</p>\n<p>&#8220;Emmy Noether&#8221; (#92), do you know <i>anything</i> about the real-life Emmy&nbsp;Noether?</p>\n<p>Shtetl Optimized readers who are interested to learn more about the historical predecessors of today&#8217;s alt-right Trump&nbsp;base will find a good on-line starting-point in (((Sanford L. Segal&#8217;s))) Preface to <a href=\"https://books.google.com/books?id=GC7aBAAAQBAJ&pg=PR11\" rel=\"nofollow\"><i>Mathematicians Under the&nbsp;Nazis</i></a> (2014).</p>\n]]>", "author": "John Sidles", "published": "2016-09-14 07:06:25+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>&#8220;Donald Trump has been a reasonably competent, and well-liked executive and celebrity for almost half a century. He has built a real estate empire. In his personal and business life, he seems to have shown some reasonable level of discipline and self-control. &#8221;</p>\n<p>Apparently not so much in recent years. He has mainly devoted himself to licensing his name all over the world with financial ties in Russia, Turkey, South Korea, India, China, Brazil, and other countries. These connections and links will be a direct conflict of interest for foreign policy decisions he would make as President.</p>\n<p>Will he give up his connections to the Trump organization? I am guessing he will not. In fact, he is probably planning exactly how he can use the Presidency to further his financial interests while he lets Mike Pence take care of the policy stuff.</p>\n<p>&#8220;If Donald Trump is elected president, will he and his family permanently sever all connections to the Trump Organization, a sprawling business empire that has spread a secretive financial web across the world? Or will Trump instead choose to be the most conflicted president in American history, one whose business interests will constantly jeopardize the security of the United States?&#8221;</p>\n<p><a href=\"http://www.newsweek.com/2016/09/23/donald-trump-foreign-business-deals-national-security-498081.html\" rel=\"nofollow\">http://www.newsweek.com/2016/09/23/donald-trump-foreign-business-deals-national-security-498081.html</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-09-14 12:52:36+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Emmy #92,</p>\n<p>Claim: &#8220;Donald Trump has been a reasonably competent, and well-liked executive and celebrity for almost half a century.&#8221;</p>\n<p>Fact: Donald Trump is the most unfavored major party Presidential candidate ever as measured by polls: <a href=\"http://www.gallup.com/poll/193376/trump-leads-clinton-historically-bad-image-ratings.aspx\" rel=\"nofollow\">http://www.gallup.com/poll/193376/trump-leads-clinton-historically-bad-image-ratings.aspx</a></p>\n<p>Fact: Donald Trump has bankrupted multiple companies: <a href=\"http://www.politifact.com/truth-o-meter/statements/2016/jun/21/hillary-clinton/yep-donald-trumps-companies-have-declared-bankrupt/\" rel=\"nofollow\">http://www.politifact.com/truth-o-meter/statements/2016/jun/21/hillary-clinton/yep-donald-trumps-companies-have-declared-bankrupt/</a></p>\n<p>Fact: Trump is rich not because he is particularly competent businessman, he is rich because his daddy was rich: <a href=\"http://www.vox.com/2015/9/2/9248963/donald-trump-index-fund\" rel=\"nofollow\">http://www.vox.com/2015/9/2/9248963/donald-trump-index-fund</a></p>\n<p>Fact: Trump is a serial litigant and is right now embroiled in a massive class action suit that has all the hallmarks of a tremendous fraud on his fellow Americans: <a href=\"http://www.newyorker.com/news/john-cassidy/trump-university-its-worse-than-you-think\" rel=\"nofollow\">http://www.newyorker.com/news/john-cassidy/trump-university-its-worse-than-you-think</a></p>\n<p>Claim: &#8220;He has built a real estate empire.&#8221;</p>\n<p>Fact: Actually, he inherited one, but I&#8217;ll concede that he has expanded this into an empire, but with multiple bankruptcies as well.</p>\n<p>Claim: &#8220;In his personal and business life, he seems to have shown some reasonable level of discipline and self-control.&#8221;</p>\n<p>Fact: Donald Trump went on national TV and felt the need to reassure about his penis size: <a href=\"http://www.cnn.com/2016/03/03/politics/donald-trump-small-hands-marco-rubio/\" rel=\"nofollow\">http://www.cnn.com/2016/03/03/politics/donald-trump-small-hands-marco-rubio/</a></p>\n<p>Fact: Donald&#8217;s ex-wife has claimed that he raped her after getting enraged over a scalp procedure she had recommended: <a href=\"http://www.theatlantic.com/politics/archive/2016/09/donald-trump-scandals/474726/\" rel=\"nofollow\">http://www.theatlantic.com/politics/archive/2016/09/donald-trump-scandals/474726/</a></p>\n<p>Fact: Trump is widely viewed as one of the most undisciplined candidates in Presidential history: <a href=\"https://www.google.com/webhp?sourceid=chrome-instant&#038;ion=1&#038;espv=2&#038;ie=UTF-8#q=Trump+discipline+campaign\" rel=\"nofollow\">https://www.google.com/webhp?sourceid=chrome-instant&#038;ion=1&#038;espv=2&#038;ie=UTF-8#q=Trump+discipline+campaign</a></p>\n<p>Claim: &#8220;From all appearances, he’s raised decent kids.&#8221;</p>\n<p>Fact: Donald&#8217;s Trumps son is  &#8211; like his father &#8211; now actively courting the neo-nazi alt-right: <a href=\"http://www.vanityfair.com/news/2016/09/donald-trump-jr-pepe-nazi-instagram\" rel=\"nofollow\">http://www.vanityfair.com/news/2016/09/donald-trump-jr-pepe-nazi-instagram</a></p>\n<p>Claim: &#8220;He’s worked with all sorts of people, from all walks of life, with no persuasive claims of animus.&#8221;</p>\n<p>Fact: Trump has nothing but animus &#8211; taken and given &#8211; by numbers of people who he has met and worked with: <a href=\"http://www.newyorker.com/magazine/2016/07/25/donald-trumps-ghostwriter-tells-all\" rel=\"nofollow\">http://www.newyorker.com/magazine/2016/07/25/donald-trumps-ghostwriter-tells-all</a>, <a href=\"http://abcnews.go.com/Politics/history-donald-trump-small-hands-insult/story?id=37395515\" rel=\"nofollow\">http://abcnews.go.com/Politics/history-donald-trump-small-hands-insult/story?id=37395515</a></p>\n<p>Claim: &#8220;He’s promoted women and minorities in his organization for decades.&#8221;</p>\n<p>Fact: Mostly true, but my how you damn with faint praise.</p>\n<p>Fact: Donald Trump has a lengthy history of rank racism and misogynistic behavior: <a href=\"http://www.vox.com/2016/7/25/12270880/donald-trump-racism-history\" rel=\"nofollow\">http://www.vox.com/2016/7/25/12270880/donald-trump-racism-history</a>, <a href=\"http://www.telegraph.co.uk/women/politics/donald-trump-sexism-tracker-every-offensive-comment-in-one-place/\" rel=\"nofollow\">http://www.telegraph.co.uk/women/politics/donald-trump-sexism-tracker-every-offensive-comment-in-one-place/</a></p>\n<p>In short, you are either:</p>\n<p>1) full of shit and arguing in bad faith<br />\n2) *deplorably* ignorant of basic facts<br />\n3) completely at odds with basic human values and #1</p>\n<p>Bye.</p>\n]]>", "author": "adamt", "published": "2016-09-14 15:19:03+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<p>Dan #91,</p>\n<p>You failed to respond to any of my claimed facts, failed to put forward any of your own, failed to make any real qualms with the values I presented and did nothing to advance the argument in any way that I can detect.</p>\n<p>Somewonk #65, I tried in good faith, but I just don&#8217;t see that effort being returned or how this is beneficial at all.</p>\n]]>", "author": "adamt", "published": "2016-09-14 15:23:04+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<p>adamt #82: &#8220;What I will not agree to:<br />\n1) There is any good evidence that Obama’s speech was irresponsible or that it caused the bad outcomes of the Arab Spring.&#8221;</p>\n<p>There is a book by an italian award winning journalist Alfredo Macchi &#8220;Rivoluzioni s.p.a. Chi c&#8217;è dietro la Primavera Araba&#8221; (he worked for a TV channel owned by Berlusconi so he hardly can be suspected to be a &#8220;communist&#8221;). For a review see <a href=\"http://www.ildiscrimine.com/alfredo-macchi-rivoluzioni-s-p-a-chi-ce-dietro-la-primavera-araba-alpine-studio-lecco-2012/\" rel=\"nofollow\">http://www.ildiscrimine.com/alfredo-macchi-rivoluzioni-s-p-a-chi-ce-dietro-la-primavera-araba-alpine-studio-lecco-2012/</a> (one can google translate it). In it, he sustains that not only US &#8220;supported&#8221; the arab spring, but was an important factor for making it happen (US was using tactics similar to the ones used in Yugoslavia).<br />\nUnlike others he actually have been there when the arab spring happened.</p>\n<p>So US was involved much more than just &#8220;supporting&#8221; the arab spring. It was another of its dirty &#8220;geopolitical&#8221; games.</p>\n<p>You of course can continue to believe that your country is exceptional, it wishes to respect human rights and the freedom of speech etc etc. But this ignores historical and political realities. It ignores the existence of people such as Henry Kissinger and Milton Friedman (see Pinochet), for example.</p>\n<p>@Scott #52<br />\n&#8220;She won’t demonize minorities, or walk away from the US’s trade agreements or defense alliances. She won’t cozy up to Vladimir Putin&#8221;</p>\n<p>Instead of demonizing minorities, Clinton demonizes Russia. A country about which you, as it appears to me, understand almost nothing &#8211; but you probably know that some 150000000 people live in Russia, and most of them don&#8217;t like US very much lately. They are worried that US wants to tear Russia to pieces in the best traditions of &#8220;divide et impera&#8221;. They are worried about the possible collapse of the MAD doctrine following the installation of &#8220;anti missile&#8221; defenses on Russia borders (it appears that in a short time these can be converted into nuclear weapons launchers), and suspect that US intends either to &#8220;preventively strike&#8221; Russia (actually this is also what Paul Craig Roberts thinks, and not only him), or otherwise &#8220;change&#8221; Russia&#8217;s government into something of a Yelstin type government. And they don&#8217;t like the idea of returning again to US sponsored banditism of the Yeltsin state, see around US sponsored chechen terrorists, and seeing their state being taken away by foreign corporations. This is why they elect Putin.</p>\n<p>What strikes me is that it looks that you couldn&#8217;t care less about these people, though they are human beings just like you and the minorities you so much wish to protect. </p>\n<p>Now, I am a jew of Russian origin, and you are an American one, and this probably causes the difference in the attitude, but also you understand that if something goes wrong &#8211; the &#8220;regime change&#8221; will not work as US plans, or some Russian or US missile unit commander makes an error (there were precedents), there might be an enormous human and other toll.</p>\n<p>This is quite a reason for doing whatever one can to kick Clinton with her present attitude, or any other candidate of US military complex, as far from any office as one only can.</p>\n<p>And if one cannot do this, then the only thing which is left is to act according to one&#8217;s conscience, though some people here, including you, would prefer to play silly games instead.</p>\n]]>", "author": "anonymous", "published": "2016-09-14 19:53:43+00:00", "title": "By: anonymous"}, {"content": "<![CDATA[<p>@adamt,</p>\n<p>I have addressed very shortly some of the main issues you have raised.<br />\nI.e., you made a recurring mistake in thinking that the value of a good leader is measured by his/her being fair or moral. I have exposed this fallacy.<br />\nSecondly, I exposed a hole in your pro-Obama argument, showing that in contrast to what you&#8217;ve insinuated, Obama was under the false impression that the Arab Spring is going to pan out positively, though in reality we now already have something like half a million bodies, and still counting.</p>\n<p>Lastly, I cannot answer in detail each of your points, because, believe it or not, besides arguing politics on the web I have other responsibilities in my life, though I still hold the task of convincing you very high in my life priorities. I hope you could find the strength within yourself to understand and forgive me.</p>\n<p>Yours,<br />\nDan R.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Richardson:Dan.html\">Dan Richardson</a>", "published": "2016-09-14 23:43:48+00:00", "title": "By: Dan Richardson"}]