[{"content": "<![CDATA[<p>Scott:</p>\n<p>Sorry, I wasn&#8217;t knocking on basic research exclusively. Lots of stuff in Engineering is silly or only superficially useful or redundant or playing the citation game.</p>\n]]>", "author": "Rahul", "published": "2014-07-13 15:39:08+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>jeffry klugman says: </p>\n<blockquote><p>the only drug for which there is empirical evidence of not just an improved mood, but an actual reduced rate of completed suicide is lithium.</p></blockquote>\n<p>Do you have a citation for that? You might be right but I just find that so hard to believe. That nothing in the wide arsenal of a modern psychiatrist works for reducing suicide rates except Li?</p>\n<p>I&#8217;ve heard other reports of the exceptional efficacy of Lithium but the big problem I remember is that the therapeutic dose is very close to the dangerous dose. So constant titre of the blood seems very essential to adjusting the dose.</p>\n]]>", "author": "Rahul", "published": "2014-07-13 17:05:07+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Often the real reason that a person may be depressed or anxious is that something very bad or very stressful is happening to them.</p>\n]]>", "author": "Simple", "published": "2014-07-13 22:22:10+00:00", "title": "By: Simple"}, {"content": "<![CDATA[<p>1.  i&#8217;ve heard the data on lithium and completed suicide on several occasions directly from the lips of fred goodwin, former head of nimh, probably the world&#8217;s leading authority on manic-depressive illness, and co-author with kay jamison of THE reference book: manic-depressive illness, now in its 2-volume 2nd edition.  i suggest you go there for a citation.  alternately, you might find the citation at pubmed.</p>\n<p>2. the therapeutic dose of lithium is NOT close to a toxic dose in most individuals.  lithium in overdose, however, is quite dangerous.</p>\n<p>3. i was not stating anything about the therapeutic benefit of lithium for ameliorating the symptoms of manic-depressive illness and as an augmentation agent for depression [though it is substantial and well-documented.  again, see goodwin and jamison.  lithium has become an under-utilized drug because of fears surrounding its possible long-term effects on the kidney, the probability of which may be minimized in several ways.]   i was merely saying that it reduced the incidence of completed suicide even in those who do NOT respond in any other way.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/klugman:jeffry.html\">jeffry klugman</a>", "published": "2014-07-14 16:06:18+00:00", "title": "By: jeffry klugman"}, {"content": "<![CDATA[<p>I&#8217;ve never attempted suicide, but had a lot of suicidal thoughts and low mood. Then I got diagnosed with vitamin D deficiency during tests for other things (high blood pressure). Started consistent use of D3 and suicidal thoughts disappeared. I don&#8217;t think it was placebo effect, since I did not expect D3 to affect my mood at all. So, perhaps chemical imbalance. </p>\n<p>I know this is anecdotal, but it&#8217;s cheap and safe, so if it helps even someone, that&#8217;s great. Talk to a professional though.</p>\n<p>Peace</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/D=deficient:Anonymous.html\">Anonymous D-deficient</a>", "published": "2014-07-14 17:58:28+00:00", "title": "By: Anonymous D-deficient"}, {"content": "<![CDATA[<p>Some references include:<br />\n<blockquote><b>PMID 23814104</b> &#8220;Lithium in the prevention of suicide in mood disorders: updated systematic review and meta-analysis&#8221; (2013)</p>\n<p>Lithium was more effective than placebo in reducing the number of suicides (odds ratio 0.13, 95% confidence interval 0.03 to 0.66) and deaths from any cause (0.38, 0.15 to 0.95) [JAS note: these are very strong effects].</p>\n<p>&#8212;&#8212;&#8212;&#8211;<br />\n<b>PMID: 19523343</b> &#8220;Review of lithium effects on brain and blood&#8221; (2009)</p>\n<p>&#8220;Lithium acts through multiple pathways to inhibit glycogen synthetase kinase-3beta (GSK3 beta). This enzyme phosphorylates and inhibits nuclear factors that turn on cell growth and protection programs, including the nuclear factor of activated T cells (NFAT) and WNT/beta-catenin.&nbsp;&hellip; Lithium has been reported to be beneficial in animal models of brain injury, stroke, Alzheimer&#8217;s, Huntington&#8217;s, and Parkinson&#8217;s diseases, amyotrophic lateral sclerosis (ALS), spinal cord injury, and other conditions. Clinical trials assessing the effects of lithium are under way.&#8221;</p>\n<p>&#8212;&#8212;&#8212;&#8211;<br />\n<b>PMID: 24308291</b> &#8220;Adult neurogenesis and its role in neuropsychiatric disease, brain repair and normal brain function.&#8221; (2014)</p>\n<p>&#8220;Neural stem/progenitor cells (NSPCs) in the mammalian brain retain the ability to generate new neurones throughout life in discrete brain regions, through a process called adult neurogenesis. Adult neurogenesis, a dramatic form of adult brain circuitry plasticity, has been implicated in physiological brain function and appears to be of pivotal importance for certain forms of learning and memory. In addition, failing or altered neurogenesis has been associated with a variety of brain diseases such as major depression, epilepsy and age-related cognitive decline.&#8221;</p></blockquote>\n<p><b>Summary</b>&nbsp; Although we are a *LONG* way from understanding the dynamical and anatomic details&nbsp;&mdash; details that span all length-scales from nanometers to microns, millimeters, and meters, and all time-scales from femtoseconds to minutes, weeks, years, and decades&nbsp;&mdash; multiple lines of evidence confluently indicate that mental health has an architectural aspect, such that effective treatments have a regenerative aspect (and in particular therapeutic agents like lithium in particular may act slowly <i>because</i> they are acting regeneratively).</p>\n<p><b>Conclusion</b>&nbsp; There&#8217;s more to mental health than &#8220;chemical imbalance&#8221;&nbsp;&hellip; and this is hopeful news for patients and their families.</p>\n<p><b>Acknowledgments</b>&nbsp; These references are offered with a view toward encouraging people and families to (1)&nbsp;seek help, and (2)&nbsp; be patient and persistent and hopeful&nbsp;&mdash; for years and even decades if necessary&nbsp;&mdash; in finding treatments that work.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-07-14 18:30:14+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Considering the kind of money thrown around lately, including a new version of Newton North High School in the over-100 million zone, I think Seth&#8217;s idea for transforming MIT&#8217;s campus by taking over the land where Memorial Drive now runs is not such a bad one, and the money can surely be found if there is the will to do it.</p>\n<p>I didn&#8217;t know Seth but his ideas and sense of community sound great. He was a person I saw across the room, most recently at Cape Cod. Once in awhile, especially in such a beautiful setting, I must remind myself that however wonderful I may feel, this is no earthly paradise and in spite of appearances, someone else may be feeling something different at the same time in the same place.  I was escaping, I thought, briefly from a family crisis. A brother-in-law (very cheerful normally, very into golf) had been diagnosed with what can only be terminal stage 4 lung cancer which is now in his spine, necessitating heavy pain meds. He was still cheerful the last time we met just before the Cape trip, and I have shared Seth&#8217;s story with my sister now. We are in awe of how two different people might experience pain &#8211; physical or psychic. One person would seem to be a candidate for assisted suicide, but instead he is embarking on a tough round of chemotherapy in hopes of a few more years of life, fighting for it every inch of the way. It&#8217;s a puzzlement how each of us occupies this physical body so differently, but I feel that in all cases there is justifiable hope, until the end.</p>\n]]>", "author": "Anonymous", "published": "2014-07-14 21:00:09+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>Scott #20</p>\n<p>&#8220;I’d say Pinker is the example par excellence of someone       drawing serious argumentative lines from current basic research in cognitive science, evolutionary psychology, and other “sciences of human nature,”</p>\n<p>Isn&#8217;t &#8220;basic research&#8221; a little superflous here?</p>\n]]>", "author": "Pablo", "published": "2014-07-15 03:04:59+00:00", "title": "By: Pablo"}, {"content": "<![CDATA[<p>I see several posts that may be read as saying antidepressants aren&#8217;t effective because they have not been proven to reduce suicide. I think this is an unfair assessment. The point of antidepressants is not just to prevent suicide; it&#8217;s to improve quality of life, which is not the same and not necessarily even correlated to preventing suicide (suicide risk is not always monotonic in how bad someone&#8217;s depression is, if that could even be quantified).  I realize suicide is topical to this thread, but I think we should be clear it&#8217;s a false and harmful inference to say &#8220;drugs not proven to reduce suicide&#8221; => &#8220;drugs aren&#8217;t useful for treating depression&#8221;.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/G:Luke.html\">Luke G</a>", "published": "2014-07-15 04:41:39+00:00", "title": "By: Luke G"}, {"content": "<![CDATA[<p>I will miss playing Ultimate Frisbee with Seth, he was the man.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Boston:Some_guy_from.html\">Some guy from Boston</a>", "published": "2014-07-15 12:42:04+00:00", "title": "By: Some guy from Boston"}]