[{"content": "<![CDATA[<p>In refutation of your assertions, please see:</p>\n<p><a href=\"http://math.mit.edu/~cohn/Thoughts/factoring.html\" rel=\"nofollow\">http://math.mit.edu/~cohn/Thoughts/factoring.html</a></p>\n]]>", "author": "Jopus", "published": "2018-01-08 13:42:35+00:00", "title": "By: Jopus"}, {"content": "<![CDATA[<p>Jopus #22: That&#8217;s not <i>in any sense</i> a &#8220;refutation of my assertions.&#8221;  Firstly, because it&#8217;s just Henry&#8217;s opinion, clearly and honestly labeled as such (&#8220;Of course, I have no real evidence for my views; if I had any good ideas for factoring, I&#8217;d be working on them instead of writing this&#8221;).  But secondly, because nowhere in my response to you did I dispute the point that factoring might turn out to be classically easy!  Did you even read what I wrote?</p>\n]]>", "author": "Scott", "published": "2018-01-08 14:27:23+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Hey Scott,</p>\n<p>Thanks for caring to give a real reply (re. #9).</p>\n<p>Bye for now&#8230;</p>\n<p>&#8211;Ajit</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2018-01-08 16:26:27+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Sorry Scott, wasn&#8217;t attempting to be churlish. Was meant to be a tongue-in-cheek comment. Should have added an exclamation mark to indicate this, but humor doesn&#8217;t always come off well in the online format, I find. </p>\n<p>I simply thought you were suggesting ignorance of Quantum Computing on my part, which would be fair enough, because it&#8217;s true. I know next to nothing about quantum computing. But confidence in the fallibility of quantum factoring methods seems well-placed given my initial observation, which I stand by, that if quantum computing worked and solved integer factorization or any problem, it would be of value &#8211; but not useful until we fully understood the mechanisms involved, so we could exploit them in further applications, allowing other science and technology developments. </p>\n<p>But when you said that, &#8216;&#8230;we have shown that if the simulation was exact, it would imply a collapse of the polynomial hierarchy, which complexity theorists consider “almost as bad” as P=NP&#8217;, I fail to see why, if P=NP, that this would be a bad thing. In the same reply, you conceded that a classical P-time factorization algorithm &#8216;still won’t undercut the main economic or scientific rationale for QCs&#8217;. However, I disagree somewhat on this. Bar the exception of protein folding for biologists and reaction modelling for chemists for example, which I can comprehend the benefits by leveraging QC power, I struggle to see the economic rationale being other than &#8216;break all encryption&#8217; for example.</p>\n<p>You may state that elliptic curve, discrete logarithm etc are still safe with a classical P-time algorithm. However, I disagree, as it&#8217;s very likely that a solution to factorization could rapidly be adapted to these other encryption classes as well. </p>\n<p>For my two cents worth though, I entirely believe that the Ancient Greeks knew a P-time factorization algorithm. When the library at Alexandria was burned by the Romans, a LOT of learning was lost. Some historians have speculated it set the world back 1,000 years or more. For example, Pythagoras had invented a rudimentary form of calculus, something which was not revived again until the 15th century. So 40+ years doesn&#8217;t really do justice to the two Millennia that preceded the modern era. </p>\n<p>The difference was that in those days, any useful algorithm had limited utility, even if was a great discovery, because there were no computers of any kind to implement it on, so the classical versus quantum distinction was rather moot. Also, I have heard it mentioned that even classical computers use quantum effects at the holes in transistor gates. So in a sense, classical computers ARE already quantum, it&#8217;s just that perhaps they are a very diluted version of what researchers are striving for with true QC machines. So good luck with your research. I honestly hope QC computers start to work properly or usefully, although I don&#8217;t hold out much hope that they will, certainly not for another decade or more.</p>\n]]>", "author": "Jopus", "published": "2018-01-08 17:15:03+00:00", "title": "By: Jopus"}, {"content": "<![CDATA[<p>I&#8217;ve never been fascinated by quantum computers, because quantum mechanics has already proven its worth for making intractable computations become tractable. Quantum mechanics is needed to build electronic computers, semiconductors, and transistors, which in turn are already used for &#8220;simulating quantum mechanics&#8221; (e.g., lattice QCD). Sure, advancing from Babbage machines to supercomputers has only changed running time constants rather than complexity classes, but they&#8217;re awfully large constants.</p>\n]]>", "author": "Jake the Snake", "published": "2018-01-09 04:21:56+00:00", "title": "By: Jake the Snake"}, {"content": "<![CDATA[<p>Jake the Snake #26: You can be fascinated or not fascinated by whatever you want, but it&#8217;s worth pointing out that there are fundamental physical limits to the continuation of Moore&#8217;s Law.  I.e., you can&#8217;t just keep repeating the advance from Babbage machines to supercomputers over and over, without your computers storing so many bits in a given region, or cycling through so many states per second, that they necessarily collapse to black holes.  In more practical terms, we have no clue how you&#8217;d make transistors smaller than atomic scale, and are already nearing that limit.  After that, if you want computers that can do even more, you need to harness nature for computation in fundamentally new ways, and quantum computing is currently the only serious proposal for how to do that based on known physics.</p>\n]]>", "author": "Scott", "published": "2018-01-09 04:59:24+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #27</p>\n<p>&#8220;we have no clue how you’d make transistors smaller than atomic scale, and are already nearing that limit. &#8221;</p>\n<p>Given that the Planck length is about 10^20 smaller than the radius of an electron, is possible to use particle position to store information?&#8230; or the uncertainty principle makes this fundamentally impossible?<br />\nOne analogy I&#8217;m thinking about (which may be wrong) is the constant flow of new techniques to get past the fundamental resolution limit of light/electron wavelength to see finer details in microscopy.</p>\n]]>", "author": "fred", "published": "2018-01-09 14:01:36+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #28: Yes, one could imagine that billions of years in the future, our descendants will build their computers out of pure quantum ripples in the spacetime metric.  Even then, of course, they still won&#8217;t be able to exceed the Bekenstein limits of ~10<sup>69</sup> qubits per square meter, and ~10<sup>43</sup> operations per second.  In any case, I think it&#8217;s fair to say that engineering ideas for how you get below atomic scale, let alone to Planck scale, remain iffy at present. 🙂</p>\n]]>", "author": "Scott", "published": "2018-01-09 16:13:00+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #29</p>\n<p>Right, and density of data is one thing, but there&#8217;s also the added difficulty that signals (reads and writes of the data) need to be propagated around (e.g. from an ALU unit at the center to a &#8220;sphere&#8221; of memory around it), and you can&#8217;t beat the speed of light for this.<br />\nThis is already what makes CPU/GPU design so difficult today.</p>\n]]>", "author": "fred", "published": "2018-01-09 17:17:51+00:00", "title": "By: fred"}, {"content": "<![CDATA[<blockquote><p>I’ve never been fascinated by quantum computers, because quantum mechanics has already proven its worth for making intractable computations become tractable.</p></blockquote>\n<p>No it hasn&#8217;t.</p>\n<p>That&#8217;s like saying László Babai&#8217;s car has already proven its worth in reducing the time complexity of graph isomorphism.</p>\n]]>", "author": "Job", "published": "2018-01-09 21:22:31+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>That makes sense.</p>\n<p>Whenever i don&#8217;t see interference mentioned, i get a sense that my understanding of how QC&#8217;s are used to solve problems (other than simulating a quantum system) is really incomplete.</p>\n<p>Like i&#8217;m missing a key technique that&#8217;s really significant.</p>\n<p>Also, interference is much cooler than entanglement. I don&#8217;t hang out with entanglements.</p>\n]]>", "author": "Job", "published": "2018-01-07 21:56:15+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>Job #18: And you hang out with interferences?</p>\n]]>", "author": "Scott", "published": "2018-01-07 22:45:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;Ignorance and confidence is usually a bad combination&#8221;</p>\n<p>I just could not help making this correction: IN SCIENCE, ignorance and confidence is usually a bad combination.</p>\n]]>", "author": "Ashley", "published": "2018-01-08 12:46:14+00:00", "title": "By: Ashley"}, {"content": "<![CDATA[<p>Ashley #20: I think it&#8217;s a <i>bad</i> combination everywhere.  It&#8217;s just that in some domains (marketing, seduction, Continental philosophy, running for president&#8230;), it can be a profitable one for the perpetrator.</p>\n]]>", "author": "Scott", "published": "2018-01-08 13:15:03+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>1948: &#8220;As soon as controlled fusion is perfected, electricity will be too inexpensive to meter&#8221;.</p>\n<p>2018:  &#8220;Moreover, if Google and IBM and IonQ and so forth do what they’re expecting to do with the 50-qubit devices they’re building now, &#8230;.&#8221;</p>\n]]>", "author": "Raoul Ohio", "published": "2018-01-10 22:53:14+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Raoul #32: Oooh, is this a game of &#8220;spot the flaws in the comparison&#8221;?  Can I play?</p>\n<p>1. I used the word &#8220;if.&#8221;<br />\n2. I wasn&#8217;t talking here about a 20-year prospect, but about something that&#8217;s either going to happen or not happen in 1 year.  (The first 50-qubit chips already exist, remain to be calibrated and tested.)<br />\n3. No claims of any useful applications (yet), let alone any that are &#8220;too cheap to meter.&#8221;<br />\n4. Actually, we could already have fusion energy with 1950s technology, by exploding hydrogen bombs underground and using them to drive turbines.  There are some obvious reasons why we don&#8217;t do it, but they&#8217;re more social and political than scientific.  No analogous issue with QC that I&#8217;m aware of.</p>\n]]>", "author": "Scott", "published": "2018-01-11 06:27:43+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>The photovoltaic effect was first observed by Becquerel in 1839 and solar power is anticipated to become the world&#8217;s largest source of electricity by 2050! 😛</p>\n]]>", "author": "fred", "published": "2018-01-11 14:15:00+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>That comparison is intended to be a pithy but not particularly serious. My official position on QC is: &#8220;Who knows?&#8221;.</p>\n]]>", "author": "Raoul Ohio", "published": "2018-01-11 15:41:02+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> opines (<i>circa</i> <a href=\"#comment-1751319\" rel=\"nofollow\">#33</a>) No analogous issue with QC that I’m aware of [in controlled thermonuclear fusion]</p></blockquote>\n<p>Todd Harrison Rider&#8217;s MIT/PhD thesis &#8220;Fundamental Limitations on Plasma Fusion Systems Not in Thermodynamic Equilibrium&#8221; (1995) and its followup article &#8220;A general critique of inertial-electrostatic confinement systems&#8221; (<i>Physics of Plasmas</i>, v2(6), 1995) provides an in-depth discussion of quantum dynamical obstructions to scalable energy-gain fusion that are directly relevant to quantum dynamical obstructions to scalable Quantum Supremacy.</p>\n<p>In a nutshell, all demonstrated plasma technologies to date (save for fission-pumped implosion devices, i.e., H-bombs) radiate photonic energy from the device much faster than fusion reactions can replenish it.  </p>\n<p>Similarly, all quantum-coherent computational technologies to date radiate photonic entanglement from the device much faster than error-correction processes can regenerate it.</p>\n<p>The physical obstruction is thtat the fine-structure constant &alpha;=1/137 is sufficiently large as to make energy-gain fusion and Quantum Supremacy comparably difficult of scalable demonstration (it was this parallel that first led me to appreciate the deep physics of Gil Kalai&#8217;s skepticism).</p>\n<p>On the other hand, large-&alpha; photonic engineering is both scientifically fruitful and economically viable because (for example) the same lossy photonic processes that make controlled fusion hard make laser technologies easy.</p>\n<p>Similarly, same lossy photonic processes that make Quantum Supremacy hard have made (to date) the Extended Church-Turing Thesis effectively true&nbsp;&hellip; for all technologies whose key hardware elements are made of photonically-bound condensed matter.</p>\n<p>For the above-stated reasons, it is well to combine support for controlled fusion research with a sober appreciation of the photonic obstructions to it.  And it is well to combine support for Quantum Supremacy research with a sober appreciation of those same photonic obstructions.</p>\n]]>", "author": "John Sidles", "published": "2018-01-11 15:44:16+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Quantum computing seems to be a clever, systematic method for converting mathematical problems into technical ones&#8230;</p>\n]]>", "author": "Serge", "published": "2018-01-11 16:09:40+00:00", "title": "By: Serge"}, {"content": "<![CDATA[<p>Raoul #35: You never know for certain that something will work until it does work.  But if you still treat 50-100 qubit QC as a random hypothetical about which no one can say anything (&#8220;who knows?&#8221;), then you&#8217;re obviously not paying attention to what&#8217;s happening on the ground.</p>\n]]>", "author": "Scott", "published": "2018-01-11 19:20:49+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, you are always saying that one of the main attributes of a scalable quantum computer should one actually be built, is that it will be able us to simulate quantum physics, but isn&#8217;t that what nature is doing all the time anyway? Can you elaborate a little bit on what you mean by the insights into quantum phenomena that a quantum computer would give us, beyond what we already know about quantum mechanics( or think we know)?</p>\n]]>", "author": "William Hird", "published": "2018-01-12 07:08:35+00:00", "title": "By: William Hird"}, {"content": "<![CDATA[<p>William #39: It&#8217;s the difference between having to build a model and put it in a wind tunnel every time you want to simulate an airplane, versus having a general-purpose computer that just does the simulation for you.  It&#8217;s not just that the programmable device is enormously faster; it&#8217;s that it lets you answer questions that you couldn&#8217;t answer in the physical experiment, because you don&#8217;t have the right knobs and levers (e.g., to measure or manipulate an electron density all the way in the interior of your molecule, without needing to destroy the whole molecule to get to it).  As a final advantage, a simulator lets you <i>test your theory</i> about, e.g., which effective Hamiltonian governs some system, comparing its predictions against reality.  Without the simulator you&#8217;d only be comparing reality against itself.</p>\n<p>It&#8217;s not clear that any of this will change the way we understand QM itself&#8212;but it <i>should</i> give a new window into many-particle quantum behavior, with applications to chemistry, materials science, high-energy physics, and other fields.  For more see (e.g.) Sec. 6.9 in John&#8217;s survey, and references therein.</p>\n]]>", "author": "Scott", "published": "2018-01-12 09:54:52+00:00", "title": "By: Scott"}]