[{"content": "<![CDATA[<p>Oops, I left my university&#8217;s proxy in the fermionant link in comment #6.  Correct link is <a href=\"http://link.springer.com/chapter/10.1007%2F978-3-642-39053-1_10\" rel=\"nofollow\">here</a>.  Sorry about that.</p>\n]]>", "author": "Sniffnoy", "published": "2016-10-14 01:07:19+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Now, I&#8217;m wondering what the correct generalization is that encompasses both the λ-determinant and the immanant. Actually, it isn&#8217;t immediately obvious to me that the λ-determinant is not a subcase of the immanant. Is there some quick way of seeing that? The fact that the λ-determinant doesn&#8217;t contain the permanent of course shows that the reverse inclusion doesn&#8217;t occur.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2016-10-14 01:57:38+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>I’m inclined to consider seriously the view that the ‘mathematical realm’ is a real concrete place that exists *beneath* the physical level, and the mathematical realm is built from pure computation.  The idea would then be that what we think of as the physical world ‘emerges’ as a higher-level manifestation of mathematics.   </p>\n<p>This conception of mathematical realism differs substantially from Tegmark’s ‘mathematical multiverse’ or other philosophical views of mathematical realism such as Platonism that regard mathematical objects as timeless abstractions outside space-time.</p>\n<p>In my conception, mathematics is not timeless, it’s computation, and there is an arrow-of-time that exists for math just as there’s an arrow of time that exists for physics.   My idea is that we should *define* the cosmological arrow-of-time as the direction of increasing complexity.    So more complex math objects are built from simpler ones, and this hierarchical increase in complexity *defines* time, which I think is truly fundamental.</p>\n<p>I think there’s a mathematical hierarchy, and all of mathematics can be classified into 3 major levels of existence.   Here are my 3-levels of mathematical existence:</p>\n<p>(1)\tAt the base is ‘Theory of Computation’ – quantum computation at root.   So I think the mathematical realm is *equivalent* to the quantum realm.  It’s here (at the sub-physical level) that quantum wave-functions reside – they’re pure mathematical objects.</p>\n<p><a href=\"http://www.zarzuelazen.com/TheoryOfComputation.html\" rel=\"nofollow\">http://www.zarzuelazen.com/TheoryOfComputation.html</a></p>\n<p>(2)\tNext level up is ‘Algebra’ which I think is where integers live.   At this second level we are talking about functions and relations, which I think is about how the lower-level Turing machines interact.  On this level I would also locate matrices and groups, and I would classify combinatorics, graph theory and number theory as arising at this level.   </p>\n<p><a href=\"http://www.zarzuelazen.com/Algebra.html\" rel=\"nofollow\">http://www.zarzuelazen.com/Algebra.html</a></p>\n<p>(3)\tNext level up is ‘Analysis’ , and here we reach the level of the real numbers (the continuum).  Geometry and topology start to emerge at this level, so this is about calculus and related stuff.  I think complex numbers also live here.   At a high-enough level there’s a ‘phase transition’ and sufficiently complex geometrical structures start to be interpreted as ‘physical’.<br />\n               <a href=\"http://www.zarzuelazen.com/SetTheory&#038;Analysis.html\" rel=\"nofollow\">http://www.zarzuelazen.com/SetTheory&#038;Analysis.html</a></p>\n<p>Remember, I think the arrow-of-time is *defined* by the direction of increasing complexity as we move up the mathematical hierarchy.   Past level 3, the physical world emerges (the boundary between levels 3 and 4 is the phase transition between mathematics and physics).</p>\n<p>In my ontology, it really should come as no surprise that abstract mathematical properties such as ‘determinants’ and ‘permanents’ can be related to quantum properties and particle physics.  According to my scheme, the mathematical realm IS the quantum realm, and matrices are a high-level explanation of the way that Turing-machines interact (thus generating functions and relations).</p>\n]]>", "author": "mjgeddes", "published": "2016-10-14 05:59:23+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>Josh: I&#8217;m doubting there is one.  And the &lambda;-determinant is definitely not an immanent.  It&#8217;s not even a polynomial in the entries, it&#8217;s a Laurent polynomial in the entries!  Take a look at the 3&#215;3 case, for instance.  (Also, like, the fact that &lambda; is taken from the field you&#8217;re working over, rather than being a partition, would make it pretty hard for that to be workable even without that &#8212; especially, say, if the field were uncountable&#8230;)</p>\n<p>It&#8217;s not too hard to encompass both the immanent and the fermionant, though.  (Side note: I guess technically the 1-fermionant is (-1)^n times the permanent, rather than just the permanent.  That certainly doesn&#8217;t affect the complexity though.)  Consider immanents, but with irreducible characters replaced by general class functions; now you&#8217;ve included the fermionants as well.  I guess another way of describing that is &#8220;linear combinations of immanents&#8221;; so, fermionants are linear combinations of immanents.</p>\n<p>I dunno, I just brought up the &lambda;-determinant because I remembered seeing it once, but it doesn&#8217;t seem like it actually fits in very well here.</p>\n]]>", "author": "Sniffnoy", "published": "2016-10-14 15:14:37+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>(Please delete my previous comment &#8211; I accidentally pressed submit)</p>\n<p>Hi Scott,</p>\n<p>I too found myself reinventing a hidden variable theory without knowing that that’s what I was doing, in order to postulate classical transition probabilities of atomic states, so that we could make a slightly better semiclassical model. You might remember me emailing you ages ago to ask about some detail.</p>\n<p>My hidden variable theory was awful and limited, so it was great to discover yours, which was more general — I ended up using the Schrodinger theory.</p>\n<p>It&#8217;s not a paper yet (soon!) but here&#8217;s a poster about it if you are interested in what we&#8217;re using your work for:</p>\n<p><a href=\"https://www.researchgate.net/publication/285264301_Reproduction_of_Stern-Gerlach_separation_in_semiclassical_models_using_hidden_variables\" rel=\"nofollow\">https://www.researchgate.net/publication/285264301_Reproduction_of_Stern-Gerlach_separation_in_semiclassical_models_using_hidden_variables</a></p>\n<p>Cheers,</p>\n<p>Chris</p>\n]]>", "author": "Chris Billington", "published": "2016-10-15 18:02:34+00:00", "title": "By: Chris Billington"}, {"content": "<![CDATA[<p>@Sniffnoy#18 &#8221; Consider immanants, but with irreducible characters replaced by general class functions&#8221;<br />\nSure, but you have a sequence of these indexed by n (you want to define something for all n by n matrices), so without any restriction, you can smuggle anything into this setup, even uncomputible functions. You need some restrictions on the type of functions to bring it down into the complexity classes you&#8217;re interested in. For example you could require that your thingo-nant is in #P when restricted to permutation matrices, then extend it to square matrices in the natural way, and it should still be in #P (or something closely related depending on what kind of matrix elements you have). Then the question is, can you come up with anything that could plausibly be strictly between P and #P-complete (even if you couldn&#8217;t prove it, of course). My guess is the situation would still be like Scott#4, that a thingo-nant will almost always have a permanant lurking in there, or else be close to a determinant, but maybe you can tweak some parameters to be somewhere in between.</p>\n]]>", "author": "Another Trump Democrat", "published": "2016-10-15 20:07:24+00:00", "title": "By: Another Trump Democrat"}, {"content": "<![CDATA[<p>If $P=BPP$ can random self reducibility be replaced by something stronger? Please enlighten with references.</p>\n]]>", "author": "P=BPP", "published": "2016-10-16 08:13:03+00:00", "title": "By: P=BPP"}, {"content": "<![CDATA[<p>P=BPP #21: Interesting question but I <i>think</i> the answer is no.  Random self-reducibility is a black-box notion: you&#8217;re given a black box that computes (say) a #P-complete function on most inputs, and you need to correct it to compute the function on all inputs, in polynomial time and with a polynomial number of black-box calls.  Now, with a deterministic algorithm, you could always get unlucky and query your black box only on inputs where it errs.  And like most phenomena in randomized black-box complexity (as opposed to computational complexity), this one seems totally unaffected if P=BPP.</p>\n]]>", "author": "Scott", "published": "2016-10-16 08:53:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I&#8217;m sorry to write this but you ended up attracting some venom (tangentially related to the lecture). <a href=\"http://www.math.rutgers.edu/~zeilberg/Opinion155.html\" rel=\"nofollow\">http://www.math.rutgers.edu/~zeilberg/Opinion155.html</a></p>\n<p>On the other hand, it&#8217;s quite exciting and confusing to learn that apparently falsifiable, in real time with real experiments predictions are meaningless??</p>\n]]>", "author": "J", "published": "2016-10-16 21:14:50+00:00", "title": "By: J"}, {"content": "<![CDATA[<p>J #23: LOL!!  Is it, like, a sign you&#8217;ve made it in math or CS when Doron Zeilberger posts a diatribe against you?  I&#8217;d respond, were there arguments in that post to respond to.</p>\n]]>", "author": "Scott", "published": "2016-10-17 03:15:15+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>For NP complete problems approximation is straight forward. You have a certificate and you want to somehow approximate this certificate (for example you relax using semidefinite programming and so on). </p>\n<p>For #P complete problems it is less clear what the analogy is (except counting certificates)? Given this is there any other reason to believe Permanent has deterministic poly time approximation other than P=BPP? May be if there is another behind the scenes reason it should be worth looking into.</p>\n]]>", "author": "P=BPP", "published": "2016-10-17 06:01:49+00:00", "title": "By: P=BPP"}, {"content": "<![CDATA[<p>Re complexity of the lambda determinant: Computing it naively from the defining recursion requires O(n^3) arithmetic operations, so it is pretty efficient (over, say, the real or the rational numbers). </p>\n<p>One subtlety: Some of those operations are divisions, so in degenerate cases you may run into problems with dividing by 0. Jim Propp challenged me at one point to give an explicit way to work around the zeroes, analogous to the &#8220;zero window&#8221; algorithm in the number wall algorithm <a href=\"https://cs.uwaterloo.ca/journals/JIS/VOL4/LUNNON/numbwall10.html\" rel=\"nofollow\">https://cs.uwaterloo.ca/journals/JIS/VOL4/LUNNON/numbwall10.html</a> but I never responded to his challenge. </p>\n<p>Fomin, Grigoriev and Koshevoy <a href=\"https://arxiv.org/abs/1307.8425\" rel=\"nofollow\">https://arxiv.org/abs/1307.8425</a> have general results on how the arithmetic circuit length of a polynomial can change when you remove the division gate. I suspect there is an answer to your question buried in there if you read carefully.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Speyer:David.html\">David Speyer</a>", "published": "2016-10-17 13:26:52+00:00", "title": "By: David Speyer"}, {"content": "<![CDATA[<p>[&#8230;] happened was that I ran into Prof. Scott Aaronson&#8217;s latest blog post [^], which is actually a transcript of an informal talk he gave recently. The topic of this post [&#8230;]</p>\n]]>", "author": "Why is the physical space 3-dimensional? | Ajit Jadhav's Weblog", "published": "2016-10-17 15:35:05+00:00", "title": "By: Why is the physical space 3-dimensional? | Ajit Jadhav's Weblog"}, {"content": "<![CDATA[<p>&#8230;huh, I guess it is only O(n^3).  I didn&#8217;t even try checking the recursion for it, I just sort of assumed it had to be awful!  Well, I feel a bit foolish now.</p>\n<p>That seems really weird though.  Computing the determinant in polynomial time without ever doing a row-reduction.  I mean, it does have division in it, as you mention, so we&#8217;re not escaping that.  But it doesn&#8217;t have any branching &#8212; I suppose because rather than branching when it needs to divide by zero, it simply fails instead!</p>\n<p>So not quite an algorithm, then.  But if it&#8217;s O(n^3) generically it seems unlikely that a version that does handle general inputs would be significantly worse?</p>\n<p>Meanwhile the Fomin et al paper mentions that Strassen showed division can always be eliminated at polynomial cost, but of course that&#8217;s for polynomials (doesn&#8217;t really make sense otherwise, does it?), and this isn&#8217;t.  Annoying.</p>\n]]>", "author": "Sniffnoy", "published": "2016-10-17 17:33:31+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Re J #23: wow.  The surprising part of that post is where it says quantum computing is &#8220;a challenging intellectual mathematical game, but with empty content&#8221;, and even tries to invoke Gil Kalai for that.  That&#8217;s not what Gil Kalai said about quantum computing, right?</p>\n]]>", "author": "jonas", "published": "2016-10-17 18:07:49+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>jonas #29: Right, that&#8217;s not at all what Gil says&#8212;he imagines that the field is heading toward the enormously meaningful, contentful discovery that QC is impossible! 🙂  And while I think Gil is dead wrong about that, I respect him for at least correctly understanding (unlike other, less curious QC skeptics) what a revolutionary development in physics it would be to explain why QC is impossible.</p>\n<p>A second problem with Zeilberger&#8217;s post is that he acknowledges Turing&#8217;s undecidability theorem to be deep and important (&#8220;because it reveals statements previously thought to be meaningful to be meaningless,&#8221; in Zeilberger&#8217;s absurd worldview), but then says that all later results about undecidability are empty of content.  Here, it seems to me, Zeilberger simply isn&#8217;t following his own wrong logic correctly: he could also, for example, have celebrated my and Yedidia&#8217;s paper for proving that the question of the value of BB(8000) is &#8220;meaningless,&#8221; rather than &#8220;meaningful&#8221; as some people had mistakenly thought.</p>\n]]>", "author": "Scott", "published": "2016-10-17 18:23:42+00:00", "title": "By: Scott"}]