[{"content": "<![CDATA[<p>To repeat Koray&#8217;s question, what are examples of frameworks that are non-trivially explanatory yet not falsifiable.</p>\n]]>", "author": "Rahul", "published": "2014-01-22 10:25:50+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul #77: The entire field of quantum information could be said to make no falsifiable predictions apart from those of quantum mechanics itself.  Likewise for numerical relativity and GR, for combinatorial chemistry and basic quantum chemistry, etc.  In fact the USUAL situation in science is that we derive mathematical consequences from already-accepted theories in order to explain stuff; it&#8217;s RARE that explanation requires the invention of a whole new theory with new falsifiable content.  Of course, any experimental falsification of a mathematical consequence of a theory also falsifies the theory itself, so in that sense, one could say that we&#8217;re constantly generating new predictions!  (E.g., every quantum algorithm is a &#8220;prediction&#8221; that quantum mechanics is sufficiently true to enable you to implement that algorithm.)  But I didn&#8217;t think that sort of thing counted.</p>\n]]>", "author": "Scott", "published": "2014-01-22 12:17:11+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #78:</p>\n<p>If you succeeded some day in rapidly factoring a large number using a QC wouldn&#8217;t that count as a quantum information explanatory  success?  Or an accurately & quickly predicted heat of reaction for quantum chemistry (already possible)?</p>\n<p>Prior to the development of either field these non-trivial goals were not possible & hence I call them  explanatory & since it&#8217;s so possible to get both answers wrong I call them  falsifiable.</p>\n<p>Perhaps I&#8217;m not getting the nuance you are hinting at?</p>\n]]>", "author": "Rahul", "published": "2014-01-22 12:43:15+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul #79: The nuance you&#8217;re not getting is that, in all the examples I gave, once you accept certain postulates that were accepted prior to the framework in question, you&#8217;re <b>mathematically obligated</b> to accept the new consequences that the framework talks about.  So for example, it&#8217;s not as if Peter Shor said, &#8220;I have a new hypothesized description of how Nature behaves, and one way of checking whether my hypothesis is correct is to try to use such-and-such algorithm to factor a 10,000-digit number.&#8221;  Instead he said: &#8220;the ability to factor numbers efficiently is a <i>logical consequence</i> of such-and-such postulates, which physicists had implicitly or explicitly accepted for most of the 20th century.&#8221;  Thus, while it&#8217;s conceivable that Shor&#8217;s algorithm won&#8217;t physically work, its failure wouldn&#8217;t falsify the algorithm per se, but much more basic postulates that were already firmly in place by the time the explanatory framework of quantum information came on the scene.</p>\n]]>", "author": "Scott", "published": "2014-01-22 13:39:45+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #80:</p>\n<p>I see. Thanks! That does set the bar very high then.</p>\n<p>Maybe we should restrict the falsifiable & explanatory test to pure hypotheses rather than derivative frameworks. The latter (e.g. Shor&#8217;s) are a product of pure logic & an underlying hypothesis (say QM). Any fault would necessarily lie in the logic or the base hypothesis.</p>\n]]>", "author": "Rahul", "published": "2014-01-22 14:10:02+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>I&#8217;m sorry to be so dense, but I find the concept of explanatory frameworks that don&#8217;t predict anything quite puzzling.</p>\n<p>If a framework is by definition unfalsifiable, i.e. it fits the existing data perfectly and no other type of new data can be collected to test predictions, then it is more likely that it captures our limits in interacting with the system under study than that it is an explanation of the system itself. If you&#8217;re studying light waves using the human eye, you may develop an equation that models the eye so well that it describes how you get any data you can get, without actually being an explanation for light itself.</p>\n]]>", "author": "Koray", "published": "2014-01-22 22:00:17+00:00", "title": "By: Koray"}, {"content": "<![CDATA[<p>Koray #82: I wouldn&#8217;t call quantum information an explanatory framework, more of a consequential one. </p>\n<p>David Deutsch talks about the &#8220;reach&#8221; of explanatory variables, for example the reach of Newtonian gravity which predicted the existence of Neptune versus the Ptolemaic system which predicted nothing (that I know of anyway). </p>\n<p>Quantum information pushes the reach of quantum mechanics by predicting the existence of machines that could, for one, factor large integers in polynomial time. If it turns out it&#8217;s not possible then that will be anomoly like the perihelion of mercury, and hopefully we get some Einstein to figure out why.</p>\n]]>", "author": "danishcrows", "published": "2014-01-22 23:35:40+00:00", "title": "By: danishcrows"}, {"content": "<![CDATA[<p>Shannon&#8217;s information theory is a good example of a useful explanatory framework that is not empirically falsifiable. It is a piece of abstract mathematics whose abstractions happen to have an almost one-to-one correspondence to the real-world things it was intended to describe. I would nominate it as a candidate for the greatest piece of armchair theorizing in history.</p>\n<p>Drawing out the unexpected logical consequences (unexpected to boundedly rational humans) of firmly founded definitions, observations, and laws is a form of explanation. In some cases, just partitioning a system and describing &#8220;accounting identities&#8221; is a powerful form of explanation, although it&#8217;s a good idea to know which relationships are causal and which aren&#8217;t. For example, any country with a trade deficit in goods and services has an exactly equal surplus in its capital account and the inverse is true as well. Which of those imbalances causes the other in any specific instance is hard to prove, but it is definitely helpful to understand the identity in trying to come up with explanations.</p>\n]]>", "author": "srp", "published": "2014-01-23 01:28:38+00:00", "title": "By: srp"}, {"content": "<![CDATA[<p>An element that appears to be largely absent from the kindle version of Max Tegmark’s book, as well as ensuing discussions regarding the book, are the views of the Great Physicists on Physics:</p>\n<p>    Einstein wrote, “But before mankind could be ripe for a science which takes in the whole of reality, a second fundamental truth was needed, which only became common property among philosophers with the advent of Kepler and Galileo. Pure logical thinking cannot yield us any knowledge of the empirical world; all knowledge of reality starts from experience and ends in it. Propositions arrived at by purely logical means are completely empty as regards reality. Because Galileo saw this, and particularly because he drummed it into the scientific world, he is the father of modern physics—indeed, of modern science altogether.”</p>\n<p>    Max Planck stated, “Let us get down to bedrock facts. The beginning of every act of knowing, and therefore the starting-point of every science, must be our own personal experience.” Planck also stated, “That we do not construct the external world to suit our own ends in the pursuit of science, but that vice versa the external world forces itself upon our recognition with its own elemental power, is a point which ought to be categorically asserted again and again . . . From the fact that in studying the happenings of nature . . . it is clear that we always look for the basic thing behind the dependent thing, for what is absolute behind what is relative, for the reality behind the appearance and for what abides behind what is transitory. . this is characteristic not only of physical science but of all science.”</p>\n<p>    Einstein was adamant in his contention, “Truth is what stands the test of experience.” He stated thusly without ever having read Popper even.</p>\n<p>    Heisenberg would likely not have been a huge fan of the multiverse, writing, “Science. . . is based on personal experience, or on the experience of others, reliably reported. . . Even today we can still learn from Goethe . . . trusting that this reality will then also reflect the essence of things, the ‘one, the good, and the true.” Schrodinger agrees with Hesinberg, stipulating, “The world is given but once. . . The world extended in space and time is but our representation. Experience does not give us the slightest clue of its being anything besides that.”</p>\n<p>    Einstein warned us of metaphysics, “Time and again the passion for understanding has led to the illusion that man is able to comprehend the objective world rationally by pure thought without any empirical foundations—in short, by metaphysics.”</p>\n<p>    Regarding the infinite complexity of the never-seen strings/infinite multiverses, Einstein wrote, “Any intelligent fool can make things bigger, more complex, and more violent. It takes a touch of genius—and a lot of courage—to move in the opposite direction.”</p>\n<p>    Even though many would consider him dated, Sir Francis Bacon wrote, “And all depends on keeping the eye steadily fixed upon the facts of nature and so receiving their images simply as they are. For God forbid that we should give out a dream of our own imagination for a pattern of the world; rather may he graciously grant to us to write an apocalypse or true vision of the footsteps of the Creator imprinted on his creatures.”</p>\n<p>    The Great mathematician Poincare understood the difference between math and reality, “Geometry is not true, it is advantageous.” –Poincare</p>\n<p>    In Disturbing the Universe, Freeman Dyson writes, “Dick [Feynman] fought back against my skepticism, arguing that Einstein had failed because he stopped thinking in concrete physical images and became a manipulator of equations. I had to admit that was true. The great discoveries of Einstein’s earlier years were all based on direct physical intuition. Einstein’s later unified theories failed because they were only sets of equations without physical meaning. Dick’s sum-over-histories theory was in the spirit of the young Einstein, not of the old Einstein. It was solidly rooted in physical reality.” In The Trouble With Physics, Lee Smolin writes that Bohr was not a Feynman “shut up and calculate” physicist, and from the above Dyson quote, it appears that Feynman wasn’t either. Lee writes, “Mara Beller, a historian who has studied his [Bohr's] work in detail, points out that there was not a single calculation in his research notebooks, which were all verbal arguments and pictures.”</p>\n<p>    In his book Einstein, Banesh Hoffman and the great Michael Faraday exalt physical reality over mere math:</p>\n<p>    “Meanwhile, however, the English experimenter Michael Farady was making outstanding experimental discoveries in electricity and magnetism. Being largely self-taught and lacking mathematical facility, he could not interpret his results in the manner of Ampere. And this was fortunate, since it led to a revolution in science. . . most physicists adept at mathematics thought his concepts mathematically naïve.”</p>\n<p>    Finally, Einstein reminds us, “The most beautiful thing we can experience is the mysterious. It is the source of all true art and all science. He to whom this emotion is a stranger, who can no longer pause to wonder and stand rapt in awe, is as good as dead: his eyes are closed.”</p>\n<p>    And,</p>\n<p>    “The important thing is not to stop questioning.”</p>\n<p>    Well, the glaring question is, “Why are the greats being ignored?”</p>\n<p>    Einstein wrote, “When the solution is simple, God is answering.” Should we not be seeking simplicity?</p>\n<p>    Einstein reminds us that physics must begin and end in physical reality, “Albert Einstein: Before I enter upon a critique of mechanics as a foundation of physics, something of a broadly general nature will first have to be said concerning the points of view according to which it is possible to criticize physical theories at all. The first point of view is obvious: The theory must not contradict empirical facts. . . The second point of view is not concerned with the relation to the material of observation but with the premises of the theory itself, with what may briefly but vaguely be characterized as the “naturalness” or “logical simplicity” of the premises (of the basic concepts and of the relations between these which are taken as a basis). This point of view, an exact formulation of which meets with great difficulties, has played an important role in the selection and evaluation of theories since time immemorial.”</p>\n<p>    Please let us start welcoming Einstein et al. in our books and blogs. Thanks!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/McGucken:Dr=_Elliot.html\">Dr. Elliot McGucken</a>", "published": "2014-01-23 04:15:17+00:00", "title": "By: Dr. Elliot McGucken"}, {"content": "<![CDATA[<p>Dr. Elliot McGucken:</p>\n<p>Excellent points. Your question about if Feynman was a &#8220;Shut up and calculate&#8221; guy makes me wonder about my own idea of what SUAC means. </p>\n<p>I have never looked it up. I had assumed something like: You can calculate a lot of things with QM. Go ahead and calculate, and don&#8217;t worry about esoteric stuff such as what the wave function really is. Keep in mind that the calculations tend to be highly difficult and often require insightful simplifications, advanced math, powerful computers, years of work, and what not.</p>\n<p>With this picture, I assume Feynman is a SUAC guy. Either way, he liked to play drums.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-01-23 06:38:46+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Feynman was not a “shut up and calculate”  type. Actually he was a Popperian which is something of the opposite.</p>\n<p>I think some people are confused partly because of some negative comments by Feynman about philosophers. But Popper said similar too! Most philosophers are really bad. Knowing that is one of the steps to being a good philosopher.</p>\n<p>sources on Feynman being a Popperian: his IRL discussion with David Deutsch. Plus his books are a giveaway if you know what to look for, plus Wheeler would introduced Feynman to Popper if Feynman didn&#8217;t know yet (and being familiar with Popper plus having a very Popper-compatible worldview is what a Popperian *is*).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/t/Temple:Elliot.html\">Elliot Temple</a>", "published": "2014-01-23 07:46:06+00:00", "title": "By: Elliot Temple"}, {"content": "<![CDATA[<p>Whatever I&#8217;ve read about the <i>&#8220;negative comments by Feynman about philosophers&#8221;</i> they seem entirely justified. His critique was spot on for 99% of the profession or even about the sort of stuff that gets published as Philosophy.</p>\n]]>", "author": "Rahul", "published": "2014-01-23 08:49:48+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Elliott Temple (#87):</p>\n<p>The average level in all the disciplines I have some familiarity with is not that high, in the sense that most practitioners in the field don&#8217;t make groundbreaking contributions. The same goes for philosophy. However, I think it&#8217;s an exaggeration to say that most philosophers are &#8220;really bad.&#8221; Most philosophers I know are pretty careful and accurate thinkers, at least.</p>\n<p>Rahul (#88) </p>\n<p>Are you sure you are in a position to make pronouncements about 99% of philosophy? Philosophy is a big and diverse field. I study philosophy, but I don&#8217;t have anything like an overview of the field. I don&#8217;t even have an overview of my own area of specialization, which is philosophy of science.</p>\n]]>", "author": "Olav", "published": "2014-01-23 16:04:57+00:00", "title": "By: Olav"}, {"content": "<![CDATA[<p>Nex #9, Scott #23:</p>\n<p>&#8220;3. “Yes, I agree with you that because of chaos, the No-Cloning Theorem, or whatever else, human decisions might be fundamentally impossible to predict beyond some fixed accuracy, even in principle. &#8221;</p>\n<p>I was just reading what Feynman had to say about this  (<a href=\"http://www.feynmanlectures.info/docroot/III_02.html#Ch2-S6\" rel=\"nofollow\">http://www.feynmanlectures.info/docroot/III_02.html#Ch2-S6</a>)</p>\n<p>&#8220;Of course we must emphasize that classical physics is also indeterminate, in a sense. It is usually thought that this indeterminacy, that we cannot predict the future, is an important quantum-mechanical thing, and this is said to explain the behavior of the mind, feelings of free will, etc. But if the world were classical—if the laws of mechanics were classical—it is not quite obvious that the mind would not feel more or less the same.&#8221;</p>\n<p>&#8220;It is therefore not fair to say that from the apparent freedom and indeterminacy of the human mind, we should have realized that classical “deterministic” physics could not ever hope to understand it, and to welcome quantum mechanics as a release from a “completely mechanistic” universe. For already in classical mechanics there was indeterminability from a practical point of view.&#8221;</p>\n<p>( I believe Scott covers all this in details in <a href=\"http://arxiv.org/abs/1306.0159\" rel=\"nofollow\">http://arxiv.org/abs/1306.0159</a> )</p>\n]]>", "author": "Fred", "published": "2014-01-23 16:16:32+00:00", "title": "By: Fred"}, {"content": "<![CDATA[<p>Olav #89:</p>\n<p><i>&#8220;Are you sure you are in a position to make pronouncements about 99% of philosophy? Philosophy is a big and diverse field. I study philosophy, but I don’t have anything like an overview of the field.&#8221;</i></p>\n<p>Depends on if you believe in sample surveys. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" />  Do I have to visit every zoo & forest in the world to know 99% of tigers aren&#8217;t white tigers? </p>\n<p>In any case, I could be a horrid judge or my reading choices may suck but when someone of Feynman&#8217;s intellect opines on the matter it only strengthens my prior prejudices.</p>\n]]>", "author": "Rahul", "published": "2014-01-23 16:54:18+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Scott #80:</p>\n<p>Couldn&#8217;t we say that Shor made a refutable prediction, namely the prediction that one should get convinced that factoring is in BQP after scrutinizing at a certain piece of text which constitutes his proof?</p>\n]]>", "author": "Jay", "published": "2014-01-23 17:28:46+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>I completely agree with your view that there is something importantly right about falsifiability but that the idea needs to be expanded. An expansion that I think works well is this: an idea is not very useful if you cannot explain under what circumstances you would abandon it. So for example, I abandon the statement &#8220;unicorns exist&#8221; not because it has been falsified but because there are very good reasons to suppose that if unicorns existed then I would know about it, and there are historical reasons for the unicorn concept to have come into existence despite there not being any actual examples.</p>\n<p>This approach doesn&#8217;t work so well for mathematical statements, but even there one can say, &#8220;I would not have accepted this theorem if I had been made aware of a counterexample.&#8221; I believe that this makes sense even if the theorem has a proof. There may be no possible world where the theorem is false, but there is an &#8220;imaginable if you don&#8217;t explore every single logical consequence of everything&#8221; world where it is false, and that&#8217;s roughly what that hypothetical statement could be said to be referring to. </p>\n<p>I haven&#8217;t read through all the comments above, so apologies if I&#8217;m simply repeating what someone else has said.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gowers:Timothy.html\">Timothy Gowers</a>", "published": "2014-01-23 17:39:01+00:00", "title": "By: Timothy Gowers"}, {"content": "<![CDATA[<p><i>&#8220;&#8230;an idea is not very useful if you cannot explain under what circumstances you would abandon it.&#8221;</i></p>\n<p>I&#8217;d love to hear from String Theory fans the answer to this question.</p>\n]]>", "author": "Rahul", "published": "2014-01-23 17:42:05+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Scott #42<br />\n&#8220;“Mathematical Universe Hypothesis” to be devoid of content.&#8221;</p>\n<p>I would agree, but I&#8217;ve been having some thought experiment about this (sorry for the long rambling).</p>\n<p>&#8220;Hypothesis&#8221; 1)<br />\nThe irreducible essence of reality is our own consciousness, i.e. &#8220;I think therefore I am&#8221;. The fundamental building block of our reality is the &#8220;I&#8221;.<br />\nWhat we label as the &#8220;physical&#8221; aspect of reality (as opposed to &#8220;mathematical&#8221;) and that we take for granted as the building block of reality is really a construction of the mind (we do not have direct access to the true nature of elementary particles, fields, etc).</p>\n<p>Imagine I ask you to close your eyes, plug your ears, and think for 10 seconds about someone very dear that you have lost (generating some self-contained strong emotion).<br />\nLet&#8217;s say we somehow measure very precisely the initial state of your brain at the start of the experiment, to some reasonably good approximation, good enough so that we could simulate all the neurons in your brain and their evolution for the next 10 seconds with good precision (we can have measured the state of your brain after 10 seconds and compare it with the simulation to see indeed that the final states are arbitrarily similar).<br />\nThat simulation is run on a powerful computer &#8211; it doesn&#8217;t have to be done “real-time” since there is no input/output (the brain was taken as a closed system for the duration of the experiment).</p>\n<p>&#8220;Hypothesis&#8221; 2)<br />\nThis simulation of your brain for 10 seconds is in itself totally equivalent to your consciousness for that amount of time.<br />\nIt might not be exactly the same quantitatively (because we can&#8217;t predict things for long before chaos takes over and the simulation eventually diverges), but it&#8217;s qualitatively the same. I.e. it&#8217;s a valid implementation of an irreducible building block of 1). It &#8220;feels&#8221; just the same way you &#8220;felt&#8221;.<br />\nThis hypothesis can&#8217;t be verified (ok, so it’s not science), just like no-one could ever prove to you that they&#8217;re conscious in the same way you are (which in a way would tend to validate the fact that it&#8217;s a fundamental building block).<br />\nBut, assuming the hypothesis is true, at what moment is this alternative consciousness &#8220;realized&#8221;? Is the question even meaningful? (but we can ask the same question about our own mind in our &#8220;wet&#8221; brain)<br />\nIs it realized during each iteration of the computation cycle (with a delta time granular enough so that enough states are computed to make it evolve similarly to the real brain, say, one micro-second)?<br />\nIs it realized when the state is somewhat updated in the RAM? When the CPU computes the next state?<br />\nWhat if the &#8220;computation&#8221; was done slowly by hand, following rules (themselves possibly part of the state), and writing down each incremental state on sheets of papers?<br />\nWhen is the consciousness realized? When we write down each new state on paper?<br />\nSince the brain is finite, it has a finite state with a finite number of possible values, in theory we could map each state to a very long integer (therefore it&#8217;s not really an algorithm/computation that has to work on an infinite domain, it can be done as a lookup). Each iteration is simply picking the next integer and the whole process is equivalent to extracting a subset of integers. When is the consciousness realized in this case? Each time you &#8220;pick&#8221; a integer?<br />\nIs the act of picking an integer even necessary to realize the consciousness?<br />\nDo we need to do anything at all?<br />\nIsn&#8217;t every possible &#8220;realized&#8221; consciousness (you, me, the simulation) and its associated “world view” then nothing more and nothing less than a pure mathematical pattern, i.e. a subset of the natural numbers, that always was and always will be?<br />\nThis seems to suggest that the possibility of simulating consciousness would be an indication that the essence of reality is mathematical and that physical objects are derived on top of it.<br />\n(okay, I stop here, sorry again for the rambling)</p>\n]]>", "author": "Fred", "published": "2014-01-23 17:44:16+00:00", "title": "By: Fred"}, {"content": "<![CDATA[<p>Timothy #93: Thanks for your comment, which was very well put!  I think my criterion is a special case of yours: if you say that every idea needs to &#8220;pull its explanatory weight&#8221; in accounting for our observations, then in particular, you&#8217;re committing to abandoning your favorite idea once someone can reproduce the same explanatory successes (or lack of successes&#8230;) in a simpler way that bypasses the idea.</p>\n]]>", "author": "Scott", "published": "2014-01-23 18:01:06+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Jay #92:</p>\n<ul>Couldn’t we say that Shor made a refutable prediction, namely the prediction that one should get convinced that factoring is in BQP after scrutinizing at a certain piece of text which constitutes his proof?</ul>\n<p>We could <i>say</i> it, but (it seems to me) only by stretching the meaning of &#8220;refutable prediction&#8221; far beyond where it&#8217;s useful.  We might as well say that anyone who proposes an experiment and predicts its outcome is really &#8220;proving a theorem&#8221;: namely, the theorem that such-and-such would be the outcome of the experiment if Nature were described by such-and-such mathematical model.</p>\n]]>", "author": "Scott", "published": "2014-01-23 18:27:50+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Well, it&#8217;s not different from saying that the concept of falsifiability needs to be expanded to mathematical activity.</p>\n<p>For the converse idea, unicity would be a big problem.</p>\n<p><a href=\"http://www.smbc-comics.com/comics/20140104.png\" rel=\"nofollow\">http://www.smbc-comics.com/comics/20140104.png</a></p>\n]]>", "author": "Jay", "published": "2014-01-23 18:47:48+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Scott #5</p>\n<p>As an example of Kuhnian misunderstanding, maybe your discussion with RJ Lipton about whether factoring was proven in BQP would count. I don&#8217;t understand RJ Lipton point enough to be sure, but I had a strong Kuhnian feeling reading this post.</p>\n]]>", "author": "Jay", "published": "2014-01-23 19:01:12+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Rahul #91</p>\n<p>I believe in sample surveys if they&#8217;re unbiased. But philosophy, like other disciplines, has a bunch of sub-communities working in relative isolation. Any sampling you do is likely to be biased towards sub-communities whose work you&#8217;ve heard about through friends or acquaintances. For instance, even though I specialize in philosophy of science in one of the main departments for philosophy of science in the US, I&#8217;ve never read either Feyerabend or Kuhn. </p>\n<p>And with due respect, unless you&#8217;ve invested serious time and effort into philosophy, I don&#8217;t really think you are qualified to judge the field even if your sampling of it is fair. The same goes for Feynman, of whom I&#8217;m a big fan. Academics have a bad tendency to denigrate other academic fields whose goals and methods they haven&#8217;t actually taken the time to try to understand and appreciate (philosophers do this a lot too). </p>\n<p>Of course, it&#8217;s possible to invest a lot of time and effort into understanding a field and then at the end conclude that it&#8217;s worthless. But if you are in that position, I think the more reasonable and humble thing to say is (in most cases), &#8220;that field is not for me,&#8221; not &#8220;99% of that field is crap.&#8221;</p>\n]]>", "author": "Olav", "published": "2014-01-23 19:09:13+00:00", "title": "By: Olav"}, {"content": "<![CDATA[<p>Jay #99: No, I don&#8217;t think that was a Kuhnian misunderstanding, just a regular, ordinary misunderstanding (on his part)! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" />   Indeed, Dick seemed to agree in <a href=\"http://rjlipton.wordpress.com/2011/01/25/factoring-is-in-bqp/\" rel=\"nofollow\">this followup post</a>.</p>\n]]>", "author": "Scott", "published": "2014-01-23 19:11:11+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Thanks, but this followup is precisely why I thought this story was very Kuhnian. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />  </p>\n<p>Look what happened: at the end you&#8217;re still in disagrement. On one side you still think he made [just a regular, ordinary misunderstanding], on his part he still think an extended proof would be required [I do agree the comments together have answered the issue, but I would humbly suggest that someone write down a short sketch of the proof so all can see it.]. </p>\n<p>So as a Kuhnian one can make the prediction that you will never understand the real reasons for Lipton&#8217;s post, nor Lipton will understand why you don&#8217;t see the problem he sees. </p>\n<p>Ok, this is not that usefull, and maybe just wrong after all. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Jay", "published": "2014-01-23 19:43:58+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Jay #102: But look what happened.  On the ground-level issue, Dick Lipton did <i>not</i> remain in perpetual disagreement with the quantum computing community.  His paradigm turned out <i>not</i> to be incommensurable with our paradigm.  Instead, like the honest scientist he is, Dick changed his mind after a few days of discussion: &#8220;well gosh, I guess factoring <i>is</i> in BQP after all!  I guess the experts who kept insisting it was in BQP <i>weren&#8217;t</i> total doodyheads!  sure, most textbook expositions might skip a few standard steps, but those steps <i>can</i> be spelled out, just as the experts said&#8230;&#8221; <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Scott", "published": "2014-01-23 19:55:38+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I dunno about Shannon&#8217;s information theory being not falsifiable; the limit on communications channel capacity is akin to the second law of thermodynamics.</p>\n]]>", "author": "Arun", "published": "2014-01-23 20:10:56+00:00", "title": "By: Arun"}, {"content": "<![CDATA[<p>In his original post Lipton listed three possible situations:</p>\n<p>1.  The proof is correct and we are just confused.<br />\n2. We are right, but. (&#8230;) all quantum experts are aware of how to fix it. (&#8230;)<br />\n3. (&#8230;) There really is a missing argument here. </p>\n<p>Of course what really matters is to exclude 3. But you take his followup blog as he thinks the situation was 1. I take his followup blog as he thinks the situation was 2. </p>\n<p>The difference might seems unimportant, and in a sense it doesn&#8217;t matter. But if you want to understand why others don&#8217;t automatically accept some proofs (especially the proofs that seems obvious to your eyes), then all Kuhn says is there&#8217;s frequently more to say than &#8220;they are just confused&#8221;. Yes if you wish, but what makes these kind of bright minds confused? Is it possible there are situations I am confused myself for the same reason?</p>\n]]>", "author": "Jay", "published": "2014-01-23 20:17:12+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Olav #100</p>\n<p>Out of random curiosity, what authors are you required to read in your program?</p>\n]]>", "author": "Jay", "published": "2014-01-23 20:41:45+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Jay #100</p>\n<p>There are no required authors, really. But if you have an interest in the philosophy of science, I&#8217;d say it&#8217;s hard to get through this program without being exposed to at least the following people at some point: van Fraassen, Reichenbach, Carnap, Elliott Sober, Judea Pearl, Hilary Putnam&#8230; That&#8217;s just off the top of my head.</p>\n]]>", "author": "Olav", "published": "2014-01-23 22:45:03+00:00", "title": "By: Olav"}, {"content": "<![CDATA[<p>Thx Olav.</p>\n]]>", "author": "Jay", "published": "2014-01-24 00:17:18+00:00", "title": "By: Jay"}]