[{"content": "<![CDATA[<p>The paper is fundamentally flawed because its assumption that one can assemble a group of agents who all agree on how to apply QM isn&#8217;t a given at all&#8230; haha.</p>\n]]>", "author": "fred", "published": "2018-10-01 16:58:18+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>David #84:</p>\n<p>Next to my random number generator that determines which blogs I should comment (see #48) I have an even more elaborate device that tells me which ones I should not even read. 🙂</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Renner:Renato.html\">Renato Renner</a>", "published": "2018-10-01 17:36:34+00:00", "title": "By: Renato Renner"}, {"content": "<![CDATA[<p>fred #86</p>\n<p>&#8221;   So, if the “alive” version of a Shrodinger’s Cat that’s in the isolated box happens to measure a qubit, it (the collapse) “affects” all observers outside the box, so a measurement is a “universal”/”absolute” event?   &#8221;</p>\n<p>It isn&#8217;t clear what precisely you are asking here. But OK first of all the cat interacts with a qubit. It does not matter if the cat is dead or alive when it does so. In order for that interaction to affect observers outside the box it has to be outside the box and that is exactly what the box is intended to prevent. </p>\n<p>The cat is constantly interacting with qubits inside the box. After all the whole point is to have the cat interact with an unstable particle (qubit) in order to place itself into superposition.</p>\n<p>And wave collapse is not universal. We view the cat as being in superposition. But from the cat&#8217;s point of view we may be in superposition. In order for us and the cat to agree there must be information flow across the walls of the box.</p>\n<p>Think of wave collapse as a very bad social disease. Any contact at all and you spread the cooties. The box protects the cat from our cooties. And protects us from the cat&#8217;s.</p>\n]]>", "author": "ppnl", "published": "2018-10-01 17:50:47+00:00", "title": "By: ppnl"}, {"content": "<![CDATA[<p>Jochen #87:</p>\n<p>If r=tails then, according to the protocol, agent \\bar{F} must prepare the state as “spin right”. The Born rule is then applied to this state. So, I do not think anything about “state collapses” needs to be assumed here. (Agent \\bar{F}&#8217;s conclusion is of course only correct if one knows that she indeed saw r=tails. But this is taken into account in the chain of reasoning; see in particular the second row of Table 3, i.e., agent F’s reasoning.)</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Renner:Renato.html\">Renato Renner</a>", "published": "2018-10-01 18:12:18+00:00", "title": "By: Renato Renner"}, {"content": "<![CDATA[<p>&#8221;<br />\n2. Whenever Diane is in the |1〉 state, she knows that Charlie must be in the |0〉 state (since there’s no |11〉 component).<br />\n3. Whenever Charlie is in the |0〉state, she knows that Diane is in the |+〉 state<br />\n&#8221;</p>\n<p>As I see it, this is already a contradiction &#8211; Diane in the |1〉state knows that Charlie knows that Diane is in the |+〉state.</p>\n<p>I think the problem here is that Diane&#8217;s &#8220;discovery of herself&#8221; is a measurement with the result unknown to Charlie. But if Charlie knows how Diane measure herself (that is in {|0〉,|1〉} basis) she can update her beliefs from |+〉to a mixed state of |0〉and |1〉. This mixed state is still not equal to |1〉but this discrepancy is justifiable.</p>\n<p>Anyway, this whole thing is very &#8220;thought-provoking&#8221;. Thank you for awesome exposition!</p>\n]]>", "author": "Dandan", "published": "2018-10-01 19:12:40+00:00", "title": "By: Dandan"}, {"content": "<![CDATA[<p>Andrei #81:</p>\n<p>&#8221;   Let’s assume that the quantum world is actually described by a classical, local, field theory. &#8221;</p>\n<p>That would mean that any supposed quantum computer would actually be a classical computer right?</p>\n<p>If they develop large scale quantum computers that give exponential speed up over classical computers would that disprove super-determinism?</p>\n]]>", "author": "ppnl", "published": "2018-10-01 19:16:31+00:00", "title": "By: ppnl"}, {"content": "<![CDATA[<p>#89 seems wise&#8230;</p>\n]]>", "author": "Brad DeLong", "published": "2018-10-01 19:55:21+00:00", "title": "By: Brad DeLong"}, {"content": "<![CDATA[<p>Renato Renner #91:<br />\n&#8220;So, I do not think anything about “state collapses” needs to be assumed here.&#8221;</p>\n<p>Well, the thing is, \\bar{F} can reason through the setup in exactly the way we can, to derive that \\bar{W} will get the fail-result. And it seems to me that they must know that this is what occurs, in the same way that Wigner&#8217;s original friend must know that a suitable experiment performed on their entire lab will show interference. It wouldn&#8217;t do to claim that, since the friend observed a certain outcome, they must now predict the non-existence of interference in such an experiment.</p>\n<p>But then, by the same token, it seems to me that \\bar{F} ought to reason that the state from the point of view of \\bar{W} has components |h>|-1/2>, |t>|1/2>, and |t>|-1/2>, which after W&#8217;s measurement is projected onto |OK>|1/2>, which is an equal superposition of |h>|1/2> and |t>|1/2> (see my comment #73 above). Consequently, \\bar{F} shouldn&#8217;t predict the fail-outcome.</p>\n<p>They should only predict &#8216;fail&#8217; if the state is equal to |-1/2> + |1/2> to \\bar{W}&#8212;but it&#8217;s not, and \\bar{F} knows this.</p>\n]]>", "author": "Jochen", "published": "2018-10-01 20:05:28+00:00", "title": "By: Jochen"}, {"content": "<![CDATA[<p>&#8220;Well, the thing is, \\bar{F} can reason through the setup in exactly the way we can, to derive that \\bar{W} will get the fail-result.&#8221;</p>\n<p>This was supposed to be &#8220;&#8230;may get the OK-result&#8221;.</p>\n]]>", "author": "Jochen", "published": "2018-10-01 20:29:45+00:00", "title": "By: Jochen"}, {"content": "<![CDATA[<p>With apologies to Tim Hardin, crossing over to the silly side:</p>\n<p>If I were a particle,<br />\nand you were a wavelet,<br />\nwould you measure me any way,<br />\nwould you be my A-gent?</p>\n<p>If entanglement was my trade<br />\nWould you still find me<br />\nCarryin&#8217; the charge I gave<br />\nin our Feynman diagram</p>\n]]>", "author": "sf", "published": "2018-10-01 20:39:45+00:00", "title": "By: sf"}, {"content": "<![CDATA[<p>It seems to me that the authors of the paper have failed to include, in their list of assumptions, the crucial one: that one who observes a measured value may conclude that the state, after measurement, is an eigenstate corresponding to that value. Without this, the first line of Table 3 in the paper is clearly wrong: when agent Fbar measures r=tails, he has no right to treat the right-polarized atom he is sending as &#8220;the true state&#8221;, and use that to make predictions about what W will measure. He knows perfectly well that his other self, who measured r=heads, is sending a down-polarized atom, which may affect W&#8217;s result. This reasoning by Fbar only makes sense with what amounts to a collapse assumption. Of course this contradicts the assumption that QM can be applied to systems that include observers.</p>\n<p>On the other hand, Fbar is justified, without additional assumptions, to conclude that &#8220;if I ever see W&#8217;s result, it will be w=fail&#8221;. Making predictions from one&#8217;s observations to one&#8217;s own future observations must be valid in all interpretations, although the justification may vary. But here, What&#8217;s measurement ruins the prediction: by Hadamarding Fbar&#8217;s brain, he makes it impossible for any continuously-aware version of Fbar to become aware of W&#8217;s result. Therefore there is no problem if W in fact measures w=ok.</p>\n]]>", "author": "Ahron Maline", "published": "2018-10-02 01:56:35+00:00", "title": "By: Ahron Maline"}, {"content": "<![CDATA[<p>ppnl #93 October:</p>\n<p>&#8220;If they develop large scale quantum computers that give exponential speed up over classical computers would that disprove super-determinism?&#8221;</p>\n<p>Not at all. The purpose of superdeterminism is to provide a local explanation for QM, not to deny QM. So, if faster computers are possible according to QM they would be just as possible according to a superdeterminist interpretation of QM.</p>\n<p>Sure, such computers would be classical computers, but they would be a different kind of classical computers because they would make use of a different classical effect, entanglement. An electric engine and a petrol engine are both classical but they need not have the same performance.</p>\n]]>", "author": "Andrei", "published": "2018-10-02 04:13:25+00:00", "title": "By: Andrei"}, {"content": "<![CDATA[<p>Andrei #81:</p>\n<p>The objective Bayesian interpretation derives the probabilities from the available information. So, it forces us to accept 1/6 if we have no information which makes a difference between the six outcomes.  So, even if we know the dice is faked, as long as we don&#8217;t know in which direction it is faked, 1/6 remains the only rational choice. </p>\n<p>Your argument (2) presupposes some reality to probabilities, following the frequency interpretation. But this is not what matters in the logic of plausible reasoning. The point there is logical consistency, and the available information.  So, if you don&#8217;t use 1/6 for everything, you get a different distribution if you simply use different numbers &#8211; but your information remains unchanged, thus, your probabilities should remain unchanged too.  </p>\n<p>(1) has essentially the same problem.  Your proof (3) fails: &#8220;Not only we do not know if a measurement at one location has an instantaneous effect at another, distant location, but everything we know about physics seems to preclude such a behavior.&#8221;  Sorry, no, we have a theorem that without such instantaneous influence we would have Bell&#8217;s inequality.</p>\n]]>", "author": "Schmelzer", "published": "2018-10-02 07:20:08+00:00", "title": "By: Schmelzer"}, {"content": "<![CDATA[<p>Renato Renner #83:</p>\n<p>So, dBB in your version gives a consistent trajectory, without counterfactual reasoning. </p>\n<p>Where is the inconsistency, then?  It appears in the reasoning of Alice thinking that w≠ok. She is reasoning about a counterfactual experiment &#8211; one where Charlie does not measure anything, and therefore does not distort Bob&#8217;s state.</p>\n]]>", "author": "Schmelzer", "published": "2018-10-02 07:29:27+00:00", "title": "By: Schmelzer"}, {"content": "<![CDATA[<p>Andrei #99: You&#8217;ve given the logical and correct answer to the question, but that&#8217;s different from the answer that the &#8220;chief superdeterminist,&#8221; Gerard &#8216;t Hooft, gives!  &#8216;t Hooft is on record predicting that it will never be possible to build a quantum computer that outperforms a classical computer, because of the classical cellular automaton that he believes underlies Nature.  On the other hand, he also believes that this CA is able to account for the Bell inequality violations, because superdeterminism!  So I&#8217;ve always wondered: why doesn&#8217;t &#8216;t Hooft point out that superdeterminism could just as easily account for the successful running of Shor&#8217;s algorithm (as, in fact, it could account for anything whatsoever)?</p>\n]]>", "author": "Scott", "published": "2018-10-02 07:44:42+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Schmelzer #100:</p>\n<p>&#8221; So, even if we know the dice is faked, as long as we don’t know in which direction it is faked, 1/6 remains the only rational choice.&#8221;</p>\n<p>This is only true for a single run. If you throw the dice only once you could ascribe equal probability. But if you repeat the experiment many times the equal probability assumption is a certain looser for a loaded dice. Given the fact that a Bell test comprises many measurements we are not in the single-run case. So, the reasonable assumption is that the hidden variable and the settings of the detectors are not independent parameters.</p>\n<p>&#8220;(1) has essentially the same problem.&#8221;</p>\n<p>I do not understand your point here. In 1 I have provided evidence that a field theory such as classical electromagnetism implies that the &#8220;dice is loaded&#8221;, in other words, such theories are superdeterministic, according to Bell&#8217;s definition. This is about the mathematical structure of the theory, not about prior probabilities.</p>\n<p>&#8220;Your proof (3) fails: “Not only we do not know if a measurement at one location has an instantaneous effect at another, distant location, but everything we know about physics seems to preclude such a behavior.” Sorry, no, we have a theorem that without such instantaneous influence we would have Bell’s inequality.&#8221;</p>\n<p>You are just proving my point here, about begging the question. Bell&#8217;s theorem does not prove the existence of an instantaneous influence. It allows you to choose between such an influence and superdeterminism. So, what you need to prove here is that taking the non-local option is much more reasonable than the superdeterminist option. With 0 evidence for non-local influences (outside the issue of entanglement which is the subject of our debate) and plenty evidence for physical systems that are not independent of each other your job is quite difficult.</p>\n]]>", "author": "Andrei", "published": "2018-10-02 08:40:37+00:00", "title": "By: Andrei"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>The exact quote of &#8216;t Hooft is (from his paper, The Cellular Automaton Interpretation<br />\nof Quantum Mechanics):</p>\n<p>&#8220;Yes, by making good use of quantum features, it will be possible in principle, to build a computer vastly superior to conventional computers, but no, these will not be able to function better than a classical computer would do, if its memory sites would be scaled down to one per Planckian volume element (or, in view of the holographic principle, one memory site per Planckian surface element), and if its processing speed would increase accordingly, typically one operation per Planckian time unit of 10−43 seconds.&#8221;</p>\n<p>So, he is not saying that it &#8220;will never be possible to build a quantum computer that outperforms a classical computer&#8221;, but it will never be possible to outperform a Planck-classical computer. It seems to me that his view is not necessitated by a classical foundation of QM but by the discrete structure of space and time of the CA. A continuous space-time background would not impose any such limitation, so, a classical computer could be equivalent to a quantum one.</p>\n]]>", "author": "Andrei", "published": "2018-10-02 10:36:32+00:00", "title": "By: Andrei"}, {"content": "<![CDATA[<p>Ahron Maine #98:<br />\n&#8220;when agent Fbar measures r=tails, he has no right to treat the right-polarized atom he is sending as “the true state”, and use that to make predictions about what W will measure.&#8221;</p>\n<p>Yes, this is what worries me, too. It strikes me as being akin to Wigner&#8217;s friend concluding that there won&#8217;t be any interference if an experiment is performed on the whole lab, where at most they can say that they don&#8217;t know.</p>\n<p>It doesn&#8217;t strike me as that different from the question of whether two events are simultaneous in special relativity: just that they are to you doesn&#8217;t necessarily mean that they are to every observer. In fact, the notion is meaningless without specifying a frame of reference. </p>\n<p>In the same way, &#8216;the state&#8217; of a quantum may differ according to different observers, and you can&#8217;t generally assume that the state you assign to a system is assigned to it by every observer. In particular, this seems to be the case with systems including you as a proper part.</p>\n<p>Wigner&#8217;s friend can&#8217;t decide whether Winger will observe interference, as this depends on whether they measured a system in an eigenstate of the measurement, or in a superposition. Likewise, \\bar{F} can&#8217;t decide the outcome of \\bar{W}&#8217;s measurement, as this, too, depends on whether the coin was in an eigenstate of &#8216;tails&#8217; or in the superposition specified in the paper. Given the knowledge of the initial state, however, they should conclude that \\bar{W} may observe either outcome.</p>\n]]>", "author": "Jochen", "published": "2018-10-02 12:06:39+00:00", "title": "By: Jochen"}, {"content": "<![CDATA[<p>Scott #102</p>\n<p>&#8220;because of the classical cellular automaton that he believes underlies Nature.&#8221;</p>\n<p>It&#8217;s the same idea that Wolfram had, right?</p>\n<p>While those ideas may be flawed, the real issue is that no-one has any robust theory for what&#8217;s going on at the Planck scale, no?<br />\nI.e. coming up with a discrete structure (made of &#8220;cells&#8221;) for space and time that&#8217;s also fitting special and general relativity?<br />\n(I don&#8217;t know enough about string theory to tell if it solves this).</p>\n]]>", "author": "fred", "published": "2018-10-02 12:49:29+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>About quantum supremacy and whether the universe is actually a simulation or not (whether an actual QC or a classical computer simulating a QC really poorly).</p>\n<p>Both &#8220;classical&#8221; and &#8220;quantum&#8221; computers are digital machines, i.e. reality is described as numbers. </p>\n<p>But reality itself appears analog (until we know WTF is going on at the Planck scale) and magically super-hyper-parallel.</p>\n<p>Reality doesn&#8217;t seem to care or struggle to make stuff happen at various scales (from super clusters of galaxies down to the proton), while digital machines need more and more resources to manipulate things consistently at both small scales and large scales.</p>\n<p>Reality doesn&#8217;t seem to care whether it&#8217;s solving a two-body problem or a trillion-trillion-body problem, it doesn&#8217;t need to pretend there such a thing as &#8220;isolated systems&#8221; to make things happen &#8211; every point in space sees the superposition of all the fields (gravity, EM) created by all the particles in the visible universe, no compromise (but apparently that&#8217;s still not enough information flowing in a given point of space to cause black holes to spontaneously appear? :P)</p>\n]]>", "author": "fred", "published": "2018-10-02 13:20:33+00:00", "title": "By: fred"}]