[{"content": "<![CDATA[<p>Prussian #194</p>\n<p>Without getting into your debate with Scott, I only want to say that I agree 100% with this,</p>\n<p>&#8220;Okay, so what group has the supreme insight into reality? Some said “the race” and became fascists, other said “class” and became commies. &#8221;</p>\n<p>I never understood the &#8220;fake distinction&#8221; some -particularly in American academia- want to make between nazism and communism given that I always saw both ideologies as believing that &#8220;group insights&#8221; -as you call them- trumping individual dignity and rights.</p>\n<p>My opposition to statism has always been driven by my belief that the notion that &#8220;group insights&#8221; trump the individual is intrinsically evil. I always found the belief that some form of tribalism (like communism) is better than others (nazism) extremely naive. My own belief that the best government is small and focused on areas like national defense and administration of justice comes also from that realization. Again, James Madison had similar insights in Federalist Paper #10.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2018-04-04 15:10:27+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Prussian #194: Aw, c&#8217;mon.  Those strike me as standards of argument by which anyone, via a game of intellectual Telephone, could connect <i>anything</i> that they disliked or considered irrational to (as the kids say) &#8220;literally Hitler.&#8221;  Indeed, Whittaker Chambers, not exactly a bleeding-heart liberal, <a href=\"https://www.nationalreview.com/2005/01/big-sister-watching-you-whittaker-chambers/\" rel=\"nofollow\">famously remarked</a> of Rand&#8217;s own masterwork:</p>\n<ul>From almost any page of <i>Atlas Shrugged</i>, a voice can be heard, from painful necessity, commanding: “To a gas chamber&#8212;go!”</ul>\n<p>This is surely unfair, but is it <i>more</i> unfair than what Peikoff does to Kant?  Like, I&#8217;m no one&#8217;s idea of an SJW, but for what it&#8217;s worth, I read <i>Atlas</i> too, and the pure, unrelenting vituperation against everyone Rand hated (the freeloaders, the moochers, the &#8220;limp&#8221; and &#8220;petulant&#8221; and &#8220;shapeless&#8221;) screamed at me for a thousand pages, and gave me the queasy feeling that I wasn&#8217;t sure whether Rand wanted a large part of humanity to go on living, but was grateful that the question was never put to the test.</p>\n<p>More to the point: I haven&#8217;t studied Kant enough to express a strong view about the &#8220;noumenal vs. phenomenal&#8221; business.  Like, there&#8217;s one sense in which it&#8217;s clearly <b>true</b> that &#8220;I only see the computer as filtered through my eyes&#8221;; there&#8217;s another sense in which even my flawed eyes clearly do give me data about a real computer that exists in external reality; both senses seem reasonably obvious to a narrow, scientistic philistine like me 🙂 ; and I&#8217;d probably have to plow through hundreds of dense pages before I could form any considered opinion about whether Kant said anything about any of this that struck me as either wrong or surprising.</p>\n<p>OK, but suppose we fully grant the premise that everything Kant had to say about the matter was pernicious garbage.  Even then, he &#8220;kant&#8221; possibly have been the <i>first</i> influential philosopher to have defended absurd theses about epistemology or metaphysics!  Yet somehow science and technology, and the general arc of human moral progress (e.g., the abolition of slavery), soldiered on despite &#8220;someone being wrong in a philosophy book.&#8221;  I think those processes are more robust than Rand and Peikoff give them credit for.</p>\n<p>And if any philosophers are to be blamed for Nazism, then at the least I&#8217;d like them to be philosophers who clearly, explicitly took up the cause of violence and hatred&#8212;like Nietzsche, or Heidegger.  With such great choices available, why reach for anyone guilty of less? 🙂</p>\n]]>", "author": "Scott", "published": "2018-04-04 20:07:21+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Three quotes from Pinker&#8217;s Chapter 23 I find problematic:</p>\n<blockquote><p>Correlation is not causation, but if you combine the fact that much of Islamic doctrine is antihumanistic with the fact that many Muslims believe that Islamic doctrine is inerrant—and throw in the fact that the Muslims who carry out illiberal policies and violent acts say they are doing it because they are following those doctrines—then it becomes a stretch to say that the inhumane practices have nothing to do with religious devotion and that the real cause is oil, colonialism, Islamophobia, Orientalism, or Zionism.</p></blockquote>\n<p>A Pentagon study from 2004 (<a href=\"https://www.salon.com/2009/10/20/terrorism_6/\" rel=\"nofollow\">source</a>) concluded the it is primarily not religion but American policy that drives violence: &#8220;Muslims do not &#8216;hate our freedom,&#8217; but rather, they hate our policies&#8221;: specifically &#8220;American direct intervention in the Muslim world&#8221; — through the US&#8217;s &#8220;one sided support in favor of Israel&#8221;; support for Islamic tyrannies in places like Egypt and Saudi Arabia; and, most of all, &#8220;the American occupation of Iraq and Afghanistan.&#8221; </p>\n<blockquote><p>All of the wars raging in 2016 took place in Muslim-majority countries or involved Islamist groups, and those groups were responsible for the vast majority of terrorist attacks.”</p></blockquote>\n<p>In Syria, most deaths are caused by the Russian-backed Assad government (<a href=\"http://www.ibtimes.com/syrian-civilian-death-toll-2016-isis-assad-regime-fuel-refugee-crisis-growing-war-2415265\" rel=\"nofollow\">source</a>).  In Yemen, most deaths are caused by the US-backed Saudi bombing campaign.  The ongoing civil wars in Afghanistan, Iraq, and Libya were of course all triggered by US-backed invasions.  Western/Christian-backed state actors are responsible for the majority of civilian deaths.</p>\n<blockquote><p>Still other [problems] were exacerbated by clumsy Western interventions in the Middle East</p></blockquote>\n<p>Note &#8220;clumsy,&#8221; not criminal.</p>\n]]>", "author": "adoawix3", "published": "2018-04-04 20:26:53+00:00", "title": "By: adoawix3"}, {"content": "<![CDATA[<p>@adoawix,</p>\n<blockquote><p>A Pentagon study from 2004 (source) concluded the it is primarily not religion but American policy that drives violence: “Muslims do not ‘hate our freedom,’ but rather, they hate our policies”:</p></blockquote>\n<p>Showcasing neatly the joke about &#8220;military intelligence&#8221;.  Yes, this clearly explains why 80% of the victims of jihad-terror are other Muslims, killed over doctrinal differences, why there have been 5 Islamic genocides in my lifetime alone, why there are attacks on Hindus, Jews, Sikhs & Yazidi <i>in Europe&#8230;</i>  You know what?  Just click my name.  I wrote about 40,000 words refuting this.  First post on the page.</p>\n<p>@<b>Scott</b>,</p>\n<blockquote><p>I read Atlas too, and the pure, unrelenting vituperation against everyone Rand hated (the freeloaders, the moochers, the “limp” and “petulant” and “shapeless”) </p></blockquote>\n<p> yes, I read your post on Atlas Shrugged and had a little fun here: </p>\n<p><a href=\"https://www.skepticink.com/prussian/2015/04/15/whos-afraid-of-the-big-bad-rand/\" rel=\"nofollow\">https://www.skepticink.com/prussian/2015/04/15/whos-afraid-of-the-big-bad-rand/</a></p>\n<p>Just to focus on this business of the limp, shapeless losers &#8211; if you read any history of the Nazi party whatsoever, that&#8217;s a pretty good description of them.  In fact, one of <i>Atlas</i> villains has a rise that&#8217;s suspiciously similar to that of Hitler-  he&#8217;s such a nonentity that people kept supporting him, thinking he&#8217;s so incompetent, he&#8217;d be easy to control.  Until one day&#8230;  </p>\n<p>The point is that the Nazis were such rabble that there is no way they could have taken over the most civilised nation in Europe had intellectuals not paved the way.  Which brings me back to Kant.</p>\n<p>Here&#8217;s where I&#8217;d disagree with this being a &#8220;game of telephone&#8221;.  The phenomenal/noumenal thing, with its corollary on mystical insight (&#8216;categorical imperative&#8217;) isn&#8217;t something incidental to Kant&#8217;s philosophy, it is literally the big thing right at the centre.  And it is precisely because Kant was such a major figure that he was able to do such major damage.</p>\n<blockquote><p>Yet somehow science and technology, and the general arc of human moral progress (e.g., the abolition of slavery), soldiered on despite “someone being wrong in a philosophy book.” I think those processes are more robust than Rand and Peikoff give them credit for.</p></blockquote>\n<p>  Well, they did &#8211; and they didn&#8217;t.  Yes, these ideas have (had?) a huge head of steam, and did soldier on, but Kant&#8217;s intellectual progeny were working away, undermining the foundations until &#8211; well, until the twentieth century.  Then they break into hideous life.  Here&#8217;s Orwell, writing during that time:</p>\n<blockquote><p>Human types supposedly extinct for centuries, the dancing dervish, the robber chieftain, the Grand Inquisitor, have suddenly reappeared, not as inmates of lunatic asylums, but as the masters of the world. </p></blockquote>\n<p> Bear in mind that within both of our lifetimes, Communism succeeded in enslaving a third of the planet.  My parents survived Hitler and Stalin both.  Hideous reversals are possible.</p>\n<p>I think where we disagree is your optimism.  You think that these things are process that will continue regardless.  I think they are human achievements rooted in human thought.  If those thoughts go away, the process stops or worse.  </p>\n<p>You might think Rand&#8217;s extreme in her emphasis on intellectuals and philosophers.  After all, she wrote the following:</p>\n<blockquote><p>If given supreme power over the country, I would pardon all the people and even most of the leaders, but I would hang every intellectual in the country and the professors three feet higher than the rest, to be left up as long as public hygiene allows.</p></blockquote>\n<p>Except she didn&#8217;t.  That line comes from the diaries of Viktor Klemperer, a German Jew writing in Dresden in 1943.  Brainless thugs can never succeed in turning over a civilised order, unless intellectuals have opened the way for them. </p>\n<p>Got to get to work, just respond to the phenomenal/noumenal thing shortly.</p>\n]]>", "author": "Prussian", "published": "2018-04-04 23:56:30+00:00", "title": "By: Prussian"}, {"content": "<![CDATA[<p>Just before I get back to the noumenal/phenomenal, thing let me underline the reason why it&#8217;s so literally deadly.</p>\n<p>There&#8217;s no such thing as absolute unreason &#8211; even the most irrational people still behave rationally for most all of the day (they know what a door is for etc.).  The way unreason works, the way irrationalism works is saying that reason is &#8220;limited&#8221;.  That there&#8217;s something &#8220;beyond&#8221; it, &#8220;above&#8221; it.  No matter what vague words are used to describe that something more &#8211; divine revelations, dialectical materialism, categorical imperative &#8211; what it boils down to are <i> feelings</i>.</p>\n<p>Now you might go, &#8220;Oh, I feel what&#8217;s right &#8211; I feel it&#8217;s wrong to be cruel&#8230;&#8221; Fine.  Here&#8217;s the problem: fanatics who do terrible things really, truly do feel justified.  People who are utterly repulsed by homosexuality to the point they want to do violence, people revolted by mixed-race couples, people who go into a murderous frenzy over blasphemy &#8211; they truly <i>feel</i> they are doing right.</p>\n<p>  Don&#8217;t assume you&#8217;d be immune to this stuff, either.  One reason I chose my pseudonym was to mess with racialists; one of the few things I&#8217;m genuinely proud of is my article arguing against racialism.  What I did discover, however, is that some of the stuff put out by groups like <i>This Is Europa</i> is profoundly, emotionally compelling.  The same way the Islamic call to prayer is compelling.  It is only reason that I &#8211; or anyone -has as a defense to that. </p>\n<p>To put it yet another way, that you may find more compelling, I&#8217;ve heard it argued that the term &#8220;post-truth&#8221; was original coined as a compliment by post modernist intellectuals and philosophers.  Regardless of whether the exact word was used, the idea certainly goes back to there (Foucault and &#8220;regimes of truth&#8221; etc.)  But in practice, in reality, post-truth means Trump.  When you decide there is no objective reality, only competing narratives, you are inviting the biggest loudmouth to define the narrative. </p>\n<p>Now to the subject of the <b>phenomenal/noumenal</b> thing:</p>\n<blockquote><p>Like, there’s one sense in which it’s clearly true that “I only see the computer as filtered through my eyes”; there’s another sense in which even my flawed eyes clearly do give me data about a real computer that exists in external reality; both senses seem reasonably obvious to a narrow, scientistic philistine like me 🙂 </p></blockquote>\n<p>I don&#8217;t recommend you plow through Kant &#8211; he has some of the worst German I have ever read, and I doubt it gets any better in translation.  Let me phrase what&#8217;s wrong with it like this: my background is in biology.  If I use a microscope to look at a cell, by Kant&#8217;s standards, I am not looking at the real cell, but only at a magnified image of the cell.  Literally all perception of reality is discredited precisely for being perception.  This line would apply just as well to an alien, or even to God Almighty, since He would have to have perception to perceive anything.  It&#8217;s completely nuts. </p>\n<p>  Yes, our senses have limits; that&#8217;s the same thing as saying that they exist.  They have an objective nature and behave as such.  They still give us objective knowledge of the world, we just need to learn to understand it.  A straw that looks bent in a glass of water <i>really, truly does look bent</i>; the light rays are, in fact, doing that.  It is just up to us to integrate our sense data and make sense of the world.</p>\n<p><b>@theproblemwithgatekeepers</b> I agree with you, only go a lot further: <i>there is no such thing as group perception</i>.  Only individuals, and individuals alone perceive anything.  Even when a committee or a research group still only has individuals doing individual work and perceiving things individually.  The concept of &#8220;group perception&#8221; in practice means that the &#8220;representative&#8221; of the group get&#8217;s to tell you what to think, in the same way that divine authority means, in practice, that the priest gets to tell you what to think.</p>\n]]>", "author": "Prussian", "published": "2018-04-05 01:04:27+00:00", "title": "By: Prussian"}, {"content": "<![CDATA[<p>Gatekeepers #185</p>\n<p>&#8220;I don’t think at this point there is a lot of disagreement between us when it comes to the core issue of “fake news” and people believing all sorts of factually false things being a universal phenomenon across the political spectrum&#8221;</p>\n<p>Well almost. We&#8217;re in agreement that it is universal. Where we are apparently in disagreement in part, and this is important, is how common it is in different groups. Something can be a common problem and still be more of a problem in one than the other. Multiple studies back up that the central problem is much more severe on the right now then it is on the left. That&#8217;s not to say that has always been the case: During much of the Cold War, a large part of the left believed all sorts of nonsense essentially fed to it by Soviet propaganda. And there are clear warning signs that fake news on the left is growing (which some of the better center-left publications have been trying to point out <a href=\"https://www.theatlantic.com/politics/archive/2017/07/liberal-fever-swamps/530736/\" rel=\"nofollow\">https://www.theatlantic.com/politics/archive/2017/07/liberal-fever-swamps/530736/</a>  <a href=\"https://www.theatlantic.com/technology/archive/2017/02/viva-la-resistance-content/515532/\" rel=\"nofollow\">https://www.theatlantic.com/technology/archive/2017/02/viva-la-resistance-content/515532/</a> )</p>\n<p>&#8220;With respect to Breitbart’s credibility. The video of #173 was about Marc Andressen’s opinion on whether it or outlets like the NY Times or WaPo more accurately reflected the mood of the country &#8221;</p>\n<p>I didn&#8217;t interpret him as talking about mood by itself, but if it really is about a distinction in mood among different parts of the country, that&#8217;s plausible. I&#8217;m generally very confused about things like large-scale American &#8220;mood&#8221; or the like, and don&#8217;t have strong priors in any direction there. </p>\n<p>&#8220;So, if you were a Facebook user in 2012 who was not an Obama supporter, but you had a friend who was, your data was included in Obama’s campaign data operation without your consent anyway just because your friend consented.&#8221;</p>\n<p>Yes, but everyone already knows that friends have access to your data. You might argue that the moral difference here is small. </p>\n<p>&#8220;The kind of “splitting hairs” discussion in which politifact engaged is the very reason many of us decided that voting for Trump was the only rational choice in 2016.&#8221;</p>\n<p>So, this is where I think we start really disagreeing: Splitting hairs matter. Whether things are the same or not matters. You can argue about how much any one of them matters, but arguing that there&#8217;s no difference is a problem. Moreover, voting for Trump due to something like this essentially is saying &#8220;This fact-checker has what may arguably be a bias in how they evaluate things so instead I&#8217;m going to vote for someone who has no relationship to the truth at all.&#8221;</p>\n<p>(You&#8217;ve made a few other parts of your comment which I&#8217;m not directly responding to other than to note general, approximate agreement.)</p>\n]]>", "author": "Joshua Zelinsky", "published": "2018-04-05 01:29:35+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>adoawix3 #197:</p>\n<blockquote><p>Western/Christian-backed state actors are responsible for the majority of civilian deaths.</p></blockquote>\n<p>They might call themselves &#8220;Christian&#8221;, but people who support killing civilians — or even militants — are disobeying Christ himself, <a href=\"https://www.biblegateway.com/passage/?search=Luke%206&version=NLT\" rel=\"nofollow\">who said</a> &#8220;But to you who are willing to listen, I say, love your enemies! Do good to those who hate you. Bless those who curse you. Pray for those who hurt you.&#8221;</p>\n]]>", "author": "Tim Makarios", "published": "2018-04-05 04:49:39+00:00", "title": "By: Tim Makarios"}, {"content": "<![CDATA[<p>Prussian  #199,</p>\n<p>&#8220;Only individuals, and individuals alone perceive anything. Even when a committee or a research group still only has individuals doing individual work and perceiving things individually. The concept of “group perception” in practice means that the “representative” of the group get’s to tell you what to think, in the same way that divine authority means, in practice, that the priest gets to tell you what to think.&#8221;</p>\n<p>Again, no disagreement here. I agree. I have also seen committees in which the opinion of the &#8220;committee&#8221; is essentially the opinion of the loudest -not literally &#8220;loudest&#8221; but the most assertive- voice in the committee with the rest of the committee members just saying yessir. On the last point though, not all Christian denominations abide by the Roman Catholic understanding of priests being above the rest of believers. One of theological innovations introduced by Martin Luther in modern times -Luther claimed that this was always the case in early Christianity- is the concept known as <a href=\"https://en.wikipedia.org/wiki/Universal_priesthood\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Universal_priesthood</a> which today is held with different degrees by the overwhelming majority of Protestant denominations. This &#8220;equalization of all believers&#8221; is thought to have been one of the triggers of the scientific revolution that took place in central and northern Europe and the Age of Enlightenment that followed. For the record, I am a Protestant Christian myself.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2018-04-05 04:54:37+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Joshua #200</p>\n<p>Again, I am addressing the few areas where I see nuance of disagreement because I think that we are largely in agreement,</p>\n<p>&#8220;Multiple studies back up that the central problem is much more severe on the right NOW then it is on the left.&#8221;</p>\n<p>The emphasis on &#8220;NOW&#8221; is mine. The way I interpret this is that those studies have a spin made to make the losers of the 2016 election feel good with themselves. The way I see things is different. The United States, unlike the European countries that I know, is a very fluid and dynamic society. Nothing here seems permanent and that include political allegiances of a significant portion of American voters. I believe this to be true even as I acknowledge that we live in increasingly polarizing times.  For example, there were counties with a total of 7.5 million voters that voted for Obama in 2008 and 2012, and then for Trump in 2016 <a href=\"https://ballotpedia.org/Pivot_Counties:_The_counties_that_voted_Obama-Obama-Trump_from_2008-2016\" rel=\"nofollow\">https://ballotpedia.org/Pivot_Counties:_The_counties_that_voted_Obama-Obama-Trump_from_2008-2016</a> . This speaks of a healthy dynamism in which the studies you mention -just as the right sought solace in the aforementioned poll of 2008 that showed Obama voters as &#8220;uninformed&#8221;- only serve to insult the voters who, for their own reasons, decided to vote for Obama in 2008/2012 and then for Trump in 2016.</p>\n<p>People are not &#8220;robots&#8221;. The effect of the Russian trolls was irrelevant when it came to make people like me vote in 2016 for Trump -I insist I would not have voted for Bush or any other of the clowns who ran against Trump for the Republican nomination- even though I had not voted in 2012 and 2014. Speaking of, this is the poll I was referring to <a href=\"https://www.scribd.com/document/330170543/9amET-NBCWSJ-release\" rel=\"nofollow\">https://www.scribd.com/document/330170543/9amET-NBCWSJ-release</a> . People in my demographic group were not captured by a poll like this that looked at people who had voted in 2012 and 2014 and young people with a high interest in the election. </p>\n<p>This takes me to your final point,</p>\n<p>&#8220;Splitting hairs matter.&#8221;</p>\n<p>Actually, when it comes to politics -and I would say also areas like religion or picking our spouses- I believe it doesn&#8217;t. Most people choose their politics not making painstakingly detailed analyses of policy proposals but on impressions. That&#8217;s true even among our intellectual elite. The term &#8220;Obamagasm&#8221; was coined to describe the irrational pleasant experience many Obama supporters felt about anything Obama uttered, no matter how absurd the utterance was. Obamagasms were as common among the low educated Obama voters as among the highly educated Obama voters. I for one don&#8217;t believe that the result of the 2008 election would have been different had most Obama voters known that it was the Democrats who controlled congress on election in 2008. I don&#8217;t believe either that Romney stood a chance against Obama in 2012 because he -Romney- just wasn&#8217;t likable enough even among people who agreed with him on policy matters. Nor do I believe that in a Trump v Clinton election and given the dynamics of what was going on in the middle of the country -that Breitbart conveyed better than the NY Times- Hillary Clinton would have won the election without the influence of the Russian trolls. Remove uber-blue California from the popular vote count and Trump got an overwhelming win among those voters too (even including very blue states like Washington, Oregon and those in New England). </p>\n<p>In short. There is a reason why academia is also known as &#8220;the ivory tower&#8221;. The real world is not an academic exercise. It is messy and chaotic and there are many reasons why people vote the way they do that cannot be measured via studies that assume voters are robots.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2018-04-05 05:22:29+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Prussian #198/199: Thanks; your comments provide much food for thought!  I appreciate, in particular, how you based your arguments not on Randian ideology but on history, your experiences, and other starting points that I and other readers here can more easily work with.</p>\n<p>I might or might not have something more intelligent to say later, but for now, two quick things:</p>\n<p>(1) When I called the processes of the Enlightenment &#8220;more robust than Rand and Peikoff give them credit for,&#8221; I didn&#8217;t mean they were robust to <i>everything</i>.  What do you take me for, some sort of Deutschian/Pinkerian optimist? 🙂  We&#8217;ve learned, in particular, that the processes are highly vulnerable to thugs, autocrats, conspiracy theories (what&#8217;s now called &#8220;fake news&#8221;), violence and the threat of it, and even the use of shame to silence debate.  I&#8217;m just skeptical that they&#8217;re so paper-thin as to blow over because some philosopher distinguishes a &#8220;noumenal&#8221; from a &#8220;phenomenal&#8221; world. 🙂  This probably means that I see a more limited role than Rand does for the more technical parts of philosophy in shaping the course of human civilization: so be it.</p>\n<p>(2) In your linked essay, you write:</p>\n<ul>Notice that this condemnation [of Rand] is always absolute.  It’s never “Well, she had a few good ideas, but…”  Or “I can see where she was coming from, but…”.  It is always absolute, utter condemnation.</ul>\n<p>No doubt this is true of many of her critics, but I think my own criticism of her is a pretty clear counterexample!  (E.g., I said that her model of the evil of collectivism seems to apply pretty well both to the former Soviet Union and to the average American high school&#8230;)</p>\n<p>In any case, whatever else one says about it, I don&#8217;t think a woman who wore a gold dollar-sign brooch, wrote a book called &#8220;The Virtue of Selfishness,&#8221; and gave a talk in 1961 called &#8220;America&#8217;s Persecuted Minority: Big Business,&#8221; was trying to live her life so as to minimize the anger of her critics, beyond whatever was absolutely necessary for getting across her points. 🙂</p>\n]]>", "author": "Scott", "published": "2018-04-05 10:50:40+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Nick Maley #13: There&#8217;s one key idea that <i>wasn&#8217;t</i> in my review, but that&#8217;s in both Gray&#8217;s review and your comment, and that I completely disagree with.  It&#8217;s this:</p>\n<ul>the track record of Enlightenment ideas applied to moral and political questions is woeful. Applied to politics, Enlightenment ideas have given us the idea of the perfectibility of society via reason, and through that, the ‘Utopias’ of Nazism and Communism.  The ghastly efficiency of the Nazis &#8230; was the result of a technologically and organisationally sophisticated nation applying its skills to mass murder.</ul>\n<p>So, must we count everyone who&#8217;s tried to usurp the prestige of science for their own ends as part of the Enlightenment project?  Or everyone who&#8217;s exploited modern technological skills to advance their ends?</p>\n<p>If so, then it&#8217;s not just Nazism and Communism that we&#8217;re talking about.  Homeopathy, Christian Science, Scientology, and New-Age healing based on quantum vibrations would all be part of the Enlightenment.  Televangelists would be great Enlightenment figures, since they skillfully exploit modern broadcasting technology to reach far larger audiences than was possible otherwise.  Trump would be too, because of his use of Twitter and data harvested from Facebook.</p>\n<p>But these strike me as absurd conclusions.  <i>Of course</i> almost every cult and regressive ideology will claim for itself the backing of science: why wouldn&#8217;t it?  And <i>of course</i> technology has magnified the power of evil and irrational actors, along with good actors.  If &#8220;the Enlightenment&#8221; encompasses every movement that <i>falsely claims</i> the support of science, or <i>skillfully uses</i> the outputs of science, then it encompasses pretty much anything you&#8217;ve ever heard of, so means nothing.</p>\n<p>In this analysis, Nazism and Communism differ from Scientology and quantum energy crystals mostly just in having done orders of magnitude more damage.  All these things bear roughly the same relationship to the original ideals of the Enlightenment.</p>\n<p>The Enlightenment, it seems to me, <i>can</i> coherently be criticized for having put so many machine guns into the hands of toddlers &#8230; even though the only alternative might have been no technological civilization at all.  But what&#8217;s never made any sense to me is this impulse to look at the toddlers riddling everyone with bullets, and hold them up as important Enlightenment thinkers because of their use of modern weapons.</p>\n]]>", "author": "Scott", "published": "2018-03-23 06:45:22+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>pku31 #12: Indeed there’s a paradox at the heart of the natalist versus anti-natalist debate—-if you’re both smart enough and socially conscientious enough to have seriously entertained the thought that you shouldn’t have kids for the sake of the world, that’s one of the best signs that maybe you <i>should</i> have kids for the sake of the world. 🙂</p>\n]]>", "author": "Scott", "published": "2018-03-23 07:52:41+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>scott:</p>\n<p>very nice. but two corrections: (1) it is a mistake to call Pinker a &#8216;classical liberal&#8217;. the modern expression of classical liberalism is libertarianism which is fundamentally opposed to all government intervention in the voluntary interactions of individuals (and at most, limits the role government intervention to ensuring negative liberty). This applies to the &#8216;crisis&#8217; of climate change where Pinker is a government interventionist. (2) there is no proof that Newton died a virgin. and finally, regarding your statement that &#8220;for some reason the Jews would need to be unable to escape&#8221;, the reason is quite clear; it was the indifference towards, and antipathy for, jews (a fundamental aspect of Christian religious doctrine, historically).</p>\n]]>", "author": "Richard Gaylord", "published": "2018-03-23 08:03:13+00:00", "title": "By: Richard Gaylord"}, {"content": "<![CDATA[<p>Interviewers (by Albert Einstein from &#8216;Mein Weltbild&#8217;, translation by Sonja Bargmann from &#8216;Ideas and Opinions&#8217;)</p>\n<p>To be called to account publicly for everything one has said, even in jest, in an excess of high spirits or in momentary anger, may possibly be awkward, yet up to a point it is reasonable and natural. But to be called to account publicly for what others have said in one&#8217;s name, when one cannot defend oneself, is indeed a sad predicament. &#8220;But to whom does such a thing  happen?&#8221; you will ask. Well, everyone who is of sufficient interest to the public to be pursued by interviewers. You smile incredulously, but I have had plenty of direct experience and will tell you about it.<br />\nImagine the following situation. One morning a reporter comes to you and asks you in a friendly way to tell him something about your friend N. At first you no doubt feel something approaching indignation at such a proposal. But you soon discover that there is no escape. If you refuse to say anything, the man writes: &#8220;I asked one of N&#8217;s supposedly best friends about him. But he prudently avoided my questions. This in itself enables the reader to draw the inevitable conclusions.&#8221; There is, therefore, no escape, and you give the following information: &#8220;Mr. N is a cheerful, straightforward man, much liked by all his friends. He can find a bright side to any situation. His enterprise and industry know no bounds; his job takes up his entire energies. He is devoted to his family and lays everything he possesses at his wife&#8217;s feet. &#8230;&#8221;<br />\nNow for the reporter&#8217;s version: &#8220;Mr. N takes nothing very seriously and has a gift for making himself liked, particularly as he carefully cultivates a hearty and ingratiating manner. He is so completely a slave to his job that he has no time for the considerations of any non-personal subject or for any extracurricular mental activity. He spoils his wife unbelievably and is utterly under her thumb. &#8230;&#8221;<br />\nA real reporter would make it much more spicy, but I expect this will be enough for you and your friend N. He reads the above, and some more like it, in the paper next morning, and his rage against you knows no bounds, however cheerful and benevolent his natural disposition may be. The injury done to him gives you untold pain, especially as you are really fond of him.<br />\nWhat&#8217;s your next step, my friend? If you know, tell me quickly so that I may adopt your method with all speed.</p>\n]]>", "author": "gentzen", "published": "2018-03-23 10:32:08+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>gentzen #17: I&#8217;ve always enjoyed that Einstein passage, but what is it apropos of?</p>\n]]>", "author": "Scott", "published": "2018-03-23 11:19:53+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>[&#8230;] Review of Steven Pinker’s Enlightenment Now 5 by onuralp | 0 comments on Hacker News. [&#8230;]</p>\n]]>", "author": "New top story on Hacker News: Review of Steven Pinkers Enlightenment Now  Tech + Hckr News", "published": "2018-03-23 11:34:12+00:00", "title": "By: New top story on Hacker News: Review of Steven Pinker’s Enlightenment Now – Tech + Hckr News"}, {"content": "<![CDATA[<p>Nassim Taleb accuses Pinker of being a charlatan. Taleb&#8217;s original criticism is that Pinker allegedly misuses statistics, because of how he doesn&#8217;t address the &#8220;fact&#8221; that wars are allegedly &#8220;black swan&#8221; events, and hence cannot be analyzed using some types of statistics. Most of the criticism appears to be aimed at Pinker&#8217;s previous book, <em>Better Angels</em>. Taleb has since accused Pinker of not responding properly to his criticism, and is now calling Pinker a charlatan.</p>\n<p>I find Taleb&#8217;s more mathematical papers quite challenging to read.</p>\n]]>", "author": "soijosrgfjosidj", "published": "2018-03-23 11:39:27+00:00", "title": "By: soijosrgfjosidj"}, {"content": "<![CDATA[<p>Richard #16: I don&#8217;t care so much about definitions, so if someone insists to me that &#8220;classical liberalism&#8221; can only mean &#8220;absolute libertarianism,&#8221; my first instinct is to say: &#8220;fine, then just tell me what term I <i>should</i> use for the broader Enlightenment values shared by me and Deutsch and Pinker among many others.&#8221;</p>\n<p>On the other hand, in a modern context, I&#8217;ve usually seen &#8220;classical liberalism&#8221; used to mean, basically: &#8220;belief in equal rights and science and human moral progress and the Enlightenment, intense opposition to theocratic conservatives and Trump-style autocrats, but <i>also definitely not</i> militant SJW-style leftism.&#8221;  So why should I cede a useful word to mean the same thing as libertarianism, when we already have a perfectly good word for the latter&#8212;namely, &#8220;libertarianism&#8221;?  Just like I don&#8217;t cede to the SJWs that the word &#8220;racism&#8221; can only mean &#8220;prejudice + power,&#8221; so that members of oppressed races can never be racist by definition, even if (let&#8217;s say) they commit a murder out of racial animus.</p>\n<p>Another thing: it&#8217;s always seemed to me that strong action on climate change could be defended on the strictest libertarian grounds.  One would simply say: property rights include the right not to have other people cause your property to be flooded, or subject to intense droughts and heatwaves, insofar as those things are influenced even probabilistically by human actions (as science tells us they are).  Of course, when someone drives a car, the property damage they cause to you is infinitesimal&#8212;but summed over <i>all</i> the people on earth whose property is now infinitesimally likelier to be damaged, it&#8217;s more than enough to justify a carbon tax, again purely on property rights grounds rather than redistributive ones.</p>\n<p>If libertarians won&#8217;t accept this, I see two explanations.  Either they don&#8217;t take their own principles to their logical conclusion, or they simply don&#8217;t accept the scientific evidence for anthropogenic climate change and its likely catastrophic effects.  In the latter case, though, the disagreement has nothing to do with differing philosophical views about the role of government.  It&#8217;s just back to the factual question, of whether you do or don&#8217;t accept that human emissions are rapidly and dangerously changing the world&#8217;s climate.</p>\n]]>", "author": "Scott", "published": "2018-03-23 12:06:24+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #18: I quoted that passage from Einstein, because it gives such a nice illustration of &#8220;hostile mistranslation&#8221; and how impotent you are to do anything against it. (Having something written down instead of a mere oral interview helps at least a bit.) Even remaining silent won&#8217;t help you. I was reminded of this when you pointed out how Pinker tried as hard as he could to prevent such hostile mistranslation:</p>\n<blockquote><p>As I read this sort of critique, the hair stands on my neck, because the basic technique of hostile mistranslation is so familiar to me.  &#8230;</p>\n<p>I’ve noticed that everything Pinker writes bears the scars of the hostile mistranslation tactic.  Scarcely does he say anything before he turns around and says, “and here’s what I’m not saying”—and then proceeds to ward off five different misreadings so wild they wouldn’t have occurred to me, but then if you read Leon Wieseltier or John Gray or his other critics, there the misreadings are, trotted out triumphantly; it doesn’t even matter how much time Pinker spent trying to prevent them.</p></blockquote>\n]]>", "author": "gentzen", "published": "2018-03-23 12:35:52+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>gentzen #22: OK, thanks!</p>\n]]>", "author": "Scott", "published": "2018-03-23 12:41:35+00:00", "title": "By: Scott"}]