[{"content": "<![CDATA[<p>mjgeddes #56:</p>\n<p>So you do believe in the ontological reality of &#8220;causal power!&#8221; In your view, causality is generated by running the laws against initial conditions where the laws and conditions are seen as ontologically real.</p>\n<p>I don&#8217;t see how this helps with determining in what form puppy torture should be seen as ontologically real.  In fact, it just muddles the question further.  Consider&#8230;</p>\n<p>Instead of puppy torture, we can ask in what way these laws+initial conditions should be seen as ontologically real.</p>\n<p>Do these laws+initial conditions need be instantiated or run &#8211; does the &#8216;movie&#8217; of the universe need to play &#8211; in order for it to be ontologically real? </p>\n<p>Must there be a &#8220;consciousness&#8221; encoded in these laws+initial conditions that is capable of conceiving the laws+initial conditions as ontologically real&#8230; for it to be ontologically real?</p>\n<p>To me, this hints that the questions themselves betray a false assumption: that there is any such *real* thing as a real thing.  The error is hypostatizing anything at all.</p>\n<p>I suggest the answer to the question, &#8220;In what form does a puppy need be (physical instantiation, mere encoded information, etc) to suffer from torture?&#8221; is any form capable of committing the error of hypostatization.</p>\n]]>", "author": "adamt", "published": "2016-05-24 16:20:26+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<p>Sniffnoy: it&#8217;s kind of amazing that a model of computation based on complex numbers can be simulated exactly by a model based on finite operations on positive integers.</p>\n]]>", "author": "venky", "published": "2016-05-24 17:13:22+00:00", "title": "By: venky"}, {"content": "<![CDATA[<p>ppnl #31.</p>\n<p>Reading your argument about video, it reminded me that space-time itself in general relativity is considered one &#8220;solid&#8221; block. Time is purely a construct of the way our memories are formed, time doesn&#8217;t pass, and all instants just exist. Very much like the different frames in a video tape.</p>\n<p>About the dog not suffering again when playing the video, there&#8217;s the different legal argument that content that&#8217;s been created artificially and that depicts forbidden acts is just as illegal as actual photos/videos, even though there is obviously no victim involved. One could argue that it&#8217;s the viewer who provides the bit of consciousness necessary to (re)enact the recorded emotions, through empathy or sadism. So when I watch a dog suffer on video, somewhere inside my head, my consciousness is &#8220;forking&#8221; a little ghostly instance of a dog that&#8217;s in pain.</p>\n<p>I guess it all boils down back to the argument of simulation vs the actual system that&#8217;s simulated. And what do we mean by &#8220;computation&#8221;. Eventually a simulation itself is made of real matter. And in a perfect simulation the relations/patterns between atoms are isomorphic to the relations/patterns between atoms of the &#8220;real&#8221; system. The question is whether the property of &#8220;consciousness&#8221; is maintained by the multiple transformations defining the isomorphism?</p>\n]]>", "author": "fred", "published": "2016-05-24 18:01:50+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>mjgeddes Says: &#8220;&#8230; the process of the glass falling from your hand and shattering was irreversible.</p>\n<p>But nowhere in the laws of particle physics can you find an explanation for this.&#8221; (Comment #56)</p>\n<p>I don&#8217;t think that is a good example of what you mean. The glass falling was caused by gravity. There would have to be negative gravity or some other force to cause pieces of glass on the ground to rise into the air, collide, and sinter themselves into a glass (container). There is no such contrary force in the laws of physics, so the laws of physics do explain the irreversibility, in that instance.</p>\n<p>If we remove the external force from the example, then irreversibility is just a statistical phenomenon: any particular configuration of interacting particles is very unlikely to reoccur due to the vast number of possible configurations, just as random shuffling of a deck of cards is very apt not to give the same deal twice in a row.</p>\n]]>", "author": "JimV", "published": "2016-05-24 18:08:15+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>mjgeddes #56:</p>\n<p>&#8220;If you drop a glass on a hard floor and the glass shatters, you won’t ever see the process happening in reverse.&#8221;</p>\n<p>Sure, but you will never see again another glass break in exactly the same manner as the glass that just shattered&#8230;<br />\nI.e. the &#8220;glass that just shattered&#8221; is an event that&#8217;s just as rare as any glass that would reconstitute itself, and indeed, at the atomic level, there&#8217;s is no difference.<br />\nWe just happen to group an infinite set of unique glass shattering events into one category. We&#8217;re biased to it because the chemistry of our memories and the set of &#8220;shattering glass&#8221; events are ancestors of the same initial conditions in the same local pocket of universe/reality.</p>\n]]>", "author": "fred", "published": "2016-05-24 18:15:37+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>venky: Well, you can&#8217;t simulate complex numbers exactly, obviously, because there are uncountably many; but quantum computation doesn&#8217;t let you read out the amplitudes, it only lets you sample according to them.  So you don&#8217;t need infinite precision to simulate quantum computing.</p>\n]]>", "author": "Sniffnoy", "published": "2016-05-25 01:47:06+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>venky #59: a discrete computer doesn&#8217;t have to exactly represent complex-valued amplitudes to arrive at comparable accept/reject probabilities. Indeed, that&#8217;s the rub in general when someone comes along and proposes some analog device that threatens to dislodge the Church-Turing thesis: buried in any definition of any reasonable model of computation based on continuous quantities, as also in experimental physics, are error bars or some equivalent means of accounting for finite accuracy.</p>\n]]>", "author": "Greg", "published": "2016-05-25 04:39:42+00:00", "title": "By: Greg"}, {"content": "<![CDATA[<p>Scott #19:<br />\n> why not say that every time you run Shor’s algorithm, really the initial conditions of the universe caused you to choose a composite number that it “already knew” the prime factors of</p>\n<p>I don&#8217;t think that specific method would work.  We can use an unseeded cryptographic pseudo-random generator to deterministically generate lots of integers from a uniform distribution.  If we have a working quantum computer, we can then factor those.  Those numbers might already be hard to factor for a conspiracy if it only has access to polynomial time classical computation, even if it knows exactly how they were generated.</p>\n]]>", "author": "jonas", "published": "2016-05-25 08:29:04+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>Thx Sniffnoy and Greg. It&#8217;s amazing we are back to the original 19th century definition of reals as equivalence classes of Cauchy sequences of rational fractions.</p>\n]]>", "author": "venky", "published": "2016-05-25 14:54:21+00:00", "title": "By: venky"}, {"content": "<![CDATA[<p>Sniffnoy (#54), Fred (#62), Greg (#64), Venky (#66) (and several other <i>SI</i> commenters) may be interested in Colin McLarty&#8217;s very lively, very reader-friendly guest article on <i>M-Phi: a Blog Dedicated to Mathematical Philosophy</i>, titled &#8220;<a href=\"http://m-phi.blogspot.com/2013/04/fermat-set-theory-and-arithmetic-guest.html\" rel=\"nofollow\">Fermat, set theory, and arithmetic</a>&#8221; (of 22 April 2013):<br />\n<blockquote>Some philosophers suspect mathematicians don&#8217;t care about foundations but only care about what works. But that elides the problem mathematicians constantly face: what will work?&nbsp;[&hellip;]</p>\n<p>These themes converged in the on-line row over whether Wiles’s proof of Fermat&#8217;s Last Theorem (FLT) uses Grothendieck universes. Universes are controversial in some circles since they are sets large enough to model Zermelo Fraenkel set theory (ZF) and so, by Gödel&#8217;s incompleteness theorem, ZF cannot prove they exist.</p>\n<p>It is no surprise theoretically that a statement about numbers could be proved by high level set theory&nbsp;[&hellip;]  but it is surprising in fact that FLT should be proved this way. We do not expect to see the Gödel phenomenon in such simple statements.&nbsp;[&hellip;]</p>\n<p>I am working to lessen the surprise in the case of FLT and other recent number theory by bringing the proofs closer to arithmetic. I have formalized the whole Grothendieck toolkit in finite order arithmetic. That is the strongest theory that is commonly called &#8220;arithmetic&#8221;.</p></blockquote>\n<p>The much-discussed HoTT mathematical foundations program provides a venue in which McLarty&#8217;s ideas are not only well-posed, but natural and even machine-checkable.</p>\n<p><b>Practical parallels</b>&nbsp; For engineers too, there are parallels with practical problems in quantum simulation.  A pretty considerable portion of the modern quantum simulation literature can be viewed as a McLarty-style effort to replace the large-dimension (uncountably infinite) Hilbert space of gauge field theory with low-dimension (usually finite, and at most countably infinite) varietal spaces.  </p>\n<p>For example, Google&#8217;s new programming language &#8220;TensorFlow&#8221;, implemented on Google&#8217;s new TPU chips (&#8220;Tensor Processing Units&#8221;), as the basis of Google&#8217;s new algorithms (&#8220;AlphaGo&#8221;) represent an evolving class of computations that are not obviously well-represented by Turing-equivalent von Neumann processors manipulating large-dimension \\( \\psi \\)-vectors.</p>\n<p>Broadly speaking, in the Turing/von Neumann/Hilber computational world, physical systems are encoded as large-dimension vectors of complex numbers, while in the Grothendieck/McLarty/Google/varietal world, physical systems are encoded as smaller-dimension joins of polynomials.  </p>\n<p><b>Toward Varietal Comity</b>&nbsp; At the practical level, Grothendieck/McLarty/Google-style varietal simulations have been so successful that it is natural to wonder whether these dimension-reducing methods are applicable <i>universally</i>, consistent with the Extended Church-Turing Thesis (ECT) as a fundamental law of nature, that governs in particular all gauge-field-theory quantum universes.  </p>\n<p>In this practical universe the Standard Model of quantum physics is entirely correct, and yet Gil Kalai&#8217;s skeptical views regarding quantum computing (per Gil&#8217;s recent <i>Notice of the AMS</i> article, see too arXiv:1605.00992) are entirely correct <i>too</i>.</p>\n<p><b>Toward Quantum Supremacy</b>&nbsp; On the other hand, the experimental demonstration of Quantum Superiority&nbsp;&mdash; for example via scalably fault-tolerant quantum computing and/or scalable BosonSampling&nbsp;&mdash; would confound fond hopes for Varietal Comity (as it might be called), by overthrowing the Extended Church-Turing Thesis.</p>\n<p>So this is one of those transformational (and immensely enjoyable) epochs in science, in which there is plenty of high-quality literature, and stimulating arguments, and high-quality mathematics, on <i>both</i> sides of a fundamental scientific question.</p>\n<p><b>Conclusion</b>&nbsp; Scott answered the <i>Quora</i> question &#8220;Do you still think that philosophers should care more about computational complexity?&#8221; with &#8220;You better believe it! 🙂 &#8221; (emoticon as in the original). </p>\n<p>The converse question &#8220;Should qubit-designers and BosonSamplers and quantum simulationists care more about computational philosophy?&#8221; is answered by works like Colin McLarty&#8217;s and Gil Kalai&#8217;s identically: &#8220;We&#8217;d better believe it! 🙂 &#8220;</p>\n]]>", "author": "John Sidles", "published": "2016-05-25 20:43:00+00:00", "title": "By: John Sidles"}]