[{"content": "<![CDATA[<p>Itai #287: Please avoid offensive generalizations, like about &#8220;deception running deep&#8221; in Arab mentality.</p>\n]]>", "author": "Scott", "published": "2014-07-28 22:26:06+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>ScentOfViolets #285: I see, so you&#8217;re a neutral arbiter, like the UN.  Out of curiosity, could you tell me about a time when you took the &#8220;pro-Israel side&#8221; in an argument?  (Myself, I&#8217;ve had plenty of arguments with hard-right Zionists, with me taking the &#8220;liberal&#8221; side.  But since anti-Zionists greatly outnumber hard-right Zionists, both in the world at large and, probably, among the readers of this blog, the former is the group that I wanted to address more.)</p>\n<p>Incidentally, I found only a single comment of yours that wasn&#8217;t moderated to appear, and it was purely an oversight on my part.  The comment is up now (#277).</p>\n]]>", "author": "Scott", "published": "2014-07-28 22:34:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Please let me join in <i>Shtetl Optimize&#8217;s</i> general praise of Sam Harris&#8217; essay <b>&#8220;<a href=\"http://www.samharris.org/blog/item/why-dont-i-criticize-israel\" rel=\"nofollow\">Why Don’t I Criticize Israel?</a>&#8220;</b>  </p>\n<p>No criticism of Sam Harris is intended, in suggesting that in at least one respect, his essay could have been <i>even better</i>.  </p>\n<p>Postponing until later a list of references (appended), Harris&#8217; improvable passage is:<br />\n<blockquote><b>Sam Harris</b> asserts&nbsp; &#8220;Whatever terrible things the Israelis have done, it is also true to say that they have used more restraint in their fighting against the Palestinians than we&nbsp;&mdash; the Americans, or Western Europeans&nbsp;&mdash; have used in any of our wars.&#8221;</p></blockquote>\n<p><b>A Personal Testimony</b>&nbsp; On being deployed to Anbar Province in March of 2004, USMC Gen.&nbsp;Mattis issed to the Marines under his command a letter, setting forth his commander&#8217;s guidance, which included a strikingly anhistorical directive:<br />\n<blockquote><b>LETTER TO ALL HANDS</b>&nbsp; The enemy will try to manipulate you into hating all Iraqis. Do not allow the enemy that victory. [&hellip; to that end] I have added, “First, Do No Harm” to our passwords of “No Better Friend, No Worse Enemy.”</p></blockquote>\n<p>The foresight of Mattis&#8217; guidance was a very considerable comfort to the Marines under Mattis&#8217; command&nbsp;&hellip; and to their families.  </p>\n<p>During the subsequent decade, extending to the present time, the Coalition Forces (of many nations!) have embraced Mattis&#8217; doctrine to the utmost extent practicable, appreciating moreover that the doctrine applies equally to societal externalities (hospitals, schools, housing, transportation) and to human internalities (trust, respect, hope)&nbsp;&hellip; &#8220;If you break it, you own it.&#8221;</p>\n<p>Essential to Mattis&#8217; doctrine is the fundamental principle that &#8220;There is only one color of Marine: green&#8221;.  Which is to say, considerations of race and religion do not enter into the qualifications that make a Marine.  </p>\n<p>All Marines appreciate&nbsp;&mdash; because they are universally and rigorously TRAINED to appreciate&nbsp;&mdash; the fragility of the doctrine of secular and racial equality, and the sustained commitment that is required to achieve an approximation of it (per the references <i>Matterhorn</i> and <i>First to Fight</i>, both appended).</p>\n<p>In this regard (as it seems to me) the IDF has adopted policies of exclusion&nbsp;&mdash; specifically, the <i>de facto</i> demographic exclusion of Israeli Muslims from IDF combat forces&nbsp;&mdash; that are politically expedient year-by-year, and militarily expedient battle-by-battle, yet have proved to be morally and socially corrosive generation-by-generation.</p>\n<p>To the extent that Muslim Israelis are untrusted and/or unwilling to participate in the ground assault against Gaza, perhaps Israel&#8217;s moral foundations for that assault <i>are</i> shaky. At the very least, a vital check-and-balance is missing&nbsp;&hellip; a check-and-balance that the USMC works diligently to respect scrupulously.</p>\n<p>Regrettably, there is (as far as I know) no public IDF syllabus that is comparable to the USMC&#8217;s Professional Reading program, in which all Marines are required to participate, and from which all US citizens are encouraged to learn.  For a nation whose millennia-old traditions honor learning, this lack is regrettable.</p>\n<p>Perhaps this is why so many comments here on <i>Shtetl Optimized</i> amount to stale slogan-shouting.  A celebrated maxim of Arthur Wichmann applies all-too-aptly to all-too-many of the Middle East&#8217;s ideology-driven  governments<br />\n<blockquote>&#8220;Successive <b><strike>&nbsp;explorers&nbsp;</strike> Middle East governments</b> commit the same ephemeral stupidities: unwarranted pride in overstated accomplishments, refusal to acknowledge disastrous oversights, ignoring the accomplishments of previous <b><strike>&nbsp;explorers&nbsp;</strike> Middle East governments</b>, consequent repetition of previous errors, hence a long history of unnecessary sufferings and deaths. Future <b><strike>&nbsp;explorers&nbsp;</strike> Middle East governments</b> will continue to repeat the same errors.&#8221;</p>\n<p>&#8220;Nothing has been learned, and everything forgotten!&#8221;</p>\n<p><i>&nbsp;&nbsp;&nbsp; Entdeckungsgeschichte von Neu-Guinea,<br />\n&nbsp;&nbsp;&nbsp; 1828-1902.</i>\n</p></blockquote>\n<p>The USMC&#8217;s syllabus aims&nbsp;&mdash; pretty successfully as it seems to me&nbsp;&mdash; to avert Wichman&#8217;s sad ignorance-driven outcome.<br />\n<code><br />\n@misc{Mattis-MajGen:2004os, Author = {James N. Mattis}, Month = {March~23}, Title = {Letter to {A}ll {H}ands}, Year = {2004}}<br />\n%<br />\n% the following appear in:<br />\n% REVISION OF THE COMMANDANT'S<br />\n% PROFESSIONAL READING LIST<br />\n% ALMARS Active Number: 001/13<br />\n%<br />\n@book{Krulak:1999fk, Address = {Annapolis, Md.}, Author = {Krulak, Victor H.}, Publisher = {Naval Institute Press}, Title = {First to {F}ight: an inside view of the {U.S}. {M}arine {C}orps}, Year = {1999}}<br />\n%<br />\n@book{Marlantes:2010fk, Address = {New York}, Author = {Marlantes, Karl}, Publisher = {Atlantic Monthly Press : Distributed by Publishers Group West}, Title = {Matterhorn: a novel of the Vietnam War}, Year = {2010}}<br />\n</code></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-07-28 22:49:30+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>@Itai #286<br />\nNice to meet you. I&#8217;m half Tunisian myself.<br />\nI&#8217;m surprised you say that about you Grandmother. The older generation from my Tunisian side, my grandparents, my older uncles and cousins, speak fondly of the Tunisian Jews and regret their leaving. My father is friends with a couple (of the rare few) who remained. </p>\n<p>It is usually members of the younger generation, born after independence, with no personal experience dealing with Jews and who get all of their information from TV and the Internet, which typically spews  violent anti-semitism and bigotry. </p>\n<p>I agree with you about the hudaybiyyah comment. Most Palestinians and Arabs view peace as a tactical objective, desirable only because of the current position of weakness. They still consider the long term objective to be a total &#8220;re-conquering&#8221; of Palestine. I happen to disagree with that point of view for several reasons. But that is my American half speaking.</p>\n]]>", "author": "Alex", "published": "2014-07-28 22:51:46+00:00", "title": "By: Alex"}, {"content": "<![CDATA[<p>Scott #289: As a matter of fact, I used to be very pro-Israel. I didn&#8217;t know anyone who wasn&#8217;t back in the mid-70&#8242;s (Munich, remember?), and I&#8217;d read all the usual pro-Israel stuff like Michener&#8217;s <em>The Source</em>. But let&#8217;s just say that evidence accumulated in the intervening decades, culminating in a re-evaluation around 2007. The intertubes, right? That&#8217;s when I first took a detailed look at groups like Lehi and how Israel really came into being, how I found out that contrary to the &#8216;They Hate Us for our Freedoms&#8217; bushwah, the Muslims of that region lived more or less peaceably with their neighbors of other faiths. And that it wasn&#8217;t until Jews started arriving en masse that they got bent out of shape and muttering &#8212; rightly as it turned out &#8212; that they were going to take all the land and water. Yes, I rather do think that the evidence is massively on my side as to why there is so much resentment towards Israel on the part of the palestinians who have been residing in that part of the world since time out of mind.</p>\n<p>In sum, I used to be pretty pro-Israel. And it took a lot of effort on the part of that country to squander all of the good will it had earned (rightly or wrongly) with me. Now I&#8217;m just disgusted and give them no more &#8212; and no less &#8212; slack for their actions than any other nation. <em>You</em> on the other hand . . . I don&#8217;t think I&#8217;m being anything but scrupulously fair here. Most assuredly I&#8217;m not being snarky, so don&#8217;t go there.</p>\n]]>", "author": "ScentOfViolets", "published": "2014-07-28 23:02:50+00:00", "title": "By: ScentOfViolets"}, {"content": "<![CDATA[<p>ScentOfViolets is like people who say, I&#8217;m not racist, but&#8230;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2014-07-28 23:32:04+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>My $0.02 worth is that it no longer matters who started it. Both sides have killed too many on the other. There is no military solution. A peace deal is the only way out, for anyone. This pointless bloodshed accomplishes nothing.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Burgan:Darrell.html\">Darrell Burgan</a>", "published": "2014-07-29 00:14:42+00:00", "title": "By: Darrell Burgan"}, {"content": "<![CDATA[<p>IMHO this short video is the most telling about the reason there are so many seemingly civilian casualties in Gaza:</p>\n<p><a href=\"http://www.israelvideonetwork.com/this-is-what-is-really-going-on-in-gaza-right-now\" rel=\"nofollow\">http://www.israelvideonetwork.com/this-is-what-is-really-going-on-in-gaza-right-now</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/P:Michael.html\">Michael P</a>", "published": "2014-07-29 01:00:46+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>ScentOfViolets #293: I see; thanks.  Let me raise the possibility that behind your change of heart about Israel, there lies an extremely interesting misconception about <i>economics</i>.</p>\n<p>Your comment suggests to me that you think of the Palestine region as a fixed pie of resources.  There&#8217;s only so much land and water, so if Jewish settlers arrive en masse, they&#8217;ll have no choice but to take everything away from the Arabs.  Well, <i>sometimes</i> that&#8217;s how it works, but often not.</p>\n<p>Where do you think Israel&#8217;s current (relative) wealth came from?  From abundant natural resources?  Israel doesn&#8217;t have abundant natural resources.  It has some land for growing oranges and pomegranates and raising livestock, and Dead Sea salt that can be used to make specialty soap, and apparently some underseas oil (but that was only discovered a few years ago).  Some of the wealth came from overseas donations, and some from religious tourism.  But by far the greatest part was <i>created</i>.  It came from pharmaceuticals and microchips and car parts and other stuff that wasn&#8217;t there for anybody when the settlers arrived.  As for water, it&#8217;s still scarce, but Wikipedia <a href=\"http://en.wikipedia.org/wiki/Water_supply_and_sanitation_in_Israel\" rel=\"nofollow\">says</a> that &#8220;in an average year, Israel relies for about half of its water supply on unconventional water resources, including reclaimed water and desalination.&#8221;  And the same land now supports ~17 times the population that it did in 1920, including ~10 times as many Arabs.</p>\n<p>So put yourself in the shoes of the Grand Mufti of Jerusalem around the 1920s.  What do you think about the waves of Jewish settlers arriving on your shores?  <i>If</i> you&#8217;re a rational opportunist, then you should think: &#8220;This could be the <i>best thing economically</i> that&#8217;s ever happened to my people.  Better yet, unlike with the whites settling the Americas, these people won&#8217;t kill us with smallpox, for the simple reason that we now have a modern understanding of disease.  And they <i>seem</i> much more interested in hiring us than in killing us.  If they do turn violent, we&#8217;ll raise a stink with the British, who are terrified of an Arab uprising for oil reasons.  But in the meantime, we&#8217;d better take advantage of this golden opportunity before it passes, by partnering with the settlers and diverting as much wealth as we can to ourselves.  Later, <i>after</i> we&#8217;ve done that, maybe we can have an anti-colonial uprising to kill the settlers or kick them out.  But that&#8217;s for later.  For now let&#8217;s focus on getting rich.&#8221;</p>\n<p>Of course, despite everything, there <i>were</i> Arabs in the area who adopted some variant of the above attitude and who did pretty well.  But suppose the Grand Mufti had encouraged this as the general policy, rather than genocide.  Would the Palestinians have then become as well-off as the Israelis?  Maybe or maybe not; I don&#8217;t know.  But just by being in the right place at the right time, the Palestinians could <i>certainly</i> have become richer than any other Muslim society in the Middle East, except the oil fiefdoms.</p>\n<p>If I&#8217;m right, then the story of the Palestinians is, in part, a story of the triumph of religious fundamentalism and resentment over economic self-interest, with tragic results for everyone (not least for the Palestinians themselves).  And while this slow-motion tragedy had many different causes&#8212;one of which, yes, was criminal actions by Jewish extremists&#8212;I wonder whether a huge part of it boiled down to the all-too-common misconception that the pie is fixed.</p>\n]]>", "author": "Scott", "published": "2014-07-29 01:29:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>> there are millions (&#8230;) for whom Judaism is very important, and yet they are atheists. (&#8230;) it’s a total non sequitur in Islam or Christianity.</p>\n<p>That remembers me of a small anecdote, when a nurse came home after we had our first child. She was filling some administrativia, and among other things asked our religion.</p>\n<p>My wife: Catholics.<br />\nMe, in shock: Pardon me? We&#8217;re what?<br />\nMW, blushing: Shut up darling, here it&#8217;s a cultural question. We are culturally catholic, even if not at all religious.</p>\n<p>Duh&#8230; so he even offended the *atheist christians*. Thanks the Non-Existent we won&#8217;t feel that offended.</p>\n]]>", "author": "Jay", "published": "2014-07-29 03:00:11+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p><b>Accompaniment</b>&nbsp; <b><i><a href=\"http://www.youtube.com/watch?v=orLeh3GsY6s\" rel=\"nofollow\">Croppies Lie Down (1798)</a></i></b><br />\n<blockquote><b>A British narrative</b>&nbsp; &#8220;The story of the Irish and English is, in part, a story of the triumph of enlightened secular governance and broad economic prosperity, with beneficent results for everyone.&#8221;<br />\n&#8212;&#8211;<br />\n<b>Scott&#8217;s narrative</b>&nbsp; &#8220;The story of the [Zionists and] Palestinians is, in part, a story of the triumph of religious fundamentalism and resentment over economic self-interest, with tragic results for everyone.&#8221;</p></blockquote>\n<p>Two hundred years ago, many among my ancestors were singing <i>Croppies Lie Down</i>; many others were throwing stones at those who sang it.  </p>\n<p>Three devastating famines and two world-wars later, young people whose English-Irish ancestors fought to the death now happily intermarry&nbsp;&hellip; and think little of it.  </p>\n<p>Did Irish culture fo extinct?  English culture?  The Crown?  Did <i>any</i> of the religions concerned go extinct?  </p>\n<p>Nope. All prospered. </p>\n<p>And we got the Beatles!</p>\n<p>That is why, in the great tradition of the Enlightenment, we may reasonably hope for a similarly enlightened outcome in Israel-Gaza.</p>\n<p>If we are *REALLY* optimistic, we may hope that this leavening won&#8217;t take two centuries!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-07-29 03:27:39+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>@Anonymous #269:</p>\n<p><i>&#8220;For example, if the world stopped watching Israel tomorrow, do you doubt that Israel’s settlement rate would triple?&#8221;</i></p>\n<p>Why is it bad/immoral? The settlements do not harm by themselves the Palestinians nor anyone. Aren&#8217;t there a lot of Arab cities in Israel?</p>\n<p><i><br />\n&#8220;Do you doubt that they’d keep Gaza under siege forever? (Yes, Egypt is culpable as well).&#8221; </i></p>\n<p>For sure, I doubt this. Why would Israel want to spend its energy and resources to keep Gaza under siege, if Gaza doesn&#8217;t throw missiles at Israel nor sends terrorists to kill its citizens?<br />\nNear history indeed teaches us that Israel would not keep Gaza under siege. (Of course, also now there is no &#8220;Israeli siege&#8221;, because Egypt controls Gaza&#8217;s southern border.)</p>\n<p><i>&#8220;If Netanyahu was given the choice to save an Israeli soldier at the price of the lives of 10 Palestinian children, do you doubt that he would do it? If you do, I say you are being naive.&#8221;</i></p>\n<p>Obviously, he would chose the Israeli soldier, and most moral and ethical systems would support his choice; as well as the international law by itself, subject to the fact that there is a legitimate military target the soldier is trying to locate.<br />\nI already explained that AFAIK the international law says that it is &#8220;legal\\proportional&#8221; to kill (non-deliberately) 30 uninvolved citizens when  targeting a terrorist hiding in a civilian neighborhood. Are you suggesting that soldiers sent to war should commit suicide if their enemy surrounds himself with kids?</p>\n]]>", "author": "Clif", "published": "2014-07-29 04:05:59+00:00", "title": "By: Clif"}, {"content": "<![CDATA[<p>LOL, Jay #298. You are right, of course: there is a lot more to a religion with centuries of history than just religion: it permeated the whole culture.</p>\n<p>And before the recent advent of eigenmorality religion served at the initial basis for evaluating morality.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/P:Michael.html\">Michael P</a>", "published": "2014-07-29 04:45:21+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>@Itai says:</p>\n<blockquote><p>The Jewish country can not be in any other place, as this is our historical homeland, as I said this land was only in control of great empires after The Jews lost to the Roman Empire, and no people based their homeland in this country.</p></blockquote>\n<p>That&#8217;s an interesting point. What exactly do you mean by &#8220;can not be&#8221;? </p>\n<p>Do you mean it wouldn&#8217;t have worked out in any other location? e.g. If 150 years ago the Aliah&#8217;s would have started to some designated pocket, in say, Mongolia would Jews have not responded, you think?</p>\n<p>How much is the fact relevant to success, that you are basing a modern settlement in some Biblical location that hasn&#8217;t been actively your homeland for 2000+ years since the fall of the Roman Empire?</p>\n<p>Or does your &#8220;can not be&#8221; imply a legal claim in the sense: Since we originally inhabited this region 2000 years ago we have the right to it now & so we must exercise it? </p>\n<p>Just to be sure: There wasn&#8217;t a Jewish majority in these regions in the intervening 2000 years after the fall of the ancient empires, was there?</p>\n]]>", "author": "Rahul", "published": "2014-07-29 04:53:22+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>And meanwhile, while we are debating how and why Israel should be blamed for its misconducts, 1700 Syrian were killed last week in their tribal war.<br />\nI guess the point is that the Israeli-Arab conflict is really not a real problem: had Israel not existed, the death toll in the region would probably be even higher.</p>\n]]>", "author": "Clif", "published": "2014-07-29 04:57:19+00:00", "title": "By: Clif"}, {"content": "<![CDATA[<p>ScentOfViolets  says: </p>\n<blockquote><p>As a matter of fact, I used to be very pro-Israel. I didn’t know anyone who wasn’t back in the mid-70′s (Munich, remember?), and I’d read all the usual pro-Israel stuff like Michener’s The Source. </p></blockquote>\n<p>I think, in general, if I&#8217;d been around in the 1950&#8242;s, 1960&#8242;s etc. I&#8217;d be far more sympathetic of Israel than I can be today (and I still am by no means anti-Israel! I think it&#8217;s a fine nation overall)</p>\n<p>A part of this is the underdog effect I think. It really was a rugged, struggling nation back then, with pioneers who had migrated from thousands of miles away just for an idea. Many were actual holocaust survivors. Their planes were getting hijacked. Athletes slaughtered. </p>\n<p>Life was harder. Scarcity was rife.  It wasn&#8217;t the prosperous nation with an advanced Missile Defense Shield we see today. </p>\n<p>I think gradually Israel, intentionally or otherwise, has made it harder for  rational third parties to sympathize with it as strongly as they used to.</p>\n]]>", "author": "Rahul", "published": "2014-07-29 05:03:18+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Great essays in the updated link.</p>\n<p>Always astounds me to no end why people seem to have this irrational need to pick sides in such a protracted conflict.</p>\n<p>I.e. for me it&#8217;s quite naturally to regard Hamas with about the same degree of sympathy that I have for the pathological killer gang formerly know as ISIS. Yet, at the same time I harbor a deep suspicion that Netanyahu simply latched onto the opportunity for war that the death of the kidnapped teenagers gave him. I think he may act mostly out of political expedience (it shores up his base and rallies the electorate around the PM).</p>\n<p>Now, be this as it may, this blog is mostly populated with scientists, so shouldn&#8217;t this at least help in establishing what to regard as facts when it come to this conflict?</p>\n<p>For instance, what was the demographic development of this part of the world since the Roman empire?  How much of this can be factually inferred? The use of the term &#8216;Palestine&#8217; is apparently  quite recent, so how many of the people who count themselves as Palestinians are legitimately descendants of people who originally lived in this area before there was Israel? </p>\n<p>Another question that one should be able to settle objectively is the following: Is there a defacto blockade of Gaza by Israel?  Cliff points out that the borders are not controlled by Israel, but what about the coastal access?  </p>\n<p>Then of course there are the big questions that will be almost impossible  to decide objectively,  what role does Antisemitism play?  And why the heck has it seemingly been going on forever?</p>\n<p>Is it simply because scapegoating a minority has always been a very useful tool to ruthless rulers? Throughout the millennia Jews were certainly an especially easy target as they had no country of their own (and the dominant religion made it easy to denounce them). </p>\n<p>Yet, it took Hitler and a &#8216;modern&#8217; pseudo-scientific ideology to take it to an unprecedented genocidal level.</p>\n<p>On the other hand <a href=\"http://en.wikipedia.org/wiki/Golden_age_of_Jewish_culture_in_Spain\" rel=\"nofollow\">Jews had been relatively save in Europe under Muslim rule</a>, and even now <a href=\"http://en.wikipedia.org/wiki/Persian_Jews#Current_status_in_Iran\" rel=\"nofollow\">there is a sizable Jewish minority in Iran</a> that seems to be able to mostly go about their business without systematic discrimination. Even the, less than subtle thinkers, at <a href=\"http://www.breitbart.com/Big-Peace/2014/07/26/27-Jul-14-World-View-Iran-s-Supreme-Leader-wants-to-annihilate-Israel-but-not-Jews\" rel=\"nofollow\">breitbart.com caught on to the fact that Iran&#8217;s Supreme Leader makes a distinction between Israel and Jews.</a></p>\n<p>We may lump all these attitudes together into the term Antisemitism, but it seems to me there are at least three major strains to distinguish.</p>\n<p>1) Classical Christian (&#8216;Jesus killers blah blah&#8217;)<br />\n2) Social-Darwinism racism<br />\n3) Contemporary Muslim<br />\n[3a] Genocidal (e.g. Hamas) [3b] Anti-Israel (e.g. Iran)</p>\n]]>", "author": "quax", "published": "2014-07-29 05:48:20+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Scott #289:<br />\ntry and put your political correctness through a test by reading &#8216;The Arab Mind&#8217; by the late Columbia University anthropologist Raphael Patai.</p>\n]]>", "author": "Faibsz", "published": "2014-07-29 12:42:04+00:00", "title": "By: Faibsz"}, {"content": "<![CDATA[<p>Scott #284:<br />\nas the devil is in  the detail, can  you please explain the difference between &#8216;the settlements&#8217; and &#8216;Israel proper&#8217;.<br />\nIn  other words, has land for Pizgat Zeev and Maale Adumim and the Jewish Quarter of  Jerusalem&#8217;s  Old City been grabbed and  will be &#8216;returned&#8217;?</p>\n]]>", "author": "Faibsz", "published": "2014-07-29 13:09:57+00:00", "title": "By: Faibsz"}, {"content": "<![CDATA[<p>quax #305</p>\n<p>&#8220;what role does Antisemitism play? And why the heck has it seemingly been going on forever?&#8221;</p>\n<p>Also, from the Harris piece:<br />\n&#8220;And there are millions of Jews, literally millions among the few million who exist, for whom Judaism is very important, and yet they are atheists. They don’t believe in God at all. This is actually a position you can hold in Judaism, but it’s a total non sequitur in Islam or Christianity.&#8221;</p>\n<p>So Judaism is more like a very exclusive club based on bloodline than a religion?<br />\nAnyone can convert pretty much instantly to Islam and Christianity, regardless of race and background. Those religions have always considered mass conversion as a long term goal &#8211; the more, the better.<br />\nBut (correct me if I&#8217;m wrong) my understanding is that unless your mother is Jewish (a recursive definition) you will always be an outsider.<br />\nI&#8217;ve seen there are ways to &#8220;convert&#8221; but it seems extremely convoluted and based on trying to discourage the candidate as much as possible&#8230; i.e. I doubt you could ask a Rabbi to convert you to be an &#8220;atheist Jew&#8221;?<br />\nIn many ways, this is very similar to being Japanese &#8211; nearly impossible to get the citizenship, and even so, you will be an outsider no matter what.<br />\nI&#8217;m guessing that some people resent this or fear it. Added to the fact that the Jewish people are often very resilient and successful, it&#8217;s all fertile ground for conspiracy theories.</p>\n<p>The irony is that this particularity of Judaism is also what ought to make it easy for non Jews to tolerate it &#8211; the population is small and unlikely to grow very fast.</p>\n]]>", "author": "fred", "published": "2014-07-29 13:20:59+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #308: Yes, you&#8217;ve put your finger on one of the causes of antisemitism.  And yes, the big irony is that, a priori, you might imagine that Jews <i>not</i> trying to convert to entire world to Judaism might make it easier, rather than harder, for other people to tolerate them.</p>\n<p>It&#8217;s different from being Japanese, because Japanese is an ethnicity.  The best characterization I&#8217;ve heard is that Jews are basically an extended family&#8212;one with certain beliefs and rituals that have accrued over the generations (but which not all family members care about, and which some vehemently reject), and with certain common genetic traits (but which aren&#8217;t universal, since many people came into this family by way of adoption or marriage).</p>\n<p>The Orthodox rule is that you&#8217;re a Jew if either your mother is Jewish or you underwent a formal process of conversion.  And yes, Orthodox conversion is supposed to be difficult, but once it&#8217;s finished the rabbis would officially consider you 100% Jewish forever after, even if you became an atheist the next day. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />   And while you might still feel like an &#8220;outsider&#8221; (especially if you chose to live in a tight-knit Orthodox community), presumably your children would feel less like outsiders, and their children less so, with intermarriage diluting the differences.</p>\n<p>Conservative and Reform Judaism still put you through a conversion process, but a less demanding one.  In particular, a non-Jews who get married to Jews (and in the US, the intermarriage rate is now above 50%) sometimes do a Conservative or Reform conversion.  Unfortunately, that conversion isn&#8217;t recognized by the Orthodox, which can cause serious contention in Israel, because the Orthodox alone get to decide who&#8217;s &#8220;Jewish&#8221; for purposes of Israeli law.  </p>\n<p>(Personally, I strongly believe that that aspect of Israeli law should be changed.  It was basically a concession that David Ben-Gurion gave to the Orthodox, to get them to support the new state.)</p>\n<p>There are two more important points to make.</p>\n<p>First, you can immigrate to Israel even if you&#8217;re not Jewish and have zero interest in being Jewish (and I know people who have done so, e.g. because of romantic relationships).  The difference is just that immigration isn&#8217;t automatic; you go through an immigration process similar to that of other Western countries.</p>\n<p>Second, while intermarriage (and other interbreeding with non-Jews) used to be much less common than they are now, we know they happened at a non-negligible rate throughout Jewish history.  How do we know that?  Well, take me for example.  Like a good number of Ashkenazim, I have blue eyes and blond hair (OK, at least when I was a kid; now it&#8217;s sort of brown).  I don&#8217;t look like a &#8220;Semite,&#8221; or for that matter, like Ethiopian or Mizrachi or other kinds of Jews.  The difference can only be because my ancestors were interbreeding with the non-Jewish populations in Belarus and Romania and wherever else they were.</p>\n]]>", "author": "Scott", "published": "2014-07-29 14:11:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Fred #308<br />\nThere is  not one but several varieties of Judaism. In Reform (the largest in  the US) a Jewish father is enough to be Jewish and conversion in most cases is a rather simple procedure. You would still be &#8216;an outsider&#8217; among the Orthodox, but so are millions of &#8216;kosher&#8217; non-Orthodox Jews.</p>\n]]>", "author": "Faibsz", "published": "2014-07-29 14:13:50+00:00", "title": "By: Faibsz"}, {"content": "<![CDATA[<p>Scott #309:<br />\n&#8220;And yes, Orthodox conversion is supposed to be difficult, but once it’s finished the rabbis would officially consider you 100% Jewish forever after, even if you became an atheist the next day.&#8221;<br />\nNot correct, at least according to Halakha. And in practice pelnty of conversions have been annulled for that very reason (or even for not keeping the mitzvot)</p>\n]]>", "author": "Faibsz", "published": "2014-07-29 14:18:45+00:00", "title": "By: Faibsz"}, {"content": "<![CDATA[<p>Scott #309:<br />\n&#8220;And while you might still feel like an “outsider” (especially if you chose to live in a tight-knit Orthodox community), presumably your children would feel less like outsiders, and their children less so, with intermarriage diluting the differences&#8221;<br />\nAlso not correct. Not only gers (converts) but even baalei-t&#8217;shuva (Jews who became Orthodox later in life) remain second-class in the Orthodox world, mostly marrying among themselves (or other Jews with &#8216;defects&#8217;) for generations</p>\n]]>", "author": "Faibsz", "published": "2014-07-29 14:38:59+00:00", "title": "By: Faibsz"}, {"content": "<![CDATA[<p>Scott #309:<br />\n&#8220;Second, while intermarriage (and other interbreeding with non-Jews) used to be much less common than they are now, we know they happened at a non-negligible rate throughout Jewish history. How do we know that?&#8221;<br />\nActually, we don&#8217;t.  The genetic evidence  shows the opposite(Ethiopean Jews are  different &#8211; they are not &#8216;genetically&#8217; Jewish):<br />\n<a href=\"http://www.amazon.co.uk/Jacobs-Legacy-Genetic-Jewish-History/dp/0300125836/ref=pd_sim_b_2?ie=UTF8&#038;refRID=0R2XW9K2644TVW1TK8XA\" rel=\"nofollow\">http://www.amazon.co.uk/Jacobs-Legacy-Genetic-Jewish-History/dp/0300125836/ref=pd_sim_b_2?ie=UTF8&#038;refRID=0R2XW9K2644TVW1TK8XA</a></p>\n]]>", "author": "Faibsz", "published": "2014-07-29 14:48:06+00:00", "title": "By: Faibsz"}, {"content": "<![CDATA[<p>Faibsz: OK, I&#8217;ll defer to people who know more than I do about Orthodox customs (though presumably the issues you mentioned are more serious among the ultra-Orthodox than among modern Orthodox).  And OK,  Ethiopian Jews might be genetically a separate branch.  But I believe the DNA evidence shows that Ashkenazi, Mizrahi, etc. Jews have a mixture of Semitic ancestry, with ancestry from whatever populations their ancestors lived among for the last couple thousand years.</p>\n]]>", "author": "Scott", "published": "2014-07-29 14:59:30+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #309: </p>\n<blockquote><p>&#8220;Yes, you’ve put your finger on one of the causes of antisemitism. And yes, the big irony is that, a priori, you might imagine that Jews not trying to convert to entire world to Judaism might make it easier, rather than harder, for other people to tolerate them.&#8221;</p></blockquote>\n<p>I always found striking similarities between Jews & the Parsis of India  (Zorastrians): both tiny religions today with a very ancient origin (both in the Middle East), with very smart, influential people that have had a deep impact on the world in science, culture etc. Both religions having a long tradition of business & entrepreneurship. </p>\n<p>Also both religions having quite strict marriage rules & conversions being quite hard or non-existant. Just like Jews migrated in search of safety, most recently to Israel the Parsis migrated too: from Iran to India ~1000 years ago. </p>\n<p>The only striking difference  is this: The Parsi past, at least for the last 500 years seems devoid of persecution or conflict. In spite having had to live in Hindu majorities & Moslem kingdoms the Parsis were always a safe & respected community. </p>\n<p>So I guess &#8220;not trying to convert the entire world &#8221; must help, at least in the Parsi case, to have the other religions tolerate them.</p>\n]]>", "author": "Rahul", "published": "2014-07-29 14:54:33+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Faibsz #307: I regard the exact boundaries as <i>negotiable</i>&#8212;ideally, as something for Israel and the Palestinians to hammer out in a peace deal (but failing that, I also think Israel should pick reasonable boundaries unilaterally).  Personally, I&#8217;d draw the line so that the Jewish Quarter of the Old City, and settlements like Maale Adumim, went into Israel (with possible land swaps), while further-away settlements were dismantled.  Isn&#8217;t that exactly what was being discussed at the Camp David and Taba accords that Arafat walked away from?  It sounded pretty reasonable to me (or rather: less unreasonable than any alternative), and still does.</p>\n]]>", "author": "Scott", "published": "2014-07-29 15:06:37+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Ali Rizvi writes in the linked article that:<br />\n<blockquote>&#8220;It is telling that most Muslims around the world support Palestinians, and most Jews support Israel. This, of course, is natural -&#8230;It means that this is not about who&#8217;s right or wrong as much as which tribe or nation you are loyal to. &#8220;</p></blockquote>\n<p>In this context, I wonder, what&#8217;s the public perception of this conflict if you ignore the views of respondents who identify themselves as either Jewish or Moslem. </p>\n<p>Are there any recent surveys out there? Just curious which side the public sympathy is if you remove opinions of those who have a strong &#8220;tribal&#8221; investment in the issue. </p>\n<p>Opinion polls aside, who are the leading non-Jewish, non-Muslim intellectuals writing about this issue & overall is their opinion more sympathetic of one side than the other?</p>\n]]>", "author": "Rahul", "published": "2014-07-29 15:08:17+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<blockquote><p><b>Boaz Barak</b> remarks [#12] “I have yet to see a thoughtful discussion on this topic in any blog/news-site/forum comment section. I am afraid this will not be the exception.”</p></blockquote>\n<p>Continuing the effort to disconfirm Boaz&#8217; expectations, here are further suggested readings.</p>\n<p><b>Insights from Quakerism and Philosophy</b>&nbsp; As a follow-on to works of Cantor, Israel, and Morgan (referenced in comment #141), the attention of <i>Shtetl Optimized</i> is directed to (philosopher) Reshef Agam-Segal&#8217;s Judaic-Quaker Testimony <a href=\"http://reshefagamsegal.weebly.com/notes-and-half-thoughts/israeli-palestinian-conflict\" rel=\"nofollow\"><b><i>Israeli-Palestinian Conflict</i></b></a>, which can be read as a graduate-level extension of the themes of Sam Harris&#8217; essay,  </p>\n<p>In particular, Morgan&#8217;s article (of #141) and Reshef Agam-Segal&#8217;s philosophical testimony combine to provide useful antidotes to a notably incorrect assertion in Sam Harris&#8217; essay<br />\n<blockquote><b>Sam Harris</b> asserts [wrongly and without reason or justification] &#8220;This [disbelief in G*d] is actually a position you can hold in Judaism, but it’s a total non sequitur in Islam or Christianity.”</p></blockquote>\n<p>Harris&#8217; claim is surprising because Harris&#8217; own father <i>is a Quaker</i>&nbsp;&hellip; and so he should know better!</p>\n<p><b>Insights from Orthodox Judaism</b> (a personal testimony)&nbsp; Recently it was my great pleasure, and a wonderful learning experience, to attend a six-hour Orthodox service here in Seattle.  Much of the service was in Hebrew (which I don&#8217;t speak), but no problem!  It&#8217;s an opportunity for scholarship! I was provided with a table-full of scrupulously annotated texts, and help in following the entire service.  </p>\n<p>The Rabbi&#8217;s message was direct yet subtle&nbsp; the Biblical text was Genesis 34 (Dinah and Schechem); the commentary was the <i>Pirkei Avot</i> (Ethics of the Fathers)<br />\n<blockquote>&#8220;He [Elazar ben Azaryah] used to say: Anyone whose wisdom exceeds his good deeds, to what can he be compared? To a tree whose branches are numerous but whose roots are few, and the wind comes and uproots it and turns it upside down; as it is stated: And he shall be like a lonely tree in arid land and shall not see when good comes; he shall dwell on parched soil in the wilderness, on salt-land, not inhabitable.&#8217;&#8221; </p>\n<p>&#8220;But anyone whose [good] deeds exceed his wisdom, to what can he be compared? To a tree whose branches are few but whose roots are numerous, so that even if all the winds in the world were to come and blow against it, they could not move it from its place; as it is stated: And he shall be like a tree planted by waters, toward the stream spreading its roots, and it shall not feel when the heat comes, and its foliage shall be verdant; in the year of drought it shall not worry, nor shall it cease from yielding fruit.&#8221;</p></blockquote>\n<p>The tough questions that the <i>Pirkei Avot</i> naturally raises  &#8220;Are Israel&#8217;s deeds in Gaza wise (in the politically and military senses) but not good (in the moral senses)?  What will be the fruits of these actions, when the winds of war subside?  What are the long-term effects of this war, upon the unseen <i>roots</i> of Judaism?&#8221; were left to the interpretation(s) of the congregation, and to the judgment(s) of history.</p>\n<p><b>Insights from the USMC reading list</b>&nbsp; Turning to the contentious question &#8220;How do Arabs/Muslims think?&#8221;&nbsp;&mdash; which necessarily entails sobering reflections upon &#8220;How do *WE* think?&#8221;&nbsp;&mdash; the present USMC reading list commends readings that include:<br />\n<code><br />\n• \"THE GREAT ARAB CONQUESTS\" BY H KENNEDY<br />\n• \"UNDERSTANDING ARABS:  A CONTEMPORARY GUIDE TO ARAB SOCIETY\" BY M NYDELL<br />\n• \"WHAT WENT WRONG?:  THE CLASH BETWEEN ISLAM AND MODERNITY IN THE MIDDLE EAST\" BY B LEWIS<br />\n• \"ANGRY WIND, THROUGH MUSLIM BLACK AFRICA BY TRUCK, BUS, BOAT AND CAMEL\" BY J TAYLER<br />\n</code><br />\nas well as less obvious entries<br />\n<code><br />\n• \"THINKING IN TIME:  THE USES OF HISTORY FOR DECISION MAKERS\" BY R NEUSTADT AND E MAY<br />\n• \"RETHINKING THE PRINCIPLES OF WAR\" BY A MCIVOR<br />\n• \"WHAT IT IS LIKE TO GO TO WAR\" BY K MARLANTES<br />\n• \"COURAGE AFTER FIRE:  COPING STRATEGIES FOR TROOPS RETURNING FROM IRAQ AND AFGHANISTAN AND THEIR FAMILIES\" BY K ARMSTRONG, S BEST AND P DOMENICI<br />\n• \"DERELICTION OF DUTY: JOHNSON, MCNAMARA, THE JOINT CHIEFS OF STAFF AND THE LIES THAT LED TO VIETNAM\" BY H MCMASTER<br />\n</code><br />\nand even<br />\n<code><br />\n• \"THE COPERNICAN REVOLUTION\" BY T KUHN<br />\n</code><br />\nThat the US Marines&nbsp;&mdash; in the midst of a long grinding war&nbsp;&mdash;  view Kuhn&#8217;s work as having military relevance is a testimony to the enduring strategic power of the scientific revolution.</p>\n<p><b>Conclusion</b>&nbsp; Boaz Barak&#8217;s lament “I have yet to see a thoughtful discussion on this topic [Israel-Gaza] in any blog/news-site/forum comment section.&#8221; reflects very largely a distressing preference, even among scientists, for slogan-shouting grounded in ignorance, as contrasted with broad-based reading-and-learning. </p>\n<p>Of Marines, Quakers, Jews, and scientists, the <i>least</i> well-read by far (and so perhaps the least aware of their own ignorance) are&nbsp;&hellip; the scientists.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/SIdles:John.html\">John SIdles</a>", "published": "2014-07-29 15:13:23+00:00", "title": "By: John SIdles"}, {"content": "<![CDATA[<p>Scott</p>\n<p>how about the many blond &#8216;Semites&#8217; in Syria (majority in some coastal areas) and Judea and Samaria (oops, sorry &#8211; occupied West Bank)? Have they also been interbreeding in Belarus and Romania?</p>\n]]>", "author": "Peter", "published": "2014-07-29 15:32:31+00:00", "title": "By: Peter"}, {"content": "<![CDATA[<p>Looking at this thread ~300 comments later, I still feel that such Internet debates are mostly counterproductive. People try to &#8220;score points&#8221; and &#8220;win an argument&#8221;, rather than truly learn about what is a very complicated situation, which cannot be explained by oversimplifying to hypothetical &#8220;trolley experiments&#8221; or by throwing around isolated &#8220;facts&#8221; without considering the larger context. </p>\n<p>I also feel that people that haven&#8217;t actually lived in Israel or the territories often choose to demonize one side of this conflict and idealize the other, for reasons that have more to do with their own personal background than with the actual past,present and future of the people in this region. (Of course a great many of the people who do live in the region also demonize the other side and idealize their own; these parallel narratives and inability to see the other side are one of the reasons for this ongoing tragedy.)</p>\n<p>The closest approximation to my own feelings (and the reason I&#8217;m posting this comment) is David Grossman&#8217;s op-ed ( <a href=\"http://www.nytimes.com/2014/07/28/opinion/david-grossman-end-the-grindstone-of-israeli-palestinian-violence.html?_r=0\" rel=\"nofollow\">http://www.nytimes.com/2014/07/28/opinion/david-grossman-end-the-grindstone-of-israeli-palestinian-violence.html?_r=0</a> ), though I am not sure I share his optimism that Israel&#8217;s society is maturing and in particular understanding the limits of force.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barak:Boaz.html\">Boaz Barak</a>", "published": "2014-07-29 15:40:04+00:00", "title": "By: Boaz Barak"}, {"content": "<![CDATA[<p>Btw if anybody is confused what this conflict is ultimately about, I recommend to look at this tweet of Lebanese tv anchor Christine Habib: &#8220;Iran should send its nuclear weapons, if they exist, to Hamas.&#8221; </p>\n<p><a href=\"https://twitter.com/Christine_Habib/status/492719466715705344\" rel=\"nofollow\">https://twitter.com/Christine_Habib/status/492719466715705344</a> </p>\n<p>And Mr. Khameini has already told us what needs to be done with his &#8220;answer to 9 key questions about elimination of Israel&#8221;. </p>\n<p><a href=\"https://twitter.com/khamenei_ir/status/493008303384199168\" rel=\"nofollow\">https://twitter.com/khamenei_ir/status/493008303384199168</a></p>\n]]>", "author": "wolfgang", "published": "2014-07-29 15:53:15+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Scott #317:</p>\n<p>yes, I meant ultra-Orthodox. Haredim (ultra-Orthodox) hate modern Orthodox (National-Religious) more than they hate atheists. A couple of years ago in Israel haredi rabbis annulled thousands of conversions (of mostly immigrants from Russia) by a leading modern Orthodox rabbi. </p>\n<p>Genetics show that (mostly Ashkenazi) Jews started interbreeding with the locals within the Jewish  communities in the past hundred years. Before that it meant leaving Jewery and Judaism, often against their will (there are studies that show up to a quarter of Spaniards have some Jewish ancestry). </p>\n<p>Scott #318:<br />\nit sounds reasonable to you because you are a reasonable person. As Hannan Ashrawi has said (and you can&#8217;t find a more reasonable Palestinian):&#8217;We Palestnians are an all or nothing people&#8217;. And with  time (and fertility) on their side (as much of the world believes) Palestinians are not in a hurry for a compromise, however reasonable and beneficial to both sides (to talk bubkes, what&#8217;s wrong with an EU-like federation for the whole region?)</p>\n<p>PS Do you still need proof that the policy of setting unilaterally boundaries a la Sharon&#8217;s disengagement from Gaza is dead and buried (no pun  intended)?</p>\n]]>", "author": "Faibsz", "published": "2014-07-29 16:15:27+00:00", "title": "By: Faibsz"}, {"content": "<![CDATA[<p>Peter #321: That&#8217;s an interesting question to which I didn&#8217;t know the answer, so I did some googling, gingerly skipping over the white-supremacist links. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />   From what I could find, it seems that, yes, pretty much <i>every</i> population with blond hair and blue eyes (i.e., where those aren&#8217;t rare mutations) got them because of interbreeding with Caucasian populations in Europe, where these mutations arose and spread some 8000-10000 years ago.  Someone correct me if I&#8217;m wrong.  (It should go without saying that there&#8217;s no possible answer to such questions, from which anything morally significant would follow&#8230;)</p>\n]]>", "author": "Scott", "published": "2014-07-29 16:35:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Yesterday (or some time between yesterday and today) nine Israeli soldiers were killed in combat. </p>\n<p>These were purely military casualties.</p>\n<p>This is Israel&#8217;s &#8220;civilian casualties minimizing&#8221; &#8220;response&#8221; -</p>\n<p>• Gaza Strip&#8217;s only power plant &#8216;hit by shelling&#8217;<br />\n• Enclave suffers one its heaviest night of bombardment of offensive so far<br />\n• House of Gaza&#8217;s Hamas leader Ismail Haniyeh destroyed; no casualties<br />\n• Five hours of strikes as Israel retaliates for death of five Israeli soldiers<br />\n• Palestinians mourn killings of eight children and two men at Beach refugee camp<br />\n• Israeli army denies refugee camp airstrike; says was hit by misfired Hamas rocket </p>\n<p>In Gaza, a health official said at least 100 Palestinians were killed in Israeli airstrikes and tank shelling Tuesday, as Israel escalated its military campaign. The official, Ashraf al-Kidra, said the day’s death toll was expected to rise.</p>\n<p>Your claims are at least prima-facie ridiculous, Scott.</p>\n]]>", "author": "Anonymous", "published": "2014-07-29 16:34:55+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>Faibsz #324: OK, I really don&#8217;t know.  In Gregory Cochran&#8217;s interesting book <a href=\"http://www.amazon.com/The-000-Year-Explosion-Civilization/dp/0465020429/ref=sr_1_1?ie=UTF8&#038;qid=1406652126&#038;sr=8-1&#038;keywords=cochran+year+explosion\" rel=\"nofollow\">The 10,000 Year Explosion</a>, he says the genetic evidence suggests that the Ashkenazim were interbreeding with the surrounding populations at about 0.5% per generation throughout their history (whether because of conversion, rape, illegitimate liaisons, etc., the evidence doesn&#8217;t say).  While that&#8217;s a tiny rate by modern standards, over 1000+ years it adds up to something substantial.</p>\n]]>", "author": "Scott", "published": "2014-07-29 16:43:01+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Boaz #322: OK, I&#8217;m sorry the discussion wasn&#8217;t up to your standards.</p>\n<p>Both because it makes for an interesting contrast with your reaction, and because I&#8217;m an oversensitive and thin-skinned person, <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />  let me paste an email I got last night from a different Israeli friend/colleague, with that person&#8217;s permission.</p>\n<ul>I just finished reading your Israel blog post and the responses (that keep coming&#8230;)  I&#8217;m not a person to comment on blogs (or Facebook, etc) in general, and also not a person to publicly discuss this particular topic (I&#8217;m one of those Israelis who would be uncomfortable and change the subject).  So I&#8217;m not putting a comment there. But I just had to email you, to say that I admire you.  Not for the specific details of the opinions you express (although I largely agree), but the way you handle the discussion is amazing &#8212; the combination of logic and rational arguments with a good (as in the opposite of evil) attitude, rare clarity, historical knowledge, thoughtful discussion, responding seriously and respectfully to those who deserve it, and sharply and to the point with the one ridiculous commenter who is clearly is not thoughtful and completely deluded (to the point of thinking him/herself not picking sides!). And you clearly have guts (in addition to time and talent!).  I can&#8217;t believe I read all those comments, but it was thought provoking and I learned some things.<br />\nIf anyone has a chance to change anyone&#8217;s mind on a blog, it&#8217;s you (and I think there&#8217;s some chance that this is not vacuously true).</ul>\n]]>", "author": "Scott", "published": "2014-07-29 17:18:53+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, I wholeheartedly agree with that email. I wouldn&#8217;t even consider debating this issue (or any other that evokes equally strong feelings and has so much nuance) anywhere else on the internet, but this has been a very enlightening discussion.</p>\n]]>", "author": "Vadim", "published": "2014-07-29 17:30:06+00:00", "title": "By: Vadim"}, {"content": "<![CDATA[<p>I don&#8217;t mean to criticize this discussion more than other discussions on this topic and definitely not to criticize you personally. I generally find your blog a very good read exactly because you are an extremely thoughtful person that usually goes much deeper than the &#8220;prevailing wisdom&#8221; and can be counted on to give a unique perspective on great many topics. </p>\n<p>And I do think that along with the &#8220;point scoring&#8221; comments, there are some insightful ones. (Especially the personal experiences of Eli and Orr; I also found this article of Sari Nusseibeh <a href=\"http://www.haaretz.com/news/diplomacy-defense/israel-peace-conference/1.599063\" rel=\"nofollow\">http://www.haaretz.com/news/diplomacy-defense/israel-peace-conference/1.599063</a> which I got through one of John Sidles&#8217; links to be a very interesting read, even if I don&#8217;t agree with good portions of it.) </p>\n<p>My issue with internet debates on this topic is that they seem to draw out the extremists on both sides, and arguing with someone like that often forces you to take a simplistic position in the other direction. Also I guess that I have a fundamental doubt of the applicability of logic and mental experiments or metaphors on trolleys, dials, swedes, or paraplegics, to real-world political and moral dillemas. </p>\n<p>I do think this thread contained some good comments and is well above the average for this topic. It is definitely up to my standards, though I would argue that it is perhaps not up to *your* very high standards that you set in your writing on other topics.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barak:Boaz.html\">Boaz Barak</a>", "published": "2014-07-29 18:22:56+00:00", "title": "By: Boaz Barak"}, {"content": "<![CDATA[<p>Boaz #322</p>\n<p>I speak only for myself, but I&#8217;ve learned a ton of stuff thanks to this thread.<br />\nWhile I still can&#8217;t and won&#8217;t &#8220;pick a side&#8221;, the point is that I now understand much better the complexity of the issue.</p>\n]]>", "author": "fred", "published": "2014-07-29 18:41:09+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott, your original post seems to imply an important distinction between killing civilians and non-civilians. I realise this is also a popular view but I am not sure it is a particularly valid moral distinction.  Have you asked yourself why you think it is better to kill a soldier than a civilian?</p>\n<p>Israel has a conscripted army, you can&#8217;t argue that the soldiers have individually chosen to attack Gaza. You can of course argue they have implicity made this choice by choosing to remain living in Israel but then this applies to the whole jewish Israeli population as well.  Furthermore, if we start from the point of view that there is an ongoing war between Gaza and Israel and that both sides would like to &#8220;win&#8221;, there is no rational way that Gazans can do this by attacking solely Israeli military targets. There is no prospect of their being able to substantially degrade Israeli military might, for example, by firing some rockets over the border.  As a result, the only rational decision, if you accept that there should be war at all, is for the Israelis to attack the Gazan military (which is indistinguishable from what they would terrorists) and for Gazans to attack any Israeli they can reach.  </p>\n<p>This is not to say the whole sorry affair has any morally good actors. It is just to say that unless you believe Gazans should simply surrender (which of course many people do), then one type of killing is really much like any other.</p>\n]]>", "author": "Wiggy", "published": "2014-07-29 19:42:28+00:00", "title": "By: Wiggy"}, {"content": "<![CDATA[<p>Scott 326/327:</p>\n<p>If the &#8216;blond&#8217; mutations appeared some 10,000 years ago, why had your ancestors waited until they got (sometime late in the Middle Ages &#8211; 17th century?) to Romania and Belarus?<br />\nThere were plenty of Arians for Jews to fool around with in Israel/Palestine 2,000 years ago (or earlier) and the rabbis didn&#8217;t mind it as much as they do now.</p>\n]]>", "author": "Faibsz", "published": "2014-07-29 20:09:10+00:00", "title": "By: Faibsz"}, {"content": "<![CDATA[<p>Anonymous 325:</p>\n<p>you &#8216;forgot&#8217; dozens of missiles fired at Israeli population centres by Hamas and a cache of rockets found in an UNWRA school in Gaza today</p>\n]]>", "author": "Peter", "published": "2014-07-29 20:21:59+00:00", "title": "By: Peter"}, {"content": "<![CDATA[<p>@Anonymous #325</p>\n<p>Did you read the 3 sentence blog post?<br />\nHint: There is a 3rd sentence.</p>\n]]>", "author": "wolfgang", "published": "2014-07-29 20:26:22+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Wiggy #332: It&#8217;s bizarre to say that there &#8220;should&#8221; be war&#8212;of course there &#8220;should&#8221; never be!  But if there <i>is</i> one, then the distinction I think is morally relevant is between</p>\n<p>(a) violence <i>more-or-less directly aimed at preventing other violence</i>&#8212;so for example, directed against military installations, or against soldiers who have entered one&#8217;s territory (which might, of course, tragically also kill civilians as an unintended consequence), and</p>\n<p>(b) violence that&#8217;s simply aimed at killing as many people as possible perceived as the &#8220;enemy&#8221; as they go about their normal lives, and that can only be justified as &#8220;aimed at preventing violence&#8221; if one construes the word &#8220;violence&#8221; in a very abstract sense (&#8220;the violence of the occupation&#8221;).</p>\n<p>I completely agree that the deaths of Israeli soldiers are tragedies; these are mostly kids fresh out of high school who didn&#8217;t choose to be enlisted.  (While it&#8217;s possible for males to fulfill their IDF service without becoming combat soldiers, I believe they keep you there for additional years if you do.)  On the other hand, I feel that firing indiscriminately at population centers has a different degree of awfulness than firing at soldiers who have entered one&#8217;s territory (and I&#8217;m hardly alone in this opinion).</p>\n<p>One thing I <b>completely</b> disagree with, is that the only options for Palestinians are &#8220;surrender,&#8221; or else indiscriminate attacks on civilians.  For one thing, while it&#8217;s true that they don&#8217;t have a serious hope right now of degrading the Israeli military, they&#8217;re not having great success <i>either</i> at killing civilians!  For another, what about civil disobedience, or even sabotage?  Had they used those approaches from the beginning, it seems likely that there would now be a peace deal.  Pretty much all the Israeli reactions and overreactions&#8212;the fences, the checkpoints, the &#8220;blockade&#8221;&#8212;have been motivated by a sadly more-than-justified fear of violence.</p>\n]]>", "author": "Scott", "published": "2014-07-29 21:37:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Faibsz #333: OK, of course I have no clue <i>exactly</i> what my ancestors were doing what, when, and with whom. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />   But, well &#8230; do <i>you</i> have a better explanation for why the descendants of the Jews who settled in Eastern Europe look sort of Eastern European, while the descendants of those who settled in Middle-Eastern lands look sort of Middle-Eastern?</p>\n]]>", "author": "Scott", "published": "2014-07-29 21:42:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>#304: <em>I think, in general, if I’d been around in the 1950′s, 1960′s etc. I’d be far more sympathetic of Israel than I can be today (and I still am by no means anti-Israel! I think it’s a fine nation overall)</em></p>\n<p>Yeah, Israel got a lot of positive spin back then that was a lot harder to verify than would be the case. BTW, I&#8217;m not anti-Israel, any more than I&#8217;m anti-U.S.A.; I&#8217;ve just lost a lot of illusions about special and nice they are, just as I&#8217;ve lost a lot of illusions about how well-behaved my native country has been.</p>\n<p>Start with the pre-WWII; again, the Palestinian Arabs didn&#8217;t seem to have little if any problems with their Jewish neighbors (so you scratch any wailing on the part of the latter about irrational hatred.) It was only after WWII when Jewish immigrants arrived en masse &#8212; and with heavy outsider finances &#8212; that the natives began to kick. That strikes me as highly rational. Doubly so since their fears were realized. Notice that the original Palestinians abided by the original British injunctions and how detrimental that law-abiding behaviour was to their long-term interests. The Israeli&#8217;s, of course, did <em>not</em> abide by the original British agreements, and in fact practiced out-and-out terrorism to be free of those strictures. I don&#8217;t think even the most Pro-Israel faction can disagree with that. Afterwards, of course, it was too late for the natives; the newcomers had far superior weaponry (the myth of Israel as plucky underdog is just that &#8212; a myth)</p>\n<p>In short, Israel has behaved just as squalidly, just as opportunistically as any other expansionist country: The United States, Australia, South Africa, etc. Nor, with the hindsight of an additional fifty years, would I have expected otherwise. This is just what expansionist regimes do. Expecting otherwise is like expecting a puppy to housebreak itself; it might happen, but it&#8217;s generally not the way to bet.</p>\n<p>So in light of what should be undisputed history, let&#8217;s talk about evidenciary requirements, which I have been remiss in not making explicit earlier: the onus is on the pro-Israel folks to convince me that Israel has been much better behaved than the historical norm. Nowhere do I have the slightest scintilla of obligation to prove that this is indeed the case.  Sorry guys, but that&#8217;s just the way science rolls.</p>\n]]>", "author": "ScentOfViolets", "published": "2014-07-29 22:19:22+00:00", "title": "By: ScentOfViolets"}, {"content": "<![CDATA[<p>Sorry for the typos in #338; keyboard kitty and then I had to fix dinner. Anyway, it&#8217;s amazing how people have to strain to rationalize Israel&#8217;s bad behaviour when the simplest and most obvious explanation does the trick very nicely.</p>\n<p>Does anybody doubt that Israel is in extreme violation of the NPT? Why is that, and why don&#8217;t so-called &#8216;rational&#8217; Israel supporters condemn this behaviour in the strongest possible terms? Another fact: most Israel-watchers agree that the Netanyahu government has no intention of reaching a peaceable settlement with the Palestinians. Witness the intransigence when it comes to freezing settlements, for example. That being the case, how come pro-Israel people are <em>still</em> supporting the Likud government and making excuses for them rather than saying in no uncertain terms that the Palestinians have a very legitimate beef in this regard?</p>\n<p>No, what happens is a series of elaborate rationalizations, special pleadings, and so on and so forth, with only the loosest connection between each excuse for a particular example of bad behaviour. Anything but the simplest, most powerful explanation: Israel is an expansionist power and is behaving every bit as badly as expansionist powers typically do. Again, let me emphasize: this is not beating up on Israel or claiming it&#8217;s behaving worse than usual; this is merely observing that it&#8217;s behaviour is about par for the course. Why anyone is still wearing rose-colored glasses &#8212; particularly those who claim to be slaves to the scientific method! &#8212; is beyond me.</p>\n]]>", "author": "ScentOfViolets", "published": "2014-07-29 23:14:47+00:00", "title": "By: ScentOfViolets"}, {"content": "<![CDATA[<p>&#8220;Why anyone is still wearing rose-colored glasses — particularly those who claim to be slaves to the scientific method! — is beyond me.&#8221;</p>\n<p>Yes, it apparently is.</p>\n<p><a href=\"http://fas.org/irp/world/para/docs/880818a.htm\" rel=\"nofollow\">http://fas.org/irp/world/para/docs/880818a.htm</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bacon:Michael.html\">Michael Bacon</a>", "published": "2014-07-29 23:42:09+00:00", "title": "By: Michael Bacon"}, {"content": "<![CDATA[<p>#297: I&#8217;m sorry, Scott, but this fails for two reasons. First: <em> If they do turn violent, we’ll raise a stink with the British, who are terrified of an Arab uprising for oil reasons. But in the meantime, we’d better take advantage of this golden opportunity before it passes, by partnering with the settlers and diverting as much wealth as we can to ourselves. Later, after we’ve done that, maybe we can have an anti-colonial uprising to kill the settlers or kick them out.</em></p>\n<p>See, this is historically inaccurate. In point of fact, by the time the British left (in part because of Jewish terrorism), it was too late to kill the settlers or kick them out. This is just historical record, an observation of how things played out. Do you disagree that these are the actual facts on the ground?</p>\n<p>The second objection goes to your, shall we say, optimistic views on how things are shared in a non-zero-sum scenario. Again, historically, whatever amount of water has been available, Israel has <a href=\"http://www.haaretz.com/news/middle-east/1.574554\" rel=\"nofollow\">grabbed the lion&#8217;s share</a>. Notice that &#8216;sloppy on the details&#8217; part. I see up above that someone mentioned Israel pulling out of the Gaza strip only to have the Palestinians smash the greenhouses. What they didn&#8217;t tell you (I can&#8217;t imagine why, given who posted this factoid) is that <em>Israel turned off the water</em> when they gave up control of the Gaza strip, something the Palestinians had no idea was going to happen.  Tore up the greenhouses? Quelle surprise.</p>\n<p>So yeah, while a non-zero-sum scenario was possible (modulo the actual land, which is, er, hard to manufacture), that&#8217;s not how it played out historically. IOW, the Palestinians of the day were right, dead right about how the situation was going to play out. Far from &#8216;unreasoning hatred&#8217;, their fears were perfectly reasonable, their hostility perfectly justifiable.</p>\n]]>", "author": "ScentOfViolets", "published": "2014-07-29 23:53:45+00:00", "title": "By: ScentOfViolets"}, {"content": "<![CDATA[<p>#340: Sigh. What does this have to do with Israel being in massive violation of the NPT or Likud&#8217;s refusal to negotiate in good faith? Be specific. I&#8217;ll warn you that raw emoting does <em>not</em> an argument make.</p>\n]]>", "author": "ScentOfViolets", "published": "2014-07-29 23:57:32+00:00", "title": "By: ScentOfViolets"}, {"content": "<![CDATA[<p>ScentofViolets: While I&#8217;m losing interest in debating you (and regaining interest in proving some theorems&#8230;), two points of information.</p>\n<p>First, Israel never <i>signed</i> the NPT, so it&#8217;s weird to say that they&#8217;re in &#8220;violation&#8221; of it.  More to the point, the reason why they have nuclear weapons is as a deterrent against annihilation, one that history strongly suggests might be needed.  The evidence that they don&#8217;t plan to use it for anything short of that is that they <i>haven&#8217;t</i> used it in the last half-century (despite having some adversaries who&#8217;d gladly use nuclear weapons against <i>them</i> if they had any).</p>\n<p>Second, as I&#8217;ve said, I don&#8217;t support the Likud government, and I don&#8217;t support the settlement policy either.  In fact I strongly oppose both.  On the other hand, if you think that a more liberal Israeli government wouldn&#8217;t <i>also</i> be responding militarily to the current rocket attacks, then you&#8217;re kidding yourself.</p>\n]]>", "author": "Scott", "published": "2014-07-29 23:57:57+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>BTW, Scott, could you throw a snark warning at Michael Bacon for his post #340? His tone is not helping the discussion. And you&#8217;ve already registered disapproval when I do it.</p>\n]]>", "author": "ScentOfViolets", "published": "2014-07-29 23:59:15+00:00", "title": "By: ScentOfViolets"}, {"content": "<![CDATA[<p>#343: Duh! you&#8217;re right of course about the NPT . . . however hypocritical they are about other country&#8217;s nuclear capabilities.</p>\n<p>And in case you missed the point about Likud, well, since it&#8217;s the Likud government who is refusing to negotiate in good faith, and since you apparently agree, can you at least say out loud the maybe the Palestinians have a legitimate beef with Likud here? That&#8217;s all I&#8217;m asking, sheesh.</p>\n]]>", "author": "ScentOfViolets", "published": "2014-07-30 00:05:33+00:00", "title": "By: ScentOfViolets"}, {"content": "<![CDATA[<p>ScentOfViolets #344: On the contrary, it&#8217;s <i>your</i> smug tone that I&#8217;ve gotten bored with.  Thank you for your contributions to this discussion, and have fun debating these issues anywhere else on the Internet.</p>\n]]>", "author": "Scott", "published": "2014-07-30 00:07:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>#343: Oh, also, <em>On the other hand, if you think that a more liberal Israeli government wouldn’t also be responding militarily to the current rocket attacks, then you’re kidding yourself.</em> Maybe I&#8217;ve forgotten to say so explicitly, but yeah, I think the whole rocket thing is dirty pool. Terrorism is terrorism, no matter who does it or for whatever justification.</p>\n]]>", "author": "ScentOfViolets", "published": "2014-07-30 00:07:45+00:00", "title": "By: ScentOfViolets"}]