[{"content": "<![CDATA[<p>Comment #8: ”.Shockley later in life became obsessed with race and IQ. I wonder if he not being identified as “high IQ” had anything to do with his obsession, in spite of having won the Nobel Prize in physics.&#8221;. Schockley&#8217;s apparent obsession with IQ has been attributed to his being a racist. His view on the subject are best expressed in his own words: <a href=\"https://www.youtube.com/watch?v=sAszZr3SkEs\" rel=\"nofollow\">https://www.youtube.com/watch?v=sAszZr3SkEs</a></p>\n]]>", "author": "Richard Gaylord", "published": "2017-10-03 13:32:37+00:00", "title": "By: Richard Gaylord"}, {"content": "<![CDATA[<p>Richard Gaylord #57</p>\n<p>Oh, don&#8217;t take me wrong. I am on record, in a different thread, saying that not only I believe Shockley was a racist, but in fact I believe he was &#8220;real Nazi&#8221;-like, the kind of Nazi I would be terrified of having running the government.  You see, the context of that discussion was how I differentiate between the losers that call themselves &#8220;neo-Nazi&#8221; that are not a cause of concern for me and &#8220;real Nazis&#8221; like Shockley who would use the political power at their disposal to implement Nazi Germany type of policies. I also said then, and I reaffirm now, that if you want to find real Nazis, you are more likely to find them in meetings of the National Academy of Sciences or high profile academic conferences than in violent demonstrations like Charlottesville&#8217;s. I also said then, and I repeat now, that I am not saying that all uber-smart people are Nazis, but only that that&#8217;s the group you should scrutinize if you really want to find the Nazis you should be afraid of.</p>\n<p>With all this said, the whole Terman experiment shows better than any empirical evidence I can provide, that the concept of IQ is baloney. Or, if you will, that IQ tests only measure how well you take IQ tests and little else. Here is another analysis of the Terman children&#8217;s achievements,</p>\n<p><a href=\"https://www.psychologytoday.com/blog/beautiful-minds/200909/the-truth-about-the-termites\" rel=\"nofollow\">https://www.psychologytoday.com/blog/beautiful-minds/200909/the-truth-about-the-termites</a></p>\n<p>&#8220;Let us give Terman the benefit of the doubt and post that all 2,000 scientific and technical publications were produced by the 70 who made it into American Men of Science. That implies that, on average, Terman&#8217;s notable scientists produced about 29 publications by the time they had reached their mid-40s. In contrast, American Nobel laureates in the sciences averaged about 38 publications by the time they were 39 years old, and claimed about 59 publications by their mid-40s. THat amounts to a twofold disparity in output. Hence, Terman&#8217;s intellectual elite was not of the same caliber as the true scientific elite of the same nation and era.&#8221;</p>\n<p>Or,</p>\n<p>&#8220;Another analysis shows that the accomplishments of the &#8220;Termites&#8221; could have been predicted on their socioeconomic status alone. These were mostly white, middle to upper middle class men with opportunities and resources for success. Some argue that it wasn&#8217;t even necessary for Terman to analyze the IQ dimension&#8211;he could have stopped with SES and call it a day.&#8221;</p>\n<p>I have several heuristic rules that I have &#8220;discovered&#8221; throughout my life. One of them, as I have mentioned, is that the most important decisions in society that affect us as individuals are made by the most stupid members of society. A closely related one, but different, is that most problems in society are caused by lack of mathematical literacy among the general population. Using IQ testing as a predictive tool is a clear example of confusing correlation with causation. In addition, the best correlations people have been able to come up with are around 0.5, a far cry of 0.99 which is what any serious correlative measure should have to be taken as a proxy of something. Imagine if medical testing of infectious disease or cancer were performed the same way: we have not detected you have HIV antibodies, but you know, only at most 50% of HIV positive people develop antibodies, so we cannot tell you much about whether you are infected with HIV. Or, gee, we detected anomalous cells in your pancreas, but you know, only up to 50% of people with pancreatic cancer develop those cells and there are other reasons those cells might have been developed so we cannot tell you whether you have pancreatic cancer. I hope people get an idea. Society as a whole gives a pass to IQ tests that does not give to other measurements.  </p>\n<p>As I said, psychology must be the biggest scam the losers of the academic game perpetrate in society at large.</p>\n]]>", "author": "The Problem With Gatekeepers", "published": "2017-10-03 15:30:29+00:00", "title": "By: The Problem With Gatekeepers"}, {"content": "<![CDATA[<p>I&#8217;d like to share my experience with IQ testing in elementary school and some thoughts.<br />\nI was about 15 and it was part of a more general voluntary psychological examination, so they could provide you with a ,,professional orientation&#8221; ( career choice etc ) . The IQ or ,,aptitude&#8221; test had three parts (perceptive, verbal and spatial),<br />\non the first one you had pairs of pictures and had to tell if they were the same or not or something like that,<br />\non the second one there were words and you had to write the words opposite in meaning next to them,<br />\nand on the third one, you&#8217;re given a 3D arrangement and have to reconstruct it from a different angle.<br />\nI got an average, maybe a bit above average score, I did terribly on either one of the first two ( verbal part I think),<br />\nbut exceptionally on the third one. On the verbal part I didn&#8217;t even know many of the words, and of the ones I did know I either didn&#8217;t know their opposite or took a long time to retrieve it from memory. On the perception part I was overly cautious and paranoid, mind started playing tricks on me, started seeing things, I don’t think it affected my ,,performance,, but I bet it could have.<br />\nI believe these kinds of tests are mostly beyond ridiculous for obvious reasons. There are others like Raven’s matrices that can be taken a lot more seriously. Some tests emphasize ,,the raw working memory’’ ,,processing speed’’ aspects; others have more to do with ,inductive leaps, etc. The problem with the first ones is these things don’t seem that important when it comes to human intellectual achievements, certain animals seem to have better ,,raw,, capacities of that sort. When Archimedes (and probably many before and after him) sat in his bathtub and came to his realization, it was not a feat of working memory ,processing speed, some combo or whatever. The problem with the second ones is, well for a given problem there are many routes the mind checks, which routes it checks is a result of many factors, everyone’s inner wiring and experience is a bit different, some routes are quicker, and you’re just lucky if you stumble upon them, or you&#8217;re lucky that the problem suits your wiring and experience, ( sometimes we instantly give elegant solutions to problems, other times we are clueless ) it doesn’t really matter if there are more solutions or just one. These things I mention don’t really matter that much because psychometrics relies on statistics. But at this stage all the research done is weak from a ,,hard science’’ point of view, and it doesn’t say much things that we in fact did not already know in one way or another. The specifics are nowhere near where they should be. People are silly to even bother themselves with it. If a time comes when intelligence is truly understood, and if certain individuals happen to be a lot more disadvantaged than they would like, there will probably be treatments/augmentations of some sort. This probably assumes more rigorous definitions and an understanding of the processes and mechanisms, or equations that describe the phenomenon.</p>\n]]>", "author": "arc", "published": "2017-10-03 15:42:43+00:00", "title": "By: arc"}, {"content": "<![CDATA[<p>My 4 kids were given IQ tests when they were young. They all took them about five years later and got almost identical scores. The tests were given by different professionals.</p>\n<p>So Scott, if you were to take the IQ test today, do you think you would get a 106?</p>\n]]>", "author": "Craig", "published": "2017-10-03 17:23:02+00:00", "title": "By: Craig"}, {"content": "<![CDATA[<p>Craig #60: For whatever it&#8217;s worth, my parents tell me that I <i>was</i> retested slightly afterward by a different psychiatrist, and on the second test I was more like 150.  I also had a perfect SAT, which is supposedly consistent with that.  But honestly, I have no real idea, there doesn&#8217;t seem to be a great deal of inter-test reliability in my case, and for reasons spelled out in the above exchange with &#8220;The Problem With Gatekeepers,&#8221; it&#8217;s not a question that interests me greatly.</p>\n]]>", "author": "Scott", "published": "2017-10-03 17:31:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #55,</p>\n<p>yes, but have you checked the rents in Silicon Valley recently?<br />\nThat&#8217;s a pretty expensive membership fee.<br />\nNot exactly for everyone 🙂<br />\nI do think it&#8217;s worth it though.</p>\n]]>", "author": "Gian Mario Manca", "published": "2017-10-03 18:58:27+00:00", "title": "By: Gian Mario Manca"}, {"content": "<![CDATA[<p>Craig #60 </p>\n<p>If they took the same ,kind&#8217; of test is it really a surprise ? It doesn&#8217;t matter if it was different people who gave the tests.<br />\nIf in those 5 years the kids didn&#8217;t change in any other way, it is also not expected for the scores to change on their own, it depends how young they were as well. My personal experience is almost the same as Scott&#8217;s, no inter-test reliability, Raven&#8217;s matrices for example I did a lot better than my elementary school test. In my opinion, the Raven&#8217;s is the better test ( unlike Scott, I am not humble ), but opinions of the experts seem to be that they are both good. More problems for them then.<br />\nI just don&#8217;t think these fields are to be trusted, yet. Some of my friends in fact had similar/same experiences.</p>\n]]>", "author": "arc", "published": "2017-10-03 19:22:55+00:00", "title": "By: arc"}, {"content": "<![CDATA[<p>Speaking of clubs for smart people, I love Richard Feynman&#8217;s take:</p>\n<p>&#8220;When I was in high school, one of the first honors I got was to be a member of the Arista, which is a group of kids who got good grades—eh?—and everybody wanted to be a member of the Arista, and when I got into the Arista I discovered that what they did in their meetings was to sit around to discuss who else was worthy to join this wonderful group that we are—okay? So we sat around trying to decide who it was who would get to be allowed into this Arista. This kind of thing bothers me psychologically for one or another reason I don&#8217;t understand myself—honors—and from that day to this [it] always bothered me. When I became a member of the National Academy of Sciences, I had ultimately to resign because that was another organization most of whose time was spent in choosing who was illustrious enough to join, to be allowed to join us in our organization, including such questions as [should] we physicists stick together because they&#8217;ve a very good chemist that they&#8217;re trying to get in and we haven&#8217;t got enough room for so-and-so. What&#8217;s the matter with chemists? The whole thing was rotten because its purpose was mostly to decide who could have this honor-okay? I don&#8217;t like honors.&#8221;</p>\n]]>", "author": "Jon K.", "published": "2017-10-03 20:59:08+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>Also, as for verbal skills, spelling, vocabulary, and other acquired knowledge that might help you on the non-math portion of the SAT (or possibly an IQ test, I&#8217;m not sure), what role does this accumulation of rote-memorized knowledge play in accessing intelligence?  (from the kid who did poorly on the verbal half of the SATs 😉</p>\n<p><iframe class='youtube-player' type='text/html' width='640' height='390' src='https://www.youtube.com/embed/ga_7j72CVlc?version=3&#038;rel=1&#038;fs=1&#038;autohide=2&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;wmode=transparent' allowfullscreen='true' style='border:0;'></iframe></p>\n]]>", "author": "Jon K.", "published": "2017-10-03 21:13:47+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>Re Mensa.</p>\n<p>I infiltrated Mensa as a junior high schooler. At the time, Frank Ryan, the QB of the Cleveland Browns, and later a Math Prof at CWRU, was promoting it, so I was psyched. </p>\n<p>The hardest part of the test was working out money transactions in UK money. They explained the rules for pounds and schillings. etc., and you had to figure out how to make change. </p>\n<p>I went to a couple meeting, expecting to be initiated into cool secret grownup knowledge, but if any such was there, it was cleverly disguised as adults getting drunk and trying to sound profound.</p>\n<p>There is a secret Mensa symbol that you wear in a particular spot on your sports jacket. This allows you to spot other Mensa types in the wild. I never wear a sports jacket, so I missed out on that. I have been at plenty of scientific meetings where a lot of people were wearing jackets, but have yet to see the secret symbol. Maybe they got a new one and didn&#8217;t tell me &#8212; I guess I am a half century + behind on dues.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-10-03 22:50:41+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>What were you supposed to say about the smoking house?</p>\n]]>", "author": "Eric Rogstad", "published": "2017-10-04 06:37:33+00:00", "title": "By: Eric Rogstad"}, {"content": "<![CDATA[<p>Eric #67: I think, that you&#8217;d call firefighters or other adults, not conditional on how much you liked your neighbors. 🙂</p>\n]]>", "author": "Scott", "published": "2017-10-04 09:37:21+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;Richard Feynman famously scored only 124 on a childhood IQ test&#8230; &#8221;</p>\n<p>Well, given the <a href=\"https://en.wikipedia.org/wiki/Flynn_effect\" rel=\"nofollow\">Flynn Effect</a>, perhaps we should apply a correction to this if we want to compare his result to yours. Since there were about five or six decades in between his test and yours, and assuming a typical rate of 2.9 points per decade, his raw test score would translate to a normalized score of about 105 or 110 for the decade in which you took the test.</p>\n<p>Also, before you get too excited about <i>g</i>, I&#8217;d recommend reading Cosma Shalizi&#8217;s discussion <a href=\"http://bactra.org/weblog/523.html\" rel=\"nofollow\">&#8220;<i>g</i>, a Statistical Myth&#8221;</a>.</p>\n]]>", "author": "Peter Erwin", "published": "2017-10-04 10:04:40+00:00", "title": "By: Peter Erwin"}, {"content": "<![CDATA[<p>Scott #61: So if you got 106 on one test and about 150 on the other, that averages to around 124, so you are in Feynman&#8217;s league. Not bad.</p>\n]]>", "author": "Craig", "published": "2017-10-04 14:07:42+00:00", "title": "By: Craig"}, {"content": "<![CDATA[<p><i>To anyone with a scientific or mathematical bent, the tests are vaguely horrifying.  “Which of these pictures is unlike the others?”  “What number comes next in the sequence?”  Question after question that could have multiple defensible valid answers, but only one that “counts”—and that, therefore, mostly tests the social skill of reverse-engineering what the test-writer had in mind.</i></p>\n<p>Just to amplify this point &#8212; this problem is most glaringly apparent in the tasks that want you to &#8220;continue a pattern,&#8221; like the ones you mention here, but it&#8217;s not limited to them.  My &#8220;favorite&#8221; example of an absurd IQ subtest is the Wechsler Similarities subtest, which I <a href=\"http://nostalgebraist.tumblr.com/post/144431542299/ok-if-you-were-wondering-where-this-dystopian\" rel=\"nofollow\">ranted about here</a>.</p>\n]]>", "author": "nostalgebraist", "published": "2017-10-04 18:43:33+00:00", "title": "By: nostalgebraist"}]