[{"content": "<![CDATA[<p>Vladimir Voevodsky&nbsp;&hellip; alas&nbsp;&hellip; so very many untimely passings, this year, of true pioneers.&nbsp;🙁</p>\n]]>", "author": "John Sidles", "published": "2017-10-01 14:28:30+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Hi Scott, do you happen to have any more information about the memorial services?</p>\n]]>", "author": "Shravas", "published": "2017-10-01 22:22:00+00:00", "title": "By: Shravas"}, {"content": "<![CDATA[<p>Shravas #11: I believe that a memorial in Berkeley already happened.  One at MIT is being planned.  In any case, I&#8217;ll leave it to those organizing memorials to post more info here if they want to.</p>\n]]>", "author": "Scott", "published": "2017-10-01 22:30:31+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>i by no means knew michael well, but he went to my middle and high school and we rode in on the same bus when i was about 11 and he was 14. based on my somewhat hazy memories of those years and the conversations therein, he was the same man right up until the end. rest in peace</p>\n]]>", "author": "evan kahn", "published": "2017-10-02 14:28:14+00:00", "title": "By: evan kahn"}, {"content": "<![CDATA[<p>If 2016 was the year the music died, 2017 appears to be turning into the year the math died.</p>\n]]>", "author": "Richard", "published": "2017-10-02 15:32:39+00:00", "title": "By: Richard"}, {"content": "<![CDATA[<p>For everyone here who&#8217;s grieving over Michael&#8217;s loss, I thought I should share a brief update from Daniela Rus, the director of MIT CSAIL.</p>\n<ul>I wanted to let you know that we have been informed by Michael’s family that Michael died of natural causes, though it will take some time to know exactly what happened. We also hope to share more information about a future plan to commemorate Michael among the wider MIT community.</ul>\n]]>", "author": "Scott", "published": "2017-10-02 17:13:58+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>This is Tom Cohen, Michael Cohen’s father.</p>\n<p>I am writing to thank the numerous people in the theoretical computer science community who have written kind words about Michael on this blog, and in other places.  But more generally to thank the community for the support they gave Michael during his, all too short, career.  It was clear by the time that he went off to college that Michael, more than anything, wished to become part of that community and to engage in a meaningful way on relevant research in the field.   At the time he doubted that he had the talent to do so. (Those who knew him recognize that he had a tendency to undervalue his abilities).  The absolute joy he had in research is a consolation to Marie and me. </p>\n<p>Michael was in many ways unusual.  His over-the-top exuberance, way of doing calculations while walking around muttering, absolute intellectual honesty, loud and fast way of proceeding when he was talking about interesting things as well as various personal quirks involving food, sartorial style and grooming might have made dealing with him difficult.  Instead of being put off by this, the community really embraced him and he became completely part of a world that he longed to be part of.  In addition to the very large number of people with whom Michael interacted on science but did not actively collaborate on a project, Michael had nearly 30 distinct collaborators on publications at the time of his death;  in addition, there were several others with whom he was collaborating when he died that had not yet lead to publications (apparently, it was notoriously difficult to get Michael to finish writing papers).    This is extraordinary for a 25-year-old researcher in this field, and shows how deeply connected Michael was with the community. </p>\n<p>Scott writes that he was frankly mystified by Michael’s death.  While the facts are not entirely known, there is no real mystery, just tragedy.  Michael died of “natural causes” according to the Berkeley police, meaning not suicide or homicide. The exact medical cause remains officially unknown, pending the results of various tests by the coroner’s office.  But the coroner’s officer who investigated the case said that there are indications that his death may well have been due to an undiagnosed and untreated case of type-1 diabetes.  In any case, whatever the underlying cause, we know that he had severe vomiting and diarrhea and that he did not call for help, either from friends or 911.  Presumably, he thought he could just tough it out—as young men are wont to do.   We will know more at a later date when the test results come in.  In truth his death was almost certainly due due to a number of random and unrelated things.  Principal among these was he was living alone and there was nobody to call for help when his condition become grave, but there were many others.   The random nature of the events leading to his death makes it all the more tragic. </p>\n<p>Scott also asked if there was any cause Michael cared about if people wish to make a donation in his memory.   If people wish to make a donation in Michael&#8217;s memory, a good choice is givedirectly.com .  Michael was very interested in the Effective Altruism movement and spoke about it with many people.  Givedirectly.org is a charity that he believed exemplified the spirit of that movement.  As its name suggests, It gives money directly to very poor people in Africa.  There is often reluctance on aid givers&#8217; part to do this, due to a fear that the money will be squandered.  Givedirectly rigorous monitors the use of the money it gives and the money is, in fact, being used wisely.   Recently, Marie and I communicated with Michael about charitable giving and he recommended Givedirectly.org to us.</p>\n]]>", "author": "Tom Cohen", "published": "2017-10-02 18:19:31+00:00", "title": "By: Tom Cohen"}, {"content": "<![CDATA[<p>Tom #16: Thank you so much for writing here.  As I said to Marie, it&#8217;s hard for me to imagine what you&#8217;re going through.  My deepest condolences to you and to all of Michael&#8217;s family.</p>\n<p>I&#8217;ve made an $1800 donation to Givedirectly in Michael&#8217;s memory.  I encourage others to donate what they can as well.</p>\n<p>If there&#8217;s any small lesson to take away here, it sounds like it&#8217;s: <i>reach out for help when you need it.</i>  Pick up the phone and call.  Or better: when in doubt about whether to do so or not&#8212;about whether your friends and family will be annoyed to be &#8220;burdened&#8221; with your health problem, or whatever else it is&#8212;think about Michael&#8217;s friends and family, about what they would&#8217;ve wanted him to do when in need, and see if that makes the choice clearer.</p>\n]]>", "author": "Scott", "published": "2017-10-02 19:29:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>My heart goes out to the Cohens on the loss of their child. I can not even begin to process this loss or the loss of another one of our children &#8211; an  MIT 2020 this past Friday. &#8230;.  The heart feels heavy and the brain becomes numb.. as I silently pray for the two boys gone so suddenly , and for all our children, and for the universe to give the parents who have lost their children the strength to bear it with grace.</p>\n]]>", "author": "Tasneem Ahmed", "published": "2017-10-02 23:51:04+00:00", "title": "By: Tasneem Ahmed"}, {"content": "<![CDATA[<p>Dear Marie and Tom,<br />\nPlease accept my deepest condolences. I cannot still believe the news.  I saw Michael at MIT after the graduation as he stopped by to say hello to all his Blair classmates.<br />\nI was always awed by his genius as Anand shared several interactions and discussion between them </p>\n<p>It will take time for all of us to get through this loss especially family and friends.  Words cannot describe the tragic loss. I am speechless and heartbroken.</p>\n]]>", "author": "Abha Oza", "published": "2017-10-03 00:55:33+00:00", "title": "By: Abha Oza"}, {"content": "<![CDATA[<p>I was a friend of Michael&#8217;s in middle and high school though our lives have diverged significantly since. My condolences to Tom and Marie, the rest of his family, and the many friends, colleagues, and acquaintances who will miss him. From your memories it sounds that he really did go on to do the great things that seemed foreshadowed in high school.  </p>\n<p>I&#8217;ve also made a donation in Michael&#8217;s memory to GiveDirectly.</p>\n]]>", "author": "Jess Muskin-Pierret", "published": "2017-10-03 16:32:56+00:00", "title": "By: Jess Muskin-Pierret"}, {"content": "<![CDATA[<p>Scott &#8211; </p>\n<p>I happen to live in Cambridge though I&#8217;m not associated with MIT. If you hear more about a memorial service at MIT could you share it here? Thank you!</p>\n]]>", "author": "Jess Muskin-Pierret", "published": "2017-10-03 16:40:18+00:00", "title": "By: Jess Muskin-Pierret"}, {"content": "<![CDATA[<p>I am deeply saddened by this tragic event. I didn&#8217;t know Michael personally. But Michael&#8217;s father, Professor Tom Cohen shared with me (while I was his student at the University of Maryland) &#8212; on more than one occasion, Michael&#8217;s interest in computer science, his job offer at Facebook, and his enrollment at MIT to pursue a graduate degree. Only a few days ago did I realize how much impact Michael had already made in the theoretical computer science community. I would like to offer my sincere sympathies to Professor Cohen and his family.</p>\n]]>", "author": "Prabin Adhikari", "published": "2017-10-03 21:50:47+00:00", "title": "By: Prabin Adhikari"}]