[{"content": "<![CDATA[<p>Neal #76: A nonsensical concatenation of words is a fine choice.  It takes longer to type (especially on a mobile device), but it might be easier to remember, and could easily have at least as much entropy as a random concatenation of 6-8 alphanumeric characters.  Or, of course, you could just abbreviate the words, or replace them with their first initials, to get the best of both approaches.</p>\n]]>", "author": "Scott", "published": "2014-04-26 19:50:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Everyone should uses passwords consisting only of lowercase letters. Other rules are enforced by idiots who don&#8217;t compute entropy, as at Stanford. Using all the numbers and symbols on my keyboard gets 6.6 bits per character, compared to 4.7 for just the lower case alphabet. If 8 characters drawn from the large set is OK, that&#8217;s 52 bits, which you can get in 12 characters drawn from the small alphabet. Yet Stanford requires 20 characters and then demands our gratitude for their bullshit generousity. And that 8 character password is only as good as the 12 character a-z password if every character has equal chance of being uppercase, of being a number or a symbol. Is that true? Of course not: people add just enough symbols to get by the gatekeeper, which is worth hardly anything.</p>\n<p>When you change your google password, it does a good job kibitzing on the strength. I find the update on every additional character enlightening.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Knight:Douglas.html\">Douglas Knight</a>", "published": "2014-04-26 23:30:16+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Scott #68</p>\n<blockquote><p>Sandro #67: In this game, you always assume that the adversary knows the function f—i.e., you’re not trying to do “security through obscurity.” </p></blockquote>\n<p>This makes sense for a conservative security analysis, but I&#8217;m after a different question. I&#8217;m trying to figure out what we can ascertain automatically by induction on observable properties, in principle.</p>\n<p>As a specific example, can we ascertain whether quantum mechanics is truly indeterministic by observing enough quantum randomness? de Broglie-Bohm is a deterministic interpretation of QM, so clearly there is at least one possible theory that could generate quantum randomness indefinitely. So could there exist some randomness test that might one day determine whether quantum randomness was truly indeterministic, and thus decide between deterministic or indeterministic intepretations of QM?</p>\n]]>", "author": "Sandro", "published": "2014-04-27 14:09:19+00:00", "title": "By: Sandro"}, {"content": "<![CDATA[<p>Sandro #79: Well, it&#8217;s not just &#8220;conservative security analysis&#8221;&#8212;it&#8217;s that part of what it <i>means</i> for f to be deterministic is that the would-be predictor knows it.  Otherwise, you might as well just let f introduce new random bits and thereby solve the entire problem by fiat!</p>\n<p>Regarding your new question: that&#8217;s what Part II of my article (coming soon) will be all about!  But briefly, in a certain philosophical sense, you can <i>obviously</i> never rule out determinism.  For someone could always maintain that, no matter how random events look, everything that&#8217;s ever happened or will happen is deterministically foretold in &#8220;God&#8217;s unknowable encyclopedia.&#8221;  You can never rule that out&#8212;and in fact, it&#8217;s not <i>that</i> different from de Broglie-Bohm, which also posits an underlying determinism, but one that we can&#8217;t &#8220;see&#8221; by making measurements even in principle.</p>\n<p>Even there, though, quantum mechanics (specifically, the Bell inequality and its more modern refinements) lets us say something nontrivial and surprising: namely, that there <i>can&#8217;t possibly</i> be any way to &#8220;cash out&#8221; this hypothetical determinism into actual predictions of quantum measurement outcomes, <i>unless</i> you can also exploit the determinism to send signals faster than light.  And furthermore, even if you only want to believe that the determinism &#8220;exists&#8221; at an unmeasurable level, you then also need to believe in a preferred reference frame, which goes against the spirit of special relativity.</p>\n]]>", "author": "Scott", "published": "2014-04-27 16:10:11+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Your use of the phrase &#8220;base 2 numbers,&#8221; while perhaps technically defensible, is confusing and needlessly distracts the reader.</p>\n<p>First off, you&#8217;re using &#8220;base 2&#8243; as a compound modifier, but you haven&#8217;t inserted a hyphen. Second, you use the plural &#8220;numbers,&#8221; which set this reader off on a search for other uses of 2 as a base, a search which was not satisfied until ten paragraphs later. And third, by far the most common use of the term &#8220;base 2&#8243; is in describing the base-2 number system, not as a description of an exponential expression. And in an article that includes quite a few strings comprised exclusively of zeroes and ones, the confusion is heightened. </p>\n<p>Instead of writing &#8220;base 2 numbers are used because,&#8221; it would have been clearer to write &#8220;the base &#8217;2&#8242; is used because&#8221; or &#8221; &#8217;2&#8242; is used as the base of the exponential expression because.&#8221;</p>\n<p>Other than that, great article!</p>\n]]>", "author": "BlueFive", "published": "2014-04-27 22:18:26+00:00", "title": "By: BlueFive"}, {"content": "<![CDATA[<p>Sandro #79 Scott #81</p>\n<p>As Scott says, about the best we can currently do wrt to ruling out deterministic hidden-variables is Bell Inequality tests, GHZ state observations and similar experiments carried out by, in particular, groups like Anton Zeilinger&#8217;s.</p>\n<p>However I would suggest deterministic theories can be demonstrated to be <i>unreasonable</i> by a very simple &#8220;demonstration&#8221; of free-will &#8211; just walk around in circles but reverse direction every prime number times of revolutions.</p>\n<p>Now, no known deterministic theory of nature can get a macroscopic body to do that &#8211; ie it is incredibly unlikely from a determinsitic interpretation &#8211; it&#8217;s never been observed elsewhere in the universe for example, and if it was observed we have no deterministic explanation for it &#8211; we would surely think we had discovered a signal of intelligent free-will operating elsewhere in the universe.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2014-04-28 00:12:18+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>James #82: Sorry, but such an experiment tells us nothing about free will, or even about indeterminism.  And I say that as someone who&#8217;s gone on record taking &#8220;free will&#8221; WAY more seriously than most scientists! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" />   In particular, the results are perfectly consistent with the possibility that we&#8217;re deterministic automata that evolved by natural selection to have large brains capable of Turing-universal computation, so in particular, of generating the sequence of primes.  No one denies that we&#8217;re complicated (and sometimes even intelligent)&#8212;the question is just whether we&#8217;re also &#8220;indeterministic&#8221; (and if so, in which senses)!</p>\n]]>", "author": "Scott", "published": "2014-04-28 00:24:51+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #84</p>\n<p>That&#8217;s why I was careful to use the word <i>unreasonable</i>!</p>\n<p>I&#8217;m very aware that the full machinary of deterministic automata can be brought to the table &#8211; but you still have such a hard job of getting a macroscopic object to do prime number based dynamics that it becomes close to believing in Gods or any other kind of incredible supernatural influences &#8211; rather than just the simple idea of genuine free-will.</p>\n<p>As long as we don&#8217;t allow free-will to do magic (something not allowed by physics) I think it&#8217;s an ok idea &#8211; so we might speculate that free-will enables us to &#8220;load the dice&#8221; for a collapse eigenstate &#8211; somehow evolution discovered this and it&#8217;s an incredibly complex emergent phenomena that we don&#8217;t currently understand.</p>\n<p>BUT, I think I&#8217;ve gone a little off-topic <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2014-04-28 00:39:23+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>I meant to say something like:</p>\n<p>&#8230;you have such a such a hard job of getting a macroscopic object to do prime number based dynamics <i>spontaneously</i> along with all the usual observed behaviour&#8230;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2014-04-28 00:55:26+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>James: Most scientists would say, &#8220;sure it&#8217;s hard, and that&#8217;s why you needed a mechanism as powerful as natural selection, plus four billion years, to do it!&#8221;  The argument you&#8217;re making seems to me to venture well beyond the questions of free will and indeterminism, and into the realm of <i>intelligent design</i> (i.e., it seems tantamount to denying that natural selection can produce the sorts of complex adaptive behaviors that we see on earth).  Or if not, then I don&#8217;t understand what blocks that implication.</p>\n]]>", "author": "Scott", "published": "2014-04-28 01:41:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #87</p>\n<p>The emergence of free-will is surely a phase change beyond simple evolutionary adaption to the environment. </p>\n<p>But I&#8217;m going to sound hopelessly imprecise and pretentious to try to talk about this, like an ancient greek talking about fire or lodestones.</p>\n<p>So,  whereof one cannot speak, thereof one must be silent </p>\n<p>For now&#8230;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2014-04-28 02:00:44+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>Scott<br />\nWill you consider probability  distribution who has no second moment ( infinite variance ) and has first moment,<br />\nor distribution who has both no second moment ,and first moment is not defined by Lebesgue integration ( so the conditions of the strong law of large numbers will not hold)<br />\nto be higher kind of randomness in probability theory?<br />\nwill you call it &#8220;Knightian uncertainty&#8221; ?<br />\nI can give you examples of such distribution if you are not familiar with it.</p>\n]]>", "author": "Itai", "published": "2014-04-28 08:50:13+00:00", "title": "By: Itai"}, {"content": "<![CDATA[<p>Itai #88: No.  If the distribution can be specified in advance, then I wouldn&#8217;t call it &#8220;Knightian uncertainty&#8221;; the moments are irrelevant.</p>\n]]>", "author": "Scott", "published": "2014-04-28 11:12:49+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;Knightian uncertainty&#8221; sound to me much the same as Donald Rumsfeld &#8220;unknown unknowns&#8221;?<br />\n<a href=\"http://en.wikipedia.org/wiki/There_are_known_knowns\" rel=\"nofollow\">http://en.wikipedia.org/wiki/There_are_known_knowns</a><br />\nknown knowns -can be described as deterministic<br />\nknown unknowns  &#8211; can be described as stochastic<br />\nunknown unknowns &#8211; not any of the above .</p>\n<p>So,would you call such distributions more random than another?<br />\nsuch distributions have infinite range, and not exponential small chance of having extreme values ( like in most well known infinite range distributions : geometric ,normal or exponential distributions ).<br />\nI wonder if such distribution are possible in physics, and if not what prevents it from appearing there ( strong law of large numbers not valid, and standard deviation can make trouble with uncertainty principle )</p>\n]]>", "author": "Itai", "published": "2014-04-28 12:10:31+00:00", "title": "By: Itai"}, {"content": "<![CDATA[<p>Itai #90: Precisely <i>because</i> these distributions need to have infinite range, I question their physical relevance.  In real physics, you basically always have a finite cutoff for anything you&#8217;re calculating&#8212;given, if nothing else, by the Planck scale.  Indeed, when there&#8217;s <i>not</i> a known finite cutoff (as in unrenormalized QFT), you typically have to <i>impose</i> a cutoff, to avoid getting nonsensical infinite answers for measurable quantities!</p>\n]]>", "author": "Scott", "published": "2014-04-28 12:16:33+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #91<br />\nI heard Cauchy distribution / Lorentzian is used in physics, also is Levy distribution.<br />\nnot sure if it is for measurable values.<br />\nsuch distribution have feasible physical values.<br />\nIf those distribution are not physical ( I&#8217;m not sure there is a physical argument for it )<br />\nso we should demand in addition to normalization that :<br />\n1. integral X^2 |psi|^2 < inf<br />\n2. integral |x| |psi|^2 < inf<br />\nnobody demands it , I don&#039;t know any real wave function psi that not hold these condition ( but maybe it&#039;s possible ,who knows ).<br />\nThe standard infinite range distribution (normal ,geometric, exponential ) can  theoretically have extreme values but I guess it will not happened in the life of the universe.</p>\n]]>", "author": "Itai", "published": "2014-04-28 17:00:10+00:00", "title": "By: Itai"}]