[{"content": "<![CDATA[<p>Semiclassical #62</p>\n<p>What&#8217;s really interesting is that those theories seem testable experimentally (in the near future).</p>\n]]>", "author": "fred", "published": "2018-08-30 21:42:28+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott #59</p>\n<p>If the interference exists <i>mathematically</i> then that is good enough.</p>\n<p>If you take a vector of 100 complex numbers (say), then randomly change the phase (say) of one of them and then evolve the vector by multiplying by a 100&#215;100 unitary matrix then you have  a new vector of 100 complex numbers.</p>\n<p>But we don&#8217;t know what it is until we look at it, since the (phase) change was random.</p>\n<p>Now, without looking, we allow another random change and a 2nd evolution via multiplication by the unitary matrix.</p>\n<p>We then have yet another vector of 100 complex numbers, but we do not know what it is until we look at it.</p>\n<p>In fact it is in a superposition of all possible two time evolution steps with a phase change allowed on any of the 100 complex numbers (That&#8217;s a big superposition)</p>\n<p>Now, if this goes on for billions of iterations, there is still only one vector of 100 complex numbers, but we have no idea what it is until we look.</p>\n<p>It is, <i>mathematically</i> in an incredibly huge superposition, with all the possible interference effects possible depending on which  branch the evolution took. And yes there are worlds, with tiny probabilities, where in a double slit experiment the photons all end up on one side, same as with deterministic many worlds, but the most probable outcomes are the ones we usually observe, the interference effects are a result of a mathematical calculation which just uses superpositions and schrodinger (unitary) evolution.</p>\n<p>Note also, that an observation of only a small part of the vector will still leave a large part in (mathematical) superposition, local observations don&#8217;t fix the global state of the universe.</p>\n<p>I&#8217;m just suggesting that the superpositions are only a mathematical reality, due to randomness at planck timescales, not actual real branching of many worlds.</p>\n<p>At least in my (silly?) model we have a speed limit, due to the finite time it takes for a random jump, in deterministic models the universe all happens at once, which  is a shame really.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2018-08-30 23:47:57+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>James #64: I confess that none of that made the slightest bit of sense to me.  But even supposing it’s meaningful, and the failure is on my end—even then, isn’t it <i>simpler</i> just to use standard QM?  I feel like the burden would still be on you to show what we gain by adopting the elaborate-sounding picture you describe.</p>\n]]>", "author": "Scott", "published": "2018-08-31 01:03:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #65</p>\n<p>Natural origin of a Speed of Light limit?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2018-08-31 01:20:24+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>Unrelated:<br />\nThe link to Ryan O&#8217;Donnell is broken.<br />\nThe correct link -> <a href=\"http://www.contrib.andrew.cmu.edu/~ryanod/\" rel=\"nofollow\">http://www.contrib.andrew.cmu.edu/~ryanod/</a></p>\n]]>", "author": "Bhavishya", "published": "2018-08-31 11:32:52+00:00", "title": "By: Bhavishya"}, {"content": "<![CDATA[<p>&#8220;Say we’re at a quantum airport and there’s a piece of unattended tipping jar which could have a 5$ bill in it, but reaching into the jar could alert the police.<br />\nHow do we take the 5 dollar bill without getting arrested?&#8221;</p>\n]]>", "author": "fred", "published": "2018-08-31 15:45:13+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #68: No, doesn’t work.  The analogue of the Elitzur-Vaidman bomb experiment would only tell you non-invasively whether the $5 is there, not take it if it is.</p>\n]]>", "author": "Scott", "published": "2018-08-31 16:34:21+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #69</p>\n<p>I figured this was too good to be true&#8230;</p>\n<p>Regarding the beginning of lecture 5, with the biased coin.<br />\nCan&#8217;t we simulate classically the qubit solution, by counting only multiples of (1/eps) radiants?<br />\nWouldn&#8217;t that require just log(1/eps) bits (instead of log(1/eps^2) bits)?</p>\n]]>", "author": "fred", "published": "2018-08-31 16:48:54+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #70: log(1/&epsilon;) and log(1/&epsilon;<sup>2</sup>) are the same thing, up to changing the base of the log.</p>\n]]>", "author": "Scott", "published": "2018-08-31 17:07:23+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Reply to Fred #60:</p>\n<p>In real events such as a partially-silvered glass pane which reflects 75% of photons in a beam-splitter experiment and transmits 25%, there are many branches, one for each possible photon trajectory. In 75% of those branches the photon was reflected and in 25% it was transmitted&#8211;or that&#8217;s the way I see it, anyway.</p>\n<p>I&#8217;m not sure if this is what James G. has in mind, but it sounds a bit like this: any quantum experiment such as two-slit interference could be simulated by programming the quantum effects according to the rules of QM in a computer, correct? (Using a random or pseudo-random number generator.) What if we postulate that the universe itself is running that simulation? (Granted, no computer in our universe could possible do all the calculations for all the observable particles, but maybe the universe itself can.)</p>\n]]>", "author": "JimV", "published": "2018-09-01 01:28:17+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>JimV #72</p>\n<p>Yes that&#8217;s is what I mean, but I&#8217;m a little surprised it&#8217;s not even considered an obvious possible mechanism, especially since MWI is accepted by people so easily!</p>\n<p>When I first thought of this idea about 6 or 7 years ago I excitedly posted my thoughts on Lubos Motl&#8217;s blog, but didn&#8217;t get much feedback, same as on Scott&#8217;s blog about 5 years ago. So although I personally couldn&#8217;t see anything wrong I assumed it wasn&#8217;t something worth making a fuss about.</p>\n<p>In any case, I was much more concerned about deriving 3D space from such a mechanism, since that is the obvious thing we observe that does not exist in a large dimensional Hilbert Space. And I noticed a peculiar result about unitary evolution followed by subtraction of the previous state.</p>\n<p>ie if we have the evolution rule U(t+dt) = ( exp(h x Anti_Symmetric_Matrix) &#8211; I ) x U(t), where h is a real number and I is the Identity matrix, then there exists an h which gives you a stable period-3 global oscillation which is an attractor for measure 1 of initial states</p>\n<p>(this is actually an easy undergraduate (or advanced high school) level result, but not something I had seen before)</p>\n<p>The idea was, that because of the constant random collapses we  need to discard the entire previous state of the universe at each evolution step, and I bet if had suggested this in  the 1960s when they were fixing QED etc by subtracting infinities it would have got some interest.</p>\n<p>However, we now know that the renormalisation is justified by a well understood mathematical mechanism due to Wilson, so it sounds a bit silly to suggest we &#8220;subtract the entire Universe at each step&#8221;</p>\n<p>(Also, we get a pretty boring universe unless we introduce a (small) subspace which avoids the period-3 global attractor and allows for particles &#8211; eg a 6-dimensional subspace which is just the eigenspace of a certain eigenvalue determined by h)</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2018-09-02 02:53:45+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>>> What if we postulate that the universe itself is running that simulation?</p>\n<p>I you really believe in the m.w.i. then you believe that there are (infinitely ?) many branches where quantum computers simulate your experience &#8230;</p>\n]]>", "author": "wolfgang", "published": "2018-09-02 11:00:25+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Pat #61: Seriously?  Thank you so much!!  Shoot me an email, and I’ll give you the link to the Dropbox folder.</p>\n]]>", "author": "Scott", "published": "2018-09-02 17:36:11+00:00", "title": "By: Scott"}]