[{"content": "<![CDATA[<p>a #15:</p>\n<p>If you sum up the amount of work being done by each processor, you get O(n^2) work. It is O(n) span, but there are sorting algorithms with O(log^2 n) span I think, so that&#8217;s not a big achievement.</p>\n<p>Your clock-scaling thing also doesn&#8217;t work &#8211; there is a minimum time a program can wait, so the actual real time scaling doesn&#8217;t make a difference.</p>\n]]>", "author": "Peter Boyland", "published": "2017-05-22 02:19:33+00:00", "title": "By: Peter Boyland"}, {"content": "<![CDATA[<p>Thanks Scott A. for pointing to Scott A.&#8217;s Unsong. It will be my undertaking to read it in full.</p>\n]]>", "author": "Aviti", "published": "2017-05-22 12:05:42+00:00", "title": "By: Aviti"}, {"content": "<![CDATA[<blockquote><p>A worldwide industry arises to discover new names of God by brute-force search through sequences of syllables.</p></blockquote>\n<p>This idea is basically at the heart of Ted Chiang&#8217;s <i>Seventy-Two Letters</i>: golem-like automata, powering an entirely different kind of industrial revolution, can be animated by inscribing them with various names of God, found exactly as above by brute-force combinatorial searches. I&#8217;ll have to have a look where Scott Alexander goes with it!</p>\n]]>", "author": "Jochen", "published": "2017-05-22 12:17:28+00:00", "title": "By: Jochen"}, {"content": "<![CDATA[<p>Oops &#8212; I can see this (including an email address for &#8220;Jochen&#8221;):</p>\n<p><code>Jochen Says:<br />\nYour comment is awaiting moderation.<br />\nComment #17 May 22nd, 2017 at 7:17 am </p>\n<p>[... Jochen's in-moderation<br />\n    comment follows ... ]</code></p>\n<p>However, I am not &#8220;Jochen&#8221;</p>\n]]>", "author": "Not Jochen", "published": "2017-05-22 12:35:06+00:00", "title": "By: Not Jochen"}, {"content": "<![CDATA[<p>Scott, your recommendation has pushed me to read Undong.  From what I&#8217;ve seen before, it was worth.  Thank you.</p>\n]]>", "author": "jonas", "published": "2017-05-22 19:08:45+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>&#8220;What if the Book of Nature were written in English, or Hebrew, or other human languages&#8230;&#8221;</p>\n<p>But if the human language used was used in a precise manner so as not to get ambiguous laws, wouldn&#8217;t you get something that could be classified as math already? (How would one define math, for that matter?) This point makes me curious enough to read Unsong.</p>\n]]>", "author": "Ashley", "published": "2017-05-23 06:02:26+00:00", "title": "By: Ashley"}, {"content": "<![CDATA[<p>1) &#8220;what could it mean for the world to be law-governed but not mathematical? &#8221;</p>\n<p>2) &#8220;What if the Book of Nature were written in English, or Hebrew, or other human languages, and if the Newtons and Einsteins were those who were most adept with words?&#8221;</p>\n<p>to 1) Haim Vital&#8217;s exposition &#8220;Etz Chaim&#8221; (&#8220;Tree of Life&#8221;) on the Lurianic Kabbalah system (roughly QFD equivalent in domain of spiritual worlds) explains that. It&#8217;s a mistake to call this mysticism, it&#8217;s a more precise behind-the-scenes science than almost anyone realizes.</p>\n<p> to 2) This idea and as far as I can tell major premises of Unsong are described by the Sefer Yetzirah (attributed to Avraham Avinu) </p>\n<p>I should note that like its physical counterparts you need a lot of background, a kosher teacher, years of devotion and practice as a devout Jew to be able to access and assimilate the ideas into a hermeneutical framework where you know the whole to situate the details and the details to situation into the whole. </p>\n<p>Start here if you like <a href=\"http://www.azamra.org/Kabbalah/starting.htm\" rel=\"nofollow\">http://www.azamra.org/Kabbalah/starting.htm</a></p>\n<p>Daniel</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bilar:Daniel.html\">Daniel Bilar</a>", "published": "2017-05-23 17:15:23+00:00", "title": "By: Daniel Bilar"}, {"content": "<![CDATA[<p>Daniel Bilar: It&#8217;s hardly a coincidence if major premises of <i>Unsong</i> appeared earlier in Lurianic Kabbalah, because the latter is what Scott Alexander spent months researching in preparation for writing the book.  While it&#8217;s many other things as well, one thing <i>Unsong</i> is, is an attempt to make some of the ideas of kabbalah accessible to general math/CS/physics nerds who don&#8217;t have the time or opportunity to study for years, and who indeed need not be Jewish, or religious at all.  This Alexander achieves through the device of presenting the archangel Uriel as a cosmic programmer and sysadmin&#8212;which leads to a great deal of nerd humor that at least I appreciated!  Of course I&#8217;m hardly an expert on kabbalah&#8212;I barely remember most of what I learned in Hebrew day school!&#8212;so no doubt many errors escaped my notice.  But in general, and in the fields where I <i>do</i> have some expertise (computational complexity, quantum computing, etc.), I feel like <i>someone</i> has to put in the effort to popularize abstruse bodies of knowledge, and indeed that the effort to do so intelligently is a high calling.</p>\n]]>", "author": "Scott", "published": "2017-05-23 19:17:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Daniel Bilar #22</p>\n<p>&#8220;This idea and as far as I can tell major premises of Unsong are described by the Sefer Yetzirah (attributed to Avraham Avinu)&#8221;</p>\n<p>The grammar, style and language of Sefer Yetzirah places it in age sometime after the rebuilding of the Temple. Even if Abraham is a historically figure, there&#8217;s no way it actually dates to being contemporary with Abraham.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2017-05-23 20:00:28+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Joshua: I am speaking from an orthodox Jewish position. Our oral tradition attributes it to Avraham. This does not contradict what you state, a substantial (arguably the main keys) to the Torah were only given orally for a long time.  It is possible that the SY teachings were written down much later and indeed, this is attributed to Rabbi Akiva.</p>\n<p>See eg <a href=\"http://www.inner.org/parshah/genesis/lech_lecha/E68-0205.php\" rel=\"nofollow\">http://www.inner.org/parshah/genesis/lech_lecha/E68-0205.php</a></p>\n<p>&#8220;Lech Lecha: Abraham and the Wisdom of the Book of Formation<br />\n231 Gates</p>\n<p>God created the world with the holy language, Hebrew. Sefer Yetizrah (The Book of Formation), the very first Kabbalistic text, describes this process and mentions that gates—two letter combinations of Hebrew letters—are a central ingredient in the construction of the universe. Because Hebrew has 22 letters, there are 462 or “231 front and back,” possibilities for combining two different letters. One of the most beautiful permutations of the word “Israel,” ישראל , is יש רלא , which literally means “there exist 231,” alluding to these 231 gates.</p>\n<p>Traditionally, the wisdom of Sefer Yetzirah is attributed to Abraham. The book itself was put into its final form in the Second Temple period, a task attributed to Rabbi Akiva, the revealer of Kabbalistic wisdom in that period and the Rebbe of Rabbi Shimon bar Yochai.&#8221;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bilar:Daniel.html\">Daniel Bilar</a>", "published": "2017-05-23 23:10:38+00:00", "title": "By: Daniel Bilar"}, {"content": "<![CDATA[<p>Daniel Bilar #25,</p>\n<p>There&#8217;s no deep halachic or other reason to accept that claim. This sort of claim is functionally similar to claims that Unetanneh Tokef is due to Rav Amnon of Mainz, although in this case the unnecessary and unsubstantiated age goes in the other direction. (Of course, I&#8217;ve met at least one person who asserted that denying the story of Rav Amnon amounted to kefirah, but at that point was isn&#8217;t even trying to really understand the history of Jewish thought and liturgy.)</p>\n]]>", "author": "Joshua Zelinsky", "published": "2017-05-24 03:07:59+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<blockquote><p><b>Joshua Zelinsky</b> speaks highly (<i>circa</i> comment <a href=\"#comment-1735661\" rel=\"nofollow\">#26</a>) of &#8220;understanding the history of Jewish thought and liturgy.&#8221;</p></blockquote>\n<p>An illuminating survey of the Kabbalic elements of Jewish history (for me at least) has been <a href=\"https://en.wikipedia.org/wiki/Abba_Hillel_Silver#Biography\" rel=\"nofollow\">Abba Hillel Silver</a>&#8216;s PhD thesis <i>A history of Messianic Speculation in Israel from the First through the Seventeenth Centuries</i> (1927, text on-line <a href=\"https://archive.org/stream/megazob/Abba_Hillel_Silver_-_A_history_of_messianic_speculation_in_Israel_djvu.txt\" rel=\"nofollow\">here</a>, PDF on-line <a href=\"https://archive.org/download/megazob/Abba_Hillel_Silver_-_A_history_of_messianic_speculation_in_Israel.pdf\" rel=\"nofollow\">here</a>).</p>\n<p><i>Unsong</i> builds directly upon the Kabbalic elements of Judaic messianic speculation that Rabbi Silver&#8217;s thesis vividly describes.</p>\n<blockquote><p><b>Introduction</b> (excerpts)&nbsp; The pathetic eagerness to read the riddle of Redemption and to discover the exact hour of the Messiah&#8217;s advent&nbsp;&hellip; proceeded with varying intensity clear down the ages. At times it seems to be the idle speculation of leisure minds, intrigued by the mystery; at other times it is the search of people in great tribulation.&nbsp;&hellip; Great political changes, boding weal or woe, accelerated the tempo of expectancy.&nbsp;&hellip; The rich fancy of the people, stirred by the impact of these great events, sought to find in them intimations of the Great Fulfillment.&nbsp;&hellip; </p>\n<p><b>The Sixteen Century</b> (p. 137)&nbsp; Isaac Luria (1534-1572), father of modern &#8220;practical&#8221; Kabbala, left none of his teachings in writing, so that we have no record of his Messianic calculations. It is clear, however, from the legends which have survived him that he entertained the hope that the year 1575 was the appointed year for the Redemption, and that perhaps he himself would bring it about. He is quoted as having declared that, although the earlier Kabbalists like Nabmanides and Nehunia ben Ha-Kanah did not reveal anything of the science of <i>parzufim</i> (physiognomy), it is permitted to do so now for the day of the Messiah is near at hand.</p></blockquote>\n<p>The hundreds of utterly failed Messianic prophesies that Silver scrupulously documents&nbsp;&mdash; prophesies inferred by methods both Kabbalistic and otherwise&nbsp;&mdash; afford comfort chiefly to the not-inconsiderable cohort of people, from many religions and none, who heretically foresee, chiefly upon scientific and rational grounds, that the Messiah&#8217;s most plausible date of arrival, will be upon the advent of a humanist era in which his/her services are scarcely required!&nbsp;🙂</p>\n<p>Assuming that the humanists are correct, nonetheless Kabbalic cognition still is eminently worthy of study.  Here illumination is provided by Reuben Hersh and Vera John-Steiner&#8217;s recent book <i>Loving and Hating Mathematics: Challenging the Myths of Mathematical Life</i> (2010).  </p>\n<p>In particular, chapters 2,3, and 4 of Hersh and John-Steiner&#8217;s text sympathetically survey mathematics as, respectively, a foundation for &#8220;culture&#8221;, &#8220;solace&#8221;, and &#8220;addiction&#8221;&nbsp;&mdash; these three traits being prominently characteristic of mathematical cognition in general, and Kabbalic practice in particular.</p>\n]]>", "author": "John Sidles", "published": "2017-05-24 09:47:04+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Scott #23:</p>\n<blockquote><p>I feel like <i>someone</i> has to put in the effort to popularize abstruse bodies of knowledge, and indeed that the effort to do so intelligently is a high calling.</p></blockquote>\n<p>Let me see&#8230; Alchemy should qualify as an abstruse body of knowledge, and it certainly seems to be possible to popularize it intelligently, but I think that describing that particular effort as a &#8220;high calling&#8221; would be utterly absurd. So, unless you can come up with something that separates kabbalah and alchemy, I don&#8217;t find that argument very convincing.</p>\n]]>", "author": "Aula", "published": "2017-05-24 20:33:28+00:00", "title": "By: Aula"}, {"content": "<![CDATA[<p>Aula: Have you read <i>Unsong</i>?  Before reading it I was closer to your position.  But <i>Unsong</i> makes one hell (har, har) of a case, from one of the Internet&#8217;s leading rationalists, that even if we agree that kabbalah is no better-founded than alchemy, there&#8217;s still a great deal of broader interest that can be mined from it.</p>\n<p>(Then again, if someone wrote an <i>Unsong</i> based around alchemy, I&#8217;d probably end up feeling that way about alchemy as well&#8230;)</p>\n]]>", "author": "Scott", "published": "2017-05-24 21:09:36+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I vaguely recall that &#8220;The Trumpeter of Krakow&#8221; did some interesting things with alchemy, although I don&#8217;t believe it was the main focus of the book&#8230; I read it as a kid though and can&#8217;t claim to remember it well.</p>\n]]>", "author": "Sniffnoy", "published": "2017-05-24 23:12:17+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Also, y&#8217;know, the alchemy didn&#8217;t work, because, I mean, it&#8217;s a historical novel, not a fantasy about an alternate universe where alchemy works.  But I remember it managing to make alchemy more interesting than anything else I&#8217;d read involving it&#8230;</p>\n]]>", "author": "Sniffnoy", "published": "2017-05-24 23:13:51+00:00", "title": "By: Sniffnoy"}]