[{"content": "<![CDATA[<p>AJ #18: Age, veteran status, hair color, Mac/Windows/Linux, whiteboard/blackboard/Beamer/PowerPoint&#8230; (must use TeX though)</p>\n]]>", "author": "Scott", "published": "2017-10-30 13:36:27+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>deep learning zombie, chanting “artificial BRAINSSSS…” with outstretched arms.</p>\n<p>I so wish I had seen this earlier, there is a Halloween costume in there somewhere.</p>\n]]>", "author": "Uncle Brad", "published": "2017-10-30 14:56:05+00:00", "title": "By: Uncle Brad"}, {"content": "<![CDATA[<p>I&#8217;ve been wanting to work through &#8220;Foundations of Data Science&#8221; by J. E. Hopcroft, Arvin Blum,  and R. Kannan as a way to get more solid with the math:</p>\n<p><a href=\"https://www.cs.cornell.edu/jeh/book.pdf\" rel=\"nofollow\">https://www.cs.cornell.edu/jeh/book.pdf</a></p>\n]]>", "author": "asdf", "published": "2017-10-30 15:40:51+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>Scott #17, &#8220;and preferred interpretation of quantum mechanics.&#8221; &#8211;> really? you&#8217;d have no qualms with a postdoc who believed in superdeterminism?? 😉</p>\n]]>", "author": "Atreat", "published": "2017-10-30 19:29:16+00:00", "title": "By: Atreat"}, {"content": "<![CDATA[<p>Atreat #22: Well, that&#8217;s not really an &#8220;interpretation&#8221;; it&#8217;s just a confusion&#8230; 😀</p>\n]]>", "author": "Scott", "published": "2017-10-31 00:11:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Here&#8217;s my wikibook on &#8216;Machine Learning&#8217; (Links: 150)<br />\n<a href=\"https://en.wikipedia.org/wiki/User:Zarzuelazen/Books/Reality_Theory:_Machine_Learning\" rel=\"nofollow\">https://en.wikipedia.org/wiki/User:Zarzuelazen/Books/Reality_Theory:_Machine_Learning</a></p>\n<p>Generally, for any given well-developed knowledge domain, there&#8217;s at most a couple of hundred (~200) key concepts that need to be mastered- find these key concepts, then break it down &#8211; draw a concept map with lines radiating outwards from the 200 core concepts into  sub-concepts.</p>\n<p>Rather than trying to learn knowledge in tiny sequential pieces, it&#8217;s best to get hit with the big picture right away (the concept mapping or mind mapping approach).  Get thrown right in the deep end.  &#8216;Super-clicking&#8217; :  Many concepts have to be integrated into a coherent whole.  </p>\n<p>I devised a map of all explanatory (deep) knowledge, with 27 core knowledge domains , each of around 200 core concepts , so that&#8217;s  ~ 5 400 concepts in total to sum up all human deep knowledge.</p>\n]]>", "author": "mjgeddes", "published": "2017-10-31 01:58:28+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>Scott @19: emacs vs. vi?</p>\n]]>", "author": "Jon Lennox", "published": "2017-10-31 14:39:23+00:00", "title": "By: Jon Lennox"}, {"content": "<![CDATA[<p>Jon #25: Even Notepad.  We are large.  We contain multitudes.</p>\n]]>", "author": "Scott", "published": "2017-10-31 14:50:56+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Could you bring yourself to take on a hard-core Trump supporter who wore his MAGA cap to your office?</p>\n]]>", "author": "Wilhelm Freh", "published": "2017-10-31 21:39:17+00:00", "title": "By: Wilhelm Freh"}, {"content": "<![CDATA[<p>Wilhelm #27: Interesting question.  For me, the specific issue with wearing a MAGA cap to the office is that&#8212;unless the wearer were to disclaim this meaning&#8212;it basically amounts to a statement (or does it not?) that other participants in our group, for example those from Iran, ought to be deported from the US.  So it&#8217;s not just a political expression unrelated to science, but a rejection of one of the preconditions for our doing science.</p>\n<p>This, of course, is also the argument people made for firing James Damore, but in the case of MAGA, it strikes me as a hundred times truer.  Damore never said or insinuated that women as a class, or any specific woman, had no place at Google (indeed he said the opposite), but wearing a MAGA cap <i>does</i> say or insinuate that many current members of the American scientific community <i>who know exactly who they are</i> have no place in the US, because that&#8217;s what Trump has actually tried to implement, and continues to fight the courts to be able to implement.</p>\n<p>Even then, though, I wouldn&#8217;t just summarily expel a MAGA hat wearer from our group&#8212;<i>especially not</i> if they were doing great research!  I would try to engage them in a dialogue about the issue above.</p>\n]]>", "author": "Scott", "published": "2017-11-01 02:40:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>#13, Ashley:</p>\n<p>Deep learning is a branch area of the rich fields of recurrent neural networks and machine learning (information theory and stochastic processing are related, more traditional fields).  You might want to go to some of the IEEE talks in these areas to get a sense of current work and new directions, and who is working on these.  </p>\n<p>If you are a student, the registration fee at IEEE talks is usually pretty inexpensive.</p>\n<p>(FYI:  The traditional progression toward machine learning, after calculus is to take classes in third or fourth year, and in graduate school, in stochastic processes, information theory, neural networks, and machine learning.)</p>\n]]>", "author": "Marnie Dunsmore", "published": "2017-11-01 13:12:32+00:00", "title": "By: Marnie Dunsmore"}]