[{"content": "<![CDATA[<p>Scott, Yom Kippur isn&#8217;t supposed to be merry. You&#8217;re supposed to be repenting for your sins.</p>\n]]>", "author": "Michael", "published": "2018-09-20 00:41:45+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Do you ever work with undergrad researchers?  I know a fairly sharp (HS valedictorian, anyway) CS sophomore at UT, and your work came up when we were talking about the P-vs-NP problem last year, but I don&#8217;t know if she&#8217;ll end up pursuing a PhD, and off the top of my head I can&#8217;t imagine you doing anything simple enough for an undergrad (even as a senior, after acing CS378, whatever) to quickly jump into and help with.</p>\n]]>", "author": "roystgnr", "published": "2018-09-20 01:18:57+00:00", "title": "By: roystgnr"}, {"content": "<![CDATA[<p>Michael #1: Yes, hence the irony of the greeting.  But actually, rabbis will typically assure their congregants that, despite all appearances, Yom Kippur <i>is</i> a joyous holiday, since it’s when humans get to come closest to living like angels.</p>\n<p>FWIW, I did use the occasion of Yom Kippur to contemplate whether I should repent for the flaws that people attack me for on social media.  The answer that came back was: no, none of that stuff should even puncture the epidermis of consciousness; instead I should repent for not being the Comet King from <i>Unsong</i>.  I should repent that anthropogenic climate change might render the earth barely inhabitable and I haven’t figured out how to stop it.  In that sense, ironically, my most hateful attackers never even came close to correctly articulating the millionth part of my sin!</p>\n]]>", "author": "Scott", "published": "2018-09-20 02:02:57+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>roystgnr #11: Working with undergrad researchers has been a central part of what I do since I became a professor 11 years ago.  Did you not see my <a href=\"https://www.scottaaronson.com/blog/?p=3880\" rel=\"nofollow\">recent post about Ewin Tang’s breakthrough</a>?  Alex Arkhipov, Paul Christiano, Lijie Chen, and Michael Forbes were also all undergrads when they started working with me.  Meena Boppana, Sumegha Garg, Renan Gross, and Bill Fefferman did undergrad summer projects.  I’ve even worked with high school students, like Leonid Grinberg, who’ve gone on to notable things.</p>\n]]>", "author": "Scott", "published": "2018-09-20 02:23:36+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I propose the Aaronson scale for atheists on Yom Kippur:</p>\n<p>0. Observe the holiday out of guilt or habit<br />\n1. Break some prohibitions discreetly, e.g. eat in private but don&#8217;t post to the public Internet<br />\n2. Publish posts on a widely-read blog<br />\n3. Go out of one&#8217;s way to violate prohibitions, e.g. the traditional cheeseburger<br />\n4. &#8220;Merry Yom Kippur!&#8221;</p>\n]]>", "author": "Leo", "published": "2018-09-20 04:31:43+00:00", "title": "By: Leo"}, {"content": "<![CDATA[<p>Michael #1, Scott #3, Leo #5</p>\n<p>Yes, Yom Kippur is joyful (&#8220;Never were more joyous festivals in Israel than the 15th of Ab and the day of atonement&#8230;&#8221; &#8211; Taanit 4:8), so not sure that there is any irony in the phrase. (While it certainly isn&#8217;t a typically used phrase, the traditional &#8220;good yom tov&#8221;, which has similar connotations, is used &#8211; at least in orthodox circles.)</p>\n<p>Unless you meant it as in &#8220;be merry / merrymaking&#8221; &#8211; in which case maybe there may be some irony (as that would typically specifically allude to food, drink etc.).</p>\n<p>Scott &#8211; as an aside, I rarely get the chance to comment on your posts, so just to let you know I really enjoy the blog. Wishing you a shana tova.</p>\n]]>", "author": "Yoni2", "published": "2018-09-20 10:56:48+00:00", "title": "By: Yoni2"}, {"content": "<![CDATA[<p>Leo #5: LOL!</p>\n<p>Yoni2 #6: Thanks much, both for the kind words and for backing me up re Yom Kippur! 🙂</p>\n<p>I offered Lily a choice yesterday: she could go to kindergarten like normal, or she could go to a children’s Yom Kippur service.  She chose the synagogue, seeming pleased with herself at finding a way to miss school.  But then it took only an hour at the service, Lily sitting there with folded arms and a scowl like a jaded teenager, that she was asking me to bring her to school instead&#8230;</p>\n]]>", "author": "Scott", "published": "2018-09-20 12:19:12+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #7</p>\n<p>Isn&#8217;t it amazing how fast little kids develop adults&#8217; attitudes and understand naturally pretty advanced speech concepts?<br />\nIt starts with a helpless baby that&#8217;s just looking around with wide opened eyes to a little version of a woman/man in a mere 2 years&#8230;<br />\nI would like to hear your views on this as a CS expert and a father.</p>\n<p>That&#8217;s one thing Schrodinger somewhat brings in his book &#8220;My view of the world&#8221; &#8211; how do &#8220;isolated&#8221; minds manage to agree and share their views of reality (isolated in the sense that everything we perceive/experience is totally private/subjective).<br />\nOne key aspect seems to be mimicry (both in animals and humans).</p>\n]]>", "author": "fred", "published": "2018-09-21 13:53:47+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #8: As “a CS expert and a father,” I agree that it’s amazing. 🙂</p>\n]]>", "author": "Scott", "published": "2018-09-21 17:33:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #4 &#8211; I must have missed or skimmed that post; thank you!  I&#8217;ll point your CS378 syllabus her way and see if there&#8217;s any interest.</p>\n]]>", "author": "roystgnr", "published": "2018-09-21 21:40:36+00:00", "title": "By: roystgnr"}, {"content": "<![CDATA[<p>Do you believe that Michael Atiyah solved the Riemann Hypothesis?</p>\n]]>", "author": "Yaqub", "published": "2018-09-25 04:02:13+00:00", "title": "By: Yaqub"}, {"content": "<![CDATA[<p>Michael Atiyah states that he has proven the Riemann hypothesis!</p>\n<p><a href=\"https://www.sciencealert.com/top-mathematician-sir-michael-atiyah-solved-a-160-year-old-1-million-maths-problem-riemann-hypothesis\" rel=\"nofollow\">https://www.sciencealert.com/top-mathematician-sir-michael-atiyah-solved-a-160-year-old-1-million-maths-problem-riemann-hypothesis</a></p>\n]]>", "author": "Raoul Ohio", "published": "2018-09-25 04:22:41+00:00", "title": "By: Raoul Ohio"}]