[{"content": "<![CDATA[<p>I&#8217;m quite interested in the specific case of a bad equilibrium that large parts of (mostly non-STEM) academia seem to be stuck in: the postmodernist dogma. What seems to be enforcing the equilibrium is the threat of severe public bullying to anyone that dares to diverge from it, and there were maybe a dozen such cases in just the last year. In this case, it doesn&#8217;t even seem to help if a high-ranking insider speaks clearly against it &#8212; Steven Pinker did for years and not much has changed, except perhaps for the worse. Clearly, if this equilibrium can be overcome, it will need to be done by some outsiders, and they will need to solve the problem of appearing like arrogant crackpots, one way or another.</p>\n]]>", "author": "Milos", "published": "2017-11-17 17:23:12+00:00", "title": "By: Milos"}, {"content": "<![CDATA[<p>I&#8217;ve twice found $20 bills next to the North Station MBTA fare machines in Boston, having passed through there maybe 20 times. There are definitely some places worth keeping an eye out&#8230;</p>\n]]>", "author": "Tim McCormack", "published": "2017-11-18 13:54:06+00:00", "title": "By: Tim McCormack"}, {"content": "<![CDATA[<p>My wife Michele once found almost exactly $20 in Guatemalan Quetzal (a lot of money, locally), not on a sidewalk, but on the floor of the economics department of the Libertarian Universidad Francisco Marroquín in Guatemala!</p>\n]]>", "author": "Michael Arc", "published": "2017-11-18 22:54:35+00:00", "title": "By: Michael Arc"}, {"content": "<![CDATA[<p>I think that the critique about &#8217;empty skulls&#8217; is important, and I&#8217;m trying to write up a more compelling version of it.</p>\n]]>", "author": "Michael Arc", "published": "2017-11-18 23:12:54+00:00", "title": "By: Michael Arc"}, {"content": "<![CDATA[<p>Michael #15: That story takes the cake!  (A cake that was just lying on the ground?)</p>\n]]>", "author": "Scott", "published": "2017-11-18 23:14:10+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>The bit about &#8220;empty skulls&#8221; reminds me of <a href=\"http://www.extremistvector.com/content/stupid.html\" rel=\"nofollow\">this old piece</a>&#8230; 🙂</p>\n]]>", "author": "Sniffnoy", "published": "2017-11-19 01:08:07+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>(FWIW, the &#8220;Laws of Human Stupidity&#8221; essay is actually older than the 1987 date listed on that page; it goes back to 1976, I think.)</p>\n]]>", "author": "Sniffnoy", "published": "2017-11-19 01:15:49+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>I haven&#8217;t read Yudkowski&#8217;s short book yet (don&#8217;t know if I will), but if your summation is mostly correct and comprehensive then there is a big ingredient that might be left out. Governing leaders often get to where they are because they are extroverts. There is a whole nebula of characteristics that are associated with being an extrovert, one of the main ones being a relative insensitivity to criticism.</p>\n<p>A lot of us introverts know that many of these &#8220;leaders&#8221; in their field just need more external stimulus from other people than we introverts do. There is a lot of truth in the idea that any attention is good attention to real extroverts. How could someone like that NOT have an advantage in the school of ideas  where a neutral audience observing them seems more like innocent sheep coming to the slaughter.</p>\n<p>I guess you can tell I have some real hostility to many notorious  extrovert thought leaders.</p>\n]]>", "author": "Eric Habegger", "published": "2017-11-19 21:36:03+00:00", "title": "By: Eric Habegger"}, {"content": "<![CDATA[<p>Eric #20: Even supposing that idea is true, I confess I don&#8217;t understand its relationship to the rest of Yudkowsky&#8217;s book (which is not to say there isn&#8217;t one).</p>\n]]>", "author": "Scott", "published": "2017-11-19 21:46:27+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #21: I suppose I should have defined my terms better. Yudkowski, to me, is calling humility the essential ingredient. I would rather define it as introversion.  There are many cranks in the scientific world that deviate from the standard path but are far from having humility. In a sense they submerse themselves in their own world and are blind to inconsistencies with the external world&#8217;s phenomenology.</p>\n<p>But that arrogance that these cranks possess is not that different from thought leaders who continually pump out excuses for why the mainstream theories are not conforming to observed reality and experiment.  Think about the discovery of dark matter and energy in the previous 20 years and some of the outlandish explanations for it that the experts have ported to all the different publications.</p>\n<p>What I&#8217;m saying is that often introverted people know when their ideas make sense but they find that the scientific culture just doesn&#8217;t want to listen to the quiet person in the corner. That&#8217;s just the way it is nowadays.</p>\n]]>", "author": "Eric Habegger", "published": "2017-11-19 22:21:45+00:00", "title": "By: Eric Habegger"}, {"content": "<![CDATA[<p>I suspect that one reason why he spends time in explaining bad policy choices made by populations from a Nash equilibrium angle (which are now suspected to be very hard to achieve efficiently; see this: <a href=\"https://www.quantamagazine.org/in-game-theory-no-clear-path-to-equilibrium-20170718/\" rel=\"nofollow\">https://www.quantamagazine.org/in-game-theory-no-clear-path-to-equilibrium-20170718/</a>), is because the more frequent cause that you mention hardly has much academic interest.</p>\n<p>After all, running into a head that seems to be a hollow chamber protected by concrete is a dead-end. There is almost nothing that can be done to make such a person see reason, whereas why a particular Nash equilibrium cannot be reached is a question that rouses our interest.</p>\n]]>", "author": "Arko Bose", "published": "2017-11-20 08:44:40+00:00", "title": "By: Arko Bose"}, {"content": "<![CDATA[<p>Who has the graver defect of rationality: the FDA who haven’t approved an intravenous baby food with the right mix of fats, or someone who doesn&#8217;t believe that pigs or human babies are conscious?<br />\n(cf. <a href=\"https://rationalconspiracy.com/2015/12/16/a-debate-on-animal-consciousness/\" rel=\"nofollow\">https://rationalconspiracy.com/2015/12/16/a-debate-on-animal-consciousness/</a>)<br />\nSome false reasoning can be ethically catastrophic. </p>\n<p>I choose this example not to make fun of Eliezer &#8211; I hold some crazy beliefs myself &#8211; but rather to make a perhaps familiar point. Virtually all of us overestimate our own rationality, but especially members of the self-avowed rationalist community.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/Pearce:David.html\">David Pearce</a>", "published": "2017-11-20 16:08:47+00:00", "title": "By: David Pearce"}, {"content": "<![CDATA[<p>I don&#8217;t buy the &#8220;twenty dollar bill&#8221; argument at all.</p>\n<p>I&#8217;m now 65 and have had several &#8220;nobody expected to see it&#8221; successes over the years. In fact, it&#8217;s the main reason I retired in 1986 when I was 34. (Didn&#8217;t stop doing things, and several other successes followed.)</p>\n<p>It&#8217;s hard to separate the trivial stories about finding a (literal) twenty dollar bill from the more important stories of seeing something other people&#8211;indeed, the consenus view&#8211;did not see from just bragging. </p>\n<p>But I think seeing what other people don&#8217;t see has long been the road to wealth.</p>\n<p>&#8211;Tim May</p>\n]]>", "author": "Tim May", "published": "2017-11-20 16:17:50+00:00", "title": "By: Tim May"}, {"content": "<![CDATA[<p>I found it strange in the first paragraph that you describe the book as being about &#8220;bureaucracies.&#8221; It seems to me that it is about very different kinds of systems, more about systems that <b>know</b> rather than systems that <b>do</b>, like bureaucracies. And then when you talk about encountering a single &#8220;empty skull,&#8221; well, that&#8217;s exactly the kind of thing he&#8217;s not talking about, because he&#8217;s not talking about bureaucracies. He&#8217;s addressing people who say &#8220;How dare you think you can have ideas outside of the system!&#8221; not &#8220;You deserve everything the system does to you.&#8221;</p>\n<p>Of course, many bureaucracies do show up. NSF is a bureaucracy, but he is mainly interested in the zero-sum game of how it distributes grants, not things it could do at no cost to anyone. And while lots of people at NSF make idiosyncratic decisions, individuals are not usually the bottleneck, indeed, NSF is not the only source of grants. </p>\n<p>I don&#8217;t know what the Bank of Japan was thinking, but it is merely the most extreme example of tendencies of central banks, not some idiosyncratic behavior that could be explained by an individual. </p>\n<p>Probably the single biggest problem with the IV baby food was the idiosyncratic decision by the company not to pursue US approval. And maybe there is an individual at the FDA blocking some fast track. Even if the FDA did approve it, there would still be the problem of getting the word out. (Pharma ads are really useful!) Most such problems are really informational. MGH makes the food, but why not hospitals in other states, especially big states like CA and TX? The FDA is the most important relevant institution, but it isn&#8217;t the bottleneck stopping them. (Could the FDA decide to make an exception to bureaucratic rules? I don&#8217;t think so. A lot is forced on it by Congress, which would respond badly to being defied.)</p>\n]]>", "author": "Douglas Knight", "published": "2017-11-20 20:24:50+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Scott, thanks for the great post on an incredible book. </p>\n<p>I&#8217;m curious what you think about the relation between this and (bear with me here!) P≠NP. In chapter 4 section iii) Eliezer writes:</p>\n<p>&#8220;This brings me to the single most obvious notion that correct contrarians grasp, and that people who have vastly overestimated their own competence don’t realize: It takes far less work to identify the correct expert in a pre-existing dispute between experts, than to make an original contribution to any field that is remotely healthy.&#8221; </p>\n<p>This seems like the core of the book. It&#8217;s really not about when you can *outperform* experts, but rather about when you can *pick* the right experts to believe, even if they&#8217;re not mainstream. (In some special cases you might pick yourself, and then try to outperform the other experts, but that&#8217;s rare.) Would P=NP imply Eliezer is wrong in claiming the latter is significantly easier?</p>\n<p>PS. Hopefully I&#8217;m not misappropriating a technical theorem already over-exploited by crackpots. DS.</p>\n]]>", "author": "Jacob Lagerros", "published": "2017-11-21 01:34:46+00:00", "title": "By: Jacob Lagerros"}, {"content": "<![CDATA[<p>David Pearce #24: I started reading the discussion you linked to.  Didn&#8217;t finish it yet, but the parts I read were pretty interesting, with plenty to challenge people of any stance about animal consciousness.  And while I didn&#8217;t agree with everything Eliezer said, his views struck me as no more abhorrent than the views of any other person who eats meat.  But then, maybe I&#8217;m unusual: eating meat without even trying to justify it, doesn&#8217;t strike me as somehow morally superior to eating meat and defending it with a philosophical stance about the distinction between pain and suffering.  But it seems like for many other people it does.</p>\n]]>", "author": "Scott", "published": "2017-11-21 22:06:13+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Jacob #27: Yes, the point Eliezer is making there (which I agree with) could be described as &#8220;broadly P&ne;NP-like.&#8221;</p>\n<p>If P=NP in the technical sense, then we could say: writing a computer program to efficiently generate correct contrarian ideas, would be no harder than writing a program to efficiently recognize those ideas when shown them.</p>\n<p>(But someone who thought that even <i>recognizing</i> good contrarian ideas was beyond the ability of computers, could deny that the formal P vs NP problem had any relevance whatsoever to Eliezer&#8217;s point.)</p>\n<p>In any case, the whole discussion is a bit academic, since of course P&ne;NP in reality. 😉</p>\n]]>", "author": "Scott", "published": "2017-11-21 22:14:54+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>>> is it rationally justifiable to act as if you know better than our civilization’s “leading experts”?</p>\n<p>I think the main problem is that in most areas the experts do not all agree, if the problem is new and complicated enough.<br />\nLet&#8217;s take the example of global warming, with experts like Richard Lindzen and Roy Spencer disagreeing with the majority.<br />\nObviously, this makes real world examples much more difficult decision problems than what Eliezer and you discussed &#8230;</p>\n]]>", "author": "wolfgang", "published": "2017-11-23 18:56:51+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>wolfgang #30: Actually, in that example the experts are <i>completely overwhelmingly</i> on one side of the question&#8212;Lindzen represents like 3% of the field.  So regardless of what you personally believe about the answer, I think Eliezer&#8217;s question applies with full force to that case.</p>\n]]>", "author": "Scott", "published": "2017-11-23 19:37:12+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>@Scott</p>\n<p>>> Lindzen represents like 3% of the field</p>\n<p>How did you arrive at this figure?</p>\n<p>If you really count experts you could perhaps go by refereed journals (assuming you already know what journals to trust) and academic affiliation. But in order to judge a scientific article (to know if you should count it as pro or con) you usually need to understand quite a bit about the field already. </p>\n<p>I assume that this is not how you did it and I further assume that most people don&#8217;t have the time to do this.</p>\n<p>Instead most people trust some news sources (from wikipedia to the NYT and from Sci.Am. to Lubos&#8217; blog) to do this work for<br />\nthem and this is where the real problem with the debate about global warming begins for most non-experts imho.</p>\n<p>In other words, I still think that establishing the opinion of &#8220;the leading experts&#8221; is actually the main part of this decision problem and it does not get easier if it is true that a large number of scientific articles cannot be reproduced in many fields &#8230;</p>\n]]>", "author": "wolfgang", "published": "2017-11-24 02:18:44+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>In the particular case of the IV formula, I think the various systemic incentives and barriers are something of a red herring. It&#8217;s not news that blindly following an institution&#8217;s dictates can sometimes lead to thoroughly pathological outcomes, which is why most real-life institutions include oversight positions with considerable discretionary power to override normal procedures when such cases arise. </p>\n<p>The real question in this case is why the people whose job descriptions include reigning in the pathological tendencies of institutions seem disinclined to do so in a case like this. In normal circumstances I&#8217;d have expected either the FDA head to temporarily waive the normal approval procedure, or a court to grant an emergency injunction against the interstate export ban. Why do such things seem to have become unimaginable? It seems to me Simplicio may be far closer to the mark than the Cynical Economist on that score.</p>\n]]>", "author": "xyz", "published": "2017-11-27 07:57:52+00:00", "title": "By: xyz"}, {"content": "<![CDATA[<p>Thanks for posting about this! It was a very good read with many interesting points although its not always clear to me what his precise point is. Could really use a summary at the end similar to &#8220;37 Ways That Suboptimal Use Of Categories&#8221;.</p>\n<p>For example, I&#8217;m not sure what he was thinking of (explicitly) at the beginning of Chapter 4.III or what &#8220;You can’t lift a ten-pound weight with one pound of force!&#8221; means there. Or he means by &#8220;But then what do you say to the Republican?&#8221; in Chapter 6.II. It feels like I&#8217;m missing some inside jokes here.</p>\n<p>The prose is very interesting and make the first reading much more enjoyable, but there&#8217;s some concision sacrificed (and more direct/explicit statements missing, even if a clearer statement would be about a nuanced view).</p>\n<p>For TCS, what about short/simple proofs? If something is open for a long (enough) time and then receives a short proof, it is well received. Otherwise, the reviewer might dismiss it thinking the original <em>problem</em> was too easy. (I think I&#8217;ve mostly encountered this as a reviewer judging the value of a result. But it could also act strongly and implicitly when I select which questions to work on.)</p>\n<p>Although you could say number of years unresolved is some statistical information about the original problem&#8217;s difficulty, I think we are still pretty heavily biased towards answering questions that are hard for other researchers (rather than things that tell us more about the mathematical world).</p>\n<p>For your question of why didn&#8217;t TCS invent bitcoin and quantum computers, I feel like this is some kind of exploration vs exploitation problem. <em>Using</em> the theory developed means taking time away from developing the theory further.</p>\n<p>But coming back to my previous point, I think what&#8217;s needed for new inventions aren&#8217;t usually &#8220;hard&#8221; theory problems. Simplier/easier question-answer pairs are more easily applicable. But these pairs still need a theoretician to explore, understand, digest and explain. (Of course, the harder problems do help map out the broader region of mathematical truth within which individual pieces of knowledge are picked for inventions.)</p>\n<p>There&#8217;s the Distill project in AI that goes a bit in the direction of promoting simplification (which I&#8217;d like to see more of). (Although I&#8217;m not quite sure if they mean only unnecessarily complicated math should be removed or should *all* complicated math be removed. And in the former case, how do we define unnecessary.)</p>\n]]>", "author": "Another Nymous", "published": "2017-11-28 13:34:54+00:00", "title": "By: Another Nymous"}]