[{"content": "<![CDATA[<p>As for feeling threatened by Palestinian activists on campus: get that carry permit already!</p>\n]]>", "author": "posttenuretourettes", "published": "2016-10-23 10:33:01+00:00", "title": "By: posttenuretourettes"}, {"content": "<![CDATA[<p>Scott, in light of recent polling in Texas, are you still planning to trade with a Johnson voter? I kinda hope not.</p>\n]]>", "author": "RO", "published": "2016-10-23 15:05:16+00:00", "title": "By: RO"}, {"content": "<![CDATA[<p>I just saw this.  I suppose that the silver lining of what&#8217;s discussed in this post is that at least it appears that Scott Aaronson is finally moving away from eigenmorality.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/w/White:Philip.html\">Philip White</a>", "published": "2016-10-23 16:09:30+00:00", "title": "By: Philip White"}, {"content": "<![CDATA[<p>@Scott (cc: jonathan):</p>\n<p>I think you should reconsider your classification of Trump as being less than Hitler-bad.  The problem is that, in this context, the term Hitler-bad should not encompass the full historical &#8220;hellscape&#8221; that we now look back on today.  During Hitler&#8217;s time, Hitler-bad was a moving target.  He was considered a fool and not a threat by many in his early days.  So is it fair to look now at the fool Trump and declare, &#8220;He could never become as bad as Hitler!&#8221;?  I&#8217;d say no.  The lesson of the second war should be that no one should ever underestimate the collective momentum of angry, deluded people nor should they underestimate the degree to which said people can be manipulated.</p>\n<p>When you realize that Trump is considered by many to be potentially Hitler-bad, I think it&#8217;s a lot easier to understand the outrage and urgency with which people reject his surrogates.  In that sense, degrees of Kevin Bacon are on a different scale than degree of Donald Trump.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sanders:David.html\">David Sanders</a>", "published": "2016-10-23 17:33:56+00:00", "title": "By: David Sanders"}, {"content": "<![CDATA[<p>RO #125: Despite ending my participation in this thread, I guess I can answer straightforward factual questions.  My vote swap partner in Ohio and I agreed to discuss again a day or so before the election.  If Texas looks competitive at that time, then we&#8217;ll both vote Hillary; only if Texas looks safe will I vote for Johnson for him.</p>\n]]>", "author": "Scott", "published": "2016-10-23 21:24:22+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>>> then we’ll both vote Hillary </p>\n<p>What kind of vote-swapping is that ?</p>\n]]>", "author": "wolfgang", "published": "2016-10-23 22:10:00+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>wolfgang #129: The kind you engage in with a guy who supports libertarianism but also wants Trump to suffer the biggest landslide loss possible.</p>\n]]>", "author": "Scott", "published": "2016-10-23 23:00:59+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>What if Trump wins? Would you change your Bayesian reasoning approach?</p>\n]]>", "author": "Easy", "published": "2016-10-24 02:13:02+00:00", "title": "By: Easy"}, {"content": "<![CDATA[<p>#127-129, interesting, seems like you&#8217;ll do same-day voting. I find absentee ballots to be much easier and time-saving for me, though I guess it brings the risk of submitting your vote too soon. I guess I&#8217;ll wait a week before the actual election.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Seita:Daniel.html\">Daniel Seita</a>", "published": "2016-10-24 03:25:24+00:00", "title": "By: Daniel Seita"}, {"content": "<![CDATA[<p>Trump is playing a dangerous rhetorical game and playing it well.  Firstly, he mixes the &#8220;crazy stuff&#8221; in with pandering to his base, which he also mixes in with some &#8220;sure-fire hits&#8221;, those being reasonable or true things you&#8217;re only allowed to say if you&#8217;re outside the political mainstream.  These include things like, &#8220;illegal immigration is bad&#8221; (right swing) and &#8220;we should restrain our military adventurism and imperialism&#8221; (left swing).</p>\n<p>He says stuff like that precisely so that he&#8217;ll have a claim to be the only guy standing outside the corrupt system telling it like it is.  This works because the system really is corrupt and he really is speaking obvious truths that everyone outside the halls of power can pretty much see.</p>\n<p>Then he throws in two kinds of shit: the kind for Republican officials, and the kind for his voter base.  Both of these are a semi-random mixture of things he really thinks, and things he&#8217;s saying just so people on &#8220;his side&#8221; have to say them.  Yes, most of it is crazy enough to alienate the general public, but it fires up Republicans and their base at the same time.  So he uses this crazy shit to ensure the loyalty of the people around him: to prove their loyalty to Trump, they have to mouth the tenets of Trumpism, which thoroughly alienate them from the general public and leave them nobody to rely on but Trump himself.</p>\n<p>The first kind of shit is things like &#8220;bomb the hell out of ISIS&#8221;.  That&#8217;s the shit he throws in to drag mainstream Republican politicians and party-staffers into his corner and keep them there.  Once he says that, everyone in his party basically has to agree, because what the fuck kind of Republican are you if you don&#8217;t want to bomb the hell out of terrorists?  Sure, it sounds crazy to non-Republicans, but if you want to keep your supporters behind you, you say it.  And then, if someone points out exactly how crazy it is, you&#8217;re stuck: just by saying it, you alienated everyone to the left of Trump anyway, so now that you&#8217;ve got second-thoughts about Trump, nobody wants you anymore.</p>\n<p>The second kind is the stuff about conspiring globalists or grabbing them by the pussy.  Maybe he believes it, maybe he&#8217;s just trying to see how much he can get away with.  He&#8217;s egomaniacal like that.  He has this absolute need to perceive himself as the winner in every situation, and he just emits the mouth-noises conducive to that goal at any given moment, without regard for semantic content as the rest of us perceive it.</p>\n<p>If you start out supporting him and try to turn against him, you confront three problems.  One is backlash from the camp you&#8217;re already in, like a cult.  The second is that outsiders hate your guts now that you&#8217;ve shown your support for Trump and Trumpism.  The third is that you really won&#8217;t find another camp in &#8220;sane&#8221; mainstream politics who are really addressing the concerns or ideas that drove you to support Trump in the first place!</p>\n<p>So for example, if you&#8217;re an ex-coal-miner in West Virginia, you know that &#8220;grab them by the pussy&#8221; is fucked-up.  Of course you know that!  You know that black people and Mexicans are humans, too: there were always some black guys in your old union.  But Hillary came to your state and just basically told you to give up and learn to code, because your blue-collar jobs are never coming back.  Really, truth be told, Hillary knows you&#8217;re not really going to learn to code and go get a professional-caste STEM job in the Bay Area.  She just wants to say you deserve your suffering.  And there was that great guy, Bernie Sanders, he was so awesomely angry, for once someone really knew how you feel, but Hillary stole that election from him.  Now she&#8217;s stealing it from Trump, too, isn&#8217;t she, by getting the whole country to just sneer at everyone who isn&#8217;t her?  So to not just roll with &#8220;grab &#8217;em by the pussy&#8221; and not just start campaigning to #RepealThe19th would be betraying everyone around you who&#8217;s standing up for your way of life.  You know it&#8217;s crazy, but it&#8217;s the only option anyone&#8217;s giving you, and there&#8217;s just enough publicly unspeakable truth mixed in with the crazy that you can&#8217;t really tell what&#8217;s real anymore when someone you trust so much says something so crazy.</p>\n<p>This is a dangerous game because it involves deliberately destroying common people&#8217;s ability to discern the truth of the events happening to them and around them.  Sneering will not help.  Voting Clinton will not help.  Only truth will help, and a basic willingness to consider others as human as we are, with all the flaws and dependencies on circumstances that implies.</p>\n<p>Fundamentally, Trump&#8217;s driving need is to be the &#8220;winner&#8221; or &#8220;on top&#8221; and make other people kneel to him.  To that end, he calculates how to whip up his base, (attempt to) humiliate or defame his opponents, and corral the supporters he doesn&#8217;t trust (such as most of the Republican Party, really) into having nowhere else to turn.  I&#8217;d like to give him a 3/5 for Saturday Morning Supervillain quality; I&#8217;ve seen better and I&#8217;ve seen worse.  Unfortunately, in most cartoons, the main characters would have realized they were being manipulated against each-other by now, and their basic main-character bonds of heroic&#8230; trust or something-or-other would have kicked in, allowing them to unite and summon their giant robot to bash Trump until he explodes in a shower of old-fashioned tokusatsu sparks.</p>\n<p>But frankly, none of the previous Saturday Morning Supervillains I&#8217;ve seen actually got themselves on the ballot for President with 40% of the country behind them, and these main characters really don&#8217;t seem to realize they&#8217;re facing a Saturday Morning Supervillain at all.</p>\n]]>", "author": "Eli", "published": "2016-10-24 03:29:55+00:00", "title": "By: Eli"}, {"content": "<![CDATA[<p>Two quotes I like from the New Yorker Clinton endorsement:</p>\n<p>&#8220;We are in the midst of a people’s revolt, a great debate concerning income inequality, the “hollowing” of the middle, globalization’s winners and losers. If the tribune whom the voters of the Republican Party have chosen is a false one, we cannot dismiss the message because we deplore the messenger. The white working-class voters who form the core of Trump’s support—and who were once a Democratic constituency—should not have their anxieties and suffering written off. Their struggle with economic abandonment and an incomplete health-care system demands airing, understanding, and political solutions.&#8221;</p>\n<p>&#8220;Clinton’s vision and temperament are the opposite of her opponent’s. She has been a pioneer throughout her life, and yet her career cannot be easily reduced to one transcendent myth: she has been an idealist and a liberal incrementalist, a glass-ceiling-smashing lawyer and a cautious establishmentarian, a wife and mother, a First Lady, a rough-and-tumble political operator, a senator, a Secretary of State. Her story is about walking through flames and emerging changed, warier and more determined. In her intelligence, in her gimlet-eyed recognition of both the limits and the possibilities of government, she’s a particular kind of inspirational figure, a pragmatist and a Democratic moderate.&#8221;</p>\n]]>", "author": "mike", "published": "2016-10-24 17:43:54+00:00", "title": "By: mike"}, {"content": "<![CDATA[<p>Several comments in this discussion (e.g. #26), and arguably every invocation of enlightenment values in general, seem to ultimately appeal to the greater long-term viability of societies which maintain norms by which people with incompatible views can continue to coexist, but isn&#8217;t the point of all the fashionable shifting of the moral event horizon to undermine precisely this sort of argument? If you feel that the position you are opposing is so repugnant that every attempt to compare it favourably to historical or hypothetical evils is frivolous sophistry, then planning for the long game in a world in which you and the opposition have to continue to coexist and make arrangements is pointless as such a world may as well be burned down. Unfortunately, &#8220;nothing short of total victory is acceptable&#8221; seems to be a sufficiently good piece of political pep talk that memeplexes which feature it have a reproductive edge over ones which don&#8217;t, and so we are left with two parties whose spearheads are large resilient to arguments about civilisation and niceness.</p>\n]]>", "author": "M.S.", "published": "2016-10-25 00:16:33+00:00", "title": "By: M.S."}]