[{"content": "I can understand your motivations not to discuss your work as an expert witness, though I have to say I find it a shame since I would be really interested to know in what kind of situations the justice needs your expertise! In particular, I wonder whether you intervene only for &quot;computer-science stuffs&quot; or in more general cases.", "author": "Anonymous", "published": "2014-10-27 16:49:04.626000-04:00", "title": ""}, {"content": "I can understand your motivations not to discuss your work as an expert witness, though I have to say I find it a shame since I would be really interested to know in what kind of situations the justice needs your expertise! In particular, I wonder whether you intervene only for &quot;computer-science stuffs&quot; or in more general cases.", "author": "Anonymous", "published": "2014-10-27 16:51:32.805000-04:00", "title": ""}, {"content": "Michael,<br /><br />I am not sure why you don&#39;t draw exactly the opposite conclusion from this experience: Just tell the truth and you&#39;ll never be caught in an inconsistency. Your experience seems to confirm that this is exactly the right thing to do pragmatically, as well as ethically.<br /><br />With all due respect (and you are due a lot!), I don’t mean to make a mountain out of a molehill here, but there is something about the alternative path you sketch that makes me uncomfortable. Basically you are saying that as a tenured member of the place with Veritas as its motto, you’re going to self-censor to protect your market value in your night job. Now probably the educational value of what you might blog is relatively small by comparison with the possible cost to you of putting it out there, so no big deal. Bult still, as a matter of principle, I’m worried about the message it sends.<br /><br />Maybe it’s because I just came back from a freshman seminar talk by Fang Zheng, who had been one of the student protesters at the 1989 Tiananmen massacre. He lost both legs when he was crushed by a tank. He was a senior in college at the time, but never got his degree and for a long time couldn’t get a job, because he refused to say that he had been injured by a car rather than a tank. The woman he was saving when the tank hit him kept silent about what happened and is living a comfortable middle class life now. It was quite something to hear him talk about this from his wheelchair, explaining to the freshmen why it’s important to tell the truth even though it may be costly to do so.<br /><br />Now that’s a melodramatic comparison to be sure. But can you draw a line around what you will no longer say, in order to protect your income from your night job? Would you, for example, self-censor anything you might teach in a Harvard course? (Of course I am not talking about protected IP, confidential information, etc.)<br /><br />By the way, I wonder if you noticed this in an announcement for a recent seminar in our program: “Please note that this event will not be filmed in accordance with [another Harvard school] policy.” As far as I know, this is the first seminar in that series that has not been made publicly available. So it seems even within Harvard we are moving to protect the value of our speech assets by (as one wag put it to me) not allowing just anyone to drink from the grail we hold.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lewis:Harry.html\">Harry Lewis</a>", "published": "2014-10-27 21:03:50.413000-04:00", "title": ""}, {"content": "Harry:  thanks for the comment.  I certainly agree with the first part.  Telling the truth makes it easy to stay consistent!<br /><br />With the further comment, I definitely see your point, and it&#39;s an issue I&#39;ve thought about.  In my mind, as I stated, the main reason not to discuss legal issues in the blog is that I view it in a similar category as protected IP/confidential information.  My &quot;night job&quot; by nature deals with sensitive information, and so best not to say anything to avoid issues.  I view this as a professional obligation -- one not contradictory with my professional obligations to Harvard and as a scholar (more on this below).  <br /><br />Part of it also is what I would simply deem as the appropriate &quot;sphere&quot; of the blog.  I don&#39;t talk much about my home life here either, as that&#39;s private.  I may mention my children, but I avoid talking about specific things about them or things they&#39;ve done, as they&#39;re a separate sphere -- one that merits its own privacy (and, quite frankly, I expect most blog readers wouldn&#39;t be interested in).<br /><br />Regarding your main question:  &quot;But can you draw a line around what you will no longer say, in order to protect your income from your night job? Would you, for example, self-censor anything you might teach in a Harvard course?&quot;  I would say that I can&#39;t think of any instance where this sort of contradiction has come up with regard to my legal consulting.  If it did, it would probably cause me to re-think my work as a consultant.  <br /><br />Strangely, where I&#39;ve seen and heard this issue come up is with regard to consulting for the NSA or related agents.  Students and professors go to work for them (over summers or sabbaticals) with clear restrictions preventing them from saying what they&#39;ve worked on or learned.  (The long-standing question/joke for us outsiders is how much they know about how to factor large numbers that we don&#39;t know...)  While there are certainly other reasons I&#39;ve never ended up working any such agency, I&#39;m also very uncomfortable with such restrictions.  I&#39;ve never felt my legal consulting has prevented me from discussing anything specific in that way;  similarly, even though I&#39;ve consulted for companies like Microsoft (with various IP and non-disclosure restrictions) I also haven&#39;t felt that sort of discomfort (since my goal in working with such organization is to produce research).  Again, if I felt there was somehow a contradiction there, I&#39;d have to re-think such relationships.  <br /><br />So happily I&#39;ll say at this point I consider your challenging questions moot in my case, though certainly worth thinking about as a broader issue.  <br /><br />   <br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-10-27 22:53:54.624000-04:00", "title": ""}, {"content": "Thanks, that makes sense (especially about the conflicts involved in working for the NSA). The bigger question of whether people will curate their identities more in the digital era is the real worry. David Brooks comes close this morning to recommending college students sanitize their resumes of political identity. Now there&#39;s a recipe for colleges to produce Excellent Sheep.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lewis:Harry.html\">Harry Lewis</a>", "published": "2014-10-28 09:53:37.759000-04:00", "title": ""}, {"content": "I find myself sympathetic with Prof. Lewis&#39; point. Self censorship and &quot;being careful&quot; are pragmatic for each individual, but shouldn&#39;t we instead try to work for a world where people can be as honest as possible? Shouldn&#39;t we try to create social norms that shame people who try to use people&#39;s internet postings against them in irrelevant contexts?<br /><br />An example is young people being told to avoid having any pictures of themselves drinking alcohol and partying available on Facebook. <br /><br />My problem with this is that people are still drinking and partying, they are just successfully hiding this behavior from inquiring eyes. So why should it matter in the first place?", "author": "rweba", "published": "2014-10-28 13:40:03.578000-04:00", "title": ""}, {"content": "On a separate note, I am one of those readers who would appreciate hearing more about legal consulting (being an expert witness).<br /><br />Not with specific names or about specific cases, just general information.<br /><br />(1) What kind of cases require the testimony of a prominent computer science theorist? Is it along the lines &quot;My computer wouldn&#39;t start&quot; or a legal case about information theoretic lower bounds? (probably something in the middle)<br /><br />(2) How much money is involved (generally)?<br /><br />(3) How long does it take?<br /><br />(4) How do you go about getting such gigs?", "author": "rweba", "published": "2014-10-28 13:49:42.133000-04:00", "title": ""}, {"content": "Hi Rweba.  Perhaps you can contact me directly for more detailed answers to these questions.  But here are some short answers.  Most of the cases I have been involved with relate to patents, and the technical questions relate to understanding the patent, and the legal issues of infringement/non-infringement and validity/invalidity;  I have also been involved with a smaller number of cases that involve trade secret issues.  <br /><br />With regard to money, it depends on the case.  You can look online to get some information about various cases.  There was a lot written about the Apple-Samsung case, for instance.  I recall a number of articles about a case involving Newegg as well.<br /><br />The time commitment depends a lot on the case.  A case can involve writing reports (and the corresponding work to prepare for the report), getting deposed, and testifying at trial.  The report is usually done over a longer period of time;  depositions and testifying at trial can require non-trivial bursts of concentrated time.  <br /><br />As with all consulting, there are various ways you can get into this type of work;  you might look online for sites that collect academics&#39; resumes/profiles for such work as a start.  ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-10-28 15:53:04.193000-04:00", "title": ""}, {"content": "@Michael: I think you pretty much covered what I wanted to know, but I&#39;ll definitely contact you directly if I ever decide to get into this. Thanks!", "author": "rweba", "published": "2014-10-28 19:46:36.606000-04:00", "title": ""}]