[{"content": "<![CDATA[<p>Here&#8217;s a just cause close to the campus that is very much worth and in need of defense: </p>\n<p><a href=\"http://nymag.com/daily/intelligencer/2015/01/not-a-very-pc-thing-to-say.html\" rel=\"nofollow\">http://nymag.com/daily/intelligencer/2015/01/not-a-very-pc-thing-to-say.html</a></p>\n<p><a href=\"http://www.vox.com/2015/6/3/8706323/college-professor-afraid\" rel=\"nofollow\">http://www.vox.com/2015/6/3/8706323/college-professor-afraid</a></p>\n<p><a href=\"http://www.nytimes.com/2015/06/02/opinion/david-brooks-the-campus-crusaders.html?_r=1\" rel=\"nofollow\">http://www.nytimes.com/2015/06/02/opinion/david-brooks-the-campus-crusaders.html?_r=1</a></p>\n]]>", "author": "Michael P", "published": "2015-06-29 21:36:08+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>[&#8230;] 9. This is good. [&#8230;]</p>\n]]>", "author": "Monday Miscellany: Lipstick, Lifeguards, Lesbians | Gruntled & Hinged", "published": "2015-06-30 01:35:05+00:00", "title": "By: Monday Miscellany: Lipstick, Lifeguards, Lesbians | Gruntled & Hinged"}, {"content": "<![CDATA[<p>A citation from zero hedge site:</p>\n<p>&#8220;We have entered a new age where, as commentator Mark Steyn notes, “we have to tiptoe around on ever thinner eggshells” and “the forces of ‘tolerance’ are intolerant of anything less than full-blown celebratory approval.”&#8221;</p>\n]]>", "author": "guest", "published": "2015-06-30 09:39:32+00:00", "title": "By: guest"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> asks us to reflect (#65)&nbsp; &#8220;Whether today [we&#8217;re] unwilling to say anything that might really get [us] into trouble, or to spend social capital defending unpopular positions that [we] think are right.&#8221;</p></blockquote>\n<p>Two recent weblog posts have challenged the STEAM to concretely answer Scott&#8217;s question:</p>\n<p>• <b>Glencora Borradaile&#8217;s</b> personal testimony &#8220;Recovering from depression with a 40-hour work week&#8221; (of May 26, 2015)</p>\n<p>• <b>Sabine Hossenfelder&#8217;s</b> essay &#8220;The plight of the postdocs: academia and mental health&#8221;, hosted on the website <i>BackReaction</i> (of June 16, 2015).</p>\n<p>Sabine&#8217;s essay concerne the suicide of post-doc Francis Dolan.  She quotes one of Francis Dolan&#8217;s colleagues, by the name of Oliver Roston, as follows:<br />\n<blockquote>&#8220;I am firmly of the conviction that the psychological brutality of the post-doctoral system played a strong underlying role in Francis’ death. I would like to take this opportunity, should anyone be listening, to urge those within academia in roles of leadership to do far more to protect members of the community suffering from mental health problems, particularly during the most vulnerable stages of their careers.&#8221;</p></blockquote>\n<p><b>Question</b>&nbsp; How can <i>Shtetl Optimized</i> readers respond to Oliver Roston&#8217;s moral challenge in the spirit of Scott&#8217;s moral reflection?</p>\n<p><b>Answer #1 (toxic)</b> <i>Keep moving; nothing to see here</i>&nbsp; Ed Wilson&#8217;s <i>Consilience</i> defends academia as &#8220;a&nbsp;profession where elitism is practiced without shame.&#8221;  Wilson&#8217;s answer becomes toxic when we take the small-and-natural further step of defending an academia that is &#8220;a&nbsp;profession where shaming is practiced without shame.&#8221;</p>\n<p><b>Answer #2 (weak)</b> <i>Nothing can be done, so laugh, clown, laugh</i>&nbsp; Jorge Gabriel Cham&#8217;s long-running <i>PhD Comics</i> wonderfully illuminates and humanizes the struggle that drove Francis Dolan to suicide.  This is a good and necessary beginning.  </p>\n<p>Yet <i>PhD Comics</i> reads naturally not as comedy, but as tragedy: the characters of <i>PhD Comics</i> are so completely and helplessly subordinate to a dehumanizing STEAM enterprise, as to be incapable of envisioning a remediating transformation.  Hmmmm.</p>\n<p>Here&#8217;s an attempt at stronger answer, that derives from game-creator <b><a href=\"https://www.youtube.com/watch?v=7F0qhq7-K08&t=0h3m22s\" rel=\"nofollow\">Laura Shigahara&#8217;s song <i>Cube Land</i></a>,</b> as illustrated by artist Steven Davis&#8217; video studio <i>Slamacow Creations</i> (2012, 25M++ views!)</p>\n<p><b>Note</b>&nbsp; The following answer to Scott&#8217;s challenge derives from the closing credits of the Shigahara/Davis video <i>Cube Land</i>, with &#8220;Herobrine&#8221; (Google it) as an avatar of the desperation and despair that drives academics like Francis Dolan to suicide.</p>\n<p>The essay won&#8217;t make much sense unless you watch the Shigahara/Davis video (it may not make sense even if you <i>have</i> watched the video).</p>\n<p>&#8212;&#8212;&#8212;<br />\n<b><i>Removing Herobrine:</i> the STEAM enterprise transformed (by 2065)</b></p>\n<p>At the conclusion of the Shigahara/Davis video <i>Cube Land</i> (2012) postulated a world whose rules are beneficently rewritten:</p>\n<p>• Fixed weird spherical lights coming out of nowhere<br />\n• Fixed lighting bug on stairs and half slabs<br />\n• Reduced spider jump capabilities<br />\n• Fixed mobs coming back to life bug<br />\n• Pig Armor<br />\n• Removed Herobrine</p>\n<p>Similarly we can postulate a STEAM community transformed in 2065: </p>\n<p>• Fixed weird lack of family-supporting jobs<br />\n• Fixed over-valuation of physicality vs universality<br />\n• Reduced institutional endowment inequality<br />\n• Completed transition to open STEAM literature<br />\n• Balanced career off-ramps with career on-ramps<br />\n• Removed &#8220;Herobrine&#8221; (structural hopelessness/helplessness within the STEAM community)</p>\n<p><b>Conclusion</b>&nbsp; Thanks to radically creative works like the  Shigahara/Davis <i>Cube Land</i>, radically creative STEAM transformations aren&#8217;t all that hard to imagine&nbsp;&hellip; but just try taking concrete measures to realize them!</p>\n]]>", "author": "John Sidles", "published": "2015-06-30 10:48:58+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Jumping on a bandwagon and being a contrarian are equally conceited endeavours. Therefore, the quest to acquire moral fortitude can lead a person astray in their thinking just as easily as the quest for conformity can. I suggest we cut away this excess and simply challenge ourselves to think clearly about which moral causes to support. It’s very mundane, I know.</p>\n]]>", "author": "Dan J.", "published": "2015-06-30 12:24:35+00:00", "title": "By: Dan J."}, {"content": "<![CDATA[<p>Dan J. #72: It&#8217;s certainly true that people can make grievous moral errors out of a sheer desire to be contrarian (&#8220;hey, what if pushing old ladies into traffic is <i>good</i>?&#8221;).  And if you look through the archives of this blog, I think you&#8217;ll find many cases where I argued with people who struck me as doing exactly that.</p>\n<p>On the other hand, if we&#8217;re talking about moral wrongs that it takes thought and civilizational progress to recognize as wrongs at all, then I&#8217;d also say that far <i>more</i> people commit those out of a desire to follow the herd than out of a desire to defy it.  (Indeed, that&#8217;s <i>almost</i> true by definition&#8230;)</p>\n]]>", "author": "Scott", "published": "2015-06-30 13:27:12+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>While this is a valuable exercise, I think that our moral energy is best spent focusing on issues that we are already convinced of and think are important, and that enjoy some but not yet enough support.</p>\n<p>While we doubtless have many moral blind spots for which our descendants will condemn us, there are many more manageable moral problems that we should probably focus on first. This is somewhat analogous to deciding to work on intermediate problems, rather than worrying about P vs. NP. </p>\n<p>For example, fighting for gay marriage in the 1960s, while laudable, probably wouldn&#8217;t have been a good use of time compared with fighting for basic civil rights for blacks.</p>\n]]>", "author": "jonathan", "published": "2015-06-30 14:38:21+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>jonathan #74: Your analogy with P vs. NP is extremely useful, but I <i>think</i> I can pinpoint exactly where it breaks down here.  With P vs. NP, even if everyone on earth were to agree tomorrow that this is humanity&#8217;s most important problem, and that all of earth&#8217;s resources beyond bare survival ought to be devoted to it (and why <i>haven&#8217;t</i> we agreed about that yet? 😉 ), there would still be profound, hard, unpredictable technical breakthroughs that would stand between us and the solution.  So <i>even then</i>, it would indeed be wiser (as you say) for civilization to concentrate initially on easier &#8220;warmup&#8221; problems, like (say) NEXP versus TC<sup>0</sup>.</p>\n<p>By contrast, with moral issues like gay rights, once you&#8217;ve gotten everyone to agree with you, you&#8217;re <i>done</i>!  In other words, acquiring enough mindshare&#8212;which, for technical problems, is merely a preliminary step&#8212;is the entire substance of the problem here.  And, you might argue, &#8220;it&#8217;s never too early to start&#8221; acquiring mindshare for a new moral idea&#8212;since even if the idea sounds crazy to your contemporaries, you can <i>make</i> it seem less crazy to the next generation, and less crazy still to the generation after.</p>\n<p>More concretely, supporting gay rights in the 1960s, or civil rights for blacks in the 1920s, or the abolition of slavery in the 1700s, etc., all seem to me like they would&#8217;ve been (and were, for those who did them) <i>phenomenal</i> uses of time, establishing the intellectual foundations for the moral revolutions that happened later.  And that&#8217;s even more so for people who are temperamentally like me and many of the readers of this blog&#8212;i.e., better at debating far-fetched possibilities than at manning the barricades or protesting in the streets.</p>\n]]>", "author": "Scott", "published": "2015-06-30 18:08:12+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>That&#8217;s why I said &#8220;somewhat&#8221; analogous 😉</p>\n<p>But I think you allude to an important question: is moral progress cumulative, or does it advance in a piecemeal fashion? In other words, was (say) civil rights for blacks in the 1960s not only closer to public acceptance than gay marriage, but a precursor to it?</p>\n<p>I think there is a sense in which moral progress is cumulative. While we could imagine a society with almost any combination of moral views, in practice moral progress involves formulating new moral principles, and discarding old principles, that then prove useful in advancing future causes.</p>\n<p>Thus if there is a cause that requires wide acceptance of only a few new steps of moral reasoning, and another that requires many, the two sets may overlap, so that one can productively work on the nearer one, while simultaneously laying the groundwork for the farther one. And further, one can do this unintentionally, without knowing what the farther one is just yet!</p>\n]]>", "author": "jonathan", "published": "2015-06-30 19:05:03+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>As we learn more and more about the interplay between genetics and the environment, the ways in which I might be different from you will move from observable phenotype to discovered genotype. The number of possible ingroups with real social or cultural disadvantages relative to some outgroups will become vast. (Then there will be all the transhumanist stuff that people will do &#8211; implanting various types of hardware into their bodies&#8230;)</p>\n<p>It&#8217;s gotta be furries, though. 😉</p>\n]]>", "author": "Mr. Gunn", "published": "2015-06-30 20:38:26+00:00", "title": "By: Mr. Gunn"}, {"content": "<![CDATA[<p>This has already been said in this thread more than once, but has not been responded to, by Scott or the others. Perhaps a sign that it is truly low on everyone&#8217;s list!</p>\n<p>The problems faced by 95% of all humans today are laughable &#8212; truly &#8220;first world problems&#8221; &#8212; compared to the abject cruelty inflicted upon non-human animals.</p>\n<p>The Chick-Fil-A debacle from a few years ago brought this out with unbearable clarity. &#8220;The CEO of a company that tortures and kills billions of animals every year doesn&#8217;t want gays to marry! Oh the horror of not being able to get married!&#8221;</p>\n<p>The fact that so many &#8220;progressive, liberal&#8221; people said things like this stands as proof that humans are dramatically less rational than they fancy themselves, and is evidence that much of the &#8220;outrage at injustices&#8221; one sees is probably herd behavior with little thought put into it.</p>\n]]>", "author": "Jake", "published": "2015-07-01 08:50:21+00:00", "title": "By: Jake"}, {"content": "<![CDATA[<p>Jake #78: My original idea for this post was let readers discuss examples of possible future moral revolutions, and avoid commenting on specifics insofar as I could.</p>\n<p>But yes, even if you considered the suffering of a chicken to be &#8220;only&#8221; (say) one hundred-thousandth as bad as that of a human, the scale of factory farming is such that you would still need to regard this as an extremely major issue.</p>\n<p>I remember some years ago when PETA ran an ad campaign called &#8220;Holocaust On Your Plate,&#8221; and the Anti-Defamation League and other Jewish organizations expressed outrage at PETA&#8217;s language and imagery.  And I remember thinking to myself: no, the issue here isn&#8217;t language or imagery; if you&#8217;re offended by PETA&#8217;s campaign, then your &#8220;beef&#8221; (so to speak) is with the <i>actual content of what they profess to believe.</i>  If you agree with their starting premises, then all they&#8217;re doing is completing the modus ponens for you.</p>\n<p>I was a vegetarian as a teenager.  I&#8217;m not today, though it&#8217;s not something I&#8217;m extraordinarily proud about.</p>\n<p>I fervently support research to accelerate the development of in-vitro meat&#8212;and more generally, cheap, succulent, mouthwatering meat substitutes.  This is the only realistic path I can see to ending the era of factoring farming with all its evils.</p>\n]]>", "author": "Scott", "published": "2015-07-01 14:22:49+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #78</p>\n<p>Unsurprisingly, Scott Alexander recently blogged about this:</p>\n<p><a href=\"http://slatestarcodex.com/2015/03/04/a-series-of-unprincipled-exceptions/\" rel=\"nofollow\">http://slatestarcodex.com/2015/03/04/a-series-of-unprincipled-exceptions/</a></p>\n<p>> I acknowledged the argument was very convincing, but [&#8230;] I was basically going to safe-word out of that level of utilitarian reasoning, for the sake of my sanity.</p>\n<p>>  I think I might have a consistent policy of allowing some of my resources into each new circle of concern while also holding back the rest of it for the sake of my sanity. Thus my endorsement of GiveWell’s principle that you should donate at least 10% of your income to charity, but then feel okay about not donating more if you don’t want to. I am allowed to balance resources devoted to sanity versus morality and decide how much of what I have I want to send into each new circle of concern – without denying that the circle exists.</p>\n<p>[&#8230;]</p>\n<p>>  I am willing to accept [&#8230;] argument about animal welfare being more important than human welfare, insofar as this means I should donate some resources to animal welfare without necessarily having to give up caring about human welfare completely. I don’t think I can make a principled defense of doing this. But I think I can claim I’m being unprincipled in a meta-consistent and effectively sanity-protecting way.</p>\n]]>", "author": "Shmi Nux", "published": "2015-07-01 20:12:15+00:00", "title": "By: Shmi Nux"}, {"content": "<![CDATA[<p>Regarding reducing animal suffering through vegetarianism, it&#8217;s possible that PETA&#8217;s all-or-nothing rhetoric is bad strategy. It might be more beneficial &#8211; both for animal rights and for the environment &#8211; to bring people&#8217;s attention to the marginal good accomplished by eating less meat, rather than using &#8220;become a vegetarian or you&#8217;re like the Nazis&#8221; arguments.</p>\n<p>If 101 people can be persuaded to lower their meat consumption by just 5%, that would more good than persuading 5 people to cut meat consumption by 100%. (Vastly oversimplifying the numbers, obviously.)</p>\n<p>There&#8217;s an empirical question: is it easier to persuade 101 meat eaters to reduce their meat consumption by 5%, than it is to persuade 5 meat eaters to become total vegetarians? I suspect it is easier, but I might be wrong.</p>\n<p>(Side note: For those meat-eaters whose concern is the environmental impact, <a href=\"http://amptoons.com/blog/2010/04/22/if-you-cant-switch-to-vegitarian-switch-to-chicken/\" rel=\"nofollow\">switching some meals from beef and pork to poultry</a> is a relatively easy change to make.)</p>\n]]>", "author": "Barry Deutsch", "published": "2015-07-01 20:12:28+00:00", "title": "By: Barry Deutsch"}]