[{"content": "<![CDATA[<p>pierremenard #96: Excellent strategy, if I do say so myself! 🙂</p>\n]]>", "author": "Scott", "published": "2017-08-10 00:01:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I think the Eichmann question is mostly ignored in this post.  What if Eichmann had tried to develop a &#8216;bubble of truth&#8217;, all the while orchestrating the Holocaust?  There are limits to prudential imperatives, and a lot of what you describe sounds like the sort of excuse for banal evil that Eichmann was the perpetrator of.</p>\n<p>From the other end, the USA isn&#8217;t the USSR.  Those who believe something to that effect are the sorts of people that if they were religious would believe that persecution of Christians in the USA is comparable to the feeding of Christians to lions during the Roman Empire&#8217;s time.  A tenured professor in the USA is unlikely to lose their job for political reasons (ignoring extreme cases, they might receive tepid condemnation from their administration (e.g. <a href=\"https://www.theguardian.com/world/2017/aug/03/what-is-a-black-professor-in-america-allowed-to-say-tommy-j-curry\" rel=\"nofollow\">https://www.theguardian.com/world/2017/aug/03/what-is-a-black-professor-in-america-allowed-to-say-tommy-j-curry</a> or <a href=\"https://thevarsity.ca/2016/10/24/u-of-t-letter-asks-jordan-peterson-to-respect-pronouns-stop-making-statements/\" rel=\"nofollow\">https://thevarsity.ca/2016/10/24/u-of-t-letter-asks-jordan-peterson-to-respect-pronouns-stop-making-statements/</a> )).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bell:William.html\">William Bell</a>", "published": "2017-08-10 00:13:29+00:00", "title": "By: William Bell"}, {"content": "<![CDATA[<p>William #99: Eichmann seems like a terrible comparison (and, separately, a terrible person 🙂 ).  Firstly, because there&#8217;s an enormous spectrum of official untruths that one can choose not to contest, which are less consequential than &#8220;we are not systematically exterminating millions of people.&#8221;  And secondly, because Eichmann was not exactly a passive observer.  Indeed, I don&#8217;t even buy the theory that Eichmann was &#8220;banal,&#8221; in the sense of just thinking of himself as doing a job.  It&#8217;s true that he wasn&#8217;t reflective or thoughtful, but later historians have argued that, in order to fit Eichmann into her preconceived philosophical thesis, Hannah Arendt had to ignore a lot of evidence that he was actually an enthusiastic antisemite.  (Of course, after he was captured and put on trial, it was in his interest to present himself differently.)</p>\n]]>", "author": "Scott", "published": "2017-08-10 00:53:31+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>It&#8217;s pretty clear what you&#8217;re trying to say between the lines here. And I imagine you&#8217;ll delete this post (although I hope you won&#8217;t). I think it&#8217;s dishonest to write so obviously on a topic but allow no responses to what you&#8217;re actually saying. As a younger researcher in the field, I find it disappointing to see such lack of accountability coming from a prominent senior professor.</p>\n]]>", "author": "Liz", "published": "2017-08-10 00:56:11+00:00", "title": "By: Liz"}, {"content": "<![CDATA[<p>#95 Thats an interesting point. Similar to Harari&#8217;s points in Sapiens about social realities &#8211; some things exist only because everyone believes they do yet they are very real &#8211; eg money or cultural norms/beliefs and their consequences.</p>\n<p>Once many people believe a shared reality as this, the marginal cost/benefit for 1 person to also believe it works out in favor of belief (because then everyone can reason that &#8220;if everyone believes it it mist be true right?&#8221;)</p>\n<p>Cultural beliefs are rigid to change in some ways. One thats interesting is its much easier to flip a belief 180 than make a smaller nuanced change. Then we are stuck for a while in the X or not X dichotomy before society adjusts to a belief somewhere between &#8211; if a belief corresponds to a vector in a vector space with basis b , the belief can be flipped but its MUCH harder to change the basis of the vector space. </p>\n<p>All this to say, todays truths are yesterdays beliefs or simple modifications thereof.. </p>\n<p>Maybe the limits of communication , time constraints and attention spans 😉 etc. mean that it will always be that way. That things will be seen as X or not X, with us or against us instead of Y.</p>\n]]>", "author": "Liam Woolsworth", "published": "2017-08-10 01:02:03+00:00", "title": "By: Liam Woolsworth"}, {"content": "<![CDATA[<p>Liz #101: So am I to understand that (1) it&#8217;s intellectually dishonest to try to abstract away from the hot-button controversies of the present, and get a broader view by focusing on meta-questions and instructive examples from the past, but also (2) if you <i>do</i> directly discuss hot-button controversies of the present, then regardless of how politely you express yourself, or even how much you agree with the usual views, if you accidentally deviate from orthodoxy on some particular then you might need to be outed, shamed, and fired from your job?</p>\n<p>In any case, as I said earlier, one bonus of my commenting policy is that I already feel like we&#8217;ve gotten much more interesting comments than we would&#8217;ve had without it.  E.g., I&#8217;ve learned various interesting new tidbits about Kolmogorov, and other things relevant to the &#8220;psychology of unspeakable truths,&#8221; a subject that&#8217;s interested me for as long as I remember.</p>\n]]>", "author": "Scott", "published": "2017-08-10 01:39:53+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>If you prefer having a conversation about Kolmogorov, then write just about Kolmogorov. If you don&#8217;t feel comfortable talking publicly about a controversial topic, then don&#8217;t write about it. I see plenty of junior people taking the risks of speaking out—and suffering the consequences. It is your right to decide you don&#8217;t want to talk about any given topic but it is telling people they cannot respond to something you are obviously insinuating given the timing etc. (not the abstractions in your original post) that I find dishonest. </p>\n<p>As far as meta discussion about ideologies go (a topic I appear to be allowed to comment on), I’ve been interested in a slightly different angle, namely smart historical figures who got wrapped up in ideologies that today we would say are misguided. An obvious example is Heidegger (I’m thinking philosophers here), but also a lot of other 20th century thinkers became very enamored with communism before some of its various flaws became apparent. It’s interesting how wrong very otherwise rational, thoughtful people can go when it comes to ideology—and leaves you wondering if there’s something they could have seen at the time to tell them they would be on the wrong side of history. To be clear, I’m actually trying to make no insinuation here because I think this can go both ways; things can become too extreme on any part of the spectrum. I think there’s a lot to learn from how thinkers in the 20th century (a time of huge ideological turmoil) interacted with the ideas of the time, and how their views evolved depending on the historical context.</p>\n]]>", "author": "Liz", "published": "2017-08-10 02:58:07+00:00", "title": "By: Liz"}, {"content": "<![CDATA[<p>Liz #104: Thanks for your comment.  If you want to argue against whatever you think I might have insinuated without saying it, then of course you&#8217;re welcome to do that anywhere else on the Internet (I think a couple others already have).  But surely you agree that, on my blog, I can set the rules for comments in whatever way I think will lead to a productive discussion &#8230; just like a private company can fire its employees for whatever reason it wishes? 😉</p>\n<p>It&#8217;s worth noting that, when my friend &#8220;the other Scott A&#8221; blogs about extremely controversial topics, he now often simply <i>turns all comments off</i>, out of fear of inviting endless flamewars.  I viewed limiting the comments the way I did as a much milder solution.</p>\n]]>", "author": "Scott", "published": "2017-08-10 03:14:47+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Yes you&#8217;re free to set the rules on your blog, and I&#8217;m free to disagree with them; just as you&#8217;re free to disagree with the rules for firing at a private company (which I may also either agree or disagree with you about). </p>\n<p>Anyway continuing along these lines further may not be fruitful, but thanks for making my posts visible.</p>\n]]>", "author": "Liz", "published": "2017-08-10 03:50:53+00:00", "title": "By: Liz"}, {"content": "<![CDATA[<p>Joscha #91: Thanks for your comment.  I do agree about the importance of distinguishing between the Stalinist phase of the USSR and the &#8220;kinder, gentler&#8221; phase that came later&#8212;i.e., the one where a wrong opinion would merely get you fired and blacklisted, not shot.</p>\n<p>In fact, a couple years ago I was talking to an older Russian physicist now working in the US.  He told me stories about the enforcement of academic orthodoxy in his current university&#8212;I&#8217;d share his stories here, except that I can&#8217;t without violating my own &#8220;no hot-button issues&#8221; policy.  He remarked on how vividly it all reminded him of what he had witnessed in the USSR.  However, he also explicitly clarified that he was talking &#8220;only&#8221; about the Brezhnev phase, not the Stalin phase that his parents had lived through.</p>\n]]>", "author": "Scott", "published": "2017-08-10 03:58:39+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Incidentally, <a href=\"https://www.amazon.com/Under-Spell-Landau-Theoretical-Destinies/dp/9814436569\" rel=\"nofollow\">here&#8217;s</a> the most comprehensive account of Landau, his school and his students that I know of. That, along with <a href=\"http://academic.evergreen.edu/z/zita/articles/history/landau.pdf\" rel=\"nofollow\">this</a> article and <a href=\"https://arxiv.org/abs/hep-ph/0204295\" rel=\"nofollow\">this</a> brief memoir by his student Boris Ioffe (which is also included in the first link), give a pretty good account of Soviet theoretical physics and anti-semitism (from the scientists&#8217; point of view) in Stalin&#8217;s Russia.</p>\n]]>", "author": "Sumukh Atreya", "published": "2017-08-10 04:20:24+00:00", "title": "By: Sumukh Atreya"}, {"content": "<![CDATA[<p>I&#8217;m for it, but I wonder if Scott is living in a bubble of sorts. I believe the ideological orthodoxy he encounters is weaker than he thinks. Indeed, Paul Graham&#8217;s essay on the same topic &#8220;what we can&#8217;t talk about&#8221; discusses the Galileo case specifically. It is precisely the institutions/ideologies that are halfway between power and obscurity that fear dissent and mockery. The truly powerful ones have no need of persecuting heresy, while the weak ones are unable to. G was persecuted because the Church was waning in power, while Copernicus before him wasn&#8217;t, b/c the Church was more secure then. Likewise, modern day ideological orthodoxy (of ANY stripe, not just the ones Scott is bothered by) is weak, its pieties barely known, much less believed, out here in real America (outside college-educated circles, let&#8217;s say). I suspect it also holds true for real England, France etc.</p>\n]]>", "author": "Tin man", "published": "2017-08-10 05:00:49+00:00", "title": "By: Tin man"}, {"content": "<![CDATA[<p>I&#8217;m a bit unconvinced that Galileo being held up as heroic figure makes sense.  Based on what I&#8217;ve read &#8212; and I&#8217;ll admit most of what I know comes just from reading <a href=\"https://thonyc.wordpress.com/\" rel=\"nofollow\">The Renaissance Mathematicus</a> &#8212; he seems more like a glory-hound who <a href=\"https://thonyc.wordpress.com/2013/05/13/gopnik-galileo-and-ed-yong-galileo-not-admitting-being-wrong/\" rel=\"nofollow\">couldn&#8217;t stand to be proven wrong</a> (e.g.: his completely wrong theory of the tides), rather than a heroic seeker of truth.  And my understanding is that at the time the hypotheses weren&#8217;t grouped as geocentrism vs. heliocentrism, but rather that each system was considered separate, so that Kepler&#8217;s heliocentric hypothesis was considered <i>opposed</i> to Galileo&#8217;s heliocentric hypothesis rather than as a refinement!  Galileo in fact <i>rejected</i> Kepler&#8217;s elliptical hypothesis (although it&#8217;s the latter that got heliocentrism widely accepted).</p>\n<p>That said&#8230; who the hell is saying that the Church was <i>right</i> to persecute Galileo??  Geez&#8230;</p>\n<p>(One thing I have to disagree with The Renaissance Mathematicus on: He occasionally says that, well, the Church&#8217;s suppression of Galileo isn&#8217;t so big a deal because, you see, the Church didn&#8217;t say Galileo couldn&#8217;t teach that it was a good <i>model</i>, he just couldn&#8217;t talk about it in terms of it being a true description of reality.  To which I say&#8230; no, I still think that&#8217;s pretty fricking bad!)</p>\n]]>", "author": "Sniffnoy", "published": "2017-08-10 05:07:57+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>To solve the collective action problem, we would need a religion where saying the truth and being martyred for it is the holiest way to live and die.</p>\n<p>Maybe that guy (won&#8217;t offend sensibilities by saying the name) was onto something.</p>\n]]>", "author": "Renato Andrielli", "published": "2017-08-10 05:18:26+00:00", "title": "By: Renato Andrielli"}, {"content": "<![CDATA[<p>I worry that I lack the self control to exercise this option. I speak my mind reflexively, and when I can&#8217;t do so I&#8217;m extremely uncomfortable. Prudence is hard, sometimes especially when I&#8217;m concerned about the consequences I might face.</p>\n<p>I keep secrets from literally everyone in my life about my heretical opinions on various things. I&#8217;m a good enough liar to cover my slips. But I feel like it&#8217;s driving me to despair. Recklessness seems like a superior option to this emptiness. &#8220;Don&#8217;t fight fights you can&#8217;t win&#8221; is hard advice to follow when you&#8217;re not strong enough to win any fights at all.</p>\n]]>", "author": "secret", "published": "2017-08-10 05:36:33+00:00", "title": "By: secret"}, {"content": "<![CDATA[<p>This reminds me of a story about Kolmogorov told to me by CS professor. It may be apocryphal, and there are different versions of it floating around.</p>\n<p>The story goes that at one point Kolmogorov was confronted by agents of the Soviet government and challenged on his work on “independent events”. They charged that this concept contradicted Marxist philosophy, which says that all events are interconnected.</p>\n<p>Kolmogorov replied: “Consider the following events: The pope prays for rain. It rains. These events are independent.”</p>\n<p>The Soviet agents left him alone.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Crawford:Jason.html\">Jason Crawford</a>", "published": "2017-08-10 06:28:49+00:00", "title": "By: Jason Crawford"}, {"content": "<![CDATA[<p>Kolmogorov is one of my heroes. There are mornings where I prepare for a lecture on CFD, and my spouse prepares a lecture in probability, and the same name appears. This amazes me. Thank you for a marvellous post about him and his struggles.</p>\n<p>I also very much like your law and its amendments. Most days when I get fired up about a truth I believe, ready to hoist myself on mine own petard &#8211; I try to take a little walk, and ask myself if the truth meets criteria very close to what you describe. </p>\n<p>Many self-evident (to me) truths are not giant truths in the ways of Kolmogorov. This means I have to think hard about considering myself a beleaguered martyr for stating them. </p>\n<p>This may be how my mind works- but not every statement I come up with is valuable, deep, important enough to risk hurting people, or morally critical. Even worse, sometimes the (to me) self-evident truths are about matters on which the evidence is hard to acquire, changeable, perhaps mutable.</p>\n<p>When I started my career in mathematics, the prevailing truths were that (a) no one does good mathematics past 25, and certainly not past 40; (b) what is called applied mathematics is not even mathematics; and (c) women are absent in the very extreme ends of the distribution of mathematical ability for reasons of biology, and therefore there would almost surely never be a truly, truly great female mathematician in my lifetime. </p>\n<p>Some of these are recognizable as sentiments dating back to Hardy, and some is recognizable as the then-available evidence-backed claims of the &#8217;90s. </p>\n<p>Perhaps these are immutable truths. Nonetheless, I am not sure they are *valuable* truths. They do seem to violate your amendment.</p>\n<p>So I very much like your law and its amendments.</p>\n]]>", "author": "Nilima", "published": "2017-08-10 07:39:41+00:00", "title": "By: Nilima"}, {"content": "<![CDATA[<p>Great post! A bit unusual to see so many comments saying that this is a great post. But they are right! No comparisons of recent minor hot-button topics to Nazi Germany. Those would only feel pathetic to people like the parents of Otto Warmbier, who know that they will never learn what happened to their son in North Korea. And a very clear and upfront comment policy that <em>current</em> hot-button topics will be deleted. As a result, the comment thread is of impressive high quality too. </p>\n<p>The discussed topic is timely and relevant for the world we live in today. What can (or should) you do as an individual that &#8220;knows&#8221; its actions will not change the global succession of events? Statements like Adorno&#8217;s &#8220;There is no right life in the wrong one&#8221; from <em>Minima Moralia</em> just don&#8217;t feel like sufficient answers to me. There are no right answers, but that is a bad excuse for not discussing such questions. Looking at what historical individuals did and how it worked out is a good idea, and way better than staying silent!</p>\n]]>", "author": "gentzen", "published": "2017-08-10 09:22:43+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>I recently read a bibliography of Werner Heisenberg by Ernst Peter Fischer. The reason why I read it was that I had read Heisenberg&#8217;s autobiography &#8220;Physics and Beyond&#8221; before, and then read Walter Moore&#8217;s biography of Schrödinger. Moore described certain &#8220;private and political mistakes&#8221; of Schrödinger, and I wondered whether Heisenberg had committed similar mistakes too, and just remained silent about them in his autobiography. I learned that Heisenberg did remain silent about certain events, but that he was not the actor but the victim of those events.</p>\n<p>One such unpleasant event was Wilhelm Wien ensuring that <a href=\"https://www.aps.org/publications/apsnews/199801/heisenberg.cfm\" rel=\"nofollow\">Heisenberg got the worst possible passing grade</a> for his doctorate. It got worse during Nazi time, when Heisenberg got accused for being a jew in spirit, for teaching Einstein&#8217;s theory of relativity. He was lucky that his mother knew influential people for getting out of that one, which could easily have cost him his live. The story of von Weizsäcker&#8217;s parents preventing his engagement with their daughter (because he was not of sufficiently noble origins) is also telling of the German society at that time. And Heisenberg&#8217;s role in the German effort at building an atomic bomb are still discussed today, even so the historical documents rather suggest that he always was quite honest in those respects, and Carl Friedrich von Weizsäcker&#8217;s role might have been the more questionable one. But Carl Friedrich was still young back then, and it is unbelievably easy to make mistakes when you are young (and the circumstances are bad).</p>\n<p>One event that is both described by Heisenberg himself and in his external biography is how he became a political actor in post-war Germany, and how he ensured success of the <a href=\"https://en.wikipedia.org/wiki/Göttingen_Eighteen\" rel=\"nofollow\">Göttinger eighteen</a> in opposing Chancellor Konrad Adenauer and Defense Secretary Franz-Josef Strauß&#8217;s move to arm the West German army, the Bundeswehr, with tactical nuclear weapons.</p>\n]]>", "author": "gentzen", "published": "2017-08-10 10:13:24+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>Good article professor!</p>\n]]>", "author": "Ishaan", "published": "2017-08-10 10:47:45+00:00", "title": "By: Ishaan"}, {"content": "<![CDATA[<p>Nilima #114: Thanks for your comment.  As it happens, I don&#8217;t believe a single one of your statements (a), (b), or (c)&#8212;that is, I don&#8217;t consider them &#8220;true but not useful,&#8221; just false.  Sufficient counterexamples:</p>\n<p>(a) Wiles completing the proof of FLT at 41<br />\n(b) Archimedes, Newton, Gauss, Euler all doing lots of &#8220;applied math&#8221;<br />\n(c) Maryam Mirzakhani</p>\n<p>There might be other statements in the same galaxy that I could defend, but at any rate, I wouldn&#8217;t discuss it here. 😉</p>\n]]>", "author": "Scott", "published": "2017-08-10 11:09:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>> truths were the ones that undermined the entire communist project: for example, that humans are not blank slates;</p>\n<p>I often see this point stated like this, as a given, and I never understood it.  What&#8217;s the rationale behind such an assertion? How is genetic diversity supposed to &#8220;undermine&#8221; the communist idea? If anything, it&#8217;s meritocratic capitalism that presupposes blank-slatism.</p>\n<p>To recap, the capitalist principle is that people should have access to resources in proportion to their abilities, as a reward for their application as market-desirable labor.  Capitalism believe this extrinsic reward system (the &#8220;profit motive&#8221;) is such a crucial incentive, that society would implode without it.  (There&#8217;s one complication in the form of inheritance laws, which surely undermine whatever principle of fairness that meritocratic rewards may have; but let&#8217;s leave that aside as something skirting too close to a contemporary unspeakable truth).  The communist project, by contrast, is that people should have access to resources based on their <i>needs</i>, not on their ability.</p>\n<p>If you believe that people are more genetically diverse than normally thought, surely the meritocratic system should be the one being undermined? The more someone&#8217;s abilities, disposition, personality etc. is determined by their genes, the more it&#8217;s beyond their control; the more it&#8217;s beyond their control, the less sense it makes to punish them for it.  Capitalism says, this guy doesn&#8217;t deserve housing and healthcare because he&#8217;s lazy and dumb; but that presupposes he could have been smart and hard-working as easily as your neighborhood surgeon or lawyer.  What if he&#8217;s <i>born</i> lazy and dumb, and nothing he can do will ever change it? Punishing him for it would be the same as allocating resources based on height or skin color.</p>\n<p>Please notice I&#8217;m not saying that intelligence and personality traits are determined genetically.  I&#8217;m saying that, the more they are, the <i>less</i> sense meritocratic capitalism makes, not the more.</p>\n<p>One simple litmus test is mental disability.  Imagine a severely impaired man with a congenital disease that renders all his cognitive abilities well below adult level.  Imagine this unfortunate man was born in a bustling capitalistic country where, despite abundance of resources and wealth, income inequality is high, real estate markets are severely overinflated, education and health have insane price barriers on them, healthy food costs a lot and crappy food is enough to create an obesity epidemic, there are very few employment opportunities for the uneducated, and so on.  In such a dystopic, horrifying country, our mentally impaired man would be, though no fault of his own, literally unable to secure sufficient income to cover his basic human needs (food, housing, medicine, clothing, a modicum of culture and dignity…).  Do you think he should be provided with access to those resources, even if he can&#8217;t offer anything that the market values right now? Do you think, on the other hand, that it&#8217;s only fair that he should contribute to society in his own way, for example doing community service etc., even if right now no one in the market is interested in paying for, say, planting trees? Then you think he should be provided according to his needs, and provide according to his ability.  The previous sentence is the literal definition of communism.</p>\n]]>", "author": "leoboiko", "published": "2017-08-10 11:18:59+00:00", "title": "By: leoboiko"}, {"content": "<![CDATA[<p>@Scott#54- Miller admitted in interviews that the Crucible was about McCarthyism- and was criticized as being self-serving because he himself had praised Stalin a few years earlier.</p>\n]]>", "author": "Michael", "published": "2017-08-10 12:21:22+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>No. Although there is much of value in what you say, you are completely unjustified in comparing fear of being fired by a cowardly and reprehensibly unsympathetic employer and of receiving anonymous threats from nasty jerks on social media to fear of being shipped off to a Gulag or getting a bullet to the head. You live in America. That ain&#8217;t gonna happen. That means you have more of a duty, especially as a tenured professor, a position of intellectual authority, to call it as you see it. We agree that one may be morally justified in not fighting battles one can&#8217;t win; but the &#8220;battle&#8221; that needs to be fought from your point of view is simply that the truth should prevail, and especially that the Knowledge that the Emperor is naked should become Common. You will not lose tenure or your blog for speaking the truth in a professional manner, with clear arguments and evidence and avoidance of invective. Although you won&#8217;t get fired, the private company you don&#8217;t work for that fires dissenters may bias their search results against you, but that&#8217;s not martyrdom.</p>\n]]>", "author": "Joe Shipman", "published": "2017-08-10 13:28:38+00:00", "title": "By: Joe Shipman"}, {"content": "<![CDATA[<p>Shouldn&#8217;t we place the Manhattan Project in the same vein? Noble scientists working in a bubble but clearly knowledgeable about the political and deadly consequences of their work?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Goldberg:Robert.html\">Robert Goldberg</a>", "published": "2017-08-10 14:30:35+00:00", "title": "By: Robert Goldberg"}, {"content": "<![CDATA[<p>I just discovered Bertrand Russell&#8217;s 1920  analysis of Soviet Russia. It&#8217;s very insightful. Russel points out that old revolutionists have very clear moral dimension in their ideology and they insisted from everyone.  </p>\n<p><a href=\"http://www.unz.org/Pub/Nation-1920jul31-00121?View=PDF\" rel=\"nofollow\">http://www.unz.org/Pub/Nation-1920jul31-00121?View=PDF</a></p>\n<p>quoting;</p>\n<p>&#8220;&#8230; In a very novel society, it is natural to seek for historical parallels. The baser side of the present Russian Government is most nearly paralleled by the Directory in France, but on its better side it is closely analogous to the rule of Cromwell. The sincere Communists (and all the older members of the party have proved their sincerity by years of persecution) are not unlike the Puritan soldiers in their stem politico-moral purpose. Cromwell&#8217;s dealings with Parliament are not unlike Lenin&#8217;s with the Constituent Assembly. Both, starting from a combination of democracy and religious faith, were driven to sacrifice democracy to religion enforced by military dictatorship. Both tried to compel their countries to live at a higher level of morality and effort than the population found tolerable. Life in modem Russia, as in Puritan England, is in many ways contrary to instinct. And if the Bolsheviki ultimately fall, it will be for the reason for which the Puritans fell—because there comes a point at which men feel that amusement and ease are worth more than all other goods put together. &#8230;&#8221;</p>\n]]>", "author": "Nick Nolan", "published": "2017-08-10 15:09:25+00:00", "title": "By: Nick Nolan"}, {"content": "<![CDATA[<p>A very nice and well thought out write-up, even though I probably disagree with you on current issues that shall not be named here :-). It makes me wonder though:</p>\n<p>&#8211; What if the &#8220;thought police&#8221; are not the authorities, but just an extremely vocal minority instead? Shouldn&#8217;t we just grow thicker skins, and re-learn to &#8220;agree to disagree&#8221;? After all, they have Twitter and not Gulags.</p>\n<p>&#8211; What if some of the &#8220;dogmas&#8221; are actually true? As scientific minded people we shouldn&#8217;t care either way. A troubling corollary of the fact that you can&#8217;t question the flat earth is that you can never prove that it is flat (or round).</p>\n<p>&#8211; That makes me think that the &#8220;inquisitors&#8221; actually hurt the &#8220;church&#8221; in the long run. (And I suspect some extreme inquisitors are just strawmen or bogeymen invented by heretics, but I disgress.)</p>\n<p>&#8211; I found it extremely valuable to have an, err, safe space (cough) to discuss dogmas / hot topic issues with friends. I could ask, &#8220;Gee, I know Lamarck was WRONG, but it really looks like the Giraffe&#8217;s neck grows when he tries to reach those leaves high up the tree.&#8221; Sometimes, these discussions convinced me of Orthodoxy, sometimes they strengthened my heresy. But they are valuable in any case.</p>\n]]>", "author": "Jason", "published": "2017-08-10 15:22:34+00:00", "title": "By: Jason"}, {"content": "<![CDATA[<p>Abe #61<br />\n<a href=\"http://theoatmeal.com/comics/believe\" rel=\"nofollow\">http://theoatmeal.com/comics/believe</a></p>\n]]>", "author": "Uncle Brad", "published": "2017-08-10 15:51:55+00:00", "title": "By: Uncle Brad"}, {"content": "<![CDATA[<p>When tenured professors will not speak about corruption in academia, which is at the root of hot button issues, why should I as a taxpayer vote to fund academia? Why should I as a citizen support academic freedom?</p>\n<p>Modern academia is coming for the throats of my kids.</p>\n]]>", "author": "Ash", "published": "2017-08-10 18:11:20+00:00", "title": "By: Ash"}, {"content": "<![CDATA[<p>Could someone please direct towards some info concerning these &#8220;unspeakable&#8221; recent events that seems to be hidden between the lines and behind the sentiment of this post? (perhaps a link or other hint that don&#8217;t risk bringing the discussion towards &#8220;current hot-button topics&#8221; suffices 😉</p>\n]]>", "author": "European reader passively ignorant of US and perhaps even world news..", "published": "2017-08-10 18:30:33+00:00", "title": "By: European reader passively ignorant of US and perhaps even world news.."}, {"content": "<![CDATA[<p>Scott #64: You write, &#8220;I think it’s clear&#8230; that Trump has taken the US down the first steps of the long path that historically leads to totalitarianism.&#8221;</p>\n<p>No, not the first steps &#8212; perhaps the ninth and tenth. Have you already forgotten about the Bush Administration? And how Obama, elected to reverse the harm Bush did the country, instead embraced and extended all of Bush&#8217;s usurpations? The Patriot Act, destruction of habeas corpus, destruction of the Fourth Amendment, universal surveillance of Americans, invading and conquering nations that never attacked us, etc.? We&#8217;ve been living in a creeping military/police state since at least 2001.</p>\n]]>", "author": "Kevin S Van Horn", "published": "2017-08-10 19:09:16+00:00", "title": "By: Kevin S Van Horn"}, {"content": "<![CDATA[<p>Are “warm-button” issues, in the bubble, fair game? Beliefs in say P!=NP, or in the inevitability of quantum supremacy seem to be current orthodoxy but I’m curious if you hold any heresies in your professional field Scott?</p>\n]]>", "author": "Ronald Monson", "published": "2017-08-10 19:56:17+00:00", "title": "By: Ronald Monson"}, {"content": "<![CDATA[<p>laretluval #73 said:</p>\n<p>> What do you make [of] the argument that all effective organizations will have unspeakable truths and mandatory-to-believe nonsense, because this provides the organizations with an efficient and highly accurate way to assess loyalty?</p>\n<p>> Obviously this community design pattern can become pathological, but a mild amount seems unavoidable.</p>\n<p>I disagree that this is an accurate way to assess loyalty &#8212; except the kind of &#8220;blind loyalty to every action, even mistakes&#8221; which any &#8220;good&#8221; organization should want to strongly discourage. I think that kind of &#8220;blind&#8221; or &#8220;shallow&#8221; loyalty is not only different than, but is often negatively correlated to, the kind a &#8220;good&#8221; organization should want &#8212; loyalty to its overall goals and &#8220;spirit&#8221;, and to its continuing long-term ability to survive and remain effective and &#8220;good&#8221;.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Smith:Bruce.html\">Bruce Smith</a>", "published": "2017-08-10 20:06:56+00:00", "title": "By: Bruce Smith"}, {"content": "<![CDATA[<p>Ronald #129: Within my field, probably my most heretical belief is that the view explored in my <a href=\"http://www.scottaaronson.com/papers/giqtm3.pdf\" rel=\"nofollow\">Ghost in the Quantum Turing Machine</a> essay isn&#8217;t self-evidently insane.</p>\n<p>Within math, my only heretical beliefs that I can think of&#8212;if they count&#8212;are in the Platonic definiteness of statements about integers and Turing machines, and in the potential for massive computer searches to someday tell us something relevant to circuit lower bounds.  Surely Graph Isomorphism in P doesn&#8217;t count.</p>\n<p>In a gathering of rationalist nerds, my most heretical belief is probably in the <i>non</i>-imminence of an AI Singularity, with agreement across an enormous swath of other topics.  These things are very context-dependent.</p>\n]]>", "author": "Scott", "published": "2017-08-10 20:19:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>laretluval #73 and Bruce #130: I think it&#8217;s reasonable for any organization to ask its employees to believe in and support the purpose of the organization (the clear and obvious purpose, not some postmodern redefinition of the purpose).</p>\n<p>Thus, if you work at a university, you should support the creation and dissemination of knowledge, and the upholding of scholarly standards.</p>\n<p>If you work at a potato chip factory, you should support the creation and sale of potato chips, consistent with product safety and protecting the environment and human rights and other general values.</p>\n<p>Beyond that, I think the most effective and admirable organizations are ones that give their employees enormous leeway to brainstorm about how best to fulfill the mission.</p>\n]]>", "author": "Scott", "published": "2017-08-10 20:33:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, you might be interested in a little but illuminating book by the philosopher Albert O. Hirschman titled &#8220;Exit, Voice and Loyalty: Responses to Decline in Firms, Organizations, and States&#8221;. It explores different conditions under which exiting, voicing your objections or staying loyal can occur and provides plenty of food for thought for individuals struggling to adapt within the culture of an organization. Hirschman applies the theory to several cases, including emigration, political situations and employment relations.</p>\n]]>", "author": "Curious Wavefunction", "published": "2017-08-10 20:34:32+00:00", "title": "By: Curious Wavefunction"}, {"content": "<![CDATA[<p>Scott #60</p>\n<p>In addition to what was raised by #75, #79, #85, #93, I think you are giving too little consideration to the resistance to the idea of a moving Earth. Any celestial motions model that assumed it would get penalized by Occham&#8217;s razor, given the knowledge of the time. No one had proof nor strong evidence for the movement of so large a mass as the whole planet, and the very idea sounded very strange. Accepting the movements of the celestial bodies was less problematic, as they&#8230; we could observe them moving, and they were assumed to be made of different matter than the earthly things.</p>\n]]>", "author": "moscanarius", "published": "2017-08-10 20:48:01+00:00", "title": "By: moscanarius"}, {"content": "<![CDATA[<p>irt. sam #78:</p>\n<p>Nicely put.</p>\n<p>My own problem with the Kolmogorov option is that I don&#8217;t think it&#8217;s rational &#8211;now&#8211;. We don&#8217;t live in a time like Kolmogorov&#8217;s. </p>\n<p>(Aside: and all the noise about Trump, Trump is a weak wannabe autocrat. A weak wannabe with an itchy trigger finger for the nukes, but also one that&#8217;s bound by the possibilities of impeachment, and of article 25, and some other things, all within the law. He&#8217;s also bound by being increasingly isolated within his own party. Forgive me for not knowing details, I&#8217;m not from the US.)</p>\n<p>The real unchallengeable orthodoxies of today are turning out to be rather challengeable lately. Oh, they were absolute terror a couple years ago; they were terror when they set their eyes on Scott. And it&#8217;s not clear that their grip is loosening for good and we&#8217;re just witnessing some desperate death throws in certain recent events.</p>\n<p>But, they do seem to be weakening. Wrong think got defined so loosely, and its punishment so extreme, that people are starting to notice the disparity. And then they&#8217;ll notice that other crowd, over there, saying &#8220;we told you so about (((those people))) all along! come to our side, we have milk and sanity&#8221;.</p>\n<p>Some people, God bless them, are too autistic to know you&#8217;re not supposed to say some things some times, and when their mouth works overtime it&#8217;s that other crowd that will leap to defend them&#8211; and it&#8217;s the rest of us who may notice that the clumsy person actually may have a point, and wonder if the other crowd has a point too, by association.</p>\n<p>Basically, I&#8217;m saying if you don&#8217;t dissent to the orthodoxy, then ask yourself if you&#8217;re happy about those who do. You may find you won&#8217;t like them either, but unless you speak up there&#8217;s no other challenger available&#8211; and arguably the times are a-changing and a challenger is sought.</p>\n<p>Cheers.</p>\n]]>", "author": "BLANDCorporatio", "published": "2017-08-10 21:02:29+00:00", "title": "By: BLANDCorporatio"}, {"content": "<![CDATA[<p>BLANDCorporatio #135: Your comment is fine, except that I can&#8217;t think of any possible useful point that one would need non-ironic <a href=\"https://en.m.wikipedia.org/wiki/Triple_parentheses\" rel=\"nofollow\">triple parentheses</a> to make.  Thanks! &#8211;(((Scott)))</p>\n]]>", "author": "Scott", "published": "2017-08-10 21:10:27+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>irt. Scott #136:</p>\n<p>Oh you know why those are there 😉 I&#8217;m referencing a certain group in a comically overstated fashion as if I&#8217;m holding an arrow with blinking lights on and a claxon. I did everything except actually name who is so fond of using those triple-(.</p>\n<p>Cheers.</p>\n]]>", "author": "BLANDCorporatio", "published": "2017-08-10 21:18:48+00:00", "title": "By: BLANDCorporatio"}, {"content": "<![CDATA[<p>Von Neumann told Feynman that<br />\n&#8220;you don&#8217;t have to be responsible for the world that you&#8217;re in&#8221;.</p>\n]]>", "author": "fred", "published": "2017-08-10 21:38:04+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Liz #104, it isn&#8217;t quite on point, but you might find <a href=\"http://slatestarcodex.com/2013/04/11/read-history-of-philosophy-backwards/\" rel=\"nofollow\">Read History of Philosophy Backwards</a> of interest.  (That&#8217;s by the other Scott A.)</p>\n]]>", "author": "Harry Johnston", "published": "2017-08-10 21:48:36+00:00", "title": "By: Harry Johnston"}, {"content": "<![CDATA[<p>Ref. #118</p>\n<p>Scott- my apologies for not being clearer. I, too, do not believe statements a, b or c any more. I did think this stuff, at some point. </p>\n<p>The statements were made with some authority, and I have to believe the people echoing them had good intentions. I&#8217;ve often wondered whether these statements served any utility, even back then. Certainly one young nerdy girl had a somewhat lonely time.</p>\n<p>This predates the achievements of Wiles and Mirzakani by many years. I&#8217;m glad for both, and I&#8217;m glad to have met and worked with many, many similar counterexamples. </p>\n<p>As I have aged, I have a variant of your law and amendment. Your formulation is more eloquent.</p>\n]]>", "author": "Nilima", "published": "2017-08-10 22:12:33+00:00", "title": "By: Nilima"}, {"content": "<![CDATA[<p>A little known fact: in the late 15th century, an eccentric clock maker from Seville (Lluís Masip) challenged the local Church authorities with the idea that the earth wasn&#8217;t the center of anything but that we were actually living on the inside of a giant metallic hollow ball, itself rotating around a bright core surrounded by a complex system of gears, lenses, and mirrors. He was thrown in jail but stuck to his theory till the very end. </p>\n<p>I guess that if you&#8217;re gonna fight to the death for your ideas, you better first make sure that you&#8217;re right?</p>\n]]>", "author": "fred", "published": "2017-08-10 22:17:33+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Excellent post, and fascinating reading with no shortage of interesting bits on the periphery – as is frequently the case.</p>\n<p>And I think your central “thesis” is a generally tenable one which one might suggest is somewhat analogous to the joke that Woody Allen closed out his movie <i>Annie Hall</i> with:</p>\n<blockquote><p>It reminds me of that old joke- you know, a guy walks into a psychiatrist&#8217;s office and says, hey doc, my brother&#8217;s crazy! He thinks he&#8217;s a chicken. Then the doc says, why don&#8217;t you turn him in? Then the guy says, I would but I need the eggs. I guess that&#8217;s how I feel about relationships. They&#8217;re totally crazy, irrational, and absurd, but we keep going through it because we need the eggs.</p></blockquote>\n<p>And as society is relationships writ large one might suggest also that there is, in most if not all societies, any number of “crazy” or highly questionable dogmata – J.K. Galbraith’s “conventional wisdom” – that one more or less puts up with because “we need the eggs”. It’s only when the “eggs” get rotten for a preponderance of the individuals in a society, or even in a subset of it, that there becomes enough motivation, enough “boots on the ground”, to produce a tipping point, a revolution of one sort or another.</p>\n]]>", "author": "Steersman", "published": "2017-08-11 00:29:48+00:00", "title": "By: Steersman"}, {"content": "<![CDATA[<p>Descriptive scientific truth will always be subservient to prescriptive ideological truth. This is why scientists are always ready to capitulate while the political are always ready to be martyred. The so called &#8220;secular&#8221; society is an ignoble lie.</p>\n<p>Interesting that discussion of hot button issues will be ruthlessly deleted unless(apparently) you are(&#8220;not&#8221;) making played out political jabs about Trump and Nazis.</p>\n]]>", "author": "anon", "published": "2017-08-11 02:02:33+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>Vaclav Havel, also living under communism, also had a view on truth. One can argue it&#8217;s similar to Kolomogorov&#8217;s, but I think the emphasis is a little different.  Note that this essay empowered the leaders of the Solidarity Movement in Poland, which was a trigger for the eventual demise of the Soviet Union.</p>\n<p>(warning, long)</p>\n<p><a href=\"http://www.vaclavhavel.cz/showtrans.php?cat=eseje&#038;val=2_aj_eseje.html&#038;typ=HTML\" rel=\"nofollow\">http://www.vaclavhavel.cz/showtrans.php?cat=eseje&#038;val=2_aj_eseje.html&#038;typ=HTML</a></p>\n]]>", "author": "A B", "published": "2017-08-11 03:51:15+00:00", "title": "By: A B"}, {"content": "<![CDATA[<p>Scott #64 &#8220;Trump has taken the US down the first steps of the long path that historically leads to totalitarianism&#8221;, nah, he is one of the later steps.  Or if I can say nice things about the Nazis for a minute: they went around goose-stepping and Hitler-saluting and trying to take over the world and stuff like that, nasty business for sure, but there is no pretense or nonsense about who they are or what they want.  </p>\n<p>A considerable amount of the US progressive left sees Trump as an enemy who can be confronted out in the open, while the Obama presidency and Clinton nomination was more of a Dolchstoss (stab in the back) by people who were nominally on the &#8220;good&#8221; side.</p>\n<p>There is a book &#8220;The Great Leveler&#8221; (by Walter Scheidel) that I haven&#8217;t yet read, which argues that the cause of the craziness is ever-increasing income inequality, and this cycle has repeated itself many times through history, usually reaching the point of violent revolution evening things out again (thus the book title).  I don&#8217;t know if the US is that far gone yet, but it&#8217;s a depressing picture.</p>\n<p>Blurb: <a href=\"http://press.princeton.edu/titles/10921.html\" rel=\"nofollow\">http://press.princeton.edu/titles/10921.html</a></p>\n]]>", "author": "asdf", "published": "2017-08-11 05:50:21+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>You&#8217;re a coward. </p>\n<p>If you were risking the Gulag or the torture rack, I wouldn&#8217;t say that, but you&#8217;re not, so you&#8217;re a coward.</p>\n]]>", "author": "Dave Pinsen", "published": "2017-08-11 06:48:13+00:00", "title": "By: Dave Pinsen"}, {"content": "<![CDATA[<p>&#8221; In the abstract Susskind claims that his ideas imply that we’ll observe quantum gravity using quantum computers in a lab&#8221;</p>\n<p><a href=\"http://www.math.columbia.edu/~woit/wordpress/\" rel=\"nofollow\">http://www.math.columbia.edu/~woit/wordpress/</a></p>\n<p><a href=\"https://arxiv.org/pdf/1708.03040.pdf\" rel=\"nofollow\">https://arxiv.org/pdf/1708.03040.pdf</a></p>\n]]>", "author": "Richard Gaylord", "published": "2017-08-11 09:18:22+00:00", "title": "By: Richard Gaylord"}, {"content": "<![CDATA[<p>Dave #146: It&#8217;s all relative.  If I&#8217;m <i>less</i> of a coward than 99% of the people around me, then unless the stakes are life-and-death, I feel like I&#8217;ve done my job.</p>\n]]>", "author": "Scott", "published": "2017-08-11 10:31:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>😛<br />\nI don&#8217;t mean to nitpick (it&#8217;s besides the point of free open debate vs dogma), but technically Geocentrism and Heliocentrism were both wrong &#8211; the earth and the sun rotate around each other at their center of gravity.<br />\nRotational relativity isn&#8217;t particularly obvious either, even to this day (e.g. Mach principle &#8211; what does rotation mean in a universe that&#8217;s empty of matter, etc).<br />\nAnd the expansion of the universe in some way suggests that any point in the universe can be considered its &#8220;center&#8221; (therefore there&#8217;s no center?).</p>\n]]>", "author": "fred", "published": "2017-08-11 13:06:06+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott. #65, Unfortunately, I could not find any information about circumstances of Kolmogorov endorsement. But it seems that  the authorities have chosen a broad spectrum of intellectuals (mathematicians, actor, novelist, musician&#8230;) to sign. This not smells like a willing endorsement.</p>\n]]>", "author": "L.", "published": "2017-08-11 13:33:16+00:00", "title": "By: L."}, {"content": "<![CDATA[<p>Richard #147, that sounds like quite the hot button idealogical dispute to me! I can see why Scott would take the Kolmogorov option on that one 😉</p>\n]]>", "author": "Adam Treat", "published": "2017-08-11 13:47:25+00:00", "title": "By: Adam Treat"}, {"content": "<![CDATA[<p>&#8220;Meanwhile, you wait for a moment when, because of social tectonic shifts beyond your control, the ruling ideology has become fragile enough that truth-tellers acting in concert really can bring it down&#8221;.</p>\n<p>Reminds me of this quote by Friedman about the role of economists:</p>\n<p>&#8220;Only a crisis &#8211; actual or perceived &#8211; produces real change. When that crisis occurs, the actions that are taken depend on the ideas that are lying around. That, I believe, is our basic function: to develop alternatives to existing policies, to keep them alive and available until the politically impossible becomes the politically inevitable.&#8221;</p>\n]]>", "author": "JSD", "published": "2017-08-11 13:56:22+00:00", "title": "By: JSD"}, {"content": "<![CDATA[<p>Stalinism didn&#8217;t go away on its own. Khrushchev chose to move towards a less horrible totalitarian government. Presumably he observed, thought, kept silent, and waited. I&#8217;m actually quite impressed, even though that&#8217;s hardly a morally ideal approach.</p>\n<p>There&#8217;s a different lesson I&#8217;m seeing in Kolmogorov&#8217;s life than most people seem to. Instead of opposing the worst thing in his environment, he made as much good as he could and that turned out to be quite a bit of good. Granting that he had extraordinary talents, it seems to me that not enough people ask about how much good they can do locally.</p>\n]]>", "author": "Nancy Lebovitz", "published": "2017-08-11 15:52:06+00:00", "title": "By: Nancy Lebovitz"}, {"content": "<![CDATA[<p>The Kolmogorov Option &#8230; by Robert Ludlum</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Robert_Ludlum_bibliography#Works\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Robert_Ludlum_bibliography#Works</a></p>\n]]>", "author": "Nate Thomas", "published": "2017-08-11 16:36:50+00:00", "title": "By: Nate Thomas"}, {"content": "<![CDATA[<p>Another relatively unknown hero of WW2:</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Witold_Pilecki\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Witold_Pilecki</a></p>\n<p>During World War II, he volunteered for a Polish resistance operation that involved being imprisoned in the Auschwitz death camp in order to gather intelligence and later escape.</p>\n<p>He was later tried and executed.</p>\n]]>", "author": "fred", "published": "2017-08-11 17:40:21+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Both the soviets and the church were big fans of scrutinizing speaker&#8217;s motivations much more than the contents of<br />\nof their speech creating a legacy of whole litanies of lip service designed to avoid being labeled as heretics (DeCartes and Spinoza famously come to mind).<br />\nIn general there is no lack of intellectual luminaries who chose not to martyr themselves while also not succumbing to the moral and intellectual debasement of their societies and Its almost as if Kolmogorov was picked here to draw attention that it was among other his work that made probability so fundamental part of sound reasoning so as to make it justifiable to attribute straw-manning and general bad faith in discourse to people attacking existential-probabilistic arguments (and those presenting) them as if they were universal-deterministic ones.</p>\n]]>", "author": "AdHominidaem", "published": "2017-08-11 18:24:21+00:00", "title": "By: AdHominidaem"}, {"content": "<![CDATA[<p>If people are looking for other blogs to talk about current hot button issues of the day, Sabine Hossenfelder has one.</p>\n]]>", "author": "Adam Treat", "published": "2017-08-11 17:53:25+00:00", "title": "By: Adam Treat"}, {"content": "<![CDATA[<p>We can always count on Scott to stick to safe, noncontroversial topics!</p>\n]]>", "author": "Raoul Ohio", "published": "2017-08-11 18:02:46+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Scott #131. Well that &#8220;Ghost in the Quantum Turing Machine&#8221; was an epic read (typo pg 29 &#8211; constructed) but not sure about it being a &#8220;bubble heresy&#8221;. I&#8217;d say positing something as &#8220;not self-evidently insane&#8221; kind of comes with the territory when attempting to build such an ambitious and speculative cosmology/philosophy on free-will. The heresy seems more about a one-off foray as AFAIK this was not the start of an ongoing program allied to the field (I don&#8217;t know,  maybe after this first, post-tenure paper, the University president hauled you into his office &#8211;  &#8220;Aaronson, we give you tenure to help build a quantum computer and you turn around and publish something about gerbils giving AI souls, big-bang, pixie dust as human souls and why we shouldn&#8217;t kill millions of cloned thetans or ems  or something.  What the hell is going on!&#8221;)</p>\n<p>The intuition about the  &#8220;potential for massive computer searches to someday tell us something relevant to circuit lower bounds&#8221; seems closer as it potentially  entails  greater risk (long-term opportunity cost, professional credibility etc) while being based on assumptions not commonly held. But where does its optimism come from?</p>\n]]>", "author": "Ronald Monson", "published": "2017-08-11 18:53:33+00:00", "title": "By: Ronald Monson"}, {"content": "<![CDATA[<p>Scott sez:<br />\n&#8220;as, for that matter, are my feelings about those who contributed to American nuclear weapons development, although the original Manhattan project scientists had the pretty good excuse that they incorrectly thought they were racing Hitler to build the bomb.&#8221;</p>\n<p>Where did you get the &#8220;incorrectly&#8221; from? Is that because the German atomic bomb team has some bad ideas, so there was no chance of them winning the race?</p>\n]]>", "author": "Raoul Ohio", "published": "2017-08-11 20:04:43+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Trivia from Heisenberg&#8217;s Wikipedia page:</p>\n<p>&#8220;From 24 January to 4 February 1944, Heisenberg travelled to occupied Copenhagen, after the German army confiscated Bohr&#8217;s Institute of Theoretical Physics. He made a short return trip in April. In December, Heisenberg lectured in neutral Switzerland.[23] The United States Office of Strategic Services sent former major league baseball catcher and OSS agent Moe Berg to attend the lecture carrying a pistol, with orders to shoot Heisenberg if his lecture indicated that Germany was close to completing an atomic bomb. Heisenberg did not give such an indication, so Berg decided not to shoot him, a decision Berg later described as his own &#8220;uncertainty principle&#8221;.[74]&#8221;</p>\n]]>", "author": "Raoul Ohio", "published": "2017-08-11 20:10:08+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Scott #60: I don&#8217;t think Mark  H.&#8217;s argument is quite in a class with slavery apologists. Some points raised by your rebuttal:<br />\nJust how many astronomers do you think there were in 1600? If there were any, were they up to date on Galileo&#8217;s theories? Not sure the Astrophysical Journal was running quite yet.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-08-11 20:20:47+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>1. I don&#8217;t think the WordPress bug ever went away. My email continues revert to that of a rabbi who died in WW2.</p>\n<p>2. Although Trump getting elected is quite a fluke, the fact that 25% or so actually supported him is the real story. I see some reasons for this that I might yammer about later. It is totally fortunately that a president elected by his core supporters is an egotistical buffoon who is incapable of getting anything done, as  opposed to a shrewd manipulator who would have done who knows what by now. Please don&#8217;t impeach him, Pence is likely to be much worse. </p>\n<p>3. murmmer: As a a pretty sharp person who happens to be a Trump supporter, are you concerned about Trump&#8217;s steady descent into madness? It reminds me of a horrendous play by a neurotic NYC playwright.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-08-11 20:34:36+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>@Raoul#160- when the war ended, the Germans were about as far away from building an atomic bomb as the Americans were at the end of 1942- it never was a real race.</p>\n]]>", "author": "Michael", "published": "2017-08-11 23:01:46+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>@Harry #139</p>\n<p>In my opinion philosophy is the long story of people learning to live without a God and what that means &#8230;</p>\n<p>I think the old way of learning/teaching philosophy is fine with me, as long as one keeps this overall theme in mind.</p>\n]]>", "author": "wolfgang", "published": "2017-08-11 23:16:45+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>I&#8217;m sorry, but I simply cannot agree.  I can&#8217;t agree at all.  I can understand deciding to keep quiet out of fear &#8211; who can&#8217;t? &#8211; but to claim it as a kind of virtue&#8230; The amount of times that society has advanced only because certain bloody-minded people would not be swayed from saying what was real.  And not even when they knew that most people agreed with them &#8211; when they were in the minority.</p>\n<p>  The Kolmogorov compromise &#8211; well, try it the other way. </p>\n<p>&#8220;Hey Hitler!  I know you&#8217;ve got the secret police and the death camps, so just let me know what the line of the week is.  Meanwhile, yeah, Communism is a total horror show, so I&#8217;m happy to help you build weapons against it.&#8221;</p>\n<p>  I know Aaronson does not care for Ayn Rand, but there&#8217;s a piece of hers he should read, &#8220;To Young Scientists&#8221;.  In it he asks what we would think of a professional soldier who said &#8220;Politics isn&#8217;t my business&#8221; and just killed for whatever war he could find, for whatever boss would employ him.  But that soldier could not do the one-thousandth of the damage of the scientist who put a formula into the wrong hands.</p>\n]]>", "author": "Prussian", "published": "2017-08-11 23:59:22+00:00", "title": "By: Prussian"}, {"content": "<![CDATA[<p>Prussian #166: Ok, but nowhere in this post did I ever advocate abdicating moral values&#8212;which seems to be a misinterpretation (or rounding to the nearest error?) that several others also made.  Instead I explored the thorny question of when <i>living</i> one&#8217;s moral values&#8212;especially if they include duty to truth but also duty to other people&#8212;might leave no option except strategically keeping one&#8217;s mouth shut.</p>\n]]>", "author": "Scott", "published": "2017-08-12 00:39:13+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Ronald #159: Ok, I guess it&#8217;s not optimism, so much as just that I don&#8217;t think we have sufficient reason we <i>couldn&#8217;t</i> learn anything new by, for example, working out the determinantal complexity of the 4&#215;4 and 5&#215;5 permanents by whatever combination of cleverness and sheer brute force would work.</p>\n]]>", "author": "Scott", "published": "2017-08-12 02:01:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>It&#8217;s somewhat Straussian, isn&#8217;t it?  &#8220;Persecution and the art of writing&#8221; and all that&#8230;  </p>\n<p>Re-reading your post, I think that I can see exactly where I was rounding.  It&#8217;s the post about, &#8220;Well, Hitler is terrible, therefore it&#8217;s fine to support Stalin&#8221;.  That kind of thing has a nasty way of mutating from &#8216;momentary expedience&#8217; to &#8216;business as usual&#8217;.  Cut to the threat of nuclear armageddon over the human species.</p>\n<p>There&#8217;s also the bit about the &#8216;social tectonics&#8217; shifting.  I think this obscures the underlying reality that society is just a bunch of people, and when you get a big shift it&#8217;s because many individuals have decided to Zerg-rush the beast.  Vide Dixiecrat America, Apartheid South Africa etc. </p>\n<p>Consider those two points my rounding comments.</p>\n]]>", "author": "Prussian", "published": "2017-08-12 02:04:44+00:00", "title": "By: Prussian"}, {"content": "<![CDATA[<p>I totally disagree with you Scott; I don&#8217;t think that the way that Kolmogorov was threatened by the KGB and the Soviet system is at all relevant to your life as a tenured university professor in the US.</p>\n<p>The &#8220;Kolmogorov Option&#8221; makes sense in a state that has degenerated into full fascism (as Landau believed that the soviet regime had: <a href=\"http://people.bu.edu/gorelik/Landau_PhysicsToday_1995.htm\" rel=\"nofollow\">http://people.bu.edu/gorelik/Landau_PhysicsToday_1995.htm</a>) and where you&#8217;re in danger of being sent the gulags (e.g. picking a fight you will *lose*). </p>\n<p>It doesn&#8217;t apply to Scott Aaronson in the US with his safe job and large audience. In an open society, you don&#8217;t &#8220;lose&#8221; the fights that you pick. It&#8217;s a victory as long as it leads to debate, and leads to some people (even <1% of your readers) to actually think about what you&#039;re really saying. </p>\n<p>More importantly, if people stop debating, arguing and talking to each other, we all lose. Don&#039;t shirk your duty as a public intellectual! To paraphrase Orwell, cowardice always has to be paid for.</p>\n]]>", "author": "Amir Safavi", "published": "2017-08-12 02:06:10+00:00", "title": "By: Amir Safavi"}, {"content": "<![CDATA[<p>Comparing K to G is an insult to K. Galileo was arrogant, rash, and a showoff. He had to ignore formal warnings and then try to make fools of his friends in the Church before he was squelched. That he had not been ordered<br />\nto write in Latin amazes me. It takes a complete lack of sense to get into trouble when the Pope is a close friend of long standing.</p>\n]]>", "author": "Henry Barth", "published": "2017-08-12 07:57:48+00:00", "title": "By: Henry Barth"}, {"content": "<![CDATA[<p>&#8216;the Kolmogorov option.  This is where you build up fortresses of truth in places the ideological authorities don’t particularly understand or care about,&#8217;<br />\nThis wouldn&#8217;t work for either Stalin&#8217;s or Mao&#8217;s Utopia because doing stuff the authorities don&#8217;t care about, more especially if it requires brain power, would be &#8216;bourgeois idealism&#8217;.<br />\nPeople like Kolmogorov & Hua Luogeng showed the State that Mathematicians were willing to roll up their sleeves and do applied work so as to overfulfill the 5 year plan or whatever.</p>\n<p>The truth is Lysenko&#8217;s idiocy was useful to both Stalin and Mao. It gave them an excuse to starve the peasantry thus bolstering the &#8216;dictatorship of the proletariat&#8217;.</p>\n<p>It is interesting that Indian mathematicians fell behind their Chinese counterparts- e.g. Kausambi fell behind Chern (KCC theory) despite having a head start, because<br />\n1) Gandhian India was uninterested in Technology<br />\n2) Kausambi refused to serve Nehru&#8217;s pet project- viz. Atomic energy- because of moral, or possibly Marxist, scruples.<br />\nThe Bureaucrats allocated money to sycophants or nerds who knew their place. Anyone who felt the atmosphere in India to be too stultifying was welcome to emigrate to the West.</p>\n<p>In the West we are fortunate to have autonomous universities competing with each other, more especially in &#8216;games against nature&#8217;. Does this circumstance permit the deduction of a categorical imperative for Scientists of the sort given in this post?<br />\nCertainly, under a specific type of Dialetheia which features &#8216;scientific truth&#8217; discoverable in one way and &#8216;deontic truth&#8217; discoverable in another way. However, this is inelegant and not robust.<br />\nIf we forbid Dialethia we either have some sort of evidentiary decision theory- which is equally fraught with problems; we might end up &#8216;managing the news&#8217; or else get caught up in backward causation type paradoxes.<br />\nAlternatively we could embrace Gibbard type &#8216;semantic normativism&#8217; but this too has problems.<br />\nFinally, we could think of &#8216;Truth&#8217; as the solution of a coordination game. However, if Knightian uncertainty obtains, we ought to be hedging through &#8216;discoordination games&#8217; so similar problems arise.</p>\n<p>Kolmogorov himself gives us a demarcation criteria for &#8216;alethic&#8217; research programs separating them from &#8216;Preference falsification&#8217; based &#8216;availability cascades&#8217;. Clearly, only a &#8216;bandwagon&#8217; would instrumentalise complexity classes far beyond our computational capability for prescriptive purposes.<br />\nSadly, this approach doesn&#8217;t take us very far either because it fails for co-evolved process</p>\n]]>", "author": "polyglot", "published": "2017-08-12 08:55:11+00:00", "title": "By: polyglot"}, {"content": "<![CDATA[<p>Post-truth communist USSR and now post-truth capitalist West, the irony of it all. They had the secret police, and we have everyone spying on everyone else, they had Lysenkoism and we have [REDACTED]. Whatever the old USSR could do the West boasted it could do bigger & better, and so it has proved. </p>\n<p>Actually, the West or rather the USA has been here before, the &#8216;know nothing&#8217;s&#8217; were a highly visible, anti-intellectual party round about Lincolns time. It looks like they&#8217;re knocking on history&#8217;s door again.</p>\n<p>Here&#8217;s hoping after they&#8217;ve found the door marked &#8216;Grand Entrance&#8217; they find the door marked exit without too much trouble in between.</p>\n]]>", "author": "Mozibur Ullah", "published": "2017-08-12 09:45:35+00:00", "title": "By: Mozibur Ullah"}, {"content": "<![CDATA[<p>Having ground my axe, let me add that Kolmogorov is a great mathematician, I learnt most of what I know about Measure theory from one of his books. He deserves an eulogy.</p>\n]]>", "author": "Mozibur Ullah", "published": "2017-08-12 09:54:50+00:00", "title": "By: Mozibur Ullah"}, {"content": "<![CDATA[<p>Kolmogorov didn&#8217;t belong to a community armed to the teeth, therefore he submitted.</p>\n]]>", "author": "Silva", "published": "2017-08-12 15:44:08+00:00", "title": "By: Silva"}, {"content": "<![CDATA[<p>Amir #170: You say: &#8220;It’s a victory as long as it leads to debate, and leads to some people (even <1% of your readers) to actually think about what you&#039;re really saying.\"</p>\n<p>Depending on whether you believe results like this one<br />\n<a href=\"http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0181640\" rel=\"nofollow\">http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0181640</a> this may or may not be true. In any case, I wouldn&#039;t know what the solution is though.</p>\n]]>", "author": "Sorites", "published": "2017-08-12 18:44:58+00:00", "title": "By: Sorites"}, {"content": "<![CDATA[<p>As often experienced on the Shtetl, this is a very interesting post with a very nice personal flavor that led to nice comments. (Also the information post seems great but I did not digest it yet.) Generally speaking, mathematicians have very small ingredient of moral dilemmas in their work and very rarely the coward-courageous scale is of any relevance to them. (As an aside, if it&#8217;s ok to express a little skepticism of a common view, in my opinion, regarding courage as necessary a virtue, should be carefully reexamined.) I don&#8217;t see also why the out-of-science heroism of great scientists is of particular interest. Those scientists who were living in cruel regimes had to face similar dilemmas to many others, and we can only be thankful that we do not live in such terrible environment.</p>\n<p>Following Boaz and Nilima let me also reflect a little on my own experience. I do like debates and discussions (perhaps like Scott), and those are quire rare in mathematics and occur mainly in places where mathematics meets fields of science and real life. Within my professional work I had  a few opportunities for debates, or for taking part in &#8220;clashes between truths&#8221; if you wish. I did took part (which was of a technical nature) in a couple and served as an interested observer in a few others.</p>\n<p>Some of my colleagues got involved and tried to influence in various political and social debates, and often I was very impressed by them (even when I did not agree). The way scientists should be involved in politics is on its own a very interesting and controversial issue.</p>\n<p>As for me, there was a single matter related to academia that I was actively involved with for many decades (but not very intensively, I am afraid). It is abut the question: &#8220;What can be done in order to increase the number of women mathematicians?&#8221; I am especially proud of a <a href=\"https://gilkalai.wordpress.com/2008/05/16/jerusalem-combinatorics-93/\" rel=\"nofollow\">conference I organized</a> (with Alon, Barcelo, Bjorner, and E. Wigderson) in Jerusalem when I was a young faculty member and I am thinking about complementing it with a second one, three decades later.</p>\n<p>In my view, advancing the status of women in mathematics, and more broadly in academics and society as a whole is a crucial and pivotal challenge.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2017-08-12 19:01:19+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Wonder if you had considered calling this post The Kolmogorov Simplicity.</p>\n]]>", "author": "Shmi", "published": "2017-08-12 20:20:13+00:00", "title": "By: Shmi"}, {"content": "<![CDATA[<p>Inspired by the thoughts of Nilima 114 and 140, but not claiming that this is how she would continue them herself: </p>\n<p>When we talk about &#8220;unspoken truths&#8221;, what defines them as &#8220;truths&#8221;?<br />\n* Do they have to be hard science truths (controlled single-parameter experiments, validating a clearly-articulated theory)<br />\n* Do they have to be mathematical truths (precise and narrow statements about clearly defined structures, supported by logical arguments)<br />\n* Do they become truths because the majority (most of the USSR during communist rule) believes them?<br />\n&#8212;- If so, can they be &#8220;truths&#8221; about the minority, and their subjective experiences?<br />\nFor example, suppose most of the USSR believed, but did not dare say, that the Mars aliens living among them did not like cheese. They did not dare say this, even though they saw the liking or not of cheese as affecting their ability to do their science. They were scared because Stalin and his guys were, for some reason, though not aliens themselves, convinced that the aliens loved cheese. Somehow, the loving of cheese helped the fight against Hitler. </p>\n<p>Should those taking the Kolmogorov option in this situation, of keeping their mouths shut about whether aliens loved cheese, really receive any congratulations? Aren&#8217;t they just idiots who were just distracted by their own convictions about aliens and cheese? (Independent of whether aliens liked cheese or not; that&#8217;s unknowable, though a &#8220;commonly-held truth&#8221;). </p>\n<p>* Is it possible that what appears to be a &#8220;truth&#8221; today is not really truth because the observations are functions of the current environment, and Stalin&#8217;s focus on changing the environment might change the measurements and invalidate the &#8220;truth&#8221;? </p>\n<p>Could the majority who believed in this unsaid truth simply be wrong? Should their awareness of this weakness inform what the morally correct thing to do is? </p>\n<p>We know today that &#8220;truths&#8221; from thirty years ago&#8212;such as those stated by Nilima&#8212; have been proven false. Does this require more humility of us than was required of scientists fifty years ago?</p>\n]]>", "author": "Poorvi", "published": "2017-08-12 23:16:26+00:00", "title": "By: Poorvi"}, {"content": "<![CDATA[<p>Seconding John Garrett, Craig, Denis, Sam,, Joscha, Eric & (with a request for more diplomacy) Joe.  </p>\n<p>This is not an ethically ambiguous situation.  Communication isn&#8217;t blocked, minimal force is being used.  If we allow an authoritarian take-over right now it will be because we resisted with less courage than any of the people who have ever effectively resisted authoritarian takeovers.</p>\n]]>", "author": "Michael Vassar", "published": "2017-08-13 00:59:59+00:00", "title": "By: Michael Vassar"}, {"content": "<![CDATA[<p>Quaker beliefs can be quite simple. One of the chief admonitions is to SPEAK TRUTH TO POWER. This is not so different from the idea that one person speaking is more powerful than a thousand people remaining silent. Or that the only thing Evil requires to win is that the Good remain silent.  And all revolve around the story told about when (the Nazis) came for this neighbor and that neighbor I said nothing to help them. And when (the Nazis) came for me . . . no one spoke in my defense.</p>\n<p>So here we are, in these times, each of us being asked by the nature of events how we will speak. How will we? And to whom?</p>\n<p>Had there been no Abolitionists, no Suffragettes (Dictionary.com tell us : &#8220;Few English speakers likely know this word&#8221;), no march on Selma, no French Resistance, no Viet Nam marches, no Black Lives Matter, no blogs like this . . . </p>\n<p>A critical moment in my understanding of the world was the realization (when I was FAR into adulthood) that there were people alive on this planet, people of power, who would willingly enslave me. Or you. Or anyone. Some critical thinkers would argue that those people are in ascendancy. I doubt prayer will save us. Or the gun.</p>\n]]>", "author": "Samson vanOverwater", "published": "2017-08-13 06:39:33+00:00", "title": "By: Samson vanOverwater"}, {"content": "<![CDATA[<p>In this so called  Age of Information, the greatest threat to truth speaking scientists is not the state or the secret police. The enemy is within- an intolerant scientific orthodoxy that spews venom on any dissent to accepted scientific wisdom.</p>\n<p>Scientific orthodoxy is not an oxymoron, its existence is real. The nexus between entrenched scientific fiefdoms and the powers that be is an unholy alliance that feels threatened by conscientious objectors.<br />\nCancer research is focussed on finding cures without bothering to consider causative factors like chemicals in the environment. It appears that preventing cancer by knowing its causes is of little interest to many researchers.<br />\nAnyway, one must appreciate the compulsions of Soviet scientists like Kolmogorov. They had to live to tell the truth one day. Martyrdom may be valiant but foolish.</p>\n]]>", "author": "Mukundarajan", "published": "2017-08-13 11:38:11+00:00", "title": "By: Mukundarajan"}, {"content": "<![CDATA[<p><em>Psst. I have a secret. But don&#8217;t tell anyone, cuz it&#8217;s a secret!</em> </p>\n<p>You might find solace in &#8216;Fitch&#8217;s Paradox of Knowability&#8217;. </p>\n<blockquote><p>Fitch&#8217;s paradox of knowability is one of the fundamental puzzles of epistemic logic. It provides a challenge to the knowability thesis, which states that any truth is, in principle, knowable. The paradox is that this assumption implies the omniscience principle, which asserts that any truth is known. Essentially, Fitch&#8217;s paradox asserts that the existence of an unknown truth is unknowable. So if all truths were knowable, it would follow that all truths are in fact known.</p></blockquote>\n<p>Substitute &#8216;knowable&#8217; and &#8216;known&#8217; etc. with &#8216;speakable&#8217; and &#8216;spoken&#8217; etc. and voila! </p>\n<p><em>If all truths are speakable, it follows that they all would have been spoken.</em></p>\n<p>Fitch&#8217;s elegant little proof is easy to find, and it provides fantastic frustration.</p>\n<p>Whether or not you agree is besides the point. Offer it up to your critics, and watch them try to refute it. They&#8217;ll have better luck imagining one-hand-clapping. They&#8217;ll be banging their heads against the wall fighting a battle they cannot win. Meanwhile, you will have deftly extracted yourself from that unpleasant space between Rock and Hard Place.</p>\n]]>", "author": "Bitfu", "published": "2017-08-13 13:01:42+00:00", "title": "By: Bitfu"}, {"content": "<![CDATA[<p>Here&#8217;s me speaking impolite truths to (probably) more powerful people:</p>\n<p>People, you can easily find posts where Scott speaks out on hot-button issues. This is one post where he chooses to take the issue up a level. Get off your high horses. And you get minus points for using buzz-words like &#8220;accountability&#8221;.</p>\n<p>Kolmogorov made a net positive (way positive) contribution to humanity &#8211; as Scott is doing, in my opinion. That is the best that can be said about anyone.</p>\n<p>While I&#8217;m being disagreeable: capitalism definitely has more in common with the Theory of Evolution than Lysenkoism. It&#8217;s survival of the fittest. (That doesn&#8217;t make it a just social system &#8211; it&#8217;s not about justice.)</p>\n<p>I too considered mentioning the phases of Venus (e.g., crescent, half, full), as I know Galileo considered it strong evidence, but what stopped me is that I don&#8217;t see how you couldn&#8217;t have phases in a geocentric system, for planets that orbited the Earth inside the Sun&#8217;s orbit. (Nobody worried about the Moon&#8217;s phases in re geocentrism, did they?)</p>\n]]>", "author": "JimV", "published": "2017-08-13 13:22:13+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>Mukundarajan #182: My impression, as an outsider, is that there&#8217;s a HUGE amount of research into environmental causes of cancer&#8212;at least, like 50% of science journalism appears to be &#8220;new study says X causes / does not cause cancer.&#8221;  But there are two huge problems: one is the immense difficulty of learning something definite, given that you don&#8217;t really know the causal mechanisms, there are zillions of confounders, and if you do controlled experiments with mice or whatever then you have to give them massive doses of the alleged carcinogen because the effect you&#8217;re looking for is so tiny.  And the second issue is that there are powerful pressure groups&#8212;on the one hand, industry lobbies that will deny to the end that their products are carcinogenic (tobacco being the famous example), and on the other hand, activist groups that will not take, e.g. &#8220;cell phones do not cause brain cancer&#8221; for an answer (just like analogous groups won&#8217;t take &#8220;vaccines do not cause autism&#8221; or &#8220;GMOs are safe to eat&#8221; for answers), and will simply keep demanding more followup studies from now until the sun swallows the earth.  Did I get anything wrong? 🙂</p>\n]]>", "author": "Scott", "published": "2017-08-13 15:34:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>hey scott, i wondered it means when you ban someone from the comment section. there is no account necessary to comment, and random user names pop up when reloading the page. so how are you able to ban someone? do you track IPs?</p>\n<p>more related to the blog entry: what would you say if someone suggests  that people as neonazis also use the kolmogorov option?they often cannot speak out their real thoughts against the government as they are hunted and belittled for it, and get regularly fired from jobs when they freely speak about their ideology. i guess most of the points you brought up to show the difficulties you have to handle (nasty comments, death threats, law threats etc.) are well known to them. and they also tend to live in their own bubbles, creating hidden societies like it appears to be your dream for scientists. and they also build unholy alliances if it comes to take down common enemies.</p>\n]]>", "author": "josh", "published": "2017-08-13 18:05:47+00:00", "title": "By: josh"}, {"content": "<![CDATA[<p>josh #186: Obviously I can only ban people from posting under their real (or previously-used) names, not from doing so under a new name and new IP.  On the other hand, some of the people who&#8217;ve been banned had such distinctive styles that I&#8217;d surely recognize them, even wearing the digital equivalent of a fake wig and prop glasses!</p>\n<p>I have no advice whatsoever to offer neonazis as such.  For almost any imaginable topic that I could imagine giving advice about&#8212;WordPress blogging, advising, blending fruit smoothies&#8212;the advice might incidentally be useful to any neonazis who read <i>Shtetl-Optimized</i>, but what can you do?</p>\n<p>Unlike our current &#8220;president,&#8221; I&#8217;m more than happy to condemn neonazis by name.</p>\n]]>", "author": "Scott", "published": "2017-08-13 18:26:40+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>well, sure, also any algorithm we develop might be useful some day for someone with evil plans. that was not really the essence of my question. but encouraging to build hidden societies and to overthrow the government when the time is right is somehow different to teaching people how to make the perfect pizza, i would say.</p>\n]]>", "author": "josh", "published": "2017-08-13 18:57:09+00:00", "title": "By: josh"}, {"content": "<![CDATA[<p>@ Joe Shipman (#121), Ash (#126), Dave Pinsen (#146)</p>\n<p>Scott isn&#8217;t a coward and I think it&#8217;s unhelpful to claim otherwise. At the very least, trying to shame him into being more vocal against the SJW crowd seems ironic.</p>\n<p>I like to think that tenured professors are in a decent position to stand up to political bullies, and Scott has weathered more online vitriol than most. He&#8217;s not obliged to endure abuse on call.</p>\n<p>Also, it&#8217;s not clear that a tenured prof enjoys the degree of immunity some posters here imagine. Others with similar credentials have had their academic careers damaged. And there is more at stake professionally than simply being fired, not to mention the personal toll shaming campaigns can take. How could they be so effective otherwise? </p>\n<p>This is one of a handful of blogs where civil discourse on politically-charged topics can still be found. I&#8217;m thankful for that much.</p>\n]]>", "author": "JASA", "published": "2017-08-13 21:24:35+00:00", "title": "By: JASA"}, {"content": "<![CDATA[<p>JimV #184 and JASA #189: Thanks so much.</p>\n]]>", "author": "Scott", "published": "2017-08-13 21:52:38+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Another problem with studying possible environmental causes of cancer is that even if you limit yourself to chemicals, there are so very many chemicals.</p>\n]]>", "author": "Nancy Lebovitz", "published": "2017-08-13 23:16:07+00:00", "title": "By: Nancy Lebovitz"}, {"content": "<![CDATA[<p>What is the Economic theory of &#8216;naked-emperor equilibriums—i.e., an equilibrium with certain facts known to nearly everyone, but severe punishments for anyone who tries to make those facts common knowledge&#8217;? </p>\n<p>This sounds like a &#8216;pooling equilibrium&#8217; on the basis of &#8216;cheap talk&#8217;. &#8216;A costly signal&#8217; (e.g. something heavily punished) gives rise to a separating equilibrium- which means there is an arbitrate opportunity between coordination and discoordination games.</p>\n<p>However General Equilibrium theory predicts that the moment this is exploited the whole becomes, at worst, &#8216;anything goes&#8217;, or at best ironic in a Hegelian manner. The &#8216;martyr&#8217; becomes the bedrock of the everlasting Ecclesia founded upon the lie he exposed.</p>\n<p>I think this question and its ironic outcome lies at the very origin of Western Philosophy in the duel between Isocrates and Aristotle. The former wrote a letter to the boy Alexander urging him to get shot of his tutor who was having him grapple with difficult and abstract subjects like Pure Mathematics. It is better, Isocrates says, to concentrate on perfecting rhetorical style and the arete proper to pre-eminence. </p>\n<p>Isocrates is referred to in the Phaedrus where Socrates comes to the conclusion that the palinode (i.e. being able to change your mind) is paradigmatic of philosophy as something which gives birth to the new. Ironically, Socrates finds an Ariadne&#8217;s thread which leads him to become a pharmakos- a scapegoat- for his beloved Polis.</p>\n<p>Isocrates&#8217;  &#8216;Antidosis&#8217; (a Coasian mechanism design quirk in Athenian law whereby, if you were selected to discharge a public function then you could challenge some richer guy to do it or else swap estates) is  the opposite of Socrates&#8217; own defense against the charge of misleading the youth. </p>\n<p>Essentially, in Scott&#8217;s terms, this &#8216;good heretic&#8217; is saying he&#8217;d be better at the job of clothing the Naked Emperor in a seamless robe of opulence.</p>\n<p>This is an idea which the Russians were familiar with from Doestoevsky. If you want to get a job with the Secret Police, you pretend to be a dissident till they pick you up for interrogation at which point you turn the tables on them and explain how you are an even better agent provocateur than those they set upon you. Of course, the thing works the other way as well. A true dissident who really wants to change the system will have disguised himself as a secret policeman straight off the bat.</p>\n<p>Perhaps this was the game everyone was playing. People like Luzin, by reason of their mystical leanings, were actually safer if denounced by their own. The real danger was Old Bolsheviks.</p>\n<p>The Soviets and the Americans develop O.R to a high standard at around the same time. Two very different systems begin to mirror each other in one respect- their Political Paideia can have a purely mathematical description. The Soviets had Nobel prize worthy mathematical economists just as the Americans did, but it was the latter which developed systematic schools attracting adherents across the globe. Ultimately, in the &#8217;90&#8217;s we had the ultimate &#8216;antidosis&#8217; competition. The Harvard Econ Dept was hired to give Russia an American type economy. We all know how that turned out.</p>\n<p>Perhaps we became complacent at some point in the Eighties. It is sad that shrill complaints re. &#8216;trait based&#8217; discrimination have vitiated proper statistical research into the genuine article as illumined by Sowell, Loury, Fryer & c. There are a lot of bright and good people doing Junk Social Science in order to show they are &#8216;engaged&#8217;.</p>\n<p>Misology, too, is a type of &#8216;costly signal&#8217;. If a smart and erudite guy makes it a point to utter ignorant non sequiturs it must be the case that he really really cares, right? Either that or he&#8217;s just lazy and likes publicity. But, that&#8217;s the nature of our current &#8216;naked Emperor equilibrium&#8217;.</p>\n]]>", "author": "polyglot", "published": "2017-08-14 00:55:25+00:00", "title": "By: polyglot"}, {"content": "<![CDATA[<p>Scott #168: Ok, but “I don’t think we have sufficient reason we couldn’t learn anything new by …” sounds studiously agnostic or perhaps just open-minded. On a spectrum of [“waste of time”&#8212;“no opinion”&#8212;“well worth exploring”], it seems, at first pass, that the orthodoxy would lean towards the “WWE” side (doing actual computation to understand computation). By taking the middle ground you seem to be indicating no belief either way but presumably this means that the bubble leans significantly to the “WOT” side and have their reasons for pessimism (otherwise, where’s the heresy?).</p>\n<p>I guess there might be under-appreciated insights gained from <a href=\"https://arxiv.org/abs/1505.02205\" rel=\"nofollow\">finding</a> the determinantal complexity of the 3&#215;3 permanent so that doing likewise for the 4&#215;4, 5&#215;5 cases potentially offers hints for the n x n case.</p>\n]]>", "author": "Ronald Monson", "published": "2017-08-14 02:40:38+00:00", "title": "By: Ronald Monson"}, {"content": "<![CDATA[<p>Scott #185.  You got it exactly right.  While reading #182 I was surprised that you did not redact the “..chemicals in the environment” comment.  But your response was perfect. </p>\n<p>In fact:  “The chemicals in the environment” meme is a perfect illustration of your comment (#57) that “… different parts of the world have gone nuts in different and sometime even diametrically opposed directions”.</p>\n]]>", "author": "David", "published": "2017-08-14 16:10:37+00:00", "title": "By: David"}, {"content": "<![CDATA[<p>I wonder whether claiming a P vs NP solution is even braver for a serious CS person these days than speaking out against Stalin:</p>\n<p><a href=\"https://arxiv.org/pdf/1708.03486.pdf\" rel=\"nofollow\">https://arxiv.org/pdf/1708.03486.pdf</a></p>\n]]>", "author": "asdf", "published": "2017-08-14 16:37:28+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>JimV #184: Regarding the phases of Venus, it is the combined observation of changes in shape, size and brightness that is a knock down that Venus, at least, is orbiting the sun. The moon, for example, exhibits phases without the huge size and brightness change.</p>\n]]>", "author": "Waterbergs", "published": "2017-08-14 19:01:38+00:00", "title": "By: Waterbergs"}, {"content": "<![CDATA[<p><a href=\"#comment-1742126\" rel=\"nofollow\">Waterbergs 196</a>, that is exactly backwards. The full moon is much brighter than the new moon. Whereas, Venus does not change total brightness. The percent of illumination cancels out the size change: when it is closer to full it is farther away and when it is closer to new, it is closer to us. And it changes size a lot.</p>\n<p>The phases are iron-clad proof that (1) Venus is illuminated by the sun and (2) that Venus is sometimes in front of the Sun and sometimes behind. </p>\n<p>Going back to ancient times various people saw that Venus was always close to the Sun and argued that it orbited the Sun. But I think that other people argued that if this were true, it would change brightness, which it does not. They argued that if it were illuminated by the Sun it would have phases. We can&#8217;t see the phases with the naked eye, but they argued that we would be able to see the change in total brightness, which we don&#8217;t. Of course, this depends on how the distance from Venus to the Sun compares to the distance from the Sun to the Earth. It turns out that the orbit of Venus is 3/4 AU, very close to the orbit of the Earth, so the size changes are big. But the size and phases are not visible to most naked eyes.</p>\n<p>On the other hand, Mercury, at 1/2 an AU orbit, has a large range of brightness, so I don&#8217;t know why people didn&#8217;t conclude that it orbits the Sun.</p>\n]]>", "author": "Douglas Knight", "published": "2017-08-14 22:46:51+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Douglas Knight #197:</p>\n<blockquote><p>On the other hand, Mercury, at 1/2 an AU orbit, has a large range of brightness, so I don’t know why people didn’t conclude that it orbits the Sun.</p></blockquote>\n<p>Martianus Capella, writing before Copernicus (Copernicus cited him!), <i>did</i> conclude that.</p>\n<p>(This idea, that Mercury and Venus orbit the sun which in turn orbits the earth, is commonly attributed to Heraclides, but apparently he never actually suggested it?  Dunno.)</p>\n]]>", "author": "Sniffnoy", "published": "2017-08-15 00:59:32+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>There is a certain impertinence in allowing oneself<br />\nto be burned for an opinion.<br />\n        &#8212; Anatole France</p>\n]]>", "author": "Brent Meeker", "published": "2017-08-15 01:05:42+00:00", "title": "By: Brent Meeker"}, {"content": "<![CDATA[<p>BTW, if we&#8217;re now down in that part of the thread where we post irrelevant CS stuff like new P vs NP claims&#8230; 😛</p>\n<p>Apparently back in January, when the whole &#8220;Babai&#8217;s graph isomorphism algorithm isn&#8217;t actually quasipolynomial time / nevermind he fixed it&#8221; thing was going down, Harald Helfgott <a href=\"https://arxiv.org/abs/1701.04372\" rel=\"nofollow\">wrote a paper</a> where he analyzed the fixed version and concluded that it runs in time 2^O((log n)^3) (this is kind of buried in there unfortunately).  I hadn&#8217;t seen this mentioned anywhere (maybe because I don&#8217;t follow many CS blogs 😛 ) so I thought I&#8217;d point it out.  The only explicit exponent I&#8217;d seen on the log n was Babai&#8217;s suggestion that it could be taken to be 8, I hadn&#8217;t see any mention of Helfgott&#8217;s proof that you could take it to be 3.</p>\n]]>", "author": "Sniffnoy", "published": "2017-08-15 01:07:12+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Douglas #197 Have you actually observed the phases of Venus? I can promise you as one who has that the brightness varies considerably over a phase &#8211; being significantly dimmer when Venus is the other side of the sun. The change in distance more than cancels the change in illuminated area we can see &#8211; up until the final few percent of phase. </p>\n<p>The key point is the combination of shape, brightness and, critically &#8211; size. Venus is about 5 times bigger when on our side of the sun and in the form of a beautiful crescent. This is obviously totally different to the behaviour of the moon. the combination of these three observations can only be explained by venus orbiting the sun. </p>\n<p>Also on your orbits: The numbers are &#8211; Mercury (while highly eliptical) has a mean orbital radius of 58 million km, Venus 108 million, and earth of course 150 million. </p>\n<p>BTW, I would encourage anyone interested to watch this for themselves. Even a simple pair of binos surfice to see the phases of Venus and to put yourself in Galileo&#8217;s boots in 1609/10. The visuals are also stunning, particualrly for the crescent phases.</p>\n]]>", "author": "Waterbergs", "published": "2017-08-15 06:08:34+00:00", "title": "By: Waterbergs"}, {"content": "<![CDATA[<p>[&#8230;] my post “The Kolmogorov Option,” I tried to step back from current controversies, and use history to reflect on the broader [&#8230;]</p>\n]]>", "author": "What I believe II  Chillycon", "published": "2017-08-15 12:54:05+00:00", "title": "By: What I believe II (ft. Sarah Constantin and Stacey Jeffery) – Chillycon"}, {"content": "<![CDATA[<p>Old Sanskrit proverb:</p>\n<p><i>satyaṃ brūyāt priyaṃ brūyāt na brūyāt satyam apriyam |<br />\npriyaṃ ca nānṛtaṃ brūyād eṣa dharmaḥ sanātanaḥ ||</i><br />\nSpeak truly, speak pleasantly, do not speak the truth unpleasantly.  Do not speak what is pleasing but untrue. This is eternal Dharma.</p>\n<p>Another old Sanskrit proverb:</p>\n<p><i>sulabhāḥ puruṣā rājan satataṃ priyavādinaḥ /<br />\napriyasya ca pathyasya vaktā śrotā ca durlabhaḥ //</i><br />\nIt is easy, O King, to find people who always speak pleasantly. Of that which is unpleasant but proper, it is rare to find those would speak or those who would listen.</p>\n<p>Between these two we lead our lives. 🙂</p>\n<p>It is an interesting moral question, between your Law and your Amendment, of what to do in cases where you simultaneously believe (1) that something is true, and (2) that speaking it will cause real harm (at least mental but possibly even career-related or other worse indirect consequences) to some. I think that&#8217;s what you were wondering with this post, and it appears the answer isn&#8217;t clear, especially when you consider additional beliefs like (3) that *not* speaking it can cause some harm too, and (4) that therefore whether you speak it or not can be taken to say something about <i>whom</i> who are willing to harm, and thereby puts you (in some people&#8217;s eyes) on one &#8220;side&#8221; or other of some putative battle.</p>\n]]>", "author": "svat", "published": "2017-08-15 13:21:01+00:00", "title": "By: svat"}, {"content": "<![CDATA[<p>Even after reading Scott&#8217;s reply (#54), I find #18 compellingly correct. &#8220;Sir, I may agree with what you say, but I deny to the death the merit of darkly hinting at it. Miss me with those Moldbuggian shenanigans.&#8221; Or something like that.</p>\n<p>The result of all this hinting and eyebrow-waggling is that reading through the comments, I have to wonder if any of the &#8216;great post!&#8217;s are actually engaged in a secret game of exchanging messages about how much they hate certain political groups and enjoy seeing those groups likened to Stalinists. Or maybe they just really like learning about Russian mathematicians. It&#8217;d be nice to think so.</p>\n<p>And yes, you can ask what choice you have, like Kolmogorov must have done. You&#8217;re not a coward for choosing not to step into a crocodile&#8217;s mouth. That&#8217;s just not being stupid. But if ever afterward people find it hard to believe you&#8217;re sincerely professing any kind of belief, well, they&#8217;re trying not to be stupid, too.</p>\n]]>", "author": "Dirdle", "published": "2017-08-15 14:25:51+00:00", "title": "By: Dirdle"}]