[{"content": "<![CDATA[<p>I was also curious about the legal question. I imagine that this precise issue has never been raised before and that it may be unclear how the courts would rule.</p>\n]]>", "author": "Jr", "published": "2014-09-24 07:42:43+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>As for the title, this blog already has a title, &#8220;Shtetl-Optimized&#8221;, so shouldn&#8217;t the title of the book re-use that? You could add a subtitle like &#8220;Shtetl-Optimized, Speaking Truth to Parallelism&#8221;.</p>\n]]>", "author": "jonas", "published": "2014-09-24 12:16:15+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>jonas #32: Thought about it, of course&#8212;but that title&#8217;s no good for selling books to anyone who doesn&#8217;t already know this blog (except, perhaps, for a tiny number of Yiddishists who will then demand refunds <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> ).  And besides, I&#8217;d like to differentiate the blog, which is about whatever I feel like blogging about on a given day, from the book, which is only about the &#8220;meatiest&#8221; subset of topics that I ended up addressing.</p>\n]]>", "author": "Scott", "published": "2014-09-24 12:39:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Just in case some other reader wants to find all the comments they have posted to decide which ones Scott can use, here&#8217;s a handy list sorted by poster: <a href=\"http://www.math.bme.hu/~ambrus/pu/aaronson-commentlist\" rel=\"nofollow\">http://www.math.bme.hu/~ambrus/pu/aaronson-commentlist</a></p>\n]]>", "author": "jonas", "published": "2014-09-24 14:20:53+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>a few notes<br />\n1) I have reviewed Lipton&#8217;s blog book, Lipton-Regan blog book, and am in the middle of reading Tao&#8217;s first blog book. In all three cases I find it much easier to read these columns in book form. I think the computer screen has so much else going on and also the notion of I can read the blog later&#8212; but don&#8217;t&#8211; is bad. So Kudos for the blog book which I look forward to reading and reviewing!</p>\n<p>2) I&#8221;m tempted to say `taking the blog posts and making them into a book will be harder than you think&#8217; &#8211; but I suspect you already know that. Is that a paradox- Scott knows that it will be harder than Scott thinks it will be.</p>\n<p>3) Speaking truth to parallelism&#8212; your posts aren&#8217;t really on parallelism, so it seems odd. But it has a nice ring to it, and it captures your spirit mod details.</p>\n]]>", "author": "gasarch", "published": "2014-09-24 14:47:12+00:00", "title": "By: gasarch"}, {"content": "<![CDATA[<p>Scott, a content creator need not explicitly post a copyright notice for internet content.  The work is still covered under copyright law.  This has been the case in the US and in many other countries for quite some time.</p>\n<p>The issue of blog comments doesn&#8217;t seem well addressed by any court cases I&#8217;m aware of.  This is what I&#8217;ve found:</p>\n<p><a href=\"http://whydoeseverythingsuck.com/2008/05/who-has-comment-copyright-ownership-in.html\" rel=\"nofollow\">A spat in 2008 between a blog owner and a commenter that seems related to this issue.</a></p>\n<p><a href=\"http://www.webpronews.com/who-owns-blog-comments-2008-06\" rel=\"nofollow\">A report on the spat above which included solicited comment from a law professor specializing on internet copyright issues.</a></p>\n<p>Here is the relevant part about the Professor&#8217;s views: <i>&#8220;From Ochoa’s viewpoint, a commenter owns his comments for copyright purposes. This means that if a blogger wanted to publish a best-of collection of comments, as Winer suggested, the blogger would likely need permission from the commenter.&#8221;</i></p>\n<p><a href=\"http://www.businessinsider.com/2008/5/who-owns-blog-comments-\" rel=\"nofollow\">Another report from Business Insider about the spat and its aftermath.</a></p>\n<p><a href=\"http://nevermetpress.com/blog-comments-who-owns-the-copyrights-to-them#.VCLbN5_7FTA\" rel=\"nofollow\">Here is another blog author talking about writing a book who decided against including comments precisely because of this uncertainty.</a></p>\n<p>Of course, none of this gets into precisely how <i>original</i> a comment has to be in order for it to be eligible for copyright.  Nor does it touch on the fair use rights and how much you are allowed to quote from these comments.  I would think paraphrasing, provided it is substantially different text, would be the best bet from a risk reduction perspective.</p>\n<p>Anyway, it sounds like you should probably consult a good lawyer to find out what is the real current state of this question.  Perhaps there are court cases&#8230;</p>\n]]>", "author": "AdamT", "published": "2014-09-24 15:02:03+00:00", "title": "By: AdamT"}, {"content": "<![CDATA[<p>Great project but horrible title. It will sound decent only in the US(UK?).<br />\nUnfortunately I do not have a better suggestion..<br />\nGood luck!<br />\nK.</p>\n]]>", "author": "anon", "published": "2014-09-24 16:53:43+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>Just in case, I think I would like to be asked if any of my comments are to be used.  But, if you do end up quoting me in a real-life book, I would probably prefer to be quoted by my <a href=\"http://www-personal.umich.edu/~haltman/\" rel=\"nofollow\">real-life name</a>&#8230; (see email address there)</p>\n]]>", "author": "Sniffnoy", "published": "2014-09-24 19:04:03+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Please consider Robert Cringley&#8217;s <a href=\"http://www.amazon.com/The-Decline-Fall-IBM-American-ebook/dp/B00KRHWZ22\" rel=\"nofollow\">The Decline and Fall of IBM</a> as an example of how not to include blog comments in a book.</p>\n<p>While you plan on responding to the comments you select, which Cringley did not do, I wonder if you wouldn&#8217;t be better off just working the ideas into your narrative and keeping the text in one voice?  A voice that some of us have come to really enjoy.  Some really very, very smart people comment here &#8212; but they aren&#8217;t you.  Let them write their own books.</p>\n]]>", "author": "wrf3", "published": "2014-09-25 09:20:28+00:00", "title": "By: wrf3"}, {"content": "<![CDATA[<p>It&#8217;s a great title for readers of the blog, but the word &#8220;parallelism&#8221; is not so accessible. As a long time lurker, I realize that it refers to wild claims in popular science writing about parallell universes, trying all possible cases at once, solving Sudoku with a Dwave machine, etc. </p>\n<p>This type of thing is probably best left to the marketing folks who know what plays with the focus groups. Anyway, my offering is &#8220;I Want to Believe&#8221;. OK, so it&#8217;s also an X-file movie I haven&#8217;t seen, but there&#8217;s an implied &#8220;&#8230;BUT&#8221; that captures both the openness to new ideas and the high threshold of proof.</p>\n<p>Good luck with the venture!</p>\n]]>", "author": "EE-John", "published": "2014-09-25 18:30:05+00:00", "title": "By: EE-John"}, {"content": "<![CDATA[<p>Berne convention of 1984 assigns defacto copyright to creator of the content. Case closed.</p>\n]]>", "author": "JG", "published": "2014-09-27 22:24:16+00:00", "title": "By: JG"}, {"content": "<![CDATA[<p>JG #41: There is such a thing as &#8220;fair use&#8221; in copyright law, which allows for the quoting of short passages.  Case reopened.</p>\n]]>", "author": "Scott", "published": "2014-09-27 23:00:10+00:00", "title": "By: Scott"}]