[{"content": "This is a huge tragedy everyone involved and a enormous loss for the whole community. It strikes me as tasteless to use this event to drive home some minor point.", "author": "Anonymous", "published": "2014-09-18 20:47:33.704000-04:00", "title": ""}, {"content": "Anon #1: <br /><br />I agree this is bad for the people who work there, although as I said they are so talented that if they choose to leave Microsoft I am hopeful/sure they will find new employment quickly.<br /><br />I agree that its a loss for the community.<br /><br />I disagree that it&#39;s &quot;tasteless&quot; to suggest this is relevant the ongoing debate, to which I referred, regarding some of the issues between industry and academia.  Indeed, isn&#39;t your reaction demonstrative that this is not a &quot;minor point&quot; at all -- it&#39;s at best a very unpleasant disruption of life for many of our colleagues?    ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-09-18 21:04:24.132000-04:00", "title": ""}, {"content": "I agree that this is a loss for the community. <br />I also feel this &quot;disruption&quot; is necessary part of innovation for the company. Although, it is sad that research always get the first hit when this happens.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/t/T:CHETAN.html\">CHETAN T</a>", "published": "2014-09-18 21:30:17.898000-04:00", "title": ""}, {"content": "I&#39;m with MM on this one, @Anon1.  This is the second or third time this has happened to this specific group -- I was a naive intern at SRC when Compaq was doing its best to make an amazingly talented group of researchers abjectly miserable.  We&#39;ve seen Intel close several of its labs.  Microsoft now has closed MSR-SV.  Many awesome current machine learning and theory faculty were refugees from Bell Labs and/or AT&amp;T research back around 2004.<br /><br />This kind of change is not unexpected for corporate research labs.  It&#39;s not an indictment of the model in any sense -- MSR-SV had a great run and did great work.  It&#39;s just one of the things to consider in the mental spreadsheet when trying to figure out what to do with your life (at any age).  Academia isn&#39;t all roses and unicorns either.  There are advantages and disadvantages, and it behooves us to be honest about them on both sides of the fence.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Andersen:David.html\">David Andersen</a>", "published": "2014-09-18 21:33:49.191000-04:00", "title": ""}, {"content": "There is something different in this case.   Those previous closures were at companies where the handwriting was on the wall for some time, not companies that just spent $2.5 billion of a big wad of cash reserves on a computer game.  That&#39;s the most shocking part of it.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Beame:Paul.html\">Paul Beame</a>", "published": "2014-09-18 22:27:30.394000-04:00", "title": ""}, {"content": "When an industrial research lab like this one shuts down, there must be many ongoing projects that are disrupted.  It&#39;s possible that the former employees will continue this research after moving on to another employer (although they won&#39;t be allowed to take any codee with them, the ideas will certainly still be in their heads), but I find it hard to believe that any of these projects will be taken up in an effective way by researchers working at other Microsoft labs.  I also wonder about papers that had been submitted or were being revised by these researchers.  That wasted effort is one of the saddest aspects of this situation in my opinion.  ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Borchers:Brian.html\">Brian Borchers</a>", "published": "2014-09-18 23:19:47.733000-04:00", "title": ""}, {"content": "Paul --<br /><br />Thank you for highlighting this excellent point;  I wish I had myself.  This aspect (that Microsoft isn&#39;t hurting -- for example it&#39;s stock is up about 40% on the year!) makes this closure very surprising. <br /><br />Relating it to my &quot;tasteless&quot; issue, this is part of the &quot;risk&quot; of working in industry.  It&#39;s not just the risk that the company runs into financial trouble (although that seems to be the most common issue for research divisions). Sometimes there are layoffs, moving headquarters/cities, changes in company direction, or other significant events that are outside one&#39;s control but can have an outsized affect on one&#39;s career and life plans.     ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-09-19 00:44:38.762000-04:00", "title": ""}, {"content": "Extrapolating: when Microsoft management says &quot;We remain committed to basic research&quot; and &quot;We need to undergo a cultural shift&quot;, the latter is probably going to eat the former for breakfast.", "author": "Anonymous", "published": "2014-09-19 01:15:36.464000-04:00", "title": ""}, {"content": "BIg deal. I bet all these guys already have a job at google at twice their MSFT  salary ", "author": "Anonymous", "published": "2014-09-19 11:43:25.042000-04:00", "title": ""}, {"content": "You know, we are all little blocks being broken and placed on an infinite board..... no wait !<br /><br />Beside pointless acquisitions, I could think of some serious fat to cut at MSFT, not a handful of underpaid researchers. <br /><br />MSFT does not get the knowledge economy. <br />It is still stuck in a &quot;boxed product&quot; mindset where the publisher is the gatekeeper. <br /><br /><br />Having an army of 10 thousand monkeys mindlessly writing another useless &quot;product&quot; cheering some stupid marketing bluff is hopeless.<br /><br />Monopolies are nice, but the targets now are less clearcut, and one has to adapt to this reality of the digital economy.<br /><br />In that light, having bright motivated folks bridging the skill spectrum is key. <br />It allows to move and reconfigure faster. It transforms those bright researchers from cost center to a competitive edge.<br /><br />Same for the languages and tools : MSFT does not in practice know how to use open source, despite all their talk. Another shield for the internal monkeys. Another loss to MSFT.<br /><br />No amount of leadership or vision can recover from the failing perspective of the boxed product.", "author": "Anonymous", "published": "2014-09-19 14:28:27.621000-04:00", "title": ""}, {"content": "To Jon&#39;s original point of academia vs. industry, no doubt that tenure in academia makes a difference.<br /><br />From my perspective, working in an industry research lab all my career, I&#39;m always aware of the possibility of being forced one day to find another job. For me personally, this means keeping a high enough profile so I would have options if that happens. I don&#39;t know if I would have worked as hard if I was a tenured professor, so it is not necessarily a bad thing.<br /><br />A related point: the institution of tenure as a whole seems at odds with current trends in our society. My (completely unsubstantiated) guess, is that in the coming decades we will see universities backing off of this system. Maybe the very top universities will always keep tenured professors, but perhaps this will become a perk which is awarded only for the select few.<br /><br /><br />To Paul&#39;s excellent point: not only is MSFT not hurting, but also this particular lab was the poster-child of what an industry research lab can be at its best: A small lab that combines revolutionary basic research (e.g. the concept of differential privacy) with making real impact on the corporate bottom line (e.g., Erasure coding in Windows Azure). Closing a lab like this is a striking statement about not believing in technical research. Unfortunately this is not the only example of this attitude in corporate America (though it is certainty the most extreme).<br /><br /><br />And a final thought, inspired by <a href=\"http://windowsontheory.org/2014/09/19/farewell-microsoft-research-silicon-valley-lab/\" rel=\"nofollow\">Omer Reingold&#39;s beautiful post</a>, if you had a chance to work in a place like that for five years, wouldn&#39;t you take it even knowing the ending?", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Halevi:Shai.html\">Shai Halevi</a>", "published": "2014-09-20 22:18:21.087000-04:00", "title": ""}, {"content": "Oops, I mean Michael&#39;s original point, I just had my wires crossed..", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Halevi:Shai.html\">Shai Halevi</a>", "published": "2014-09-21 00:21:35.095000-04:00", "title": ""}]