[{"content": "<![CDATA[<blockquote><p><b>Scott</b> critiques the critics: &#8220;A common thread [is] a refusal to accept quantum computing for the basic research field that it is, and an insistence on treating it like an applied engineering project that can then be faulted for failing to produce &#8216;deliverables&#8217; on schedule.&#8221;</p></blockquote>\n<p>The American president Bill Clinton was celebrated&nbsp;&mdash; and reviled too&nbsp;&mdash; for his pragmatic ingenuity in triangulating problems that ideology-driven pundits (equally on the left and the right) deemed irreconcilable.  </p>\n<p>We can all hope that Nature, being no less ingenious than Bill Clinton, will triangulate the various issues associated to quantum computation.  One such happy triangulation, which would be strategically, economically and technologically transformational, *and* plenty fun for young mathematicians, scientists, and engineers, might be as follows.</p>\n<p><b>Acknowledgement</b>&nbsp; The following &#8220;quantum virtuous cycle&#8221; scenario owes much to the <i>International Roadmapping Committee&#8217;s</i> (IRC) sensible and cheerful analysis in the <b>&#8220;<a href=\"http://www.itrs.net/papers.html\" rel=\"nofollow\">More-than-Moore White Paper</a>&#8220;</b> (2010).</p>\n<p>(1)&nbsp; D-Wave exhibits an heterogenous \\(k\\)-member class of simulation and/or optimization problems \\((S_i; i\\in 1,k)\\), that are chosen for their practical importance.</p>\n<p>(2)&nbsp; D-Wave demonstrates (empirically) that &#8220;real world&#8221; instances of problems in each set \\(S_i\\) can be solved with \\(n^{k_i}\\) D-Wave qubits.</p>\n<p>(3)&nbsp; New generations of D-Wave machines, having ever-increasing \\(n\\), are embraced by eager customers, in a paradigmatic <i>virtuous cycle</i> of quantum technology development.</p>\n<p>(4)&nbsp; Simulationists meanwhile improve their classical algorithms, such that &#8220;real world&#8221; instances of problems in the D-Wave problem-set \\(S_i\\) can be solved with (let us say) \\(n^{k_i+1}\\) classical operations.</p>\n<p>(5)&nbsp; New generations of classical algorithms <i>also</i> are embraced by eager customers, in a parallel paradigmatic <i>virtuous cycle</i> of classical technology development.</p>\n<p>(6)&nbsp; A crucial contribution of (what Scott calls) &#8220;basic&#8221; quantum computing research is to provide the mathematical foundations and physical insights that sustain <i>both</i> the classical and quantum virtuous cycles. </p>\n<p>(7)&nbsp; Progress toward the research objectives of error-corrected quantum computing and/or scalable BosonSampling continues at its historical and stately (but vital) one-doubling-per-scientific-generation pace&nbsp;&hellip; with no artificial pressure to accelerate that pace.</p>\n<p><b>Conclusion</b>&nbsp; It is plausible (even likely?) that Nature <i>already</i> has triangulated the debate between quantum computing advocates and skeptics, by sustaining a &#8220;virtuous cycle&#8221; of classical-quantum synthesis that <i>already</i> is generating transformational advances in simulation and optimization capability, such that we <i>already</i> live in a world in which the Extended Church-Turing Thesis (ECT) is effectively true.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-01-21 12:18:23+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>&#8220;yet again burst DWave’s hype bubble&#8221;</p>\n<p>What does that metaphor mean? When I burst a soap bubble, it stays burst. Do you mean like how lots of people burst Madoff&#8217;s bubble?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Knight:Douglas.html\">Douglas Knight</a>", "published": "2014-01-21 14:58:52+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>#54 Scott: &#8220;Incidentally, thanks for reporting Robert Alicki’s speculation; it helps to clarify his views for me. But I don’t see his idea as a separate possibility: rather, I consider it 100% compatible with the classical Extended Church-Turing Thesis.&#8221;</p>\n<p>Yes this is 100% compatible with the thesis but still a separate possibility. There is a difference between the two ways that ECT can be satisfied in the context of quantum field theory computations.</p>\n<p>One possibility is that certain computations from quantum field theory are computationally hard, gives precise description of how nature works, but in order to probe the outcome, either experimentally or computationally we need exponential resources. </p>\n<p>Another possibility is that certain computations from quantum fiels theory are computationally hard, and this indicate (because of the ECT) that they are simply becoming irrelevant to the physics (error terms are becoming larger than main term) for complex systems. </p>\n<p>I still think that the second possibility is more likely, but I missed the first possibility, before Robert mentioned it to me.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2014-01-21 18:58:19+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<blockquote><p><b>Gil Kalai</b> postulates&nbsp;  (**):&nbsp;&#8221;For all attempts at universal quantum computing devices [...] decoherence will scale up linearly with the number of qubits.&#8221;</p>\n<p><b>Scott Aaronson</b> opines&nbsp; &#8220;I absolutely would regard (**) as even more surprising than the failure of QM itself.&#8221;</p>\n<p><b>Daniel Gottesman</b> postulates&nbsp; (***):&nbsp;&#8221;No geometric restrictions on gates [in&nbsp;particular] interacting arbitrary pairs of qubits, no matter where the two qubits are physically located.&#8221;</p></blockquote>\n<p><b>Reference</b>&nbsp; The Gottesman postulate is stated in his recent (excellent!) e-print &#8220;What is the Overhead Required for Fault-Tolerant Quantum Computation?&#8221; (arXiv:1310.2984v1).</p>\n<p><b>Observation</b>&nbsp; Nature imposes upon us the restriction that qubit interactions (both long-range and short-range) are mediated by QED field theory.  And within the <i>restricted</i> world of QED, Gil Kalai&#8217;s (**) postulate is comparably plausible&nbsp;&mdash; from experimental experience, and from physical expectations, and from abstract mathematical arguments too&nbsp;&mdash; to Daniel Gottesman&#8217;s (***) postulate.</p>\n<p>Similar considerations apply to scalable BosonSampling:<br />\n<blockquote><b>Scalable BosonSampling&#8217;s</b> independence postulate&nbsp; (****)&nbsp;&#8221;If we observe high-coherence \\(n\\)-photon emission into low-efficiency detectors, and we observe high-efficiency  \\(n\\)-photon detection from low-coherence emitters, then we can attain high-coherence <i>and</i> high-efficiency performance by coupling the photon-sources to the  photon-detectors.</p></blockquote>\n<p>The teaching of quantum optics (per the &#8220;Mordac&#8221; argument of #60) is that (****) is the least plausible postulate of all.</p>\n<p><b>Conclusion</b>&nbsp;  The Kalai postulates may or may not prove to be correct&nbsp;&mdash; we don&#8217;t know as yet&nbsp;&mdash; however our present understanding of QM provides no obvious reason(s) for us to regard them as implausible.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-01-21 19:33:07+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Scott #98:</p>\n<p>I think that criticism is absolutely unfair. I have no problem with QC as basic research (ok, asides of how much we ought to be spending). But are you really saying that it&#8217;s me who&#8217;s pushing to treat QC as applied engineering? And not the hundreds of others out there (including DWave, Google, NASA, media, academics etc.) who are selling it as a prototype of an just-around-the-corner useful technology? </p>\n<p>Sure, I gloat with glee when the ones promising it as a solution fail to deliver & in that respect I like the ones who quantify their claims better since that sort of hype is easier to refute than some vague hype. I&#8217;d gloat as much over the failure of someone promising a car that runs on water or a fusion generator, or a perpetual motion machine or some such. </p>\n<p>There&#8217;s some like Scott who are frank & honest about QC being basic research & I admire that greatly. But if you are claiming no QC enthusiast / article / firm  is flogging QC as a potential revolutionary technology to crack codes or elucidate protein structure  etc. then you&#8217;ve got to be kidding me.</p>\n]]>", "author": "Rahul", "published": "2014-01-21 20:16:34+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul #104: Dude, a large part of what I&#8217;ve been doing on this blog for almost a decade&#8212;and with my book, and with my New York Times and Scientific American articles, etc. etc.&#8212;is trying to <b>fight</b> the view of QC as applied engineering (and all sorts of other related misconceptions, like that QCs can solve NP-complete problems with exponential parallelism).  I try to redirect people&#8217;s excitement to what I see as the <i>real</i> reasons to be interested in this field, which have to do with enormous open questions both in complexity theory and in quantum foundations.</p>\n<p>And no, I don&#8217;t blame you for the prevalence in the wider world of the &#8220;applied engineering&#8221; view, the thing I&#8217;ve been fighting all these years: I blame the hype circus that I described in comment #87.  I&#8217;m only focusing on you because you&#8217;re here on this blog! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n<p>Regarding decreasing the amount of funding for basic research in QC, let me submit the following thought: when scientists can&#8217;t get funded for making an <i>honest</i> case&#8212;&#8221;we want to try this and see where it will lead, and we don&#8217;t actually know; we only know that people asking these sorts of questions has been pretty damn successful for the last 400 years&#8221;&#8212;that&#8217;s precisely what pushes some fraction of scientists into making dishonest, hype-laden cases.  Which doesn&#8217;t excuse their behavior, but which suggests that, if you&#8217;re against QC hype, then it&#8217;s in your own interest to see that people can get funded just by promising to explore the frontiers of computer science and physics, and not promising a useful device in X number of years.</p>\n]]>", "author": "Scott", "published": "2014-01-21 21:00:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>#93<br />\n&#8220;Much more radically, some people want to get rid even of the amplitudes in quantum mechanics (which are continuous complex numbers, but which are never directly observed, only used to calculate the probabilities of discrete outcomes).&#8221;</p>\n<p>It&#8217;s quite interesting that while QM offers fundamental &#8220;quanta&#8221; which are just the perfect to represent &#8220;pure&#8221; bits for classic digital computers, QC is really about taming mysterious continuous and non-directly-observable amplitudes&#8230;<br />\nSeems like a throwback to the 1920&#8242;s and the whole particle/wave duality debates between Bohr, Pauli, Einstein, Heisenberg, Schrodinger, etc <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Fred", "published": "2014-01-21 21:31:29+00:00", "title": "By: Fred"}, {"content": "<![CDATA[<p>[Luke]trying to fight the view of QC as applied engineering &#8230;<br />\nthe real reasons to be interested in this field, which have to do with enormous open questions both in complexity theory and in quantum foundations.</p>\n<p>[Yoda] That is why you fail, Luke. Quantum Computer others like China will get first if you persist in your complacency. You must unlearn what you have learned.</p>\n<p>Luke: I want my lamp back. I&#8217;m gonna need it to get out of this slimy mudhole.<br />\nYoda: Mudhole? Slimy? My home this is!</p>\n]]>", "author": "rrtucci", "published": "2014-01-22 02:12:04+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>rrtucci #107, well at least we know that in this drama, Geordie cannot turn out to be Scott&#8217;s father.  The age difference doesn&#8217;t allow for that.</p>\n]]>", "author": "quax", "published": "2014-01-22 05:27:42+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Scott #98, I thing at the end there you meant to write &#8220;quantum speed-up&#8221;, instead of speed-up.  </p>\n<p>From a simplistic applied engineering point of view, any practical speed-up will suffice quite nicely to ensure D-Wave&#8217;s business success.</p>\n]]>", "author": "quax", "published": "2014-01-22 05:36:38+00:00", "title": "By: quax"}, {"content": "<![CDATA[<blockquote><p><b>Fred</b> (#106) quotes <b>Scott</b> (#93)&nbsp; &#8220;Much more <b><strike>radically</strike></b> <i>pragmatically</i>, some people <b><strike>want&nbsp;to</strike></b> <i>already</i> get rid even of the amplitudes in quantum mechanics.</p></blockquote>\n<p>Students (especially) may wish to consult the burgeoning 21st century literature that amply justifies the maps  \\(\\text{&#8220;radically&#8221;}\\to\\text{&#8220;pragmatically&#8221;}\\) and \\(\\text{&#8220;want to&#8221;}\\to\\text{&#8220;already&#8221;}\\).  Two starting-points are Carlton Caves&#8217; on-line notes <i>Completely Positive Maps, Positive Maps, and The Lindblad Form</i> (2000) and Howard Carmichael&#8217;s <i>Statistical Methods in Quantum Optics 2: Non-Classical Fields</i> (2007). </p>\n<p>Carmichael&#8217;s final chapter <b>&#8220;<a href=\"http://books.google.com/books?id=sXeMO9EfyUgC&pg=PA478\" rel=\"nofollow\">Quantum Trajectories III: More Examples</a>&#8220;</b> especially is recommended; it begins:<br />\n<blockquote>&#8220;Much more could be said about methods of calculation and simulation within the quantum trajectory approach [and there is] therefore a great deal more that could be done.  There is only one chapter left, however, in which to do it, and many things must be set aside.  </p>\n<p>In this final chapter we explore just a small selection of the possible extensions and applications of quantum trajectory theory.&#8221;</p></blockquote>\n<p><i>Shtetl Optimized</i> readers are invited to verify for themselves that Caves&#8217; Lindbladian unravelling(s) of Carmichael&#8217;s quantum trajectories are specified wholly in terms of the <i>local</i> structures (metric & symplectic) of quantum state-space, with no need for particular assumptions regarding the <i>global</i> structure (or even dimensionality) of that state-space.  </p>\n<p>History provides plenty of precedent for radical ideas in physics and mathematics to originate humbly, in (what Scott calls) &#8220;applied engineering&#8221;.  <i>Shtetl Optimized</i> readers are invited to consult Nathaniel Bowditch&#8217;s <i>New American Practical Navigator</i> of 1807 for a startlingly modern exposition of the key principles of differential geometry:<br />\n<blockquote>In sailing on [any course] the surface of the globe may be supposed to be divided into an indefinite number of small surfaces, as square miles, furlongs, yards, &c. which on account of their smallness, in comparison with the whole surface of the earth, may be esteemed as plane surfaces, and the difference of latitude and departure (or meridian distance) made in sailing over each of these surfaces, may be calculated by the common rules of Plane Sailing, and by summing up the all the differences of latitude and departures made on these different planes, we shall obtain the whole difference of latitude  and departure nearly.&#8221;</p></blockquote>\n<p>A subsequent generation of geometers (Gauss, Bolyai, Lobachevsky, Riemann, etc.) merely formalized the non-Euclidean mathematical concepts and efficient computational algorithms that Bowditch (a fanatical educator) had <i>already</i> communicated to tens of thousands of common sailors.</p>\n<p><b>Conclusion</b>&nbsp; The doors <i>already</i> stand wide-open for 21st century researchers to <strike>radically</strike> pragmatically and routinely &#8220;get&nbsp;rid even of the amplitudes in quantum mechanics.&#8221; </p>\n<p><b>Conclusion</b>&nbsp; In researchers like Carlton Caves and Howard Carmichael, the 21st century quantum research community <i>already</i> has its Nathaniel Bowditches&nbsp;&hellip; as a vigorous cohort of &#8220;tensor practitioners&#8221; (in Joseph Landsberger&#8217;s kindly phrase) who  <i>already</i> are embracing radically post-Hilbert quantum mathematical ideas in service of pragmatical engineering objectives.  </p>\n<p>Our 21st century&#8217;s Carl Gauss, János Bolyai, Nikolai Lobachevsky, and Bernhard Riemann of (post-Hilbert) quantum dynamics have not yet appeared on-stage&nbsp;&hellip; but surely we can appreciate Gil Kalai as her/his/their prophet!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-01-21 23:32:15+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>&#8220;I thing therefor I am?&#8221;</p>\n<p>Despite the beautiful preview function I still manage to make spelling mistakes &#8230;</p>\n]]>", "author": "quax", "published": "2014-01-22 07:43:37+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>quax #110: No, I meant what I said.  As I explained in the post, there&#8217;s currently no evidence for ANY speedup of the D-Wave Two over a decent classical algorithm, regardless of its source (slightly outperforming simulated annealing on an unpredictable 10% of instances is totally consistent with the &#8220;random noise&#8221; you&#8217;d see were one classical heuristic compared against another).  Furthermore, it seems to me that a quantum speedup WILL ultimately be needed, because that&#8217;s the only kind that will be non-ephemeral and Troyer-resistant.</p>\n]]>", "author": "Scott", "published": "2014-01-22 08:26:07+00:00", "title": "By: Scott"}]