[{"content": "<![CDATA[<p>pretty much like bitcoin mining, isn&#8217;t it?</p>\n]]>", "author": "Giulio", "published": "2018-05-02 14:01:12+00:00", "title": "By: Giulio"}, {"content": "<![CDATA[<p>There should be a book, &#8220;Failed attempts at quantum algorithms&#8221;.</p>\n<p>It would apply basic quantum techniques to well-known problems, even when they don&#8217;t provide any advantage.</p>\n<p>Like my O(n!) quantum solver for Graph Isomorphism. Bet you want to know more about it.</p>\n<p>It&#8217;s impractical, useless. But&#8230; it&#8217;s a direct application of quantum interference to a familiar problem.</p>\n]]>", "author": "Job", "published": "2018-05-02 21:06:11+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>Job #125:</p>\n<ul>Like my O(n!) quantum solver for Graph Isomorphism. Bet you want to know more about it.</ul>\n<p>Just in case this is useful data for you: I don&#8217;t. 😀</p>\n]]>", "author": "Scott", "published": "2018-05-03 03:44:07+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I disagree with Caplan for rather the opposite reason as you, <b> Scott</b>.  My vision of &#8216;educational reform&#8217; consists more of rolling tumbrels and nice shiny guillotines being erected&#8230;</p>\n<p>  Okay, hyperbole aside, there are two things about the current system that bring out my inner Saint Just.    The first is how it shores up the class system, the second is the abomination called the &#8220;PhD&#8221;.  </p>\n<p>Just to take the easy one first, the number of people I know who have done PhDs and have just been chewed up by the system &#8211; and, yes, these are STEM PhDs &#8211; and produced little or nothing is ludicrous.  When you take the smartest and most driven people on the planet and work them like dogs, and still get so little out &#8211; <i> something has gone wrong</i>.  What that something is, is the disconnect between the number of tenured positions and the number of postgrads.  Less than 1% of postgrads ever make prof.  So what happens is too many young minds get mauled by psycho careerists.  Here, read this and see how many people agree with it:</p>\n<p><a href=\"http://blog.devicerandom.org/2011/02/18/getting-a-life/\" rel=\"nofollow\">http://blog.devicerandom.org/2011/02/18/getting-a-life/</a></p>\n<p>There&#8217;s a really good reason  that all, repeat, <i>all</i> the people I know in my field (biology) doing good, innovative work decided to drop out and start up.</p>\n<p>The even worse case is how the University as an institution shores up the <b>class system</b>.  A good working definition of a class system is that it&#8217;s more important who you know than what you can do (I&#8217;m drawing on Isabell Patterson&#8217;s distinction between the Society of Status vs the Society of Contract).  I&#8217;m a beneficiary of some pretty elite universities and I studied STEM.  What I got to see, over and over, was people who didn&#8217;t study this or didn&#8217;t study at those universities assured that &#8220;a career&#8221; was waiting for them just by virtue of &#8220;having a degree&#8221;.  And then come graduation it was &#8220;thanks for the cash, here&#8217;s your worthless paper, enjoy working at Starbucks&#8221;.  </p>\n<p>This isn&#8217;t those poor students fault.  They&#8217;d been systematically given false information their entire lives.  If any other industry pulled a stunt on this scale, we&#8217;d have the greatest lawsuit in history.  Yet because it is &#8220;education&#8221;&#8230;</p>\n<p>Anyway, I look at Germany where I know many people who went straight into apprenticeships after school, are now running their own offices and owning their own homes.  Please tell me that&#8217;s not better than the fate of the 20-something sociology student in the US.  The scandal isn&#8217;t the waste of money but the far worse waste of people.</p>\n<p>  Since you&#8217;re teaching <b>Computer Science</b> let me say that CS is the exception that proves the rule&#8230; but the rule survives the proving with ease.  See, your field is way closer to the way formal, theoretical education got started in the Renaissance (c.f. Jacques Barzun, <i>From Dawn To Decadence</i>).  What happened was that different guilds got together to compare notes, and started working out larger theoretical systems that let them do better and better.  The point is they were teaching theoretical knowledge to people who already had vast amounts of practical experience &#8211; and so could actually make good use of the theoretical knowledge, could embody it in their work.  That seems similar to what you&#8217;re doing &#8211; many of your students will surely have prior coding experience, and all will be constantly gaining it.  So don&#8217;t worry: come the revolution, the howling mob will be sparing your department.</p>\n<p>My tuppence.  I&#8217;ll have to take a look at Caplan&#8217;s book.</p>\n]]>", "author": "Prussian", "published": "2018-05-03 07:32:15+00:00", "title": "By: Prussian"}, {"content": "<![CDATA[<blockquote><p>So I have the same skepticism of Caplan’s project that I’d have (ironically) of Bolshevism or any other revolutionary project.  I say to him: don’t just persuade me, show me</p></blockquote>\n<p>As regards apprenticeships, I would strongly suggest Germany as a good model.  </p>\n<p>Just on this though:</p>\n<blockquote><p>In the first tier, I simply want the Democrats to vanquish the Republicans, in every office from president down to dogcatcher,</p></blockquote>\n<p>You do realize, you&#8217;re talking about a One Party State, right? </p>\n<blockquote><p>&#8230;n order to prevent further spiraling into nihilistic quasi-fascism&#8230;</p></blockquote>\n<p>I don&#8217;t think those words mean what you think they mean.</p>\n]]>", "author": "Prussian", "published": "2018-05-03 07:48:51+00:00", "title": "By: Prussian"}, {"content": "<![CDATA[<p>Prussian #127:</p>\n<ul>Less than 1% of postgrads ever make prof.</ul>\n<p>Uh, source???  Where did you get that stat?  We actually track these things, and at least in strong CS grad programs, I believe the figure is somewhere around 40-50%.  And of the remaider, not all even wanted academic positions.  It would be wonderful if we had more tenure-track positions to be offered, but the situation (at least in CS) isn’t nearly as dire as you say.</p>\n]]>", "author": "Scott", "published": "2018-05-03 10:34:16+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Source:</p>\n<p><a href=\"https://royalsociety.org/~/media/Royal_Society_Content/policy/publications/2010/4294970126.pdf\" rel=\"nofollow\">https://royalsociety.org/~/media/Royal_Society_Content/policy/publications/2010/4294970126.pdf</a></p>\n<p>The Royal Society </p>\n<p>I&#8217;ve done some reading around and seen that in the US, it&#8217;s better &#8211; but then, professor means something different over there.</p>\n]]>", "author": "Prussian", "published": "2018-05-03 12:50:17+00:00", "title": "By: Prussian"}, {"content": "<![CDATA[<p>Prussian #128: I have the impression that the European education systems are very different compared to the US system. You don&#8217;t have debt, but your time gets wasted. You don&#8217;t have to be a genious, but your later career after university will probably be in the private sector, or at least not publicly founded. They have good and bad aspects, get changed from time to time with various (political) goals and various success, and are an integral part of the political agenda of the respective countries.</p>\n<p>You probably disagree with my summary of the European systems, but my point is that the US system is probably very different from them, independent of how you would characterize them. And the current moment is probably not a good one for reforming the US system, given the goals of the current US gouvernment.</p>\n]]>", "author": "gentzen", "published": "2018-05-03 17:22:35+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>It would be interesting to know if a DD214 is valued as much by employers as a college degree.  Successful completion of four years of active duty military service demonstrates  &#8220;conscientiousness and conformity.&#8221; at least as well as four years of college.  Whether it demonstrates intelligence as well is another issue.  The willingness of my employer to hire veterans without college degrees for the same positions as non-veterans with degrees  suggests it does, but perhaps my employer is not typical.</p>\n]]>", "author": "Michael Murden", "published": "2018-05-04 17:00:30+00:00", "title": "By: Michael Murden"}, {"content": "<![CDATA[<p>I didn&#8217;t read the whole post, but am really curious what some of these results of Mumford, Connes, and the like that you had an aha moment about are! I, for one, would like to plan for 2130 🙂</p>\n]]>", "author": "Noah", "published": "2018-05-04 19:20:25+00:00", "title": "By: Noah"}, {"content": "<![CDATA[<p>Noah #133: See comment #99 above.</p>\n]]>", "author": "Scott", "published": "2018-05-05 10:22:33+00:00", "title": "By: Scott"}]