[{"content": "<![CDATA[<p>Vincent #35 </p>\n<p>Seconded.</p>\n]]>", "author": "John Stricker", "published": "2018-11-09 21:16:34+00:00", "title": "By: John Stricker"}, {"content": "<![CDATA[<blockquote><p>The point of using a small-scale programmable QC for quantum supremacy experiments is that, if it works, it should address every one of the issues above.</p></blockquote>\n<p>There&#8217;s also this implied requirement that the QS experiment outperform even the largest classical computers available, brute force or not.</p>\n<p>On the surface it seems reasonable to demand that, but it stretches the experiment to such an extent that the outcome becomes way too statistical. And for what?</p>\n<p>With 52 qubits you could run Simon&#8217;s algorithm on 25-bit functions. It tests large-scale interference and the results can be conclusively verified. If a machine can do that, it&#8217;s a quantum computer.</p>\n<p>You can even stick a random classical circuit in front of the input function, it will still work.</p>\n<p>But i guess 2^25 is easily within reach of classical computers, so somehow it&#8217;s not compelling even though asymptotically the classical algorithm is provably much slower?</p>\n<p>I don&#8217;t understand that.</p>\n]]>", "author": "Job", "published": "2018-11-09 22:28:54+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>@Scott#40- No, the original purpose of the Senate was to favor small states, not slave states. Wikipedia has a map of the 1792 election:<br />\n<a href=\"https://en.wikipedia.org/wiki/United_States_presidential_election,_1792\" rel=\"nofollow\">https://en.wikipedia.org/wiki/United_States_presidential_election,_1792</a><br />\nThe number of electors roughly correspond to the population of the states. Both the North and the South have small and large states- the North has New York with 12 and Pennsylvania with 15, the South has Virginia with 21 and North Carolina with 12. And similarly, when it comes to small states, the North has Vermont with 3 and the South has Georgia with 4.<br />\nNor was the Senate intended to favor rural states. As late as 1800, only 6% of the population of the United States was urban:<br />\n<a href=\"https://www.seniorliving.org/history/1800-1990-changes-urbanrural-us-population/\" rel=\"nofollow\">https://www.seniorliving.org/history/1800-1990-changes-urbanrural-us-population/</a><br />\nThe Senate was originally intended to favor small states- it was needed to get the smaller states to sign on to the Constitution. There WERE parts of the Constitution that favored the slave states- the Three Fifths Compromise, for example- but the Senate wasn&#8217;t one of them.</p>\n]]>", "author": "Michael", "published": "2018-11-10 01:34:12+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Michael #52:</p>\n<p>(Your comment wasn&#8217;t in reply to me, but I also made this mistaken claim, so&#8230;)</p>\n<p>It seems you&#8217;re right.  I thought I remembered reading something arguing that despite conventional wisdom it was actually about slavery, but, um, it seems I just completely misremembered and that reference does not exist.  Looks like the conventional wisdom is correct here.  My mistake.</p>\n]]>", "author": "Sniffnoy", "published": "2018-11-10 08:48:23+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Oh!  I think I know what mistake I was making.  I was getting the senate confused with the electoral college.  It&#8217;s commonly said that the electoral college is about helping small states, but in reality it actually had more to do with helping slave states.  The senate, though, really was about the small states, contrary to what I said above.  Oops.</p>\n]]>", "author": "Sniffnoy", "published": "2018-11-10 09:14:33+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>fred 46: that&#8217;s not how politics works. The optimal positioning in a two-party system is epsilon to the left and right of wherever the mean voter is. So if you change the rules to shift that center, the parties will just shift along with it.</p>\n]]>", "author": "Jelmer Renema", "published": "2018-11-10 10:40:34+00:00", "title": "By: Jelmer Renema"}, {"content": "<![CDATA[<p>Who is/was David J. Bruton? I see that you are David J. Bruton Centennial Professor of Computer Science, but why is a professorship named after that person? I first thought he was some sort of Knuth-level computer scientist I had never heard of somehow, but the only thing I can find on Google is references to you.</p>\n]]>", "author": "Andrei", "published": "2018-11-10 13:22:00+00:00", "title": "By: Andrei"}, {"content": "<![CDATA[<p>Andrei #56: David J. Bruton made a substantial donation to UT (isn’t that the most common way to get your name on a professorship?).  I believe there are several other David J. Bruton Professors on campus.</p>\n]]>", "author": "Scott", "published": "2018-11-10 15:10:11+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Slave-vs-small-staters: I stand corrected, thanks!</p>\n]]>", "author": "Scott", "published": "2018-11-10 15:11:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>On #10, obviously you and the American Jewish community have my deepest sympathies. Antisemitism, and in particular murderous Antisemitism, has no place in my worldview and has no place in a civilized society. I must note that the killer in the Pittsburgh massacre was a Trump hater and that Trump has a daughter who converted to Judaism because of her husband and gave Trump three Jewish grandchildren. Trump has also been the best friend Israel has had in the White House in decades, finally having the courage to move the US embassy from Tel Aviv to Jerusalem. I am not sure why the massacre should be blamed on Cruz or Republican politicians when you have the Democratic establishment that has not fully distanced itself from avowed Jewish hater Louis Farrakhan.</p>\n<p>On #1, I think that Democrats overplayed their hand with Kavanaugh. Until then, the midterms of 2018 were headed to being classic &#8220;the party not holding the White House mobilizing its base to show their opposition at the polls&#8221;. The treatment Kavanaugh received -that we now know included two women who are on record acknowledging that they made up the charges- prompted many Republicans who were not particularly excited about the midterms to vote. The result is the midterm election with the highest voter turnout since 1966: a mixture of pissed off base Democrats (that was expected) and pissed off base Republicans (many of whom, including yours truly, would not have come out to vote had it not been because of the vicious treatment Kavanaugh received).  I also find very ironic that many Democrats were celebrating the historic expected turnout in 2018 before the night of the election expecting that the high participation was going to be a &#8220;blue wave&#8221; and instead got pissed off Republicans who got out to vote to show their displeasure with &#8220;the Resistance&#8221;. These Democrats would be well served by watching outlets different than CNN. Even MSNBC is fairer these days than the CNN echo chamber.</p>\n]]>", "author": "the problem of the gatkeepers", "published": "2018-11-10 20:12:09+00:00", "title": "By: the problem of the gatkeepers"}, {"content": "<![CDATA[<p><a href=\"#comment-1792688\" rel=\"nofollow\">Sniffnoy 51</a>:</p>\n<blockquote><p>the key point about the South wasn’t so much that it was low in population, so much as that it was low in <em>free</em> population</p></blockquote>\n<p>You seem to have retracted your comments based on this factual claim in response to evidence that doesn&#8217;t actually contradict it (although some that renders it moot). But the claim is false. In the <a href=\"https://en.wikipedia.org/wiki/1790_United_States_Census#Data\" rel=\"nofollow\">1790 census</a>, Virginia had the largest free population (although below MA+ME).</p>\n<p><a href=\"#comment-1792745\" rel=\"nofollow\">54</a>, In what sense does the electoral college help slave states? It&#8217;s just a compromise between the House and the Senate. Those institutions do what they do, but the College doesn&#8217;t add anything to it. [I assume you mean electoral <em>votes</em>, rather than Electors. I wish people would say which aspect they mean, rather than complaining about the EC in toto.]</p>\n]]>", "author": "Douglas Knight", "published": "2018-11-11 16:48:49+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Scott #57: Thank you for your quick answer!</p>\n]]>", "author": "Andrei", "published": "2018-11-11 17:04:33+00:00", "title": "By: Andrei"}, {"content": "<![CDATA[<p>Sniffoy,</p>\n<p>I&#8217;m aware of the differences between the House and the Senate.</p>\n<p>But my point about an ideal 50/50 alternation in a two party system holds for the Senate as well.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Party_divisions_of_United_States_Congresses#Partisan_control_of_Congress\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Party_divisions_of_United_States_Congresses#Partisan_control_of_Congress</a></p>\n<p>Party \tSenate \tHouse \tPresidency<br />\nDemocratic \t50 \t57 \t44<br />\nRepublican \t42 \t36 \t45 </p>\n<p>I think that this 50/50 alternation is not as much of a result of the specific rules, but a reflection of history being cyclical: we have generational reset and the fact that results aren&#8217;t all that different based on who&#8217;s in power.</p>\n]]>", "author": "fred", "published": "2018-11-11 19:58:35+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>But why today?  Surely we shouldn&#8217;t have substantially raised our prob that a given synagogue would be shot up any day.</p>\n<p>Uggh, I really hated that aspect of living in Israel.  Not particularly the security (it&#8217;s rare outside airports) but the willingness of everyone to just come up and challenge your right to be somewhere.  I kinda liked the willingness to but in and offer unsolicited advice but I when it is realized as a challenge to your belonging it&#8217;s the ugly part.</p>\n<p>Of course native Israelis didn&#8217;t even seem to blink when some religious zealot yelled at them on the street for a skirt above the knee so this is just prob my cultural background speaking up.</p>\n]]>", "author": "Peter Michael Gerdes", "published": "2018-11-11 20:18:15+00:00", "title": "By: Peter Michael Gerdes"}]