[{"content": "<![CDATA[<p>Congratulations to you and Dana!  MIT&#8217;s loss is Austin&#8217;s gain, I&#8217;ll be sure to come visit soon!</p>\n]]>", "author": "Daniel Harlow", "published": "2016-02-28 12:41:10+00:00", "title": "By: Daniel Harlow"}, {"content": "<![CDATA[<p>Ad maiorem &#8211; congratulations on this appointment 😀</p>\n<p>Do you have prior administrative experience running such a center and if not, (how) are you preparing ?</p>\n]]>", "author": "Daniel", "published": "2016-02-28 12:48:18+00:00", "title": "By: Daniel"}, {"content": "<![CDATA[<p>Hate to hear this in some ways, but then I&#8217;ve always heard great things about Austin&#8230; so, CONGRATS!!<br />\nHere&#8217;s hoping you run for governor one day and reform the rest of that friggin&#8217; state (I mean before they vote to secede) 😉</p>\n]]>", "author": "Shecky R", "published": "2016-02-28 12:54:06+00:00", "title": "By: Shecky R"}, {"content": "<![CDATA[<p>Congratulations to both. Excellent articulation and dissection of the pros and cons of any faculty move. The best of success for your new adventure. I have never been in Austin. It is likely I will eventually visit given the academic traveling salesman aspect of our lives and if so, let&#8217;s have a cold one over there. I will stop by the MIT group meeting also to say hi before you pack your boots <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "Alan Aspuru-Guzik", "published": "2016-02-28 12:58:02+00:00", "title": "By: Alan Aspuru-Guzik"}, {"content": "<![CDATA[<p>Congratulations!</p>\n<p>As a Texan, I salute you and welcome you to our state.</p>\n<p>Though, as I live in NYC, I won&#8217;t be able to give you the welcome you deserve.</p>\n<p>My mother did her Ph.D. at UT Austin, and my dad did his Masters after he got back from WW2. It&#8217;s a great school, and I think you will enjoy your time there.</p>\n<p>If you ever accidentally find yourself in the Waco area, look my family up. They would be happy to entertain you on their farm, and who knows, maybe I might be visiting.</p>\n<p>I&#8217;ve been reading your blog for quite a long time now, and I think that your moving here is probably the best thing to happen to Texas since I left.</p>\n<p>Many Mozels. I hope to get down to Austin and take you out to lunch in the near future.</p>\n]]>", "author": "ianamartin", "published": "2016-02-28 13:16:07+00:00", "title": "By: ianamartin"}, {"content": "<![CDATA[<p>Congratulations to you and Dana!</p>\n<p>This is a huge loss for the Cambridge theory community, but I am happy for you. </p>\n<p>Whenever you feel that the good weather in Austin is making you grow soft, you&#8217;re very welcome to come visit us at Harvard.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barak:Boaz.html\">Boaz Barak</a>", "published": "2016-02-28 13:41:38+00:00", "title": "By: Boaz Barak"}, {"content": "<![CDATA[<p>Congratulations, Scott and Dana, ll the best in this adventurous move!</p>\n]]>", "author": "Ernesto", "published": "2016-02-28 14:19:37+00:00", "title": "By: Ernesto"}, {"content": "<![CDATA[<p>I believe the telescopes quote is first due to Mike Fellows.</p>\n]]>", "author": "Historian", "published": "2016-02-28 14:19:52+00:00", "title": "By: Historian"}, {"content": "<![CDATA[<p>Congratulations to both of you on this exciting move!</p>\n]]>", "author": "Ashley", "published": "2016-02-28 14:19:56+00:00", "title": "By: Ashley"}, {"content": "<![CDATA[<p>Thanks so much, everyone!</p>\n]]>", "author": "Scott", "published": "2016-02-28 14:26:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Congratulations, Scott! It&#8217;s a loss for MIT but good luck with life and research in Austin!</p>\n]]>", "author": "David", "published": "2016-02-28 14:48:26+00:00", "title": "By: David"}, {"content": "<![CDATA[<p>What a loss for Cambridge. We&#8217;ll miss you here. But so be it. Go west, young man. Or go south by southwest. We&#8217;re counting on you to create an enclave of sweet reason deep in the heart of . . . Please make Texas safe for TCS.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2016-02-28 14:50:18+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>Congrats. As I went to grad school in Austin, I can confirm that all the great things you heard about Austin are correct.</p>\n]]>", "author": "Moshe", "published": "2016-02-28 15:35:19+00:00", "title": "By: Moshe"}, {"content": "<![CDATA[<p>Good luck Scott and have a wonderful start. I loved the post. I did my kindergarten in San Antonio TX and I can&#8217;t say I loved it but last year I visited there twice because of JMM and March meeting and it was \\infty-ly better. Now Austin has always been known as a much better city. So I infer it must be excellent to live there now😀 Weinberg being around is very inspiring too. Wish y&#8217;all the best !</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Movassagh:Ramis.html\">Ramis Movassagh</a>", "published": "2016-02-28 15:38:24+00:00", "title": "By: Ramis Movassagh"}, {"content": "<![CDATA[<p>Congratulations! Sorry to hear that we&#8217;ll be missing you at Michigan, but Austin is a great alternative.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Speyer:David.html\">David Speyer</a>", "published": "2016-02-28 16:01:43+00:00", "title": "By: David Speyer"}, {"content": "<![CDATA[<p>Congratulations Scott and Dana!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Roberts:Dan.html\">Dan Roberts</a>", "published": "2016-02-28 16:03:48+00:00", "title": "By: Dan Roberts"}, {"content": "<![CDATA[<p>Brian #13:</p>\n<ul>Please make Texas safe for TCS.</ul>\n<p>I assure you, UT Austin is already one of the safest places anywhere for TCS.  Now it just needs to be made safe (or safe again) for quantum information.</p>\n]]>", "author": "Scott", "published": "2016-02-28 17:02:26+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Hey congrats Scott, this was completely unexpected.  Keep us informed about nerd culture in Austin!</p>\n<p>I hope the gun thing doesn&#8217;t get to you.  UT&#8217;s gun policy is actually quite restrained compared to Berkeley and CMU:</p>\n<p><a href=\"http://www.cs.cmu.edu/~hgobioff/public/random_stuff/weapons\" rel=\"nofollow\">http://www.cs.cmu.edu/~hgobioff/public/random_stuff/weapons</a></p>\n<p>😉</p>\n]]>", "author": "asdf", "published": "2016-02-28 17:07:47+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>Congratulations on the new position!</p>\n]]>", "author": "D. Eppstein", "published": "2016-02-28 17:41:44+00:00", "title": "By: D. Eppstein"}, {"content": "<![CDATA[<p>Congratulations!</p>\n<p>BTW<br />\n>> computer science is no more about computers than astronomy is about telescopes</p>\n<p>So why not change it to &#8216;computation science&#8217; or something like that?</p>\n]]>", "author": "wolfgang", "published": "2016-02-28 18:11:36+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Well dang!  Congrats to both of you!  You should look forward to SXSW.  Heck, I might just have to drag you to it. 😉</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Shaw:Bilal.html\">Bilal Shaw</a>", "published": "2016-02-28 18:27:17+00:00", "title": "By: Bilal Shaw"}, {"content": "<![CDATA[<p>Congratulations on the move! UT has had a great theory group and it&#8217;s now even better.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arora:Sanjeev.html\">Sanjeev Arora</a>", "published": "2016-02-28 18:30:50+00:00", "title": "By: Sanjeev Arora"}, {"content": "<![CDATA[<p>Daniel #3:</p>\n<ul>Do you have prior administrative experience running such a center and if not, (how) are you preparing ?</ul>\n<p>I have zero such experience and am doing nothing to prepare.</p>\n<p>Anyone who teaches a large undergrad course, or has to fund a group of grad students and postdocs, is forced kicking and screaming to obtain <i>some</i> administrative experience, but that&#8217;s all I&#8217;ve got.  In any case, the Austin quantum information center won&#8217;t start out as much more beyond me, my students, my course, and a website.  My hope is that it will expand later (but still not to the scale of, say, Waterloo&#8217;s IQC or Caltech&#8217;s IQIM).</p>\n]]>", "author": "Scott", "published": "2016-02-28 18:37:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>YEE-HAW!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/Preskill:John.html\">John Preskill</a>", "published": "2016-02-28 19:07:05+00:00", "title": "By: John Preskill"}, {"content": "<![CDATA[<p>Congrats, and enjoy Austin! As someone who recently graduated out of the high-energy theory group at UT, I can say sincerely that I wish you had made this move a decade ago: many of us were quite regretful about the derth of QC/QI people there, and it always felt really odd that such a big place barely had anyone working on that stuff.</p>\n]]>", "author": "Dan Carney", "published": "2016-02-28 19:21:19+00:00", "title": "By: Dan Carney"}, {"content": "<![CDATA[<p>Ha! MIT fire Scott Aaronson, not in a million years in any of the many worlds. What a notion, I&#8217;m sure CSAIL is devastated.</p>\n<p>On the other hand, major congratulations to Scott, Dana, and especially UT Austin computer science.</p>\n<p>About this Quantum Computing Center: Any interest in quantum logics and quantum programming? Seems like the top people in these areas are pretty spread out (modulo maybe the people at Oxford and Radboud) it would be really nice to see a coherent group somewhere in these United States. Though I suspect you&#8217;re hiring in quantum complexity at the moment?</p>\n]]>", "author": "Rand", "published": "2016-02-28 20:13:16+00:00", "title": "By: Rand"}, {"content": "<![CDATA[<p>Congratulations Scott! Welcome to the South!</p>\n]]>", "author": "Dylan McKay", "published": "2016-02-28 20:37:13+00:00", "title": "By: Dylan McKay"}, {"content": "<![CDATA[<p>Congratulations to UT Austin for getting you brilliant couple (and Lily too, if, as I conjecture, she is going to enroll to UT Austin next year), and congrats to you three for what looks like a perfect environment for a great scientific and personal adventure.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2016-02-28 20:40:37+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Please accept my sincere congratulations&nbsp;&hellip; you are precisely the right person (as it seems most folks including me) to lead a new quantum computing initiative.  It will be tons of fun to see what new quantum chicks fledge from the University of Texas&#8217; new research nest; it&#8217;s not an opportunity that a committed quantum researcher could easily pass up.</p>\n<p>As for you and Dana being personally happy in Austin, Texas&nbsp;&hellip; well&nbsp;&hellip;  the same university that proudly graduated psychology student <a href=\"https://www.youtube.com/watch?v=kEbdle400Tc\" rel=\"nofollow\">Richard Samet Friedman</a> in 1966, and the same state that gave proudly gave gubernatorial candidate Friedman 12% of its votes in 2006,  surely can accommodate the creative energies of the Aaronson family without excessive strain! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "John Sidles", "published": "2016-02-28 21:02:19+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Congratulations Scott and Dana!  And to UT Austin for their success in recruiting you both.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hazan:Elad.html\">Elad Hazan</a>", "published": "2016-02-28 21:45:48+00:00", "title": "By: Elad Hazan"}, {"content": "<![CDATA[<p>Welcome to Texas! As a former Bay Stater (although I left 40 years ago), I can say I think you&#8217;ll enjoy being here. As many of us transplants say, &#8220;I wasn&#8217;t born in Texas but I got here as soon as I could.&#8221; And, you may find yourself starting to form some &#8220;conservative&#8221; views, because from my perspective they mostly derive from common sense and knowledge of history. You&#8217;ll hear both from many Texans you meet. Keep in mind that that pot of money that got you here was created by the actions of people like Rick Perry and Greg Abbott.</p>\n<p>A couple of other things. As an honest scientist, you owe it to yourself to spend some time researching both sides of the arguments about &#8220;climate change.&#8221; I have, and am convinced that (1) the science is clearly not settled, and (2) the whole area has been co-opted by politicians for reasons other than pursuing objective scientific results. About gun control, I admit that guns make me nervous because of their destructive power. However, the idea that an overbearing government possesses guns and the citizenry do not makes me more nervous. Finally, what seems to me obvious common sense: how is it that a sign saying &#8220;gun free zone&#8221; can be other than an open invitation to some sicko who wants to murder a group of innocents? The sicko isn&#8217;t going to stop because some law says he can&#8217;t own a gun&#8230;.</p>\n]]>", "author": "Rick Mayforth", "published": "2016-02-28 21:52:22+00:00", "title": "By: Rick Mayforth"}, {"content": "<![CDATA[<p>Now we&#8217;re never going to get you up to Orono. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/frownie.png\" alt=\":(\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> </p>\n<p>My own selfish motivations aside, congratulations to both you and Dana!</p>\n]]>", "author": "Joshua Zelinsky", "published": "2016-02-28 22:19:56+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Congrats Scott and Dana! Texas is lucky to have you both!</p>\n]]>", "author": "Daniel", "published": "2016-02-28 22:54:16+00:00", "title": "By: Daniel"}, {"content": "<![CDATA[<p>Rand #27:</p>\n<ul>About this Quantum Computing Center: Any interest in quantum logics and quantum programming? Seems like the top people in these areas are pretty spread out</ul>\n<p>It seems to me that quantum logics and quantum programming <i>do</i> have a center, and that center is Oxford!  I confess that these are never things that resonated with me personally, though I remain ready to be converted by something spectacular being done in those areas, or even just by a really juicy open problem.</p>\n<p>As for hiring at UT: what I know at this point is that<br />\n(1) the CS and ECE departments will both be doing searches for quantum information faculty within the next several years (the physics department will be deciding on its hiring priorities at a future time; of course I hope that they&#8217;ll join);<br />\n(2) I&#8217;m obviously very far from the only person who will have input into the process;<br />\n(3) to whatever extent I <i>do</i> have input, I&#8217;ll be interested in spectacular researchers from all parts of quantum information science, not just the parts close to my own interests (like complexity theory)&#8212;clearly it&#8217;s better to have faculty that complement rather than duplicate each other;<br />\n(4) theorists are obviously easier in terms of not needing expensive equipment or lab space, but <i>if</i> an opportunity arose to hire a spectacular quantum computing experimentalist, I&#8217;d try to make a case for that within UT.</p>\n]]>", "author": "Scott", "published": "2016-02-28 23:44:32+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott:</p>\n<p>I&#8217;ve always been a bit curious about Weinberg and his move to UT. Of course his situation is rather different than yours, since he moved when he was nearly 50, and you haven&#8217;t even hit middle-age yet. Do you know why Weinberg basically failed to do anything of note once he moved to Texas? Certainly nothing near what he achieved when he was at Berkeley and Harvard. I would have imagined that Weinberg&#8217;s move to Texas and his subsequent complete lack of productivity would have made you more skeptical about a move to Texas, not less! What is your thinking on this?</p>\n]]>", "author": "bigjon", "published": "2016-02-28 23:41:58+00:00", "title": "By: bigjon"}, {"content": "<![CDATA[<p>John Preskill #25:</p>\n<ul>YEE-HAW!</ul>\n<p>Thanks! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" />  As it happens, &#8220;yee-haw&#8221; was the subject line of my email to Bruce Porter (UT&#8217;s CS department chair) and others, announcing our acceptance of UT&#8217;s offer.  But after receiving thoughtful feedback from our new UT colleagues (&#8220;that&#8217;s the first &#8216;yee-haw&#8217; I&#8217;ve encountered since moving here, though &#8216;y&#8217;all&#8217; is a different story&#8221;), I had second thoughts about it: like, would I announce my move to an Italian university with &#8220;mamma mia,&#8221; or to Oxford with &#8220;hellloooo, I shall joinest thee for scones and tea&#8221;?  So I scrupulously made this post yee-haw-free.  Even so, my inner 9-year-old is delighted that someone as respectable as yourself has now yee-hawed the comments&#8230;</p>\n]]>", "author": "Scott", "published": "2016-02-29 00:02:59+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Congratulations on the decision to move! I know you put them further down on your list, but I think that reasons #7 and #8 will give the biggest benefits in the long run. I would caution against skipping grades solely for academic reasons though. While some children may be there academically, the asymmetry in social skills and maturity can end up holding a student back. There are other ways to accelerate and enhance an education without just pushing them forward. Did the schools you talk to mention any of these?</p>\n<p>&#8220;I feel the need to say this because, within the last year, I’ve spent hundreds of miserable hours scrolling through social media threads wherein stranger after stranger proclaimed me basically the world’s worst scum (tied, perhaps, with the other Scott A.), and even called on MIT to fire me.&#8221;</p>\n<p>That&#8217;s an awful lot of research hours that were rudely stolen by internet trolls and their drama. Since you realize that it didn&#8217;t really matter, does this mean you will stop feeding the trolls?</p>\n]]>", "author": "Anonymous", "published": "2016-02-29 00:12:51+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>Wow! Wonderful news! Hearty congratulations to all three of you on the move Scott!! I visited Dallas in December for my brother-in-law&#8217;s graduation from SMU and I loved the city. I hope to visit Austin sometime in the future.</p>\n<p>Congrats again!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Adluru:Nagesh.html\">Nagesh Adluru</a>", "published": "2016-02-29 00:19:02+00:00", "title": "By: Nagesh Adluru"}, {"content": "<![CDATA[<p>Scott&#8230;what to say? I thought then with MIT you reached the top but it was not true! You really deserve it: I never saw a person with  more passion for his research subject like you.<br />\nAll the best,<br />\nK.</p>\n]]>", "author": "Anon", "published": "2016-02-29 01:17:17+00:00", "title": "By: Anon"}, {"content": "<![CDATA[<p>1) Congratulations to you and Dana!</p>\n<p>2) Is there a sketch of the bra-ket version of Bevo, the University of Texas Longhorn Steer mascot?  (Or were you just joking?) </p>\n<p>3) Speaking of quantum related cartoons, I believe the following one from <i>Futurama</i> is apropos: </p>\n<p>     <a href=\"http://i.imgur.com/HtsigPd.jpg\" rel=\"nofollow\">http://i.imgur.com/HtsigPd.jpg</a> .   </p>\n<p>It&#8217;s one of the show&#8217;s great jokes about parallel universes.  Namely, there aren&#8217;t an infinite number of parallel universes, but rather there&#8217;s just two: the main one we know and love and the other one which is the exact same except that everybody wears cowboy apparel.  Moreover, these two parallel universes are mutually visible to each other via coin-operated binocular viewers at the tourist rest areas at the edges of the each universe (hence the binocular frame around the picture).</p>\n<p>[P.S. Not to nerd out, and though I imagine it&#8217;s probably needless to say, but this claim about the <i>Futurama</i> multiverse is from the Season 3 episode &#8220;I Dated a Robot.&#8221; Subsequent seasons of <i>Futurama</i> introduce many more parallel universes.]</p>\n]]>", "author": "Bill Kaminsky", "published": "2016-02-29 01:27:26+00:00", "title": "By: Bill Kaminsky"}, {"content": "<![CDATA[<p>A prominent and much-honored Texan who agrees with Rick Mayforth (#32) that &#8220;climate science has been co-opted by politicians&#8221; lives in Lubbock, just up the road from Austin: she&#8217;s Texas Tech&#8217;s professor <a href=\"http://katharinehayhoe.com/wp2016/biography/\" rel=\"nofollow\">Katherine Hayhoe</a>. </p>\n<p>Yep, there&#8217;s plenty of scientific talent roamin` them Texas plains&nbsp;&hellip; and more&#8217;s a-coming!&nbsp; <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "John Sidles", "published": "2016-02-29 01:47:02+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Congratulations!  I hope that all the hours you&#8217;ve spent on science outreach via this blog contributed in some way to this great opportunity for you.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lewis:David.html\">David Lewis</a>", "published": "2016-02-29 03:11:23+00:00", "title": "By: David Lewis"}, {"content": "<![CDATA[<p>A friend of mine had already made me privy to your upcoming movement a *month ago*!</p>\n<p>By the way, I suspect that pot-belly is the foremost pernicious effect of this blog. However, the world is the better place for it (I mean the blog, not the&#8230; :P)</p>\n]]>", "author": "Arko", "published": "2016-02-29 03:56:27+00:00", "title": "By: Arko"}, {"content": "<![CDATA[<p>Yeehaw!<br />\nCongrats Scott.<br />\nWe&#8217;ll have to Shanghai you into SQUINT now.<br />\nReminds me of the good old days when I was an undergrad at UT Austin and the hired Weinberg and Wheeler. At least this time they are starting at the other end of the alphabet. </p>\n<p>Here are a 100 triva points about the mascot longhorn steers named Bevo through the ages:<br />\n<a href=\"http://news.utexas.edu/2014/08/30/100-facts-about-bevo-for-bevo-xivs-100th-win\" rel=\"nofollow\">http://news.utexas.edu/2014/08/30/100-facts-about-bevo-for-bevo-xivs-100th-win</a></p>\n]]>", "author": "Jonathan Dowling", "published": "2016-02-29 04:21:46+00:00", "title": "By: Jonathan Dowling"}, {"content": "<![CDATA[<p>Hmmm&#8230;. The <i>Daily</i> Texan! </p>\n<p>Congrats!</p>\n<p>&#8230;Honest, it was a surprise. Never thought you would ever leave MIT once you got the tenure there. &#8230; But then, who knows, it might turn out to be the best move of your career&#8230; From what I gather, David Hestenes went to the ASU and stayed put because it worked great by him; David Griffiths went to the Reed and stayed put because that&#8217;s what he wanted and it also worked great by him&#8230;. And, yes, UT has the aura of Dijkstra&#8230; </p>\n<p>People outside the TCS field remember Dijkstra best not for the shortest path or the spanning, but for the following piece (which, I am sure, you must have read already, and must have liked too):<br />\n<a href=\"https://www.cs.utexas.edu/users/EWD/transcriptions/EWD11xx/EWD1175.html\" rel=\"nofollow\">https://www.cs.utexas.edu/users/EWD/transcriptions/EWD11xx/EWD1175.html</a>. </p>\n<p>(It&#8217;s a different story that I am all for interdisciplinary efforts (and in fact for even multi-disciplinary efforts).) </p>\n<p>&#8230; Anyway, it&#8217;s nice to know that you can continue using your blog the way you like, including pointing out the snake oil as you spot it. (I have a pretty good idea of what you might pick up for the snake oil on the hardware side, but I am not so sure on the <i>software</i> side. &#8230; And how about the snake oil in the <i>TCS</i> field? Is there any? Or is it that the possibility not only does not exist but in fact <i>cannot</i>, because of the `T&#8217; in it? 😉 )</p>\n<p>Oh well&#8230; Too long a comment, once again! Congrats, once again, anyway, and all the best!</p>\n<p>&#8211;Ajit<br />\n[E&OE]</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2016-02-29 04:27:46+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Bill #41: No, I wasn&#8217;t joking about the intended logo of Austin&#8217;s quantum information center, but I could use someone with some actual graphic arts skills to help me create it!  Any volunteers??  I&#8217;m more than happy to provide a hand-drawn sketch.</p>\n]]>", "author": "Scott", "published": "2016-02-29 10:56:54+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;&#8230;[Steven Weinberg] could go wherever the hell he wanted&#8230;&#8221;. Really ? I&#8217;d love to see him apply to King Saud University or Karachi University, or a few hundred similar places. Why not discuss these exciting potential moves  during your next dinner with him ?</p>\n]]>", "author": "Attila Smith", "published": "2016-02-29 12:48:27+00:00", "title": "By: Attila Smith"}, {"content": "<![CDATA[<p>This might not be the place to ask this, but how would the grad admissions committee feel about an Australian PureMath(hons)/CS graduate with a postgrad knowledge of complexity theory, computability, model theory, set theory, etc (almost none of which are active areas of research at all anywhere in Aus <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/frownie.png\" alt=\":(\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> ) but a shaky transcript?</p>\n<p>I had resolved to just retreat to lick my wounds and come back when I&#8217;m 30-something, but this sounds like such an appealing opportunity that I couldn&#8217;t help but ask.</p>\n]]>", "author": "Greg", "published": "2016-02-29 13:02:36+00:00", "title": "By: Greg"}, {"content": "<![CDATA[<p>> I once, for example, thought about the Religious Right as<br />\n> purely contemptible, deserving only unthinking snark, and<br />\n> I was completely wrong.  Even when I was right on the<br />\n> underlying issues, I was wrong on the epistemology.  </p>\n<p>Well on you.  I grew up as fundamentalist as they come on this continent, and nothing is as tiresome as the &#8220;fundamentalists are incapable of intellectual honesty&#8221; line of argument.  It&#8217;s so much less work (not to mention more fun) to poke fun at people than it is to engage with them and possibly even change their minds.</p>\n]]>", "author": "Carey", "published": "2016-02-29 14:06:04+00:00", "title": "By: Carey"}, {"content": "<![CDATA[<p>In appreciating <i>Futurama</i>&#8216;s alternative Texas universe (of Bill Kaminsky&#8217;s comment #41), don&#8217;t overlook that universe&#8217;s poetic masterwork, <a href=\"https://tattuinardoelasaga.wordpress.com/2012/01/12/cowboy-havamal-full-text/\" rel=\"nofollow\"><i>The Cowboy Hávamál</i>.</a>  And I for one welcome our new high-plains cultural avatars!</p>\n]]>", "author": "John Sidles", "published": "2016-02-29 14:12:36+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Congrats!  I&#8217;d encourage you to create some sort of QC Visitor&#8217;s Center / Museum as part of the new establishment.  There could be guided tours and a gift shop with witty t-shirts.</p>\n]]>", "author": "Dave", "published": "2016-02-29 15:12:08+00:00", "title": "By: Dave"}, {"content": "<![CDATA[<p>Greg #49: It&#8217;s pretty much impossible to say without seeing your application, but:</p>\n<p>(1) Apply!  My advice is always to apply broadly, to any program that you think might interest you.  I&#8217;m always gobsmacked when I meet people who only applied to one or two programs&#8212;it&#8217;s the precise academic equivalent of considering yourself undateable because you&#8217;ve only asked out one person in your entire life and they said no.</p>\n<p>(2) In general, people who read PhD applications (myself included) will be looking for evidence that you can do original research.  So, it&#8217;s nothing at all like applying for undergrad admission (at least in the US); it&#8217;s not a matter of checking off bureaucratic boxes but of finding the best candidates for a job.  Thus: a &#8220;C&#8221; in theory of computation is a serious problem, whereas a &#8220;C&#8221; in political science no one really cares about.  If your school didn&#8217;t offer theory of computation, but you made the most of whatever it did offer (discrete math, etc.), that&#8217;s great, whereas if your school had great TCS opportunities that you failed to avail yourself of, that&#8217;s a concern.  And in any case, much more important than formal academics is any actual research experience that you have (or if not that, maybe practical experience in software development, etc.), and the recommendation letters that resulted from that attesting to your brilliance and creativity.</p>\n]]>", "author": "Scott", "published": "2016-02-29 15:18:27+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Attila #48: It&#8217;s funny, my first draft of this post actually said that Weinberg could go wherever the hell he wanted, except of course for Saudi Arabia or Pakistan or places like that (or presumably North Korea, though that has little to do with Weinberg being a Jewish Zionist).  But then I reflected that, if I really wanted the list to be complete, I should add that Weinberg also probably couldn&#8217;t choose to live under the ocean, or in the earth&#8217;s core, or on Neptune.  So it seemed better just to say that he could live wherever the hell he wanted, and trust readers to understand what I meant.</p>\n]]>", "author": "Scott", "published": "2016-02-29 15:27:17+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>A quantum leap in a leap year.<br />\nCongratulations!</p>\n]]>", "author": "domenico", "published": "2016-02-29 15:52:06+00:00", "title": "By: domenico"}, {"content": "<![CDATA[<p>Congratulations!<br />\nIn 2012 41% of Texans voted for Barak Obama and 58% for<br />\nRomney (I assume the rest were various third and fourth and..<br />\nparty candidates)</p>\n<p>Calling Texas `A Red state&#8217; is true, but no state is monolithic.</p>\n<p>Your post alludes to your changing your mind about the religous right (though I assume you still disagree with them).<br />\nWhat caused that? </p>\n<p>Career- sounds like a GREAT move for BOTH of you as they have strong complexity and strong quantum.</p>\n<p>Family- sounds great for Lily and hypothetical future kids!</p>\n]]>", "author": "GASARCH", "published": "2016-02-29 16:22:32+00:00", "title": "By: GASARCH"}, {"content": "<![CDATA[<p>Rick Mayforth #32: Thanks for the welcome!  Let me set aside our disagreement on climate change, since that will take over the entire thread if I allow it to and I&#8217;ve debated it many other places on this blog.  Instead I&#8217;ll take up the (to me) more interesting question of general liberalism vs. conservatism.</p>\n<p>After so much of the social-justice left was so vicious to me a year ago&#8212;after they reacted to my polite attempt to carve out some tiny space within their worldview for the problems of shy male nerds, as if I were a counterrevolutionary traitor who needed to be exiled to the labor camps&#8212;while many on the anti-PC Right came to my defense, I confess that I asked myself whether it was time simply to &#8220;come out as a conservative.&#8221;  A &#8220;conservative&#8221; who happens to disagree with the conservative positions on climate change, gun control, voter ID laws, endangered species, corporate taxes, and most other issues, but who&#8217;d been banished by his fellow liberals.</p>\n<p>But then I watch the Republican primary debates.  And I see the current leaders of three different factions of American conservatism&#8212;Marco Rubio, Ted Cruz, and Donald Trump&#8212;each vying to be the most cringe-inducing parody of himself (Trump is winning).  And I think: well, if that&#8217;s what &#8220;conservatism&#8221; is, at least that makes it easier for me; I can be absolutely certain that I&#8217;m against THAT, even if Amanda Marcotte is also against it and I&#8217;m against her.  And it&#8217;s a free country, and I&#8217;m allowed simply to continue being a capital-L enlightenment Liberal, someone who&#8217;s generally left-wing by American standards, right-wing by the standards of academia, but really just tries to consider each question on the merits and to change his mind when wrong.</p>\n]]>", "author": "Scott", "published": "2016-02-29 16:36:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Those of us in California are envious of the Texas academic support program and commitment to academic excellence.</p>\n]]>", "author": "Ivy", "published": "2016-02-29 16:49:07+00:00", "title": "By: Ivy"}, {"content": "<![CDATA[<p>Exciting news, Scott!</p>\n]]>", "author": "fred", "published": "2016-02-29 17:23:00+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>here&#8217;s a logo sketch : <a href=\"http://imgur.com/2pFWLJI\" rel=\"nofollow\">http://imgur.com/2pFWLJI</a></p>\n]]>", "author": "dunboyir", "published": "2016-02-29 17:59:24+00:00", "title": "By: dunboyir"}, {"content": "<![CDATA[<p>Anonymous #38:</p>\n<ul>That’s an awful lot of research hours that were rudely stolen by internet trolls and their drama. Since you realize that it didn’t really matter, does this mean you will stop feeding the trolls?</ul>\n<p>I hope and wish so!  I like to imagine what would happen if (for example) Bill Gates or Mark Zuckerberg felt the moral obligation to read every mean thing any commenter ever said about them in any online forum&#8212;to stop and carefully consider whether, beneath the bile and expletives and factual errors, there might be a grain of valid critique that would make them a better person if they took it to heart.  Of course, they&#8217;d never do anything else in life.  So, had they started out like that, they&#8217;d never even be in a position to be attacked in the first place.</p>\n<p>So, there&#8217;s a part of me that wants to care about online trolls as little as Gates or Zuckerberg must care about them.  But then there&#8217;s another part that&#8217;s scared of turning into the <i>kind of person</i> who doesn&#8217;t care&#8212;into a smooth, self-confident politician rather than the neurotic nerd I&#8217;ve always been.  Because it feels to me like the aspect of my makeup that wants to argue with every single person everywhere on earth who doesn&#8217;t like me&#8212;however pointless and counterproductive that might be&#8212;until we reach some sort of common understanding, is inseparable from the aspect that wants to pursue some weird technical point, like how the complexity class C/qpoly could properly contain D/qpoly even though D properly contains C, all the way to the bottom rather than just shrugging and accepting it.  And that the latter quality is responsible for everything scientifically worthwhile I&#8217;ve done.</p>\n]]>", "author": "Scott", "published": "2016-02-29 18:00:15+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>bigjon #35:</p>\n<ul>Do you know why Weinberg basically failed to do anything of note once he moved to Texas? Certainly nothing near what he achieved when he was at Berkeley and Harvard.</ul>\n<p>I indeed can&#8217;t think of much Weinberg has done since age 50&#8212;besides, like, correctly predicting that our universe should have a nonzero cosmological constant, and writing many outstanding books and <i>New York Review of Books</i> pieces.  I.e., what you or I would be proud to have as the outputs of our entire careers.</p>\n<p>But it seems to me that a prerequisite question to yours is: among the physicists who did something in their 20s or 30s such as unifying two of the four known fundamental forces, what fraction <i>did something else equally important</i> in their middle or old age?  Certainly, not Einstein, not Dirac, not Heisenberg.  At any rate, I think we&#8217;d first need to know that &#8220;base rate,&#8221; before we could even begin to consider the differential effect of living in Cambridge, MA versus Austin, TX.</p>\n<p>Having said that&#8212;as I weighed where to go, it was indeed reassuring to me that the heat, indie music, Tex-Mex food, and whatever else there is in Austin don&#8217;t seem to have prevented David Zuckerman, Adam Klivans, Sasha Sherstov, and others from doing CS theory that I&#8217;m personally familiar with and consider to be first-rate.</p>\n]]>", "author": "Scott", "published": "2016-02-29 18:11:37+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>dunboyir #60: Thanks!!  But between the horns should be a &psi; and &phi;, not my likeness. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" />  And I was thinking of a cartoon bull with eyes, nostrils, etc., not just a silhouette.</p>\n]]>", "author": "Scott", "published": "2016-02-29 18:15:38+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #61: I hope not to be repeating the obvious, or minimizing the unpleasantness of being lambasted in public, but I think you are misunderstanding a basic point about trolls: they do not care about the subject (or person) being discussed, they just want to cause people to have an emotional reaction (offended, angry, sad, etc.), as they find it funny. Therefore, trying to engage with their arguments is an exercise in futility. Of course, the nontrivial part is determining who is a troll and who is a legitimate commenter. </p>\n<p>See for example this fictitious example of Newton being trolled: <a href=\"http://i.4cdn.org/b/1456766055390.jpg\" rel=\"nofollow\">http://i.4cdn.org/b/1456766055390.jpg</a></p>\n<p>On a more pleasant subject, congratulations on your new position!</p>\n]]>", "author": "Mateus Arajo", "published": "2016-02-29 18:55:22+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Scott: &#8220;For I’ve increasingly come to the conviction that, while you might fail to find common ground with someone, you’ve got to try, you’ve got to steelman their argument and learn whatever you can from it.&#8221;</p>\n<p>I love that this notion of steelmanning is spreading; my opinion of you just went up another notch.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Horn:Kevin_S=_Van.html\">Kevin S. Van Horn</a>", "published": "2016-02-29 19:46:32+00:00", "title": "By: Kevin S. Van Horn"}, {"content": "<![CDATA[<p>Wow! What a change! All the best to you and your family with this new move.</p>\n<p>Just out of curiosity, did MIT make any sort of a counter-offer?</p>\n]]>", "author": "Ian", "published": "2016-02-29 20:40:16+00:00", "title": "By: Ian"}, {"content": "<![CDATA[<p>Ian #66:</p>\n<ul>Just out of curiosity, did MIT make any sort of a counter-offer?</ul>\n<p>Sort of!  But it was missing a key thing that Austin&#8217;s and several other places&#8217; offers had: namely, tenure for both of us.</p>\n]]>", "author": "Scott", "published": "2016-02-29 20:58:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #57. Pretty much agree. Here is my take:</p>\n<p>In the US, both Liberal and Conservative no longer have the positive aspects that they used to have. In brief:</p>\n<p>1. The title &#8220;Liberal&#8221; has been expanded to include what are traditionally called &#8220;Dingbats&#8221; and &#8220;Social Justice Warrors&#8221;, and</p>\n<p>2. The title &#8220;Conservative&#8221; has been expanded to include the traditional categories of &#8220;Dummy&#8221;, &#8220;Crazy&#8221;, &#8220;Racist&#8221;, and &#8220;A$$hole&#8221;.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-02-29 21:29:22+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Congrats! And please make sure to keep all your CS blogs and notes online. Their have helped me study more than you can ever imagine. You are now responsible for CS education around the globe, not just at MIT or UT! There is no replacement for your web presence.</p>\n]]>", "author": "venky", "published": "2016-02-29 22:02:14+00:00", "title": "By: venky"}, {"content": "<![CDATA[<p>Congratulations, and welcome to Austin! I enjoyed your colloquium in the UT Physics department a few semesters ago, and am very happy to know that you&#8217;re headed to Austin. As a theoretical high-energy physicist interested in QI/QC, I look forward to dropping in on your lectures.</p>\n]]>", "author": "Siva Swaminathan", "published": "2016-02-29 22:10:13+00:00", "title": "By: Siva Swaminathan"}, {"content": "<![CDATA[<p>&#8220;like how the complexity class C/qpoly could properly contain D/qpoly even though D properly contains C, &#8221;</p>\n<p>Do you actually have examples of C and D which do this?</p>\n]]>", "author": "Joshua Zelinsky", "published": "2016-03-01 01:55:34+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>scott,<br />\nI&#8217;m delighted that you will be 1000 miles closer to Stanford. But what really want to know is whether it means the summer is getting any closer?</p>\n<p>Lenny</p>\n]]>", "author": "Leonard Susskind", "published": "2016-03-01 04:58:05+00:00", "title": "By: Leonard Susskind"}, {"content": "<![CDATA[<p>Congratulations Scott: good move.</p>\n]]>", "author": "Barbara Terhal", "published": "2016-03-01 06:07:42+00:00", "title": "By: Barbara Terhal"}, {"content": "<![CDATA[<p>Good luck <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>Ballsy move.</p>\n]]>", "author": "quax", "published": "2016-03-01 06:19:05+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Incidentally, Anonymous #38:</p>\n<ul>There are other ways to accelerate and enhance an education without just pushing them forward. Did the schools you talk to mention any of these?</ul>\n<p>Yes, if you mention academic acceleration at almost any school, they&#8217;ll tell you that they won&#8217;t skip but will instead give a student &#8220;enhancements&#8221; within the same grade level.  In practice, unfortunately, those &#8220;enhancements&#8221; might turn out to mean <i>even more</i> tedious make-work, exacerbating the problem rather than solving it!</p>\n<p>From my experience, I agree with you about the social and emotional difficulties of skipping.  But I&#8217;d also say that those difficulties are mostly caused by the practice&#8217;s very rarity, rather than by anything intrinsic to it.  And to whatever extent there <i>is</i> something intrinsically hard about skipping, I&#8217;d say it&#8217;s almost entirely dating-related, and probably tends to be much harder for boys like me than for girls like Lily.  (At least, women who have skipped tell me as much.)</p>\n<p>In my case, the purpose of skipping was simple: namely, to get me out of an environment where (except for a few wonderful friends, some of whom remain friends today) I was generally bullied, hated, and miserable&#8212;and to get me as quickly as possible into an environment where at least I could spend my time doing things I cared about, like math and CS, and be surrounded by other people who also cared about those things.  Skipping achieved that for me, so I&#8217;d do it again in a microsecond, <i>despite</i> all the emotional problems that it might have exacerbated or prolonged.  (After all, I was already at the bottom of the social totem pole <i>before</i> skipping, so had nowhere to go but up! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> )</p>\n<p>To be clear, I don&#8217;t want to steer Lily, or any future children we have, in a particular direction based on ideology or extrapolation from my and Dana&#8217;s own strange cases.  (Though the details were very different, involving the Open University in Israel, Dana finished her undergrad even earlier than I did, at 17.)  I just want to help my kids pursue whichever path is right <i>for them</i>.  But my experience does suggest to me that, <i>if</i> a school is willing to accelerate a student, despite all the education authorities warning against it, then there&#8217;s probably something fundamentally right about that school&#8212;something in it that values actual knowledge, like Paul Erd&ouml;s did with his epsilons, that recognizes the <i>impatience</i> of those afflicted with the thirst for knowledge, that isn&#8217;t purely about following rules and producing more rule-followers.</p>\n]]>", "author": "Scott", "published": "2016-03-01 07:01:03+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #75: But… isn&#8217;t it actually the rarity of skipping grades that makes it work well?  If lots of people skipped grades, then if you skipped grades, you&#8217;d be surrounded by other people who skipped grades, and would have a curriculum and teachers adjusted to young people who have skipped grades, so the higher grade would work very similar as the lower grade works now.</p>\n]]>", "author": "jonas", "published": "2016-03-01 08:02:19+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>jonas #76: By &#8220;skipping being commonplace,&#8221; I simply mean that students could sign up for any course that interested them and that they could show they were intellectually ready for, and could advance at whatever pace was right for them.  Their biological age wouldn&#8217;t even enter into it, any more than it does in college.  So, like in college, the typical course might have a spread of ages at least a few years wide, even though (ideally) the students would all be about equally prepared intellectually for whatever course they were taking.  This would be <i>great</i>, I think, for the social comfort of students at either extreme of the age distribution.</p>\n]]>", "author": "Scott", "published": "2016-03-01 08:54:38+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;I once, for example, thought about the Religious Right as purely contemptible, deserving only unthinking snark, and I was completely wrong.&#8221;</p>\n<p>Have you written about this before? What changed your mind?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/j/Johnson:Timothy.html\">Timothy Johnson</a>", "published": "2016-03-01 09:18:03+00:00", "title": "By: Timothy Johnson"}, {"content": "<![CDATA[<p>Congratulations. </p>\n<p>I think you have a mostly sensible take on the gun control thing. Guns, and people with guns, are somewhat dangerous to be sure, but the fear the Steven Weinberg expressed of some student being so enraged in class by what he is saying that he just snaps and shoots him seems overblown. There have been a number of university shootings in the US of course, but banning guns locally at UT does not diminish that risk appreciably, I think.</p>\n]]>", "author": "Jr", "published": "2016-03-01 10:57:21+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Just sharing a great personal experience with skipping since the topic came up &#8211; I got along better with the other kids since they were more mature, and I didn&#8217;t feel academically stressed out or pushed forward or anything remotely like that since the school stuff was still mostly trivial.</p>\n<p>Also, what Scott says at #77 makes a lot of sense.</p>\n]]>", "author": "Abel", "published": "2016-03-01 11:15:20+00:00", "title": "By: Abel"}, {"content": "<![CDATA[<p>Huh. </p>\n<p>Scott #67: Thanks for your response! It is hard for outsiders like myself to imagine how any cost-benefit analysis MIT might have done could come out on the side of &#8220;it will cost too much to keep Aaronson here, so we have to let him go.&#8221; You are a proven resource in multiple domains, and clearly significantly valued by many communities. </p>\n<p>Any thoughts on how the cost could possibly have come out higher than the benefit? Is agreement to grant tenure really that politically charged?</p>\n]]>", "author": "Ian", "published": "2016-03-01 16:34:04+00:00", "title": "By: Ian"}, {"content": "<![CDATA[<p>Congratulations! Welcome to the South! The state of Texas is lucky to have you. Austin sounds like a great place to live.</p>\n]]>", "author": "tinduck", "published": "2016-03-01 16:43:00+00:00", "title": "By: tinduck"}, {"content": "<![CDATA[<p>Bigjon&#8217;s comment (#35) is associated to lore among theorists that jumping to &#8220;Big State University&#8221; is a risky career move.  Prominent examples include Julian Schwinger&#8217;s move from Harvard to UCLA, and Alexander Grothendieck&#8217;s move from the IHS to Montpellier.  </p>\n<p>At the time of his early death, John von Neumann too was negotiating a move from the IAS to the University of California system&nbsp;&mdash; we&#8217;ll never know how <i>that</i> would have turned out.</p>\n<p>The ratio (total&nbsp;endowment)/(total&nbsp;students) is a measure of how great the change in academic culture can be, in jumping to a state university. Wikipedia&#8217;s numbers are:</p>\n<p>• <b>Boston</b>&nbsp; (13.47&nbsp;G$)/(11,319) = 1.190&nbsp;M$<br />\n• <b>Austin</b>&nbsp; (&nbsp;3.27&nbsp;G$)/(51,313) = 0.063&nbsp;M$</p>\n<p>That&#8217;s a nineteen-to-one relative shift in per-student endowment.  Needless to say, at the level of college deans and university presidents, these contrasting endowment ratios necessitate <i>YUGE</i> contrasts in institutional development strategies.  Not&nbsp;necessarily for the worse!</p>\n<p><b>A modest proposal</b>&nbsp; It&#8217;s interesting to contemplate a world in which (say) five percent of all young people received STEM degrees at four-year institutions endowed at the 1&nbsp;M$ level.  Crunching the numbers, the required global endowment is ~25&nbsp;T$ (that is, 25 quadrillion dollars).</p>\n<p><b>Resolved for purposes of debate</b>&nbsp; A 21st century global commitment of 25&nbsp;T$ toward STEM educational endowments would make good sense, both socially and economically.</p>\n<p><b>Conclusion</b>&nbsp; Perhaps academic STEM culture underestimates its own global value?  Perhaps STEM faculty commonly think too&nbsp;small, about the enduring global value of STEM academia?</p>\n]]>", "author": "John Sidles", "published": "2016-03-01 17:27:33+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>I thought Boston had some good magnet schools like Boston Latin (alma mater of The Great Quux).  Do they use lottery admission?  Anyway you know more than I do.</p>\n<p>I&#8217;m male and skipped a couple grades and it was a good thing in all regards. </p>\n<p>Regarding those 18yo IDF girls with the huge-ass machine guns, Scott might like &#8220;The 188th Crybaby Brigade&#8221; by Joel Chasnoff, a funny-only-serious book about the year he spent in an IDF tank batallion.</p>\n<p>Norbert Wiener&#8217;s autobiography &#8220;Ex-Prodigy&#8221; (that&#8217;s the first volume) comes to mind from a different direction.</p>\n]]>", "author": "asdf", "published": "2016-03-01 18:21:06+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>As a Texan and UT alumni, I am proud to see my school branch out into a growing and exciting field. I&#8217;m also a huge fan of your blog/writing and am glad to see you come to Texas. Don&#8217;t stop confronting stupidity!</p>\n]]>", "author": "Michael", "published": "2016-03-02 06:36:21+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>I love all the comments that Scott so diligently makes in these posts but comments like <a href=\"http://www.scottaaronson.com/blog/?p=2620#comment-1006398\" rel=\"nofollow\">http://www.scottaaronson.com/blog/?p=2620#comment-1006398</a> are to die for.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Adluru:Nagesh.html\">Nagesh Adluru</a>", "published": "2016-03-02 17:13:06+00:00", "title": "By: Nagesh Adluru"}, {"content": "<![CDATA[<p>Timothy #78: For 20 years or so, I thought of the Religious Right as (1) believing in scientific absurdities and (2) using those absurdities to prop up a system for denying people basic rights and implementing terrible public policy, up to and including the destruction of the planet.  Not only is there nothing to like in that, there&#8217;s not even any basis for dialogue.</p>\n<p>So what changed?  It was neither a specific incident nor a real change in my object-level views, so much as simply getting older, and becoming increasingly conscious that there&#8217;s nothing in the political or social world that&#8217;s not susceptible to &#8220;ironic reversals.&#8221;  Reading Scott Alexander&#8217;s blog certainly accelerated that insight.</p>\n<p>As one example, if you&#8217;re worried about the <i>worst</i> religious right on earth&#8212;i.e., the one that stones gays, beheads infidels, kidnaps women to use as sex slaves, celebrates the murder of Jews, and plausibly boasts about demographically taking over the world in the long run&#8212;then one of the supreme ironies of our time is that the American religious right is more of an ally to you than the modern social-justice left is.  (The parts of the left that are actually consistent in opposing religious fundamentalism&#8212;exemplified by Richard Dawkins and Maryam Namazie&#8212;are also the parts that get denounced every nanosecond by the social-justice left.)</p>\n<p>As a second example, suppose you&#8217;re a shy, intellectual, nerdy straight male who feels alienated by the dating mores of the modern world.  Who would you choose for an ally:</p>\n<p>(a) people with the bizarre belief that the earth is 6,000 years old, but who share your dissatisfaction with modern dating mores; see you as a sweet, well-meaning person who deserves to be happy; and just hope your studies of the natural world will eventually lead you to God; or</p>\n<p>(b) people who know the age of the earth but despise you for existing, and will do everything in their power to shame you as a misogynist monster if you ever breathe a word about your life experience?</p>\n<p>To clarify, I&#8217;m no friend of the religious right.  If anything, I suspect I&#8217;m a more effective <i>opponent</i> of them, now that I understand their appeal, because there&#8217;s some tiny part of me that&#8217;s actually felt their appeal.</p>\n<p>But there&#8217;s no getting around it: given what I&#8217;ve gone through, the idea of, let&#8217;s say, President Rick Santorum terrifies me much less than the idea of President Amanda Marcotte.  There&#8217;s probably <i>some</i> limit to what President Santorum would do just to make everyone like me suffer!</p>\n<p>(Note: please don&#8217;t ask me whether I&#8217;d be more terrified of President Marcotte or President Trump.)</p>\n]]>", "author": "Scott", "published": "2016-03-02 19:17:05+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Best wishes on your transition! But dagnabbit, why&#8217;d you&#8217;d have to move to Central Texas *after* I moved out? 😛</p>\n]]>", "author": "Silas Barta", "published": "2016-03-02 22:32:19+00:00", "title": "By: Silas Barta"}, {"content": "<![CDATA[<p>Congratulations! Here&#8217;s wishing all three of you a grand new adventure.</p>\n<p>A salutary side-effect of moving departments a few years ago was the thorough cleaning-out of my book shelves. I found a bunch of notes with half-baked ideas for projects that I&#8217;d forgotten. Also, a picture of me and some grad school friends drinking beer. For that alone, the move was worth it.</p>\n]]>", "author": "Nilima", "published": "2016-03-02 23:39:07+00:00", "title": "By: Nilima"}, {"content": "<![CDATA[<p>Congratulations on the new positions (spin up) and all the best on the transition.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Regan:Kenneth_W=.html\">Kenneth W. Regan</a>", "published": "2016-03-03 03:13:52+00:00", "title": "By: Kenneth W. Regan"}, {"content": "<![CDATA[<p>#87,</p>\n<p>&#8220;President Rick Santorum terrifies me much less than the idea of President Amanda Marcotte.&#8221;</p>\n<p>It may be worth noting that one of these was actually an elected Senator of the US who actually showed signs of being the candidate for the Republican party, and the other is a columnist.</p>\n<p>The right-wing has given far more in the way of functional government power to the Santorums than the left has to the Marcottes.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2016-03-03 14:44:18+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>The Alarming History of low-status citizens. Ouch. David Henderson and condensed matter physics, engineering, technology, and experimentally observed and/or paste the oracle can reveal that assertion in the roadmaps will respectfully disagree with the consequences will occur when it most horrendous forms.</p>\n<p>Scott says: The NIH Campus, and quantum state-space of artificial pressure on further add the HGP.</p>\n<p>Scott *expand* his view, there is noise. In any talks about eugenics, torture not an outstanding complexity theory. From the fifth postulate (if need be) an exemplary of quantum information … in the difference between fundamental research in TCS Stack Exchange? Here “younger” means, we assume that the problematic metaphysics only an equivalent</p>\n<p>IMHO it’s *got* to sell-out to the Kahler manifolds a.k.a. matrix elements of the other hand, I’m told, is any two.</p>\n]]>", "author": "John Sidlesbot", "published": "2016-03-03 16:10:51+00:00", "title": "By: John Sidlesbot"}, {"content": "<![CDATA[<p>Joshua #91: That&#8217;s a fair point.  It&#8217;s worth noting, however, that Marcotte <i>was</i> a major figure in John Edwards&#8217; presidential campaign, until she was eventually let go&#8212;not, interestingly, for anything directly related to her hateful/distorted version of feminism, but for mocking Christianity, for example by referring to Jesus as &#8220;Jeebus.&#8221;</p>\n]]>", "author": "Scott", "published": "2016-03-03 16:18:41+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Welcome to Austin!  You&#8217;re going to love it here.</p>\n<p>Ignore the hipsters and other snooty elitists of the &#8220;Don&#8217;t Move Here&#8221; movement.  Most of them weren&#8217;t born here anyway.  As a transplant myself, property taxes have precluded any such guilt. </p>\n<p>And watch out for the aggressive bicyclists. </p>\n<p>Enchanted Rock is great for trail running and camping.  Hamilton Pool will amaze the kids.  </p>\n<p>Enjoy!</p>\n]]>", "author": "Austin Eric", "published": "2016-03-03 16:24:45+00:00", "title": "By: Austin Eric"}, {"content": "<![CDATA[<p>Great to hear and all the best Scott!</p>\n]]>", "author": "AdamT", "published": "2016-03-03 19:10:27+00:00", "title": "By: AdamT"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>Since we are talking politics, I am an independent because I also have problems with both the blue and red tribes. Problems including the social justice reactionary wing of the blue, and the anti-science of the red and the foreign policy of both who never met a foreign problem they feel killing the right people didn&#8217;t solve.</p>\n<p>My ideal policy prescription for America would look like:</p>\n<p>1) A national basic income for *everyone*<br />\n2) Nationalized medicine like the British<br />\n3) A VAT tax to replace the income tax and much of the tax code<br />\n4) Get rid of Social Security, Medicare, Medicaid, Obamacare, Welfare, Food Stamps, Unemployment Insurance, the IRS, and many more for #1, #2, #3 above<br />\n5) Publicly funded, instant run-off elections<br />\n6) Funding for the arts, science, the military<br />\n7) Carbon tax roled into #3 above</p>\n<p>Whaddya think?</p>\n]]>", "author": "AdamT", "published": "2016-03-03 19:17:54+00:00", "title": "By: AdamT"}, {"content": "<![CDATA[<p>Maybe the new quantum computing center could find some way to use complex-valued probability to help these guys:</p>\n<p><a href=\"http://www.theonion.com/article/gop-statisticians-develop-new-branch-math-formulat-52463\" rel=\"nofollow\">GOP Statisticians Develop New Branch Of Math To Formulate Scenarios In Which Trump Doesn’t Win Nomination</a></p>\n]]>", "author": "asdf", "published": "2016-03-03 20:08:40+00:00", "title": "By: asdf"}]