[{"content": "<![CDATA[<p>Marnie: The lists I linked to did <i>claim</i> to account for long-term compensation.  But setting that aside, can you find a list of the best- and worst-paying majors that properly accounts for all the factors you think should be accounted for (including layoffs)?  That would probably be more useful for this particular conversation than anecdotes, which of course we all have.</p>\n<p>Incidentally, I completely agree that petroleum engineering is an inherently limited field&#8212;if nothing else, it&#8217;s over once all the oil is out!  (Maybe half of it&#8217;s out already, and a lot of the rest better <i>never</i> come out if we want civilization to survive.)  But that&#8217;s a special case, and other kinds of engineering seem like there should be continuing demand for them all the way from now until the Singularity. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "Scott", "published": "2015-12-08 18:00:09+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Marnie #106</p>\n<p>&#8220;I think you yet again are trying to contrive a reason not to hire women as scientists and engineers.&#8221;</p>\n<p>Hmm, I did not single out women in my post, I only talked about &#8220;raising a family&#8221;, imo it all applies equally to mothers and fathers!</p>\n<p>And I don&#8217;t understand why you say &#8220;Yet again&#8221;&#8230;<br />\nAFAIK I never said anything in this blog about not hiring women as scientists and engineers.<br />\nQuite the opposite, I&#8217;ve written here in the past that I&#8217;ve been lucky to work in financial software companies where the majority of the dev managers were women, and the working environment was great.</p>\n]]>", "author": "fred", "published": "2015-12-08 18:39:41+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott #108</p>\n<p>&#8220;But setting that aside, can you find a list of the best- and worst-paying majors that properly accounts for all the factors you think should be accounted for (including layoffs)?&#8221;</p>\n<p>And it&#8217;s impossible to know what fields are going to get deprecated or suddenly relevant based on future discoveries and inventions!</p>\n]]>", "author": "fred", "published": "2015-12-08 18:47:21+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>#110</p>\n<p>Ultimately probably almost every career will be deprecated except for some highly specialized areas and artistic fields.</p>\n<p>There is a good post on Turing&#8217;s Radiator about that.</p>\n<p><a href=\"http://vicgrout.net/2015/11/05/will-the-robots-take-our-jobs-isnt-really-the-important-question/\" rel=\"nofollow\">http://vicgrout.net/2015/11/05/will-the-robots-take-our-jobs-isnt-really-the-important-question/</a></p>\n<p>I picked up on it and some other things when I wrote about Arthur C. Clarke&#8217;s Childhood&#8217;s End.</p>\n<p><a href=\"http://broadspeculations.com/2015/11/14/childhoods-end/\" rel=\"nofollow\">http://broadspeculations.com/2015/11/14/childhoods-end/</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2015-12-08 19:39:28+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>on the dynamics of current social networks:</p>\n<p><a href=\"http://mobile.nytimes.com/2015/12/08/opinion/bret-easton-ellis-on-living-in-the-cult-of-likability.html?referer=https://t.co/dnfi8yfD89\" rel=\"nofollow\">http://mobile.nytimes.com/2015/12/08/opinion/bret-easton-ellis-on-living-in-the-cult-of-likability.html?referer=https://t.co/dnfi8yfD89</a></p>\n]]>", "author": "fred", "published": "2015-12-08 21:43:13+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Taking about IBM and QC:<br />\n<a href=\"http://spectrum.ieee.org/nanoclast/computing/hardware/spy-agency-bets-on-ibm-for-universal-quantum-computing?utm_source=feedburner&#038;utm_medium=feed&#038;utm_campaign=Feed%3A+IeeeSpectrum+%28IEEE+Spectrum%29\" rel=\"nofollow\">http://spectrum.ieee.org/nanoclast/computing/hardware/spy-agency-bets-on-ibm-for-universal-quantum-computing?utm_source=feedburner&#038;utm_medium=feed&#038;utm_campaign=Feed%3A+IeeeSpectrum+%28IEEE+Spectrum%29</a></p>\n]]>", "author": "fred", "published": "2015-12-08 22:20:36+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>@fred #110</p>\n<p>&#8220;Quite the opposite, I’ve written here in the past that I’ve been lucky to work in financial software companies where the majority of the dev managers were women, and the working environment was great.&#8221;</p>\n<p>OK.  Maybe in financial software companies, things are a little different.</p>\n]]>", "author": "Marnie Dunsmore", "published": "2015-12-08 22:34:37+00:00", "title": "By: Marnie Dunsmore"}, {"content": "<![CDATA[<p>New study published today  : ) </p>\n<p>&#8220;Low wages, not education, to blame for skills gap&#8221;</p>\n<p>Dr van Rens also argues that reform of the education system is not an answer to the perceived lack of appropriately skilled workers. As long as wages do not reward certain skills, workers will be less likely to acquire them, and even if they do, will find employment in higher-paid occupations that do not utilize these skills. </p>\n<p>He added: “While firms complain about a shortage of qualified physicists and engineers on the labour market, a very large number of graduates in these fields work in the financial sector, where they only use their STEM skills to a very limited degree.</p>\n<p>“Encouraging universities to educate more physicists and engineers will not make any difference if these additional STEM graduates look for jobs in investment banks.”</p>\n<p><a href=\"http://www2.warwick.ac.uk/newsandevents/news/low_wages_not/\" rel=\"nofollow\">http://www2.warwick.ac.uk/newsandevents/news/low_wages_not/</a></p>\n]]>", "author": "Marnie Dunsmore", "published": "2015-12-08 22:36:49+00:00", "title": "By: Marnie Dunsmore"}, {"content": "<![CDATA[<p>@Tim May #1 and #106</p>\n<p>&#8220;Meanwhile, of a bunch of us who worked together in various projects at Intel, every one of us is a multimillionaire. I say this not to brag but to point out that earning a better-than-average (and the Forever 21 clerks a far, far below even average) salary plus some prudent investments of the surplus usually works out very well. &#8221;</p>\n<p>Judging by your comments in the first message (#1), you probably acquired your stock options at Intel before 1994.</p>\n<p>Look at the stock price. That little graph of stock price versus time.  You can do it.  If you have a look, you will note that if you worked at Intel before 1994, and not after 2000, when their salaries and stock price flatlined, yes, you probably did very well for yourself.</p>\n<p>If you worked at Intel after 2000, like I did, you probably made zilch.  I have friends there, who never left, who haven&#8217;t been promoted in 15 years.  Their stock, the little they have been granted, is worth peanuts.</p>\n<p>It&#8217;s just this kind of arrogant, out of touch, narcissistic, clueless attitude that is driving the economy into the ground.  </p>\n<p>Here you go:</p>\n<p> &#8220;Record Number of Men Not in Labor Force&#8221;</p>\n<p><a href=\"http://freebeacon.com/issues/38151000-record-number-of-men-not-in-labor-force-participation-rate-dips-to-lowest-level-ever-recorded/\" rel=\"nofollow\">http://freebeacon.com/issues/38151000-record-number-of-men-not-in-labor-force-participation-rate-dips-to-lowest-level-ever-recorded/</a></p>\n]]>", "author": "Marnie Dunsmore", "published": "2015-12-08 22:54:48+00:00", "title": "By: Marnie Dunsmore"}, {"content": "<![CDATA[<p><a href=\"http://googleresearch.blogspot.ca/2015/12/when-can-quantum-annealing-win.html\" rel=\"nofollow\">http://googleresearch.blogspot.ca/2015/12/when-can-quantum-annealing-win.html</a></p>\n]]>", "author": "max", "published": "2015-12-09 02:08:51+00:00", "title": "By: max"}, {"content": "<![CDATA[<p>@Marnie  Dunsmore:</p>\n<blockquote><p>&#8220;If you have a look, you will note that if you worked at Intel before 1994, and not after 2000, when their salaries and stock price flatlined, yes, you probably did very well for yourself.</p>\n<p>If you worked at Intel after 2000, like I did, you probably made zilch. I have friends there, who never left, who haven’t been promoted in 15 years.&#8221;</p></blockquote>\n<p>If I sense any arrogance and cluelessness here it is on your side, sadly and not Tim&#8217;s. </p>\n<p>Intel was and still remains a fantastic job with a fantastic pay package. I am not sure what world you live in. </p>\n<p>I graduated from a US-top-10 department (Engineering) circa 2010 and we got a lot of hirers from the Chemicals / Food / Semiconductors  / Polymers sectors. Among all the hiring companies Intel was handing out the absolute best pay packets. And from what I hear the trend still continues. </p>\n<p>No doubt Intel had a reputation of working you hard, but that&#8217;s a separate issue. I&#8217;ve no clue about internal promotions but at those starting salaries, even if you got no promotions for a decade you&#8217;d be doing no worse than others who had to be forced into post-docs, scientists or school teaching etc. </p>\n<p>Further, if you compare to those non-STEM  majors who had to end up working in coffee shops, bookstores or other non-major related jobs (and believe me there&#8217;s a huge cohort like that!) then I&#8217;d wager an Intel job today even with no promotions for your whole career, you might still be better off. </p>\n<p>The problem with you Marnie is that when you deride STEM jobs or badmouth Intel jobs your baseline is just so skewed. I think you are so lost in your rarefied ivory tower atmosphere of startups and stock options and million dollar lost earnings that you have no clue how bad things can get at the bottom. </p>\n<p>I&#8217;m still amazed that someone could associate an employer like Intel with &#8220;making zilch&#8221;. For most students out there it is one of the best things that could happen.</p>\n]]>", "author": "Rahul", "published": "2015-12-09 03:41:59+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Scott 103,</p>\n<p>It seems like it&#8217;s about the one-year anniversary of when the  &#8220;Obviously, I&#8217;m not defending Aaronson&#8221; blog posts and corresponding comments began. It would be nice to have a comprehensive overview of what you have learned since then, what has changed in your beliefs, and what you do differently now in light of  your previous experience. Right now your comments about that are too dispersed across this site (and other blogs) for us to see the big picture.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Seita:Daniel.html\">Daniel Seita</a>", "published": "2015-12-09 03:43:22+00:00", "title": "By: Daniel Seita"}, {"content": "<![CDATA[<blockquote><p>&#8220;While firms complain about a shortage of qualified physicists and engineers on the labour market, a very large number of graduates in these fields work in the financial sector, where they only use their STEM skills to a very limited degree&#8221;</p></blockquote>\n<p>So what?! What&#8217;s wrong with that.</p>\n<p>Firms hire people with skills that best fit the job. (Some) Finance jobs need good numerical / analytical / coding skills. STEM grads have them so they get hired. </p>\n<p>Students look for jobs that best match their goals (salary, fun, passion whatever) and apparantly some STEM grads find those in finance jobs. Good for them. </p>\n<p>If someone came up with a new non-STEM degree that was a better match I guess finance companies would hire from there. </p>\n<p>What we should care more about are how employable STEM grads are in general. Whether they end up working in Finance or Factories shouldn&#8217;t matter much.</p>\n]]>", "author": "Rahul", "published": "2015-12-09 04:10:03+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Marnie, #116, more money has been made in high tech companies AFTER 1994 than before. (And for what it&#8217;s worth, my last profitable stock option grants were granted in 1980. When I left in 1986 all of my exercisable options were underwater. Yeah, there was later a big run-up&#8230;.but profited only from excercised as stated above, plus buying the maximum amount in the Stock Participation Plan, plus buying Sun, Microsoft, etc. And later on, I poured money into Qualcomm, Apple, and others. $16,000 I put into Apple when many were writing them off went up to more than $2 million. I got out of Apple completely over the past 3 years.</p>\n<p>Frankly, you seem to be very bright (and I like your stuff on the migrations of early post-Ice Age people&#8230;the rise of languages and tools is fascinating. </p>\n<p>But you seem to be missing the incredible opportunities that are all around. (Yeah, I&#8217;m skeptical about the unicorns, but plenty of opportunities.</p>\n<p>Advising someone with the chops to go into math, science, and engineering (&#8220;STEM&#8221;) to instead pick something in the areas you listed seems like incredibly bad advice. Sure, some people in music, the arts, dance, even social work, do OK. Some even become fabulously wealthy. (Ironically, the wealthiest musician in the world by a long shot is Bono, of U2. More on that later.)</p>\n<p>I see a lot of folks with artsy-craftsy degrees complaining that their degree prepared them for no job offers. Plenty of reports that many of them are now barristas or clerks at clothing stores.</p>\n<p>Oh, about Bono. His billions come from his investment stake in Facebook. And Facebook, which like you I don&#8217;t have an account with, is just one of the many Valley start-ups which have left Intel in the dust. So, no, I think your colleagues who have remained at  Intel through the 15 years it has been dead money are reaping the implications of chip companies becoming what steel companies became.</p>\n<p>(I would sell my remaining Intel were the tax implications more reasonable. And if &#8220;Feel the Bern!&#8221; is elected, and taxes go up to the 90% marginal rate, I&#8217;ll look into moving to another branch of the infinite multiverse.)</p>\n<p>But I do like your comments here, really. I just don&#8217;t have the same &#8220;priors,&#8221; as that thread a while back (&#8220;A celebrated 1976 theorem of Aumann asserts that honest, rational Bayesian agents with common priors will never “agree to disagree”: if their opinions about any topic are common knowledge, then those opinions must be equal.&#8221;).</p>\n<p>I&#8217;ve never had any luck with complaints about unequal treatment, and I&#8217;m unwilling to call for more laws about discrimination against males and whites/Asians (a point I think you effectively admits is happening when you say that males and whites/Asians are playing a sucker&#8217;s game&#8230;.Scott even said he&#8217;d like to help prove this with data&#8230;I can&#8217;t speak from memory about Scott&#8217;s exact words, much less his rationale, but there was something of the &#8220;nerds may be the oppressed ones&#8221; flavor.)</p>\n<p>I think women and people of color would be best served by a kind of Reformation, a changing of their outlook. Perhaps they should even &#8220;appropriate&#8221; the learning values so many Jews have. They do disproportionately well in science, math, law, medicine, etc. precisely because learning and studying are valued. Any culture which says &#8220;Reading fo&#8217; whitey&#8221; is marginalizing itself.</p>\n<p>The future will be even more high-tech, even more intensely focused on abstraction than today. And there are fewer and fewer jobs for those with little useful education. </p>\n<p>If young girls are led to believe that the &#8220;patriarchy&#8221; is holding them down, or are encouraged to use words like &#8220;nerd&#8221; or &#8220;dork&#8221; when referring to boys interested in math or science, then this will &#8220;back react&#8221; on them. </p>\n<p>Aren(I despise the terms &#8220;nerd&#8221; and &#8220;geek.&#8221; These are not terms of honor, and engineers and programmers are NOT &#8220;reclaiming the terms&#8221; by yammering about &#8220;nerd culture.&#8221; </p>\n<p>What should scientists and engineers and programmers call themselves, then? I just said what they should call themselves.</p>\n<p>&#8211;Tim</p>\n]]>", "author": "Tim May", "published": "2015-12-09 05:44:50+00:00", "title": "By: Tim May"}, {"content": "<![CDATA[<p>&#8220;a very large number of graduates in these fields work in the financial sector, where they only use their STEM skills to a very limited degree.&#8221;</p>\n<p>That seems like an unfair remark. A sizable number of financial sector jobs are software engineering and mathematical modeling.  Presumably the STEM grads are going to those roles, where they are indeed making use of their STEM skills.</p>\n]]>", "author": "Luke G", "published": "2015-12-09 06:12:07+00:00", "title": "By: Luke G"}, {"content": "<![CDATA[<p>Coming in late, then maybe circling back to pick up the rest of the conversation:</p>\n<p>Updike and Roth vanished from syllabi decades ago precisely because &#8212; well, for several reasons, actually. One was the misogyny, which doesn&#8217;t play in English departments anymore. Another is the fact that they don&#8217;t play particularly well outside the northeastern US &#8212; they have a cultural specificity that doesn&#8217;t resonate well elsewhere. Salinger has the same problem. A third is that the publishing world blew open in the 80s and suddenly there were warehouses full of stories that were not about the travails of married middle-class white men waiting for the 5:35 to Bernardsville, or wherever, which nicely suited the new multiculturalism that had run all over English lit (and still left us plug-ignorant of non-USian literatures). And a fourth is that lit classes are not writing classes, and are not about the quality of the writing but about textual analysis: they really are there to study literature, not read it. Aesthetics went out most of a century ago and have only recently started tiptoeing back in, but in unrecognizable form. </p>\n<p>I recently taught a section from _Let Us Now Praise Famous Men_, Agee&#8217;s discovery of the South, and I let the kids know what was coming in advance, because they&#8217;re not generally hit with this kind of thing anymore. It&#8217;s beautiful writing. It&#8217;s also bald about racism, from the perspective of a white man at a time when an open and virulent racism was so deeply normed that its language was used even by those who despaired at it. Most of the kids I was reading to &#8211; some white, some not &#8211; have no context, anymore, for such language. </p>\n<p>Most of the early 20th-c writers have similar problems, except perhaps Faulkner, the most sex-and-race-obsessed I can think of offhand. His stories are about almost nothing but race and destruction of women, the language is brutal, and yet he&#8217;s so ferociously human throughout, aware throughout of the humanity of every person in every story, that the horror and irony make him Vonnegut&#8217;s much more talented cousin. </p>\n<p>Anyway. No, Updike and the others get no pass. Houellebecq &#8212; oh, I imagine he gets assigned sometimes for drawing and quartering; I startled a writing prof by saying I admired the beginning of one his books. He&#8217;s kind of a jagoff, though &#8212; Houellebecq, not the&#8230;well, the prof, too. I wrote something once about admiring the quality of the literary nihilistic porn, but how H. kept insisting on having ideas, which he wasn&#8217;t very good at, and how I was damned if I wanted a half-assed white paper in the middle of my literary nihilistic porn. It&#8217;s childish stuff in the end though.</p>\n<p>As for defensiveness, enemies lists, etc: I don&#8217;t think it&#8217;s particularly healthy, Scott, I really don&#8217;t. The world will always have people who enjoy playing circular firing squad; always have stupid ideas that attract crowds. This country will always have bright, persecuted, undereducated kids escaping their rural/impoverished/suburban-anomie hellholes, pick one, and grabbing the first idea train out of town. The fraction willing and able to entertain complex ideas will always be small. And when it comes to new, alarming worlds that look entirely foreign: I regret to inform that this comes for all of us, and is called &#8220;getting old&#8221;. (You know what was a rough year for me? The year that Updike and Samuelson both died. My whole century, sliding right off the table. My students have no idea who either of those guys might be; the 20th c. doesn&#8217;t exist for them. Tell you all about monetizing Call of Duty play, though.)</p>\n]]>", "author": "amy", "published": "2015-12-09 06:47:36+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Well I think this appropriation of Emma Goldman&#8217;s quote distorts the original meaning. Goldman said what she said, knowing full well that she *was* part of the revolution; the contribution of her point was you don&#8217;t want the change to go a certain way.</p>\n<p>In Scott&#8217;s version, &#8220;dancing&#8221;/&#8221;math&#8221; is valued over whatever thing the other group is up to (their mental model of what executing a revolution should entail.) That is, math is taken to become the revolution.</p>\n<p>And that&#8217;s not a parallel application, at all. The words are parallel but the meanings are inverted.</p>\n]]>", "author": "Carven", "published": "2015-12-09 12:47:30+00:00", "title": "By: Carven"}, {"content": "<![CDATA[<p>Carven #124: No, I still think it&#8217;s pretty parallel.  I&#8217;m not nearly as famous as Goldman, of course, but I&#8217;d like to think of myself as <i>trying</i> to do what little I can to advance the ongoing revolution called the Enlightenment (a revolution that&#8217;s under attack from counterrevolutionary forces on all sides&#8230;).  Goldman didn&#8217;t want the change to the world to go in such a way that there would be no longer be room for dancing&#8212;dancing, for her, was a symbol of what made the world worth inhabiting and of what she was fighting for.  I don&#8217;t want the change to go in such a way that there will no longer be room for math, science, or socially-inept nerds.</p>\n]]>", "author": "Scott", "published": "2015-12-09 14:08:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>amy #123: Good to have you here as always!  And thanks for your &#8220;field report&#8221; about how Updike, Roth, and Houellebecq are viewed in modern literature departments.  This is not something I have firsthand knowledge about, but I have to confess that neither possibility thrills me that much.  To whatever extent these authors are venerated by literary types, I feel like saying: &#8220;so then why are they allowed to talk about so many things that <i>I&#8217;m</i> not allowed to?&#8221;  Conversely, to whatever extent they&#8217;re jeered at, I say: &#8220;so you&#8217;re not <i>even</i> allowed to talk about the things they talk about in literature?  Then where <i>are</i> you allowed to talk about them?&#8221;</p>\n<p>I only just started reading Houellebecq a month ago, but I have to admit that so far, the &#8220;white papers&#8221; (where the author just comes right out and explains his view of something, or puts it into the mouth of a character) are my favorite parts! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>Finally: you write about how &#8220;aesthetics went out a century ago&#8221; (so presumably, since then it&#8217;s been all about the writer&#8217;s political sympathies?), as though that were something you supported, or at worst were neutral about.  But how can I possibly square that with your comment, in the &#8220;Ordinary Words Will Do&#8221; thread, that the art is really what you care about, in the end?</p>\n]]>", "author": "Scott", "published": "2015-12-09 14:38:06+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Amy #123<br />\nYour take on Houellebecq is a blast. Made my day!</p>\n]]>", "author": "luca turin", "published": "2015-12-09 14:39:04+00:00", "title": "By: luca turin"}, {"content": "<![CDATA[<p>amy #123<br />\nFor non native speakers, would you mind to define: &#8220;a writing prof&#8221;, &#8220;jagoff&#8221; (wikipedia suggests several meanings that would work for your sentence), &#8220;the prof&#8221; (he&#8217;s professor?) and &#8220;literary nihilistic porn&#8221; (a subfield of english literatory?)?</p>\n]]>", "author": "Jay", "published": "2015-12-09 15:51:24+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>As the great unsung 20th century philosopher poet Terence McKenna said, “The cost of sanity in this society, is a certain level﻿ of alienation”. 15 years after his death, a relevant-as-ever quote.</p>\n<p>Commiseration aside, I graduated high school in 2004. Very few of my peers cared about issues of any kind in that time &#8211; ecology, war, social problems. In my observation, it was not until ~this decade (BP Deep Horizon spill and Fukushima) that it became &#8216;mainstream&#8217; to care about much at all (the last example being the 1960s). The zeitgeist between the assassination of MLK and RFK through to the Iraqi insurgency outbreak was a mini dark age imo. Now that, as you point out, we&#8217;re on the verge of imminent planetary destruction &#8211; it seems even the &#8216;privileged&#8217; humans care on a significant scale&#8230; It&#8217;s like some kind of collective Gaian immune response.</p>\n<p>While I do agree it is somewhat disturbing to see people 10 or less years younger than I revert into a Lord of the Flies type self-enforced psychological fascism &#8211; it is promising. Promising in the sense that this is the first major step towards a new enlightenment. </p>\n<p>For a revolution to occur first the youth must care *at all*, and eventually life (exposure to new data, work, travel, family crises, psychedelic experiences, heartbreak/mending, child rearing, so forth) will dissolve the boundaries of their brittle world views. &#8212; I personally remember having incredibly strong, self-righteous opinions in my undergrad years (chiefly scientism and post-911 &#8216;West > East&#8217;), but life humbles all who claim to have an open mind.</p>\n<p>This is the first generation ever to be in a position to establish a healthy planetary civilization, and it begins with sometimes-legit-sometimes-hypocritical accusations of tone policing, mansplaining and privilege.. Hopefully.</p>\n]]>", "author": "Jordan", "published": "2015-12-09 16:58:14+00:00", "title": "By: Jordan"}, {"content": "<![CDATA[<p>I&#8217;m actually wondering how much of my appreciation of H&#8217;s style is appreciation of his translator&#8217;s style. Last night I started reading a trilogy by Patrick Modiano, also translated by Wynne, and it&#8217;s got the same intelligent astringency, a very midcentury voice. Really terrific. My French isn&#8217;t good enough for me to be able to read either of them in the original.</p>\n]]>", "author": "Amy", "published": "2015-12-09 17:13:51+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>My profuse apologies for being blatantly off-topic, but. Prof. Aaronson, what do you think of this: <a href=\"http://arxiv.org/abs/1502.04573\" rel=\"nofollow\">http://arxiv.org/abs/1502.04573</a></p>\n]]>", "author": "Vadim Kosoy", "published": "2015-12-09 18:50:41+00:00", "title": "By: Vadim Kosoy"}, {"content": "<![CDATA[<p>Amy #130</p>\n<p>&#8221; My French isn’t good enough for me to be able to read either of them in the original.&#8221;</p>\n<p>Native French speaker here: Modiano is a great stylist, Houellebecq a trivial writer.</p>\n]]>", "author": "luca turin", "published": "2015-12-09 22:33:24+00:00", "title": "By: luca turin"}, {"content": "<![CDATA[<p>@amy #123</p>\n<p>&#8220;Most of the early 20th-c writers have similar problems, except perhaps Faulkner, the most sex-and-race-obsessed I can think of offhand. His stories are about almost nothing but race and destruction of women, the language is brutal, and yet he’s so ferociously human throughout, aware throughout of the humanity of every person in every story, that the horror and irony make him Vonnegut’s much more talented cousin.&#8221;</p>\n<p>What about 19th century writers?</p>\n<p>The Cotton Kingdom, Frederick Law Olmsted</p>\n<p><a href=\"http://www.amazon.com/Cotton-Kingdom-Travellers-Observations-1853-1861/dp/0306807238/ref=sr_1_1?ie=UTF8&#038;qid=1449702581&#038;sr=8-1&#038;keywords=cotton+kingdom\" rel=\"nofollow\">http://www.amazon.com/Cotton-Kingdom-Travellers-Observations-1853-1861/dp/0306807238/ref=sr_1_1?ie=UTF8&#038;qid=1449702581&#038;sr=8-1&#038;keywords=cotton+kingdom</a></p>\n]]>", "author": "Marnie Dunsmore", "published": "2015-12-09 23:12:59+00:00", "title": "By: Marnie Dunsmore"}, {"content": "<![CDATA[<p>Tim May #125</p>\n<p>I&#8217;m too busy today to explain to you how the framing of your discussion in this post makes a lot of assumptions that don&#8217;t fit for me.</p>\n<p>If you want to talk more, you can invite me for lunch.  I&#8217;m in the Bay Area.  We could discuss IC design, Intel, alpha particle detection, investments, whether someone should or should not report a hostile work environment, math, evolutionary biology, etc.</p>\n<p><a href=\"mailto:marniedunsmore@earthlink.net\">marniedunsmore@earthlink.net</a></p>\n]]>", "author": "Marnie Dunsmore", "published": "2015-12-09 23:22:25+00:00", "title": "By: Marnie Dunsmore"}]