[{"content": "<![CDATA[<p>Well if we combine</p>\n<p>1. William Binney&#8217;s assertion that the NSA records 80% of the world&#8217;s phone calls (<a href=\"http://www.theguardian.com/commentisfree/2014/jul/11/the-ultimate-goal-of-the-nsa-is-total-population-control\" rel=\"nofollow\">http://www.theguardian.com/commentisfree/2014/jul/11/the-ultimate-goal-of-the-nsa-is-total-population-control</a>)</p>\n<p>2. The NSA claiming a national security exemption to Utah (desert state) law requiring public disclosure of its data center&#8217;s water consumption (since that would allow figuring out the power consumption, <a href=\"http://www.wired.com/2014/03/nsa-water/\" rel=\"nofollow\">http://www.wired.com/2014/03/nsa-water/</a> )</p>\n<p>3. Rapid advances in voice recognition software (automated voice mail transcription is sort of useful now, though it misses lots of words; compare that to the stuff available just a few years ago). </p>\n<p>We get: the NSA may be fixing up that data center for massive amounts of computation and not just storage.  Binney&#8217;s claim that despite collecting all the data, they missed a lot of terror plots, misses the point.   The real idea is that in 10 years, speech recognition gets almost as good as OCR is now.  Then they can run all the collected audio through recognition and machine analysis, and build up a database of every extramarital affair in the world in which the participants talked on the phone.  </p>\n<p>No wonder they want to stop the spread of cryptography.</p>\n]]>", "author": "asdf", "published": "2014-07-28 06:14:46+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>quax #7 I think on balance you are probably right, and I agree with you that border control in the US is becoming increasingly unpleasant even when all your paperwork is in order. </p>\n<p>I hold an Italian passport and a green card. As it happens I was born in Beirut, and an immigration officer recently tried to &#8220;trick&#8221; me into speaking Arabic (of which I know not a word) by saying phrases in Arabic to see if I reacted. </p>\n<p>Re: string-pulling, I guess I was coming at this from an EU perspective, where a phone call from on high can fix _anything_.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/t/turin:luca.html\">luca turin</a>", "published": "2014-07-28 08:54:15+00:00", "title": "By: luca turin"}, {"content": "<![CDATA[<p>Sorry, this is unrelated to cryptography but might be of interest: My friend who is from India had to stay back 3 months when he visited home because of a background check and almost had his job offer rescinded. The reason? He works on NMR spectroscopy, and the word &#8220;nuclear&#8221; sparked suspicion.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/w/Wavefunction:Curious.html\">Curious Wavefunction</a>", "published": "2014-07-28 15:36:50+00:00", "title": "By: Curious Wavefunction"}, {"content": "<![CDATA[<p>Here&#8217;s a related Hackernews posting:<br />\n<a href=\"https://news.ycombinator.com/item?id=6564558\" rel=\"nofollow\">https://news.ycombinator.com/item?id=6564558</a></p>\n<p>There seems to be some good information in there. In particular, there are a couple tidbits that would help scientists get through the process sooner.</p>\n<p>Hope that helps!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/Dixon:Michael.html\">Michael Dixon</a>", "published": "2014-07-28 18:06:02+00:00", "title": "By: Michael Dixon"}, {"content": "<![CDATA[<p>I can&#8217;t fathom the level of governmental paranoia about these crypto related issues. If a terrorist network wants to communicate in perfect secrecy for nefarious purposes, the technology for doing this already exists: the one-time pad cryptosystem and some 64GB memory sticks to store the pad. Sixty-four gigabytes is a LOT of pad for any field agent to send and receive messages , if you include a discrete re-padding operation then your pad is virtually unlimited. The only reason I can see for the present governmental policies and programs is for some form of totalitarian control ( the &#8220;new world order&#8221;?).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hird:William.html\">William Hird</a>", "published": "2014-07-28 19:09:36+00:00", "title": "By: William Hird"}, {"content": "<![CDATA[<p>&#8220;No, no, I&#8217;m not working on cryptography at all!  My research is *solely* focused on one-way permutations, factoring semi-primes, and elliptic curves.  What could *that* have to do with cryptography?&#8221;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barta:Silas.html\">Silas Barta</a>", "published": "2014-07-28 19:10:29+00:00", "title": "By: Silas Barta"}, {"content": "<![CDATA[<p>Silas #14: ROFL!  You may have just nailed this particular problem, so we can move on to the next.</p>\n]]>", "author": "Scott", "published": "2014-07-28 19:26:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>With regard to the NSA and mathematics: it is probably worth linking to these articles published recently in the AMS- <a href=\"http://www.ams.org/notices/201406/rnoti-p623.pdf\" rel=\"nofollow\">http://www.ams.org/notices/201406/rnoti-p623.pdf</a> and <a href=\"http://www.ams.org/notices/201407/rnoti-p772.pdf\" rel=\"nofollow\">http://www.ams.org/notices/201407/rnoti-p772.pdf</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hopkins:Sam.html\">Sam Hopkins</a>", "published": "2014-07-29 00:54:34+00:00", "title": "By: Sam Hopkins"}, {"content": "<![CDATA[<p>I know it&#8217;s off-topic, but since this post started as follow-up by the previous 3 sentence post (and in case that wasn&#8217;t already done in the previous 250+ comments) I thought it might be fun to post this</p>\n<p><a href=\"http://www.huffingtonpost.co.uk/2014/07/22/the-daily-show-israel-gaza_n_5609815.html?utm_hp_ref=tw\" rel=\"nofollow\">http://www.huffingtonpost.co.uk/2014/07/22/the-daily-show-israel-gaza_n_5609815.html?utm_hp_ref=tw</a></p>\n<p>And on-topic &#8211; yes, the state department bureaucracy is laughable and laudable at the same time for the same reasons a comment above noted &#8211; in the US connection high up sometimes don&#8217;t cut you a break, and that&#8217;s refreshing for anyone who&#8217;s grown up elsewhere. If only it were that simple.</p>\n]]>", "author": "Anon", "published": "2014-07-29 03:22:15+00:00", "title": "By: Anon"}, {"content": "<![CDATA[<p>asdf #9: you don&#8217;t have to use a phone to be heard.</p>\n<p>Years ago I used to work on a voiceless speech recognition project. The primary component was a camera capturing movements of the speaker&#8217;s lips. We reached about 80% accuracy of speech recognition, comparable with voice recognition accuracy at that time.</p>\n<p>Have you seen any security cameras around?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/P:Michael.html\">Michael P</a>", "published": "2014-07-29 05:07:33+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>People in US are paranoid about everything. Either too free or too tight on things upon catastrophe incidents.  This is more of a culture phenomenon which is not surprisingly has paved it&#8217;s way into bureaucracy. A famous/leading actor from shahrukh khan was detained at New jersey airport  khan is part of his name. Unless US understands how to identify the truth in such things it&#8217;s going to become worse loosing many talented and dedicated individuals to other countries. Unless some rude awakening happens something like  real shortage of good scientists and engineers the immigration/homeland security policies will not change.</p>\n]]>", "author": "Krishna", "published": "2014-07-30 14:27:15+00:00", "title": "By: Krishna"}]