[{"content": "<![CDATA[<p>Out of my depth here, but seems like some of this may relate to the interesting, commonplace “tip-of-the-tongue” phenomenon (I studied it a bit in the 1970s, but haven’t kept up with research), wherein a person can’t quite think of a word they want, but can think of the beginning or middle letters, or the the number of syllables, or a sound-alike word, or synonymous words… they’re dabbling all around it in their ‘memory-bank’ but with difficulty specifically retrieving it.<br />\nIn turn, the whole universal phenomenon of simply speaking a proper sentence — rapidly, spontaneously drawing forth from memory the right words in the right order — that we all do all the time — seems incomprehensible! In linguistic terms, any of us is capable of producing, at any moment, a unique sentence that has never before been uttered in history, and likely never will be again.<br />\n[But maybe I'm taking you too far afield getting into speech production and processing; you have enough to deal with already!]</p>\n]]>", "author": "Shecky R", "published": "2018-07-31 22:56:16+00:00", "title": "By: Shecky R"}, {"content": "<![CDATA[<p>The next time you&#8217;re trying to identify some shrub, trust Shakespeare: &#8220;There’s rosemary, that’s for remembrance&#8221; (Hamlet) Whatever it is you&#8217;re trying to remember, it&#8217;s probably rosemary.(Applying this method to learning foreign words for &#8220;butterfly&#8221; is left as an exercise.)</p>\n]]>", "author": "larry hosken", "published": "2018-08-01 00:52:49+00:00", "title": "By: larry hosken"}, {"content": "<![CDATA[<p>Ahhh, I see now you DID make brief mention of the tip-of-the-tongue phenomena in a paragraph I somehow missed before. Duhhh! It comes right after a very brief mention of another phenomena that fascinates me: how we are able to hear just 2 or 3 notes of a melody (say, while scanning through radio channels in the car) and immediately know the specific song and musicians playing it (or similarly, as you also mention, just a whiff of a certain smell will take one back to a very specific moment or event in time). No doubt there’s some sort of algorithmic explanation, though when it happens it feels almost mystical!</p>\n]]>", "author": "Shecky R", "published": "2018-08-04 15:48:57+00:00", "title": "By: Shecky R"}, {"content": "<![CDATA[<p>A little off topic, but it would be interesting to read a post where you compare your impressions of Berkeley and Cambridge. What do you like and dislike about each city?</p>\n]]>", "author": "Guest", "published": "2018-08-06 21:41:01+00:00", "title": "By: Guest"}]