[{"content": "This comment has been removed by the author.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/e/Erickson:Jeff.html\">Jeff Erickson</a>", "published": "2016-07-06 10:16:47.629000-04:00", "title": ""}, {"content": "Announcing the location 18 months in advance isn&#39;t nearly enough. Most conferences decide (or at least announce) their location for year n at their business meeting in year (n-2). If you want to give other summer conferences (ahem) an opportunity to colocate, I&#39;d suggest announcing 2.5 years in advance, for example, announcing the 2019 location in January 2017.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/e/Erickson:Jeff.html\">Jeff Erickson</a>", "published": "2016-07-06 10:17:35.100000-04:00", "title": ""}, {"content": "On the topic of the dates -- I think it&#39;s a bit unfortunate that STOC will overlap with ICML, which (as best I can see) will take place from June 19 to 24, 2017. There was a similar overlap this year (2016) as well. I know there is coordination between ICML and COLT timings/locations. Is there a way that all three conferences could coordinate in order to avoid conflicts?", "author": "Gautam \"G\" Kamath", "published": "2016-07-06 10:46:02.828000-04:00", "title": ""}, {"content": "Jeff -- we&#39;re working on getting things decided earlier.  (2018 is already approximately decided.)  I hear your point and we&#39;ll continue to try to get &quot;on track&quot; for 2+ years earlier.<br /><br />Gautum -- I&#39;ve asked the ACM this.  They check for overlaps with other ACM conferences, but for some reason, do not track non-ACM conferences for checking for overlaps.  I agree this seems shortsighted and will continue to ask them to do this.  <br />On the other hand, what I&#39;ve found is that there are limited dates over the summer (with various graduations, 4th of July, etc.) so that if you want to have a conference in June you&#39;re bound to hit something.  I don&#39;t really see a solution unless we decide to drastically move STOC&#39;s traditional dates significantly.<br /><br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2016-07-06 12:53:40.549000-04:00", "title": ""}, {"content": "Gautam and Michael:<br /><br />ICML does not conflict. According to Bob Williamson (local organizer of ICML) it is August 6-11 2017 in Sydney.<br /><br />I believe you are looking at some website that tries to predict next year&#39;s dates using the past years, but it is wrong in this case. (Machine learning does fail sometimes. :)<br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arora:Sanjeev.html\">Sanjeev Arora</a>", "published": "2016-07-06 15:39:05.117000-04:00", "title": ""}, {"content": "Jeff, I hear you about advance notice.<br /><br />One problem with planning  future Theory Fests is that we don&#39;t know how it will work out. Could attendance go up to 500? 600?  Could we have 5 parallel workshops in future? 10?  (This could happen if many subcommunities decide to have quick workshop/short conferences around STOC.) <br /><br />All such details need to be pinned down in the contract with the conference venue. But presumably Michael and ACM will figure out venues which allow some flexibility.<br /><br /><br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arora:Sanjeev.html\">Sanjeev Arora</a>", "published": "2016-07-06 15:45:13.461000-04:00", "title": ""}, {"content": "ps For other conferences wishing to colocate even this year, I imagine it is possible to get reasonable rates from the same hotel.<br />STOC only signed the contract a month or two ago.  So it is definitely not too late. <br /><br />I am not sure you even need a local organizer; you can get info from the Theory Fest organizer. ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Arora:Sanjeev.html\">Sanjeev Arora</a>", "published": "2016-07-06 15:53:49.670000-04:00", "title": ""}, {"content": "Michael, <br /><br />For what it is worth, <a href=\"http://lics.rwth-aachen.de/lics17/preview/\" rel=\"nofollow\">LICS 2017</a> will be held in Reykjavik in exactly the same week: 20-23 June 2017 with workshops on 18-19 June. ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Aceto:Luca.html\">Luca Aceto</a>", "published": "2016-07-07 08:37:35.982000-04:00", "title": ""}]