[{"content": "<![CDATA[<p>1. I am not a fission power hater, but FE does have a LOT of problems, and certainly will not fulfill the &#8220;clean, too cheap to meter&#8221; fusion hype from the last 50+ years. The sad reality is that all power sources have a lot of problems, and are usually limited.</p>\n<p>2. I have no doubt that 100&#8242;s or 1000&#8242;s of scientists are sure that their specialty could do great stuff with $11G or so from the EU. But I think there is widespread agreement that physics looks into fundamental stuff that is at the bottom level. This kind of boils down to: &#8220;Are the QCD rules correct? Complete? The LHC is not a &#8220;find the Higgs&#8221; machine, it is the biggest microscope yet, to see what is there, and if the rules apply. The first thing the LHC has found might be the Higgs. It also might not.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2013-12-27 04:54:20+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>One of the difficulty in this debate is that it&#8217;s not clear what sort of minimum quantum circuit would clearly qualify as a computer (a custom quantum circuit that factorizes 15=5&#215;3 is more a calculator).</p>\n<p>Early classical computers were limited (laughable by today&#8217;s standards) but still immediately useful as general-purpose computing systems (with an emphasis on programmability).<br />\nThe improvement of the hardware has been so amazing that we tend to forget that classical computers are limited in many ways &#8211; minimum energy thresholds, the speed of light, quantum noise (transistors leak and erode, etc), miniaturization (at best one transistor == one atom).<br />\nThose aren&#8217;t just engineering difficulties but inherent theoretical limits.<br />\nToday those limitations are pushing back in the other direction (no more free lunch) forcing software engineers to be aware of the underlying hardware (break of abstraction) and try to rewrite their code to take advantage of hundreds of CPU cores, etc (we see a resurgence of functional programming languages, which makes parallelization somewhat less painful).</p>\n<p>QC seems trickier because the approach is bottom-up from the start, using particle state to store qbits, rather than using large clumps of matter to store bits, then refining little by little.<br />\nBut in the end I wouldn&#8217;t be surprised if the two technological efforts meet, hitting the same physical limitations and solutions.</p>\n]]>", "author": "Fred", "published": "2013-12-27 15:36:14+00:00", "title": "By: Fred"}, {"content": "<![CDATA[<p>tl;dr</p>\n<p>Now we need a tweet editor to reduce it to <=140 characters.</p>\n]]>", "author": "GDS", "published": "2013-12-28 00:54:02+00:00", "title": "By: GDS"}, {"content": "<![CDATA[<p>Your post seems to imply that QC gives speedup for factoring but not much else. When I made the same claim in a recent post I was refered to </p>\n<p>Quantum Algorithms for algebraic problems<br />\nby childs and dam</p>\n<p>which has MANY algebraic problems with super-poly speedup.<br />\nSo&#8212; are there really MANY algebraic problem s with super-poly speedup?  I was also told that quantum simulations are also an application of QC (I HAD mentioned this in my blog,<br />\nbut only briefly).</p>\n<p>Not sure I have a question here- just want you to comment on these other apps.</p>\n]]>", "author": "GASARCH", "published": "2013-12-28 01:51:17+00:00", "title": "By: GASARCH"}, {"content": "<![CDATA[<p>GASARCH #29: Yes, there are quantum speedups for lots of number-theoretic, algebraic, and (abelian) group-theoretic problems other than factoring.  Which is a difficult fact to express in the Up-Goer Five editor.</p>\n]]>", "author": "Scott", "published": "2013-12-28 12:14:42+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Nice and clear explanation. A question: Could a subtle gravitational wave passing through the quantum computer decohere the superpostion states?.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/t/Thomas:Mark.html\">Mark Thomas</a>", "published": "2013-12-28 17:30:04+00:00", "title": "By: Mark Thomas"}, {"content": "<![CDATA[<p>Mark Thomas #31: In principle, sure.  In practice, I&#8217;m told that gravitational decoherence is so many orders of magnitude smaller than other, more &#8220;prosaic&#8221; decoherence sources that it&#8217;s never anything to worry about.  (And of course, if the failure of your quantum computer to work led instead to the first direct experimental detection of gravity waves, I believe that would count as an experimental <b>success</b>! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_biggrin.gif\" alt=\":-D\" class=\"wp-smiley\" />  )</p>\n<p>Here I&#8217;m not talking about the exotic speculations of e.g. Roger Penrose, according to which gravitational effects would ultimately change quantum mechanics itself.  If true, that could certainly affect quantum computing, but so far there&#8217;s not the slightest evidence for it.  (Again, though, another reason to care about quantum computing is that, if there <i>were</i> anything that modified quantum mechanics, we&#8217;d like to push QM to its furthest limits and discover what that something is.)</p>\n]]>", "author": "Scott", "published": "2013-12-28 17:57:50+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I certainly support making large investments in trying to demonstrate (or refute) beyond-classical computational power.  </p>\n<p>In my opinion, it is a mistake to identify  &#8220;scientific value&#8221; with &#8220;attention&#8221; and with &#8220;resources&#8221;. Both resources and attention (of various forms) are instruments rather than targets in science, and they depend (and should depend) on various other factors.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2013-12-29 07:28:09+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>@Gil</p>\n<p>Can you expand on what you mean by your comment on value, attention & resources? </p>\n<p>It&#8217;s intriguing but I may not be understanding it fully.</p>\n]]>", "author": "Rahul", "published": "2013-12-29 09:21:42+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul, when it come to &#8220;resources,&#8221; beside &#8220;scientific value&#8221; a crucial ingredient is to what extent and in what way resources are useful to advance the project. When it comes to attention there is a vast difference between various scientific projects in the way they appeal to large audiences (within and outside science).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2014-01-01 07:55:23+00:00", "title": "By: Gil Kalai"}]