[{"content": "<![CDATA[<p>About the &#8220;singularity&#8221;, lots of natural/biological processes are &#8220;geometric&#8221;, but they&#8217;re all very bounded by some actual resources in their environment. They&#8217;re all some kind of transformation of something into something else.<br />\nAn atomic chain reaction.<br />\nVirus/cell reproduction is geometric (each splits in 2 every x unit of time), bounded by the available nutrients.<br />\nApparition of life on earth and the human species taking over the earth could be considered a singularity given how fast it happened on the cosmic scale. We&#8217;re limited by the earth resources, but if we could colonize the entire galaxy at the current population growth, we would saturate it in a few thousand years.</p>\n]]>", "author": "fred", "published": "2015-06-04 12:53:52+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Aren&#8217;t games invented precisely to give us a challenge when nature does not necessarily provide one?</p>\n]]>", "author": "Jr", "published": "2015-06-04 17:30:40+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>These comments remind me of the The Metamorphosis of Prime Intellect (<a href=\"http://localroger.com/prime-intellect/\" rel=\"nofollow\">http://localroger.com/prime-intellect/</a>). Be warned it has quite a bit of adult content, but it addresses this issue very well.</p>\n]]>", "author": "Orange", "published": "2015-06-05 18:33:18+00:00", "title": "By: Orange"}, {"content": "<![CDATA[<p>Scott #57</p>\n<p>I think the Fermi paradox applies to SAIs as well &#8211; why don&#8217;t we see obvious signs of them?  </p>\n<p>Did you recently see the big news item about the scan of 100,000 galaxies for signs of waste heat &#8211; nothing was found.</p>\n<p><a href=\"http://www.huffingtonpost.com/2015/04/15/search-for-alien-life-100000-galaxies_n_7063232.html\" rel=\"nofollow\">http://www.huffingtonpost.com/2015/04/15/search-for-alien-life-100000-galaxies_n_7063232.html</a></p>\n<p>&#8220;For the research, Wright and his colleagues analyzed a vast catalog of observations made in 2010 by NASA&#8217;s Wide-field Infrared Survey Explorer (WISE) space telescope. The team looked at the heat emitted by the 100,000 &#8220;most promising&#8221; candidates of the all-sky catalog&#8217;s nearly 100 million entries.&#8221;</p>\n<p>And these were the most promising candidates out of 100 million entries!  Still nothing!  By the laws of thermodynamics some infrared heat seems an unavoidable side-effect of *any* advanced technologies.</p>\n<p>It&#8217;s most odd and disconcerting.  I mean, it&#8217;s credible that we&#8217;re alone in this galaxy, but no intelligent life in 100 000 other galaxies either?</p>\n<p>Either intelligent life is much much rarer than commonly supposed, or we are forced to conclude that there is some huge gap in our understanding about the universe, or that something extremely weird is happening.</p>\n]]>", "author": "mjgeddes", "published": "2015-06-06 05:37:27+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>A brief comment on this:</p>\n<p><a href=\"http://broadspeculations.com/2015/06/06/waking-dream-being-non-being/\" rel=\"nofollow\">http://broadspeculations.com/2015/06/06/waking-dream-being-non-being/</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2015-06-06 15:02:43+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p><i>At what point do we just sit down and ask ourselves, why not put our brains in a jar, and just activate our pleasure receptors for all eternity? That seems to be the logical conclusion of that line of thinking.</i></p>\n<p>A conclusion that was indeed gamed out in a Sci Fi story many years ago:</p>\n<p><a href=\"http://www.goodreads.com/book/show/6398163-the-orchid-cage\" rel=\"nofollow\">http://www.goodreads.com/book/show/6398163-the-orchid-cage</a></p>\n]]>", "author": "quax", "published": "2015-06-07 06:30:42+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>I find it amusing what some people fret about. Oh no, someone wants to abolish suffering! Whatever will we do?!?</p>\n<p>It&#8217;s even more absurd because it&#8217;s such an unrealistic pipe dream. Not only will there never be a consensus to do this, they will also never get the technology right. And if they did, the &#8220;enhanced&#8221; organisms would die.</p>\n<p>The right answer is, &#8220;Quality over Quantity&#8221;: A small world population with high living standards.</p>\n<p><a href=\"http://fatknowledge.blogspot.de/2009/04/people-prosperity-nature.html\" rel=\"nofollow\">http://fatknowledge.blogspot.de/2009/04/people-prosperity-nature.html</a></p>\n]]>", "author": "Yawner", "published": "2015-06-07 15:29:42+00:00", "title": "By: Yawner"}, {"content": "<![CDATA[<p>&#8220;Suffering&#8221; in the discussion above is taking various meanings. Some referring to death while some are referring to pain and poverty and scarcity. Suffering to me is the state of not being in control of my own environment and that is eternal for us humans. We are constantly in transaction with our environment and we wish it to respond in a certain manner every moment. So suffering is constant. The relevant question to ask would be &#8220;Why is suffering there in the first place?&#8221; It has some purpose in the evolutionary scheme of things. That is why we as a species have not evolved out of it. It certainly has a role to play in a major way. We can not even think of causing an end to suffering unless we know what is its role in evolution. If I have to offer an explanation to the question I have raised; I suspect it is present because it is fundamental reason of our existence. It acts as a motivation for us to study our environment and try to stop all the dynamic change which occurs in nature which nature does not like because of its inertia. We are devices which nature evolved to study those changes and try to find ways to stop those changes. Suffering has given birth to religion and science and with the latter we seem to be on the right track. Once we figure why is so much dynamic change in our environment, suffering will end automatically. It can not be ended artificially.</p>\n]]>", "author": "Virendra", "published": "2015-06-07 18:04:10+00:00", "title": "By: Virendra"}, {"content": "<![CDATA[<p>#62</p>\n<p>One of your links begins with a quote from Buddha.</p>\n<p>Yet you seem to be forgetting the major lesson of Buddhism. The Buddha was raised as a prince and shielded from suffering. Eventually he encountered old age and sickness. The experience shocked him to renounce his life as a prince and to search for a Truth that would free him from suffering. </p>\n<p>There is no freedom from suffering in technology or societal engineering because suffering is built into the nature of human existence. At its root, it arises from awareness of our own ultimate dissolution.</p>\n<p>#70</p>\n<p>The evolutionary point of suffering is that without it we would have no evolution. See my more extended comment in the link I gave earlier.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2015-06-07 19:09:31+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Isn&#8217;t it important to distinguish between physical and psychological suffering? It&#8217;s easy to imagine a technologically driven significant reduction of the former. But psychological suffering? No matter how much technology changes, human beings will continue to suffer from the seven deadly sins of pride, envy, gluttony, lust, anger, greed, and sloth, and all of those sins can lead to considerable psychic distress and, yes, suffering. I suppose one could argue that human brains could be rewired to eliminate those drives, but then the resulting creature could hardly be called a human being. So fear not! Suffering is here to stay.</p>\n]]>", "author": "Joe", "published": "2015-06-07 23:46:51+00:00", "title": "By: Joe"}, {"content": "<![CDATA[<p>Even malaise-ridden people are prone to status quo bias. One way to correct such bias is to imagine a thought-experiment where we encounter an advanced civilisation that has abolished the biology of suffering. Its members enjoy lives animated entirely by information-sensitive gradients of intelligent bliss.</p>\n<p>What exactly are these super-happy extraterrestrials missing? Should we urge them to reintroduce a genetic predisposition to depression, anxiety disorders, and others nasty psychological states from their evolutionary history? Are their compassionately run wildlife parks boring in the absence of violence, predation and famine? Would their sublime aesthetic creations be more &#8220;authentic&#8221; with a bit of tormented artistic angst? </p>\n<p>I suspect they&#8217;d regard humans who advocated re-introducing such horrors as emotional primitives in the grip of a depressive psychosis.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/Pearce:David.html\">David Pearce</a>", "published": "2015-06-08 10:10:57+00:00", "title": "By: David Pearce"}, {"content": "<![CDATA[<p>Suffering cannot be extinguished it is rooted in an awareness that death is inevitable.</p>\n<p>Death is inevitable with or without a technological singularity, because even the entire universe that we live in and which underwent cosmic inflation 13.7 billion years ago will decay into a state that will not support any kind of life or intelligence at all. This will take an absurdly long time. But it will not take forever. Therefore no matter what you do you will die.</p>\n<p>If there is an end to suffering it cannot come from science or technology.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gogins:Michael.html\">Michael Gogins</a>", "published": "2015-06-08 20:19:38+00:00", "title": "By: Michael Gogins"}]