[{"content": "<![CDATA[<p>@ppnl #66</p>\n<p><i>Now create a quantum version where initially all cells are in a superposition of their states</i></p>\n<p>haha &#8211; but how do you propose that happens? Do you say, like Dirac at the 1927 conference, that Nature does all the random jumps?</p>\n<p>I think Nature must do all the random jumps, at a statistical time period close to Plank time unit, and then the rest of the universe updates via a huge unitary evolution so it knows what just happened. If it wasn&#8217;t unitary we could get infinities or zero states &#8211; maybe those are ruled out by anthropic arguments ?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2016-12-17 22:27:28+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>Planck  &#8211; my spell checker is shit</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2016-12-17 22:28:31+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>ppnl and Sniffnoy:  I always assumed the alien nerd would be calculate the billionth integer in the continued fraction expansion of pi. (<a href=\"http://oeis.org/A001203\" rel=\"nofollow\">http://oeis.org/A001203</a>)</p>\n]]>", "author": "Jair", "published": "2016-12-18 01:53:23+00:00", "title": "By: Jair"}, {"content": "<![CDATA[<p>I&#8217;d love to post this comic on Facebook, but it&#8217;s too long for reading on mobile and that&#8217;s how most people (including me) read things.  Do you have a version that&#8217;s chopped up?  Would you like a version that&#8217;s chopped up?  For instance, instead of:<br />\nA<br />\nB<br />\nC<br />\nD<br />\nE<br />\nF<br />\nI could put a version together like:<br />\nABC<br />\nDEF<br />\nso that it&#8217;s a little more readable.</p>\n]]>", "author": "Bart", "published": "2016-12-18 04:01:35+00:00", "title": "By: Bart"}, {"content": "<![CDATA[<p>Scott #70 and ppnl #66:</p>\n<p>(I am writing in reference to the description in ppnl #6, and not to quantum Darwinism as such. I didn&#8217;t know about qD, and just now rapidly browsed the Wiki article on it, that&#8217;s all.) </p>\n<p>I think that it is not the preferred basis which is primarily problematic with ppnl #66&#8217;s model. (Problematic, in the sense, what makes it unlike the actual QM.) </p>\n<p>I think there is a more basic problem here, and it is the fact that the automaton has &#8220;a set of rules of physics that is classically deterministic.&#8221; By those words, I take it that ppnl does not mean a deterministic but chaotic process underlying those rules, and imparting an apparent disorder to their outcomes. I think he means that the updating rules are the simplest deterministic here; it&#8217;s just that the number of cells and updates are great.</p>\n<p>In ppnl&#8217;s model, presumably, not just the updating rules but also the measurement rules which the observer cell uses in making its measurements, follow a classical, deterministic criterion. If the criterion is deterministic, it will impart a preferred basis. </p>\n<p>The preferred basis thus is an outcome, an not an essential feature of the model. The basic reason the preferred basis comes about is: the classical determinism.</p>\n<p>If ppnl makes either of those two&#8212;the updating rules or the measurement rules&#8212;probabilistic, then the problem would actually go away. </p>\n<p>For QM to turn probabilistic the way it is described in its axiomatic description, it is sufficient if only the measurement rule is made probabilistic. The system evolution, represented here via the updates, could very well be deterministic. In QM, the Schrodinger evolution <i>is</i> deterministic anyway.</p>\n<p>Even if both the categories of rules (updating and measurements) are kept deterministic, the machine would still show certain similarities to the quantum mechanical (i.e. the actually existing) world&#8212;viz., a reduction in the number of input states required to get to a given observed state.</p>\n<p>Yet, IMO (for whatever it is worth), speaking overall, the way this model is built is <i>not</i> how people should go about thinking about QM. The QM is about going (i) from one measured (definite) state (in whatever basis) (ii) through the deterministic Schrodinger evolution (iii) to another, probabilistically measured (but definite) state (in whatever basis). Starting a description in the middle&#8212;at (ii)&#8212;-is conceptually more difficult if not dangerous. The best way to approach QM is to start at (i), and also end at (iii). That&#8217;s what I think.</p>\n<p>Best,</p>\n<p>&#8211;Ajit<br />\n[E&OE]</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2016-12-18 04:48:47+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Jair #78: Oh, good point! But shouldn&#8217;t that be 2&pi;? 🙂</p>\n]]>", "author": "Sniffnoy", "published": "2016-12-18 07:18:38+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Excellent!</p>\n<p>(Yes, that&#8217;s all I have to say, and yes, it needs to be said ^_^ )</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Armstrong:Stuart.html\">Stuart Armstrong</a>", "published": "2016-12-18 07:22:06+00:00", "title": "By: Stuart Armstrong"}, {"content": "<![CDATA[<p>In regard to Stella&#8217;s comment (#68), not the least of many virtues of Scott&#8217;s essay “Why Philosophers Should Care About Computational Complexity” is that the essay explicitly <i>disclaims</i> coverage of several broad classes of philosophical question.  </p>\n<p>The <i>Gazette</i> of the Fondation Sciences Mathematiques de Paris takes up some of the slack in a recent interview with ISA mathematician Vladimir Voevodsky, that was published (in French) as &#8220;La bifurcation de Vladimir Voevodsky: De la théorie de l’homotopie à la théorie des types&#8221; (2014).  The <i>Gazette</i> article derives in turn from an interview (in English) that has recently become available on youtube as &#8220;<a href=\"https://www.youtube.com/watch?v=b6SgBCWPd6Y&t=16m46s\" rel=\"nofollow\">La bifurcation de Vladimir Voevodsky</a>&#8220;.</p>\n<p>In a nutshell, Voevodsky&#8217;s philosophical agenda radically embraces, as a primary objective of mathematical practice, &#8220;to read and trust and enjoy, rather than doubt and work and eventually not read at all&#8221;; moreover Voevodsky sees &#8220;no other way for mathematics to prosper.&#8221;  Yes, these philosophical ideas definitely are radical.&nbsp;🙂</p>\n<p>Needless to say, it is neither philosophically necessary nor socially desirable that every young STEAM-worker embrace Voevodskyian ideals and methods.  Yet neither is it desirable for young researchers&nbsp;&mdash; young quantum researchers in particular&nbsp;&mdash;  to be oblivious to the detailed roadmap that is set forth in works like the IAS Univalent Foundations Program&#8217;s survey &#8220;Homotopy type theory and Voevodsky&#8217;s univalent foundations&#8221; (Bull. AMS, 2014)</p>\n<blockquote><p>Ultimately, we hope that it will be possible to formalize large amounts of modern mathematics in the univalent setting, and that doing so will give rise to both new theoretical insights and good numerical algorithms (extracted from code in a proof assistant like Coq) which can be applied to real-world problems by applied mathematicians.</p></blockquote>\n<p>For practicing photonic engineers and quantum optics researchers, the fruits of this approach are manifest in practical computational tools like &#8220;MEEP: A flexible free-software package for electromagnetic simulations by the FDTD method&#8221; (Computer Physics Communications, 2010).  Students of the history of science will appreciate, too, that the (DARPA-funded) Univalent Foundations Program is a direct descendant&nbsp;&mdash; philosophically mathematically, computationally, and programmatically&nbsp;&mdash; of the (DARPA-funded) MEEP program.  This inheritance is very largely the legacy of Dennis Healy.</p>\n<p>Looking toward the quantum future, the preceding considerations provide reason to foresee that practical large-scale demonstrations (or not) of quantum supremacy&nbsp;&mdash; whether achieved by photonic BOSONSAMPLING, DWAVE-style SQUID arrays, ion traps, or any other foreseen scalable quantum technology&nbsp;&mdash; will rely crucially upon MEEP-like computational tools and philosophical/social insights like Voevodsky&#8217;s.  </p>\n<p>In summary, the present decade is proving to be a golden era for all varieties of quantum researcher&nbsp;&mdash; including philosophers.&nbsp;🙂</p>\n]]>", "author": "John Sidles", "published": "2016-12-18 11:52:08+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Ajit #80:</p>\n<p>I often have trouble understanding what you are saying. When I do think I understand it seems wrong in strange ways. For example:</p>\n<blockquote><p>I think there is a more basic problem here, and it is the fact that the automaton has “a set of rules of physics that is classically deterministic.” By those words, I take it that ppnl does not mean a deterministic but chaotic process underlying those rules,&#8230;</p></blockquote>\n<p>No, by deterministic I mean deterministic. As in the current state follows precisely from the previous state. Like Conway&#8217;s game of life for example. Now chaos may result from following the rules. But first that chaos does not change the fact that it is fully deterministic. And secondly that chaos is irrelevant to any point about quantum mechanics.</p>\n<p>And I don&#8217;t understand what you mean by measurement rules being deterministic. Quantum measurements are always irreducibly ontogicaly random. That randomness simply is. There is no underlying mechanism. That is the point of the Born rule. </p>\n<p>I&#8217;m still trying to wrap my head around Scott&#8217;s point about preferred basis. I can&#8217;t work out what it means physically. I guess that means I will have to work on an actual understanding rather than just an intuitive one.</p>\n]]>", "author": "ppnl", "published": "2016-12-18 23:36:24+00:00", "title": "By: ppnl"}, {"content": "<![CDATA[<p>Ajit #43: When you say &#8220;I haven’t so far studied the density matrix formalism at all&#8221;, do you mean that you have never seen density matrices before, or just that their ultrashort treatment found in introductory QM textbooks gave you no indication why they are useful? By ultrashort, I mean a short talk about mixed states followed by some basic facts like:</p>\n<p>definition: p = Σ p_k |ψ_k> <ψ_k|<br />\ntrace: tr(p)=1<br />\npure state: p^2=p <-> pure state<br />\nexpectation value: <A> = tr(Ap)<br />\ntime evolution (<a href=\"https://en.wikipedia.org/wiki/Density_matrix#The_von_Neumann_equation_for_time_evolution\" rel=\"nofollow\">von Neumann equation</a>): ih dp/dt = [H,p]</p>\n<p>Let me try to give some reasons (there are many more) why they are useful: (1) absence of global phase, (2) description of subsystems, (3) definition of entropy.</p>\n<p>(1) A pure state is not measurable, because the global phase cannot be measured, The global phase is absent for the description by the density matrix, and it turns out that the density matrix is indeed measurable (in a suitable sense).</p>\n<p>(2) Even if the global state of a system is given by a pure state, the state of a subsystem can in general not be described by a pure state. But the state of a subsystem can always be described by a density matrix, even if the global state of the system is itself given by a density matrix (or a pure state).</p>\n<p>(3) The <a href=\"https://en.wikipedia.org/wiki/Von_Neumann_entropy\" rel=\"nofollow\">von Neumann entropy</a> must be computed from the density matrix (or rather from the eigenvalues e_i of the density matrix p as S(p) = Σ e_i ln(e_i)). Taking the probabilities from the Born rule instead (or the p_k from the definition of the density matrix) simply gives the wrong result.</p>\n<p>The definition of the entropy was the reason why John von Neumann introduced the density matrix. The description of subsystems was the reason why Lev Landau independently invented the density matrix. And the absence of global phase is a good reason for physics students to not worry too much about the global phase.</p>\n]]>", "author": "gentzen", "published": "2016-12-18 23:40:15+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>ppnl #84:</p>\n<p>0. I won&#8217;t keep quoting your passages, though the context should make the particular reference clear. My reply does follow the order of your points in #84.</p>\n<p>1. OK. There are two different flavors of deterministic theories. One is linear, another nonlinear. The nonlinear theory (viz. that at least for some regimes of the input data, the output does not scale linearly with the input) is a good candidate for producing randomness. (Oh, BTW, &#8220;randomness&#8221; is &#8220;random-ness&#8221;: it <i>is</i> a matter of degrees.) All pseudo-random number generators rely precisely on such a (deterministic) nonlinearity. They <i>do</i> have <i>some</i> relevance to <i>some</i> points &#8220;related to QM.&#8221; All software simulations of QM phenomena rely on the pseudo random number generators&#8212;i.e. on the nonlinear determinism. If they thus are practically useful, so is the linear vs. nonlinear distinction, esp. in the context of a <i>software</i> model like CA. You failed to make it. <i>I</i> therefore had trouble understanding what you had in mind. </p>\n<p>If you would still only emphasize: &#8220;but it <i>is</i> deterministic,&#8221; then, sorry, I would have nothing to add further w.r.t. this point.</p>\n<p>2. There was a typo in my #80. Instead of &#8220;For QM to turn probabilistic,&#8221; it should be: &#8220;For CA to turn probabilistic.&#8221;</p>\n<p>But there was no typo when I wrote <i>this</i> here:</p>\n<p>&#8220;Even if both the categories of rules (updating and measurements) are kept deterministic, the machine would still show certain similarities to the quantum mechanical (i.e. the actually existing) world—viz., a reduction in the number of input states required to get to a given observed state.&#8221;</p>\n<p>In particular, notice the words: &#8220;if,&#8221; &#8220;would,&#8221; &#8220;certain,&#8221; &#8220;similarities&#8221; etc. (Is skipping such words the reason you have difficulty understanding what I write? Were you very rapidly browsing what I wrote?)</p>\n<p>3. Yes, quantum measurements are random&#8212;in the sense, quantum measurements do show randomness. </p>\n<p>That what <i>quantum</i> measurements show is a perfect randomness, is a <i>hypothesis</i> not a physically established fact. &#8230; Actually, it&#8217;s not even a hypothesis. It is just a conjecture because none has found a sensitive and accurate enough way to experimentally verify it. If you must refer to Popper&#8217;s falsifiability criterion (and I don&#8217;t care to), the matter has not yet experimentally come within the realm of falsifiability.</p>\n<p>As to me, I don&#8217;t accept the position that randomness exists in a metaphysical sense. This point of our difference is philosophical in nature; in fact even you yourself said &#8220;ontologicaly.&#8221; But QM is not a philosophical theory&#8212;it is not a branch of or theory in ontology (or metaphysics) any more than it is not a branch of theology. QM is a theory of physics. Don&#8217;t club the two together.</p>\n<p>That there is no mechanism (for what? I take it for randomness) is what Born <i>might</i> have said&#8212;and I am not sure if he really actually said <i>that</i>. Bohr could easily have said it, also Heisenberg. But Born? I am not sure. </p>\n<p>In case Born did say that: Born was not God&#8212;merely a Nobel laureate. This position (i.e., pre-emptying any possibility of there being any deeper mechanism) is not worthy of any serious attention&#8212;not in physics. May be (and just may be) Born shares a philosophic point with you, that&#8217;s all&#8212;at the most. </p>\n<p>4. The preferred basis concept is not very clear to many people, I now gather. It (and qD) certainly is not very clear to me. The concept is new; what I gathered about it could be easily wrong&#8212;because the simpler sources (Wiki, Quora, others) could also be (at least partly) wrong about it. In any case, that part of my above comment could very easily be wrong. (It was just a blog comment, and I did indicate my lack of knowledge of qD etc.) </p>\n<p>As to Scott, I am sure, he would be admiringly capable of stating what <i>he</i> did have in mind.</p>\n<p>5. If you think that I am wrong, feel free to say so too. It won&#8217;t be an <i>ad hominem</i> if you are careful to distinguish the idea from the ideator. </p>\n<p>Also, in future, if you don&#8217;t understand something I write, simple: feel free to ask me (by private email, if you wish.)</p>\n<p>But in no case would I allow you to simply observe&#8212;though publicly&#8212;that you find me difficult to understand, and let the matter explicitly stop just at that. There can be implicit bad effects out of this practice, and I am concerned about them. </p>\n<p>On my own part, I most certainly <i>don&#8217;t</i> wish to be sneering, by just putting an emphasis: &#8220;oh, <i>you</i> (possibly: you <i>all</i>) don&#8217;t understand me,&#8221; either. Hence, the suggestion&#8212;to just ask me! It helps keep the air clear.</p>\n<p>Hope I addressed all your concerns.</p>\n<p>Best,</p>\n<p>&#8211;Ajit<br />\n[E&OE]</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2016-12-19 04:30:33+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>gentzen #86:</p>\n<p>I have not worked (or thought) through density matrices. I had gathered something about them when I read those topics in text-books, but being concerned more with the foundational issues, my reading was geared towards really understanding Schrodinger&#8217;s and Heisenberg&#8217;s &#8220;pictures&#8221; first, before anything else. (It precisely is the reason why I have kept studying relativistic QM in the waiting list for quite some time&#8212;even though it&#8217;s been years since I bought Dirac&#8217;s Principles book.)</p>\n<p>But thanks for taking so much care to note down the important points about DM! I really appreciate that!! </p>\n<p>A few rapid comments:</p>\n<p>(1) seems lovely. No doubt about it.</p>\n<p>(2) I don&#8217;t quite understand right away, but never mind. (I don&#8217;t want to put you through the trouble of explaining something to me at a time that I am not even ready to understand it!)</p>\n<p>(3) won&#8217;t interest me, I am sure. The application would be of interest to information theory/TCS folks, but it is not, to me. My interests are mainly in the QM foundations and then, may be, some software simulations of some basic QM phenomena and/or applications to some topic here and there, may be, from condensed matter physics (i.e., if at all). </p>\n<p>Overall, (1) is absolutely great to have. This property by itself does motivate me to &#8220;pre-pone&#8221; my studies of density matrices to an earlier date (even if it won&#8217;t be right away&#8212;not right this week or next week!).</p>\n<p>Thanks, once again!</p>\n<p>Best,</p>\n<p>&#8211;Ajit<br />\n[E&OE]</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2016-12-19 04:51:53+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Gentzen&#8217;s remarks on density matrices (#24) are well-conceived and clearly stated (as they seem to me).  Thanks!</p>\n<p>A three-step student-friendly <i>Shtetl</i>-relevant reading program that builds on Gentzen&#8217;s remarks is:</p>\n<p>(1) Wikipedia&#8217;s article &#8220;Classical electromagnetism and special relativity&#8221;, in particular Section 2.1 &#8220;Deriving magnetism from electrostatics&#8221;.  This section begins with a Feynman quote:</p>\n<blockquote><p>One part of the force between moving charges we call the magnetic force. It is really one aspect of an electrical effect.</p></blockquote>\n<p>(2) Richard Ernst&#8217;s density-matrix-centric text (with Geoffrey Bodenhausen and Alexander Wokaun) &#8220;Principles of nuclear magnetic resonance in one and two dimensions&#8221;.  Ernst&#8217; text surveys the comprehensive capacity of density matrices in simulating quantum dynamics in the (superficially) non-relativistic world of the Schrödinger equation and the Heisenberg picture (note: Ernst&#8217; lively Nobel Biography  supplies some needed real-world zest to his dry text). In turn, Ernst&#8217;s text prepares us to appreciate a third text:</p>\n<p>(3) &#8220;Quantum mechanical NMR simulation algorithm for protein-size spin systems&#8221; by Ilya Kuprov and collaborators (JMR 2014).  The abstract of this article leads off with the challenging pro-skeptic assertion</p>\n<blockquote><p>Nuclear magnetic resonance spectroscopy is one of the few remaining areas of physical chemistry for which polynomially scaling quantum mechanical simulation methods have not so far been available. In this communication [we simulate] a protein containing over a thousand nuclear spins&nbsp;&hellip;</p></blockquote>\n<p>Two particularly commendable aspect of the Kuprov et al. article are, first, the thousand-spin quantum mechanical predictions are compared in-depth with thousand-spin experimental observations, and second, the computational methods used are well-suited to scalably simulate the dozens-of-qubit experiments that the recent Martinis/Google preprint “Characterizing quantum supremacy in near-term devices” (2016, see #75) envisions.  </p>\n<p>In a nutshell, quantum supremacists envision that Martinis-style qubit protocols may (eventually) scalably demonstrate sufficiently large-dimension/high-order quantum coherences (in density matrix lingo) as to dimensionally overwhelm Kuprov-style dissipation-dependent simulation methods, whereas skeptics repose their trust in the decoherent aspects of the quantum gauge-dynamics that Nature supplies.</p>\n<p>In aggregate, these four works&nbsp;&mdash; Ernst, Martinis, Kalai, and Kuprov&nbsp;&mdash; go far to establish the practical equivalence of Kalai-style fundamental skepticism of quantum supremacy with Kuprov-style optimism regarding the polynomially scaling celerity of quantum simulation methods for all of physical chemistry (and condensed matter physics too).  The equivalence is grounded&nbsp;&mdash; physically, mathematically, and computationally&nbsp;&mdash; in the dissipative dynamics that is generically associated to the long-range gauge-invariant interactions that (as Feynman&#8217;s quote affirms) relativistic invariance requires even of the simplest Schrödinger-equation models of condensed matter systems.</p>\n<p>A particularly wonderful aspect (as it seems to me) regarding works of Ernst, Martinis, Kalai, and Kuprov is that there&#8217;s no fundamental contradiction in regarding all of these works as excellent, and foreseeing too that the hopes of all these workers&nbsp;&mdash; including even some of the hopes of quantum supremacists&nbsp;&mdash; can be substantially realized in coming decades&nbsp;&hellip; albeit with a few adjustments!&nbsp;🙂</p>\n]]>", "author": "John Sidles", "published": "2016-12-19 13:07:34+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>But isn&#8217;t this like saying that nature must be &#8220;using&#8221; quaternions rather than rotation matrices whenever we look around?</p>\n]]>", "author": "fred", "published": "2016-12-19 13:39:27+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott #72</p>\n<p>&#8220;you would also need faster-than-light communication to coordinate the measurement outcomes between different parts of the universe.&#8221;</p>\n<p>But since *any* quantum system can be simulated on a classical digital computer, can&#8217;t we always reduce the physics of the known universe to be the output of such a simulation?<br />\n&#8220;Efficiency&#8221; is pretty much irrelevant because we (are observers inside the system) only experience each successive state, but not how those states are generated (outside of the internal time tick).<br />\nAnytime the simulation needs to simulate a random event, it would just use the next digit in PI (or any other pseudo-random sequence).</p>\n]]>", "author": "fred", "published": "2016-12-19 14:10:57+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #90: Yes, of course.  But Bell&#8217;s Theorem tells us that such a simulation of our universe on a classical digital computer would necessarily be a nonlocal one (that is, the <i>simulation</i> would involve rapid signalling between memory cells corresponding to faraway events, violating the causal structure of the spacetime, even if we, living inside the universe, never actually experienced such signalling).</p>\n<p>Of course, the aliens simulating our universe might be fine with that nonlocality, and you might be fine with it too!  But what it does is to push the alleged pseudorandomness of quantum measurement outcomes to a level that&#8217;s disconnected from what we actually know about physics.  Note, in particular, that it&#8217;s extremely important that none of us ever discover the pattern to the pseudorandomness, since if we did, we could break the whole structure of QM, communicate faster than light, etc.  Personally, I&#8217;d say that it&#8217;s of limited interest to postulate a theoretical superstructure that has to be so intentionally sequestered from everything we know about the workings of the world, but YMMV.</p>\n]]>", "author": "Scott", "published": "2016-12-19 14:57:02+00:00", "title": "By: Scott"}]