[{"content": "<![CDATA[<p>That&#8217;s what I call overnight fame:) Better at 48 than never!</p>\n<p>By the way, if you wish to see some unconditional proofs about models where postselection is really more powerful than its cousin nondeterminism, see:</p>\n<p>Abuzer Yakaryılmaz, A. C. Cem Say, “Proving the power of postselection,” Fundamenta Informaticae, Vol. 123, No. 1, pp. 107-134, 2013. (<a href=\"http://arxiv.org/abs/1111.3125\" rel=\"nofollow\">http://arxiv.org/abs/1111.3125</a>)</p>\n<p>This may also be one of the first papers where the &#8220;restarting&#8221; view of postselection was explicitly used, I guess.</p>\n<p>Thank you, Scott!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Say:Cem.html\">Cem Say</a>", "published": "2014-12-01 14:38:32+00:00", "title": "By: Cem Say"}, {"content": "<![CDATA[<p>Fred #9: On the whole, I&#8217;d say the process works extraordinarily well in math; I only wish that the error-correcting processes in other spheres (e.g. politics) worked 1% as well. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />  As you can see, errors aren&#8217;t always found right away, but if enough people care about something (often, because they&#8217;re trying to adapt it for their own work), then errors will inevitably come to light, and essentially always be acknowledged when they are.</p>\n]]>", "author": "Scott", "published": "2014-12-01 15:00:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>There is now a titanium standard of correctness of proofs of theorems:  You can encode a theorem and proof in a formal proof-checking language and have it verified by computer.   This has actually been done for at least three modern results of mathematics:  The four-color theorem, the sphere-packing conjecture in 3 dimensions, and the Feit-Thompson theorem that odd-order groups are solvable.</p>\n<p>Except for lack of training, and except that it would maybe triple the total work of the result (getting the theorem, writing the paper, etc.), there is nothing stopping Scott or anyone from doing this with one of Scott&#8217;s papers, or many people&#8217;s papers.    However, it wouldn&#8217;t have caught the first &#8220;mistake&#8221;, and maybe not the second one either.  Scott&#8217;s theorem about PostBQP is correct as stated; what we found is a mistake in the  <i>interpretation</i> of the theorem.</p>\n<p>The way that I wrote it in the paper is that for each gate set Γ, you get a complexity class PostBQP-Γ.   It is clear that if Γ is FPTEAS, then you get PostBQP-Γ ⊇ PostBQP.   (I suppose that that always holds even if Γ isn&#8217;t FPTEAS, using the quantum fault tolerance theorem!  I didn&#8217;t think of that in my paper.  If you&#8217;re keeping a hairsplitting notebook, Scott, that surely belongs there.)   To get the reverse inclusion, PostBQP-Γ ⊆ PostBQP, you need that Γ is FPTEAS and tame.  Anyway, technically speaking, Scott&#8217;s paper claims nothing rigorous about PostBQP-Γ; it is only a correctly stated and proved theorem about vanilla PostBQP.</p>\n<p>The worst that the paper has is a peripheral mistake in the definition of PostBQP rather than in the proof of the theorem.   He says, &#8220;By a result of Shi, we can assume WLOG that the circuit is composed only of Hadamard and Toffoli gates.&#8221;   So, this is clearly incomplete reasoning.   Maybe this would have been caught rather than skirted if someone did try to code this paper as a formal proof; but more because of the human reason that you have to go over everything with a fine-toothed comb when you do formal proofs.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-12-01 18:22:05+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Greg, would it really only triple the workload for these kind of theorems? I had the impression that the overhead was much worse.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/f/Fitzsimons:Joe.html\">Joe Fitzsimons</a>", "published": "2014-12-01 18:54:16+00:00", "title": "By: Joe Fitzsimons"}, {"content": "<![CDATA[<p>Joe #13 &#8211; That depends on how much of the learning curve for this sort of work is counted as continuing overhead, and how much is counted as prior training.</p>\n<p>I think that Georges Gonthier and Tom Hales have really demonstrated that it is not out of reach; that it is not 20 times or 100 times as much work as the original result.   However, certainly in the case of Hales&#8217; theorem (he encoded his own theorem!), the result is not completely satisfying.  Yes, the computer checked &#8220;the&#8221; proof &mdash; it certainly checked a complete proof, which was the purpose of the project.  However, many of the preparatory lemmas are obfuscated imitations, computer-generated as well as computer-checked, of proofs for human consumption.  It is similar to (indeed related to) the experience of Mathematica/Maple/etc. finding an integral with a 10-page calculation, when an able human can do it with a half-page calculation.</p>\n<p>Indeed Scott&#8217;s paper is sufficiently simple and conceptual that it&#8217;s not clear what you would learn from formalizing it.   I suspect that the journey would be the only reward.   You might learn nothing new about Scott&#8217;s theorem, but you could make a very interesting formalized library for quantum and classical complexity theory.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-12-01 19:30:59+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Greg: Can you recommend a good introduction to the area? I&#8217;ve always been taken with the idea, but I had previously thought the overhead would be too high.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/f/Fitzsimons:Joe.html\">Joe Fitzsimons</a>", "published": "2014-12-02 03:34:55+00:00", "title": "By: Joe Fitzsimons"}, {"content": "<![CDATA[<p>Joe &#8211; The main thing that I know about it is that one of the most successful proof systems is called &#8220;Coq&#8221;.  It means &#8220;rooster&#8221; in French.   I&#8217;m not sure why they didn&#8217;t translate the name to English for English-speaking audiences.</p>\n<p>One other thing that I know is that my late uncle, Andrzej Trybulec, created another such system called &#8220;Mizar&#8221;.   It was his life&#8217;s work.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-12-02 04:18:38+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>This kind of thing is why I&#8217;d like to get the &#8220;formally verified complexity theory&#8221; ball rolling. In complexity arguments, there are so many details to keep track of, and any small mistake could throw off an argument, that even a small amount of computer assistance could be valuable in preventing small mistakes from spreading. Some algebraic topologists (Voevodsky in particular) learnt this lesson the hard way, and Homotopy Type Theory is the happy result, a formal system capable of greatly simplifying (and verifying) proofs in algebraic topology.  It remains to be seen whether someone will invent a formal system that both simplifies complexity theoretic proofs and makes them easier to verify automatically.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mota:Francisco.html\">Francisco Mota</a>", "published": "2014-12-02 05:50:09+00:00", "title": "By: Francisco Mota"}, {"content": "<![CDATA[<p>As a Canadian, I approve of these apologies.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/Pritchard:David.html\">David Pritchard</a>", "published": "2014-12-02 07:15:26+00:00", "title": "By: David Pritchard"}, {"content": "<![CDATA[<p>Everyone should do a post like this!</p>\n<p>The issue of postselection &#8220;contaminating&#8221; the random choice of inputs to the problem reminds me of the issues discussed in<br />\n<a href=\"http://arxiv.org/abs/0908.3023\" rel=\"nofollow\">http://arxiv.org/abs/0908.3023</a><br />\nThey  too wrestle with the notion of deterministic inputs, e.g. with:</p>\n<blockquote><p> The physical interpretation of a single input might be that one has made a firm and unwavering decision to use a CTC to solve a particular problem&#8230;.\n</p></blockquote>\n<p>On a different note, I wonder if you found so many bugs in your simple and famous papers not because they are uniquely wrong, but because they are simple and famous.  I suspect that in my own papers, the # of bugs found is really a function of how comprehensible they are and how many people have looked at them.</p>\n]]>", "author": "aram", "published": "2014-12-03 01:17:28+00:00", "title": "By: aram"}, {"content": "<![CDATA[<p>Francisco &#8211; <i>In complexity arguments, there are so many details to keep track of, and any small mistake could throw off an argument, that even a small amount of computer assistance could be valuable in preventing small mistakes from spreading.</i></p>\n<p>That&#8217;s not my experience.   Many of the earlier arguments in complexity theory, which are already quite important, are based on a simple, clear, nearly inevitable idea.   Newer methods based on hashing and coding theory are more complicated, but my impression is that you build up some amount of machinery and then you see the writing on the wall.</p>\n<p>I have not seen much in this area that has the feel of delicate estimates as you see in number theory, for example.  Nor the fairly intricate algorithmic proofs as you sometimes see in geometric topology, for example.   But certainly specific algorithms in CS, as opposed to complexity theory, can be quite delicate or intricate.</p>\n<p><i>Some algebraic topologists (Voevodsky in particular) learnt this lesson the hard way, and Homotopy Type Theory is the happy result, a formal system capable of greatly simplifying (and verifying) proofs in algebraic topology.</i></p>\n<p>More power to Voevodsky for entering the field of formalized proofs, but I am not sure what it really does simplify in algebraic topology.   Algebraic topology might well benefit from a stronger connection to computer science in general, since it includes some serious complexity-theoretic and algorithmic questions.  Whether it specifically needs formalized proofs is less clear to me.</p>\n<p>As far as I know, the marquee formalized proofs by Gonthier and Hales don&#8217;t simplify anything.   Some of the proofs were simplified and improved before they could be formalized, but that&#8217;s not the same thing.   The formalized proofs do certify the results, which is very important for a different reason, to clear the air of controversy.</p>\n<p><i>It remains to be seen whether someone will invent a formal system that both simplifies complexity theoretic proofs and makes them easier to verify automatically.</i></p>\n<p>I haven&#8217;t done anything for formalized proofs in complexity theory, but I do have an old project to build an expert system of complexity class relations, that I called <a href=\"http://www.math.ucdavis.edu/~greg/zoology/\" rel=\"nofollow\">Complexity Zoology</a>.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-12-03 05:27:27+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>I appreciate Scott&#8217;s honesty.  However, given that the original theorem was wrong, what will it take now for us to be able to believe that PostBQP=PP?  </p>\n<p>It seems to me that the result is basically in limbo.  The author says that the mistake was fixed, but of course he would say that.  There isn&#8217;t a huge incentive for others to dig into the details to verify the claim.  Seeing that it took so long for the community to find this mistake, how much longer do we have to wait to get confidence in this?  I feel like I have to verify the result myself, but lack the time, or the interest in reading poorly written proofs.  As far as I can tell from this blog post, there is not even any proof currently written up for me to consider.  Maybe I am too skeptical?</p>\n]]>", "author": "Joe", "published": "2014-12-03 07:47:30+00:00", "title": "By: Joe"}, {"content": "<![CDATA[<p>Scott: Just to make sure I understand this right. You propose to choose special gates where the probabilities or amplitudes of the output encode some information.  Are you saying that then a  quantum circuit with post-selection can extract the information from the low order digits of the amplitudes effectively, but a quantum circuit without post-selection or a randomized circuit with post-selection cannot?</p>\n]]>", "author": "jonas", "published": "2014-12-03 09:45:27+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>Joe #21: I think you misunderstand the situation.  I gave a proof in the paper for PP&sube;PostBQP (which isn&#8217;t long, by the way, just 1 page).  The proof is completely valid.  Indeed, it even works with the bizarre, pathological gate sets I&#8217;m talking about in this post.</p>\n<p>Now, I also included a sentence or two to explain why the converse direction, PostBQP&sube;PP, was &#8220;obvious.&#8221;  And it <i>is</i> obvious&#8212;as long as the gate set that you used to define PostBQP isn&#8217;t too pathological.  At the time, I didn&#8217;t care about the issue of pathological gate sets, but eventually other people <i>did</i> care, and they rightly forced me to care as well.  In particular, the treatment of this issue in Greg&#8217;s paper on the Jones polynomial is fully rigorous.</p>\n<p>Interestingly, if you look at the other three examples of errors/oversights in this post, <i>every one of them</i> has a common structure.  Namely, for every statement that I recognized as central and requiring a nontrivial proof, I gave a proof that&#8217;s withstood the test of time (as proofs tend to do <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> ).  The problems arose in the auxiliary, side statements&#8212;the ones I felt were &#8220;obvious&#8221; and could be dealt with in a brief, handwavy remark or a 3-sentence proof sketch.</p>\n<p>I&#8217;ve found this to be the situation for other researchers as well: for example, a paper from the early 90s wrongly asserted that every 2-prover game has perfect parallel repetition&#8212;not because the authors gave an incorrect proof of the parallel repetition theorem, but because at the time, they considered it so obvious that it didn&#8217;t even <i>require</i> proof.</p>\n<p>Lessons about which parts of published math/TCS papers to trust and which to be skeptical about&#8212;assuming, of course, that you don&#8217;t have time to verify everything yourself&#8212;are left as exercises for the reader. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /></p>\n]]>", "author": "Scott", "published": "2014-12-03 13:02:14+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>jonas #22: No, it&#8217;s more subtle than that.  There exist gates that encode nontrivial information, in such a way that even a BQP circuit (i.e., a quantum circuit with no postselection) can efficiently extract it.  The gate G from the post provides an example of that.  There are also classical analogues of those gates: for example, a coin that lands heads with probability equal to Chaitin&#8217;s &Omega;.  A BPP machine can efficiently extract uncomputable information from those coins as well.</p>\n<p>However, there <i>also</i> exist other quantum gates&#8212;for example, those that involve amplitudes like &alpha; (i.e., sums of super-duper-rapidly decreasing sequences of rational numbers)&#8212;such that a BQP circuit could <i>not</i> efficiently extract any useful information from them, but a PostBQP circuit <i>could</i> do so, by using a combination of quantum interference and postselection.</p>\n<p>In order to get an analogous phenomenon classically, I believe you would need coins such that the probabilities of their landing heads <i>themselves</i> decreased super-duper-rapidly as a function of the input size n.  I don&#8217;t see how you could get it with coins that have constant probabilities of landing heads.  But, of course, I might be mistaken about that.</p>\n]]>", "author": "Scott", "published": "2014-12-03 13:12:24+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Should not the tenure committee be reconvened? (there is ordinarily a five year statute of limitations on such decisions)</p>\n]]>", "author": "Slipper.Mystery", "published": "2014-12-03 14:06:32+00:00", "title": "By: Slipper.Mystery"}, {"content": "<![CDATA[<p>Slipper.Mystery #25: LOL!  As it happens, all the oversights discussed in this post were committed before MIT <i>hired</i> me, let alone before they tenured me.  But yes, if they actually tenured me because they thought I&#8217;d proved PostBQP<sub>G</sub>=PP for arbitrary gate sets G, not merely for all the gate sets G that people normally care about, then I hereby invite the committee to revisit their decision.</p>\n]]>", "author": "Scott", "published": "2014-12-03 14:38:51+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Some people are here are clearly reading too much in to Scott&#8217;s style of self-criticism.   It has been reasonably standard in some papers to quantum computation solely in terms of one gate set, the Hadamard and Toffoli gates.   If you read his paper that way, it has no mistake at all, only a limitation that he didn&#8217;t properly consider.  In particular, in answer to Joe&#8217;s question, &#8220;What will it take now for us to be able to believe that PostBQP=PP&#8221;, the answer is that it only takes Scott&#8217;s paper.   The issue is not whether PostBQP=PP, the issue is whether standard PostBQP equals its other flavors, namely PostBQP-Γ for other gate sets Γ.  (I think that I still cannot do subscripts in comments in WordPress, even though Scott can!?)</p>\n<p>That said, if this is the page for hair-splitting, I do not completely agree with Scott&#8217;s comment #23.</p>\n<p>(1) I think that gate sets such as those produced by the Jones polynomial are certainly among those that people care about. That&#8217;s why this gate set issue came up in my paper.  Of course the result turns out to be true in that case, but only using the extra lemma that such a gate set Γ is tame.  So, the question is whether Scott&#8217;s tenure at MIT should be revoked because of an extra lemma that people in MO proved in 15 minutes.   I wish!   Then maybe we can hire him at UC Davis.</p>\n<p>(2) Scott&#8217;s original paper cites a paper of Shi to argue that the gate set doesn&#8217;t matter, implicitly as Scott now explains only for one side of the relation, namely PostBQP⊇PP.   The citation should really just have been for Solovay-Kitaev; as such, his paper only establishes that PostBQP-Γ⊇PP when Γ is FPTEAS.  Actually what this step really proves is PostBQP-Γ⊇PostBQP.  The only way that I know how to prove that PostBQP-Γ⊇PostBQP if Γ is not FPTEAS is to use the quantum fault tolerance theorem to coerce Γ to a nearby gate set Γ&#8217; that is FPTEAS or even rational.  (Or, maybe better, to use short words in Γ to bring it close to Hadamard-Toffoli, and then coerce it to that.)</p>\n<p>(3) If people really want to split hairs, question:   Is it the case that PostBQP-Γ⊆PostBQP if and only if Γ is both tame and FPTEAS?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-12-03 15:42:33+00:00", "title": "By: Greg Kuperberg"}]