[{"content": "<![CDATA[<p>As for there being no silver lining, won&#8217;t Trump&#8217;s policies result in more tolerable Canadian winters due to accelerated global warming? Shouldn&#8217;t Canadians celebrate his victory for this reason?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Michail:Amir.html\">Amir Michail</a>", "published": "2016-11-09 16:32:07+00:00", "title": "By: Amir Michail"}, {"content": "<![CDATA[<p>Good luck to us all.</p>\n]]>", "author": "SolveIt", "published": "2016-11-09 16:52:42+00:00", "title": "By: SolveIt"}, {"content": "<![CDATA[<p>Ditto, what Scott said&#8230;<br />\n(&#8230;will just add that those who voted for this authoritarian narcissist are pathetic suckers)</p>\n]]>", "author": "Shecky R", "published": "2016-11-09 16:57:50+00:00", "title": "By: Shecky R"}, {"content": "<![CDATA[<p>Well said. It&#8217;s a sadder day then I can properly describe, but all we can do now is wait to see the consequences and be ready to actively work against the implementation of the worst of his proposed hateful policies if such comes to pass</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Stern:Jesse.html\">Jesse Stern</a>", "published": "2016-11-09 17:00:04+00:00", "title": "By: Jesse Stern"}, {"content": "<![CDATA[<p>The latest results (as of right now) show Clinton with a larger share of the popular vote.</p>\n<p>Yeah, this is upsetting. 🙁</p>\n<p>#1 Amir: I really hope that was sarcasm.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Seita:Daniel.html\">Daniel Seita</a>", "published": "2016-11-09 17:01:13+00:00", "title": "By: Daniel Seita"}, {"content": "<![CDATA[<p>Stay strong and rock on, Scott.</p>\n<p>From my corner of the world, I watch this with a mix of surprise and apprehension at what the ripple effects will be. A good case scenario is still conceivable&#8211; that Trump and co. reveal themselves to be ineffective buffoons, thus discrediting the new nationalism in vogue these days. But then again, if the cabinet he selects look like competent people, that is a strong reason to shit bricks.</p>\n<p>As to the electorate, I insist on remaining naive. Yes, people are prejudiced (me too), but I believe that on the whole people are decent. They don&#8217;t go out of their way to harm others. The key for the political class (Left or [old-]Right, since Trump is neither) is to get in touch with their constituents again. And if they want to feel white pride, that should be possible without suppressing other groups. And if they want to feel their jobs secure, it should b&#8211; well, that one&#8217;s a storm still raging, and the computers are marching on.</p>\n<p>What can I say. The narrative was that many people wanted to see the political establishment burn. It&#8217;s burning. Up to us to contain, rebuild, improve.</p>\n<p>Cheers?</p>\n]]>", "author": "BLANDCorporatio", "published": "2016-11-09 17:05:21+00:00", "title": "By: BLANDCorporatio"}, {"content": "<![CDATA[<p>Amir, we like our winters the way they are, thank you very much!</p>\n]]>", "author": "Don Reba", "published": "2016-11-09 17:09:22+00:00", "title": "By: Don Reba"}, {"content": "<![CDATA[<p>Sad!</p>\n]]>", "author": "William Hoza", "published": "2016-11-09 17:27:44+00:00", "title": "By: William Hoza"}, {"content": "<![CDATA[<p>What do intelligent people of good will do now?  What we have always done, we build.</p>\n]]>", "author": "rick fleischer", "published": "2016-11-09 17:35:04+00:00", "title": "By: rick fleischer"}, {"content": "<![CDATA[<p>You can relax. The scary monsters that some people have been seeing were never real. And the actual real scary monsters were defeated (for the time being) at the polling booth. Despite always having previously voted Democrat, this time I was absolutely TERRIFIED at the prospect of them winning. I feared that this country would be severely and irreversibly damaged, dragging the world down with it. It&#8217;s time for the left to look inward and purge it&#8217;s cult-like elements (social justice warriors, political correctness, identity politics), and to repair its empathy malfunction that causes it to side with cheats and criminals instead of the victims and the genuinely downtrodden.</p>\n]]>", "author": "Another Trump Democrat", "published": "2016-11-09 17:39:16+00:00", "title": "By: Another Trump Democrat"}, {"content": "<![CDATA[<p>Scott, a lot of what you are saying here is total non-sense. </p>\n<p>The reason this election result was such a surprise to so many was because the _opposite_ camp to Trump has been so blatantly discriminatory against those they disagree with. More people voted for Trump than were willing to say they supported Trump. Why? Because of the aggression you&#8217;ll meet with if you openly support Trump.</p>\n<p>You realize that Trump&#8217;s daughter is Jewish. I think playing the &#8220;when will they start persecuting Jews&#8221; card is ridiculous, inflammatory, and belies an unhealthy obsession with race that many Jews have. Not responsible or reasonable.</p>\n<p>I don&#8217;t think Trump will be a good president. And I feel weird that my first comment on this excellent blog is one of disagreement, so to end with agreement: I completely agree with you about &#8220;the excesses of the social justice movement&#8221; doing so much more harm than good. I&#8217;ve silently been a huge fan of your rational, humane discourse on that touchy matter among many other, and of course science, a joy to read.</p>\n]]>", "author": "Luke", "published": "2016-11-09 17:46:25+00:00", "title": "By: Luke"}, {"content": "<![CDATA[<p>Don&#8217;t despair. Maybe quantum supremacy will let neural nets efficiently produce blackmail videos of Trump that are indistinguishable from the ones Epstien already has. If classically recorded footage of illegal activities is no longer considered acceptable evidence, we cold finally see what Trump is like without a puppeteer.</p>\n]]>", "author": "CompressiveSensor", "published": "2016-11-09 17:50:32+00:00", "title": "By: CompressiveSensor"}, {"content": "<![CDATA[<p>I&#8217;m the italian that a few months ago told you Donald Trump President wouldn&#8217;t be nearly as bad as you think he would be. Now that the happening has happened I want to know what would convince you, if anything, that Trump is not the second coming of Hitler. That way I can swing by here in two years and tell you &#8220;see, I told you&#8221;.</p>\n]]>", "author": "Anonymous", "published": "2016-11-09 17:54:05+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>Luke #11:</p>\n<ul>You realize that Trump’s daughter is Jewish.</ul>\n<p>Of course.  And there were Jews who stupidly supported him.  I&#8217;ve been emphatic, in all my previous posts, that I don&#8217;t see Trump as a Hitler figure.  I don&#8217;t even think he&#8217;s personally antisemitic (merely that a sizable fraction of his supporters are).  If I <i>did</i> think he wanted to exterminate me, I&#8217;d be packing my bags for Israel or Canada or Singapore or some other place right now, rather than merely contemplating the idea.  But what Trump <i>has</i> decisively shown is that the United States is not special in its anti-authoritarian, anti-loon defense mechanisms&#8212;i.e., that there&#8217;s nothing about its people or its institutions that protects it from the darkest forces that have ever gripped human civilization.  As a result, terrifying political possibilities that American Jews (and blacks, and Muslims, and Hispanics, and other minorities) might never have personally contemplated, or in any case not contemplated for generations, are now suddenly on the table, or back on the table.</p>\n]]>", "author": "Scott", "published": "2016-11-09 18:05:26+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>The part that bothers me is the idea of doing really well for myself, being successful.</p>\n<p><i>Tremendous job, huge.</i></p>\n]]>", "author": "Job", "published": "2016-11-09 18:20:18+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>Scott, out of curiosity, what is your view on epistocracy? (the idea of granting more voting power to people with higher degrees or based on some sort of test of basic knowledge of politics and/or history, such as a citizenship test)</p>\n]]>", "author": "Random Oracle", "published": "2016-11-09 18:36:55+00:00", "title": "By: Random Oracle"}, {"content": "<![CDATA[<p>Only silver lining I can see is that Trump might be such a catastrophe that the Republicans are thrown out of control for a few decades but that only works if we all survive the catastrophe.</p>\n<p>My attitude is summed up here.</p>\n<p><a href=\"http://www.dailykos.com/stories/2016/11/9/1594458/-We-oppose-everything\" rel=\"nofollow\">http://www.dailykos.com/stories/2016/11/9/1594458/-We-oppose-everything</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-11-09 18:39:15+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Hey, you Americans are the lucky ones. It is not likely Trump will let Putin invade America without consequence but the risk has definitely increased in Europe.</p>\n<p>Politically, ever since the Arab Spring turned Islamist, it ha felt like the world is going to hell. And maybe I am a liberal elitist but I freely admit that I don&#8217;t understand reactionary tribalist mindset that seems so popular.</p>\n]]>", "author": "Jr", "published": "2016-11-09 18:43:53+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Random Oracle #16: I think it&#8217;s hard to think of any case in human history when democracy has had a more catastrophic showing, or when some sort of epistocracy (e.g., number of votes allocated based on your score on an American history and politics test) has seemed more appealing.</p>\n<p>Even Hitler never won more than a third or so of the German vote, so his ascent to power can&#8217;t be blamed <i>quite</i> so clearly on a failure of democracy itself.</p>\n]]>", "author": "Scott", "published": "2016-11-09 19:07:50+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Nothing you or I could have done would have swapped enough votes to change the outcome of this election.</p>\n]]>", "author": "Linch", "published": "2016-11-09 19:03:49+00:00", "title": "By: Linch"}, {"content": "<![CDATA[<p>(Isn&#8217;t Trump also very pro-Israel?)</p>\n<p>The things that the West coast and East coast well-educated and well-employed privileged crowds don&#8217;t seem to be able to relate to:</p>\n<p>1) Whenever globalization is happening too fast, millions of factory workers are left behind. It&#8217;s hard to give a shit about political correctness if you can&#8217;t feed your family and have zero future.</p>\n<p>2) People living at the South border have to deal with drug cartels incursions using ISIS level violence (beheadings, etc).</p>\n]]>", "author": "fred", "published": "2016-11-09 19:04:32+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Maybe it is a time for new jokes, but it is never a time for none.  Your lecture style would suffer immensely by it.  Good luck!</p>\n]]>", "author": "Jon", "published": "2016-11-09 19:15:22+00:00", "title": "By: Jon"}, {"content": "<![CDATA[<p>The fault is also squarely on the two main parties who have held the democratic process into a total lockdown for decades.<br />\nThen they fed us with the myth that voting really makes any difference, when in fact there&#8217;s absolutely no chance for real reforms to ever happen again. The political elites know the USA is heading for the iceberg, but noone wants to even bring it up (have you looked at the staggering national debt?!)<br />\nSo we only get to pick between the nominates the two parties have chosen and groomed, which is about how things are done in China.</p>\n<p>Trump understood that the only way for an outsider to get a fair shake was to totally disregard all conventions and be ruthless.<br />\nSanders tried in a more civil fashion, but got totally screwed by the system.</p>\n]]>", "author": "fred", "published": "2016-11-09 19:18:17+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>One small consolation in this political black hole: at least you did what you could to try to prevent this (blogging, donating, arguing, trying to understand the other side). And more people voted for Clinton than for Trump. The constructive response might be if a movement started to get rid of this crazy electoral college and just go by popular vote (bonus: no more worthless votes in safe states or candidates pandering to swing states). Clinton would have won, as would have Gore in 2000.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/w/Wolf:Ronald_de.html\">Ronald de Wolf</a>", "published": "2016-11-09 19:26:23+00:00", "title": "By: Ronald de Wolf"}, {"content": "<![CDATA[<p>I think that&#8217;s the problem with the Enlightenment: its values work well only if people who make decisions share them. If you want an enlightened monarchy, you need an enlightened elite. If you want an enlightened democracy, you need enlightened people, which is a much harder goal.</p>\n]]>", "author": "Alex", "published": "2016-11-09 19:28:13+00:00", "title": "By: Alex"}, {"content": "<![CDATA[<p>Dr Aaronson &#8211; I say this with respect, but you need to get out more</p>\n<p>I always respect and value your writings, even when they are in areas (like politics) that are outside your immense expertise. But in this instance, your view of the world is constrained by the people you hang around with.</p>\n<p>Like you, I did not vote for Trump, and like you I was very surprised at the result. But it&#8217;s not the end of America or a step towards Concentration Camps. It&#8217;s just another election. You win some, you lose some, and you move on. There are a surprising number of non-racist science-loving sane people who voted for candidate T vs candidate C. It&#8217;s no reason to jump off a bridge.</p>\n]]>", "author": "TPHB", "published": "2016-11-09 19:29:08+00:00", "title": "By: TPHB"}, {"content": "<![CDATA[<p>Let&#8217;s look at the bright side:</p>\n<p>Trump is gonna appoint Howard Stern to the supreme court.</p>\n]]>", "author": "fred", "published": "2016-11-09 19:55:56+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>It&#8217;s not a bad idea to wait for a few months and see how it goes. He seemed surprisingly decent in his speech last night.</p>\n]]>", "author": "ks", "published": "2016-11-09 20:11:56+00:00", "title": "By: ks"}, {"content": "<![CDATA[<p>So what do we make of those who out of sheer &#8220;principle&#8221; decided to vote for  this<br />\n<a href=\"https://www.youtube.com/watch?v=NXhR41lsEJY\" rel=\"nofollow\">https://www.youtube.com/watch?v=NXhR41lsEJY</a><br />\nand this<br />\n<a href=\"https://www.youtube.com/watch?v=PtHTT0yRvN8\" rel=\"nofollow\">https://www.youtube.com/watch?v=PtHTT0yRvN8</a></p>\n]]>", "author": "jorp", "published": "2016-11-09 20:17:16+00:00", "title": "By: jorp"}, {"content": "<![CDATA[<p>TPHP #26: If <i>ever</i> there were a US election whose outcome provided a reason to jump off a bridge, this is the one.  Still, I won&#8217;t do it, for a few reasons:</p>\n<p>(1) There are still more theorems I&#8217;d like to prove.  In fact, Bush&#8217;s election prompted me to turn inward, away from &#8220;this shabby world of appearances&#8221; and toward the world of Forms, and it seems likely that this one will do the same.</p>\n<p>(2) If some of my relatives could get through even the Holocaust without suicide, if they could wait for someone else either to kill them or not, what right do I have to do differently?</p>\n<p>(3) In the past, what&#8217;s caused suicidal feelings in me has almost always been guilt.  In this case, however, I&#8217;m free of guilt.</p>\n<p>(4) My students.</p>\n<p>(5) Lily.  Even if the world is horrible, I have the responsibility to create a simulation of a non-horrible world for her to inhabit for a while.  (I&#8217;m just lucky that Lily&#8217;s not yet old enough to understand what happened.  The 7-year-old daughter of a colleague was sobbing when she heard the news.)</p>\n]]>", "author": "Scott", "published": "2016-11-09 20:18:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>fred #23</p>\n<p>Trump&#8217;s economic policies, if he gets his way, will explode the national debt. And why won&#8217; he get his way? Republicans are in love with tax cuts and think they are the panacea for every economic ill.</p>\n<p>We know where that goes. There is a burst of growth but  the tax revenues do not keep up with losses. Then comes the budget cutting. So who gets cut? Not the military or anything of business. Eventually will come the time for Paul Ryan&#8217;s to fulfill his Ayn Randian fantasy of eliminating social welfare programs. </p>\n<p>We will see how much the seniors who voted for Trump like it when social security and Medicare get screwed over.</p>\n<p>After the burst of growth comes the crash of course, a la Bush II.</p>\n<p>The angry blue collar will just love it when they get laid off with few unemployment benefits and their retraining programs are at Trump U.</p>\n<p>Before all that happens Trump, of course, will do enormous damage to the country as Commander in Chief. As head of the executive branch he will surround himself with toadies like Gingrich and Christie. I can easily see enemies lists. He will mobilize  government resources against anyone who opposes him and on behave of own interests. This is likely to be the main work that Trump actually does since he has little interest in policies and not enough attention span to think too deeply on any issues.</p>\n<p>If we are really really lucky he won&#8217;t start a nuclear war.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-11-09 20:44:11+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Your panicked reaction would be more fitting if you were an undocumented hispanic immigrant muslim convert. You&#8217;re an upper class caucasian with one of the most stable classes of jobs &#8211; tenured professor. I&#8217;m struggling to find exactly what it is you&#8217;re worried about. You will be one of the more protected classes in these coming 4 years. Chill the f**k out.</p>\n]]>", "author": "Gail", "published": "2016-11-09 20:45:43+00:00", "title": "By: Gail"}, {"content": "<![CDATA[<p>Regarding humor:</p>\n<p>I love this part of My Cousin Vinny.</p>\n<p><a href=\"https://www.youtube.com/watch?v=1hxuRU5IJE8\" rel=\"nofollow\">https://www.youtube.com/watch?v=1hxuRU5IJE8</a></p>\n<p>We need to make this a simple in and out procedure and get through this as easily and quickly as possible.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-11-09 20:46:49+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Scott, you&#8217;re hysterical. Calm down. Banish your emotion from the driver seat and let your rationality take control. Breath in, breath out, and ask yourself &#8211; 4 years from now when I look back at this laughably overwrought blog post, how silly will I feel?</p>\n]]>", "author": "Gail", "published": "2016-11-09 20:40:29+00:00", "title": "By: Gail"}, {"content": "<![CDATA[<p>:hug: 🙂</p>\n]]>", "author": "Luka", "published": "2016-11-09 21:07:48+00:00", "title": "By: Luka"}, {"content": "<![CDATA[<p>I&#8217;m sure you realize this, but I can personally verify that a huge number of people who voted for Trump had good intentions. For example, I hope you agree that most people within the pro-life movement have good intentions (though I recognize that reasonable people can disagree about whether the pro-life position is the correct way to implement those good intentions.) In the pro-life world, many people were shocked by what an awful candidate Trump is, but saw Clinton as an even worse candidate, because of the extremely high priority we ascribe to the anti-abortion cause and the perception that Trump is more likely to help the anti-abortion cause (even while he *hurts* non-abortion-related pro-life causes.) Among such people, there was a lot of healthy dialogue about just when you draw the line and refuse to vote for the barely-less-catastrophic of two utterly unacceptable candidates. Along with most of my friends in this position, I ended up voting for Evan McMullin, but I know several people in this position who ended up voting for Trump.</p>\n<p>Of course, none of this has any bearing on how terrible the Trump presidency is. My point is simply that we need not conclude that half of Americans are evil, stupid, etc. (On the other hand, I think the fact that Trump won the Republican *primary* election really does reflect extremely poorly on the Republican party.)</p>\n]]>", "author": "William Hoza", "published": "2016-11-09 21:08:19+00:00", "title": "By: William Hoza"}, {"content": "<![CDATA[<p>fred #20<br />\n1) I don&#8217;t think that&#8217;s true. Why would Bernie Sanders be so popular otherwise when he focused almost exclusively on economic issues affecting poorer classes? It&#8217;s just a disagreement, I don&#8217;t think Trump will be all that effective at tackling this problem.<br />\n2) Do  you have some statistics on this? Even better if they&#8217;re compared to some sort of baseline.</p>\n]]>", "author": "Juan", "published": "2016-11-09 21:17:26+00:00", "title": "By: Juan"}, {"content": "<![CDATA[<p>&#8220;If I ever missed the danger and excitement that so many European scientists and mathematicians felt in the 1930s, that sense of trying to pursue the truth even in the shadow of an aggressive and unironic evil—OK, I can cross that off the list.&#8221;</p>\n<p>Are you sure that this isn&#8217;t a little bit overdoing it? Both the comparison to the 1930&#8217;s and the &#8216;pursue of truth in the shadow of evil&#8217; seem a bit too much.</p>\n]]>", "author": "Henk", "published": "2016-11-09 21:17:41+00:00", "title": "By: Henk"}, {"content": "<![CDATA[<p>James #32</p>\n<p>What about TPP and other trade deals?</p>\n<p>Obama went out of his way to make sure the terms were hidden from the American public (Obama sure loved making more and more stuff secret&#8230; no wonder his administration freaked out so much over Snowden).</p>\n<p><a href=\"http://www.vice.com/read/everything-we-know-so-far-about-the-trans-pacific-partnership-824\" rel=\"nofollow\">http://www.vice.com/read/everything-we-know-so-far-about-the-trans-pacific-partnership-824</a></p>\n<p>That&#8217;s the one thing Trump is totally against, with Hillary constantly flip-flopping.<br />\nTrump sure has no experience as an elected official, but how much do career politicians really understand that stuff?</p>\n]]>", "author": "fred", "published": "2016-11-09 21:31:58+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>I am reminded of the old riff on Kipling: &#8220;If you can keep your head when all about you are losing theirs&#8230;then you probably just don&#8217;t understand the gravity of the situation.&#8221;</p>\n<p>Man&#8217;s place on this planet is by no means assured, and we just handed the sole control of the World&#8217;s largest nuclear arsenal to a man who has so little self control that he can&#8217;t resist 3 AM twitter wars with an ex Miss Universe.  If we don&#8217;t blow up the planet, then we may still cook it, and Trump&#8217;s election ensures that nothing will get done for at least four years.</p>\n]]>", "author": "Edm", "published": "2016-11-09 22:05:06+00:00", "title": "By: Edm"}, {"content": "<![CDATA[<p>fred #39</p>\n<p>What about them?</p>\n<p>Even if we pull out of them it won&#8217;t make any difference. </p>\n<p>We can&#8217;t compete with laborers working usually in sub-standard conditions and earning a dollar or less an hour.</p>\n<p>Eventually those workers won&#8217;t be able to compete with robots.</p>\n<p>In either case, the good paying blue collar jobs aren&#8217;t coming back in any substantial way.</p>\n<p>Trump is not going to stem the tide of history and technological progress.</p>\n<p>Before it is over he will probably sign it after he will claim to have renegotiated it because that is what the Republican Party wants.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-11-09 22:07:02+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Juan #37</p>\n<p>for what it&#8217;s worth:<br />\n<a href=\"http://www.judicialwatch.org/blog/2014/08/doj-report-nearly-half-fed-crimes-near-mexican-border/\" rel=\"nofollow\">http://www.judicialwatch.org/blog/2014/08/doj-report-nearly-half-fed-crimes-near-mexican-border/</a></p>\n]]>", "author": "fred", "published": "2016-11-09 22:09:38+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>@Scott: you say that vote swapping wasn&#8217;t a bad idea, and that people should have done more of it.  How accurate were the predictions about which states would be swing states and which ones stable on the election?  If they were very inaccurate, that would make vote swapping somewhat dangerous.  Have you seen an analysis on this?</p>\n]]>", "author": "jonas", "published": "2016-11-09 22:19:23+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>What saddens me is that somehow US couldn&#8217;t come up with better candidates? Both parties I mean.</p>\n]]>", "author": "Anon", "published": "2016-11-09 22:23:23+00:00", "title": "By: Anon"}, {"content": "<![CDATA[<p>I blame the DNC for deep-sixing Bernie, who could have beaten Trump. Hillary was such a weak, flawed candidate and Obama has failed America in so many ways that only a strong democrat had a chance of victory.</p>\n]]>", "author": "Haribo Freak", "published": "2016-11-09 22:50:59+00:00", "title": "By: Haribo Freak"}, {"content": "<![CDATA[<p>On blaming the wrong things, failing to see the underlying causes and address them with real solutions (hint: a tweak of the voting process ain&#8217;t one of them):</p>\n<p><a href=\"https://theintercept.com/2016/11/09/democrats-trump-and-the-ongoing-dangerous-refusal-to-learn-the-lesson-of-brexit/\" rel=\"nofollow\">https://theintercept.com/2016/11/09/democrats-trump-and-the-ongoing-dangerous-refusal-to-learn-the-lesson-of-brexit/</a></p>\n]]>", "author": "fred", "published": "2016-11-09 22:58:12+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>My unscientific and unsolicited guess as to how Trump managed to win despite all the poll data to the contrary was that a whole bunch of people who normally don&#8217;t vote and were not polled as likely voters came out of the woodwork to vote for Trump. However, after you (not seriously) brought it up, I now consider hacking of electronic voting machines to be also possible. Seriously, we know Trump is not morally above that sort of thing, and the Russians have some very proficient hackers.</p>\n<p>After GWB was elected in 2000, I consoled myself that he would be surrounded by experienced, professional advisers &#8211; and we know how that turned out. So I have zero consolation to give you this time. Except to say, it&#8217;s 1/2 *minus* epsilon &#8211; both Gore and HRC won the popular vote.</p>\n]]>", "author": "JimV", "published": "2016-11-09 23:09:26+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>Guess what?  That feeling you have?  It&#8217;s all in your head.<br />\nTrump supporters felt that too, the whole time, just with the roles reversed, and with less hatred and fear in their hearts.  You&#8217;ll feel better a few months after Trump takes office.</p>\n<p>There are two ways the outcome could have been different.<br />\n1) If there were a competing candidate who had personal integrity.<br />\n2) If Hillary wasn&#8217;t trying to capitalize on the system she helped to rig.  She set it up so that it was supposed to be easy for her to win.  If she didn&#8217;t do that, she would have had a chance.</p>\n<p>That&#8217;s it.  Everything that happened is the natural result of those two initial conditions.</p>\n]]>", "author": "Elliott", "published": "2016-11-09 23:14:58+00:00", "title": "By: Elliott"}, {"content": "<![CDATA[<p>Trump is probably no more than half or a quarter as bad as Hitler. Perhaps a better analogy is when the fascists took over South Africa, I think in 1948. </p>\n<p>The bad news is that the right wing nuts already have a huge fraction of power in the US. In the likely event that the new Trump crew will further rig voting rules and pack the courts, how will they ever be driven from power?</p>\n<p>For both Nazi Germany and Apartheid South Africa, the US and UK were powerful enough to lead opposition that eventually brought the terror to an end. There is no remotely powerful enough third party to oppose right wing nuts in the US if they ever take over. And they just have. Things will probably wind up being like a Latin American semi democracy, where the main business is the President and cronies looting a huge chunk of money. That is all Trump cares about, he could give a hoot about abortions, jobs, NAFTA, and the other things he promises.</p>\n<p>For those thinking that when the  uneducated white people who voted for Trump will revolt when they realize he cannot deliver any results, dream on. The Trumpsters will blame the failures on liberals, minorities, academics, as usual. People who were dumb enough to think Trump would help their lot will not be smart enough to figure out why things will get worse. The long running Republican war on education has born fruit.</p>\n<p>Of all the disappointing things about Hillary, conceding with &#8220;Trump has a right to lead&#8221; (or whatever she said) is the worst. The rightwingers never give the Democrats a chance to lead, and fight to obstruct at every step. That is how things got so bad. As much as we hate to do it, it is time for progressives to fight at every step.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-09 23:22:16+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Gail #33:</p>\n<ul>Your panicked reaction would be more fitting if you were an undocumented hispanic immigrant muslim convert.  You’re an upper class caucasian with one of the most stable classes of jobs – tenured professor.</ul>\n<p>I just considered it obvious that, if Muslims are no longer safe in the US, if Mexican-Americans aren&#8217;t safe, if blacks aren&#8217;t safe, etc., then ultimately none of us are safe.  Historically, the more usual pattern has been &#8220;first they came for the Jews&#8230;,&#8221; but if authoritarian demagogues are coming for all these other populations, surely they&#8217;ll get around to us eventually.  And even if not, it would still be my moral responsibility to speak up.</p>\n]]>", "author": "Scott", "published": "2016-11-09 23:48:40+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>James Cross #17<br />\nThat has already happened.  The Republicans and Democrats are now both damned.<br />\nRepublicans voted for Trump because he&#8217;s NOT a standard republican.  And he showed in his campaign how bad the republican party has become.  He also showed how bad the Democratic party has become.<br />\nThe democratic party would survive, but I suspect Hillary is going to be sent to prison, and she&#8217;s the backbone of the DNC.</p>\n<p>Both the RNC and DNC are damaged beyond repair now.  They have only three options: change, and get rid of the internal corruption; stay the same, and let whatever change happens over the course of 30 years happen; or double down on the corruption, and lose everything.</p>\n<p>There&#8217;s actually a very good chance of a third party president in 8 years, as long as a good candidate comes up (the only good 3rd party candidate this time was Zoltan Ishvar).</p>\n]]>", "author": "Elliott", "published": "2016-11-09 23:30:58+00:00", "title": "By: Elliott"}, {"content": "<![CDATA[<p>My wife&#8217;s American we lived in NC before moving to Canada, she was able to vote in the last elections, but not this time. She filled out the forms for an absentee ballot a months ago but received no response.</p>\n]]>", "author": "quax", "published": "2016-11-09 23:40:44+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Raoul Ohio #50 &#8220;As much as we hate to do it, it is time for progressives to fight at every step.&#8221;</p>\n<p>Trump winning is the result of the &#8220;regressive left&#8221; fighting with fire, and setting the world ablaze; all the while thinking they&#8217;re progressive.  The label &#8220;progressive&#8221; is now damaged.<br />\nTrump is the candidate that was chosen to fight the fires the progressives started.</p>\n<p>The people who voted for Trump are progressive in their own hearts.  The people who voted for Hillary are progressive in their own minds.  Both groups see the other as regressive.</p>\n]]>", "author": "Elliott", "published": "2016-11-09 23:44:24+00:00", "title": "By: Elliott"}, {"content": "<![CDATA[<p>Jonas #44<br />\nAt this point (the count is still changing, so we don&#8217;t really know how it will end up), Trump won the electoral count, and Hillary won the popular vote (many people predicted the opposite, and I predicted a Trump win on both counts).<br />\nBecause of that, it&#8217;s very possible to have made Hillary win using vote swapping.<br />\nHowever, as you stated, some swing states weren&#8217;t close to 50/50 this time, like Ohio.  And Scott thought Texas would vote Hillary, but it didn&#8217;t.  So vote swapping probably would have worked if 10-50 times as many people tried it.</p>\n<p>I suggest next time you work to make vote swapping in the form of an easy-access phone app.  The problem is: the easier it is to access it, the easier it is to commit voter fraud with it, so whoever designs this will have to be careful.</p>\n]]>", "author": "Elliott", "published": "2016-11-09 23:53:32+00:00", "title": "By: Elliott"}, {"content": "<![CDATA[<p>Honestly don&#8217;t understand the people here who are commenting in support of Trump, and profess to have a scientific education. The window on keeping CO2 atmospheric increase under control is rapidly closing. It doesn&#8217;t take evil on the level of Hitler to do considerable damage for generations to come. Inaction and indifference will suffice.</p>\n<p><a href=\"http://cdn.phys.org/newman/gfx/news/hires/2016/awarmclimate.jpg\" rel=\"nofollow\">http://cdn.phys.org/newman/gfx/news/hires/2016/awarmclimate.jpg</a></p>\n]]>", "author": "quax", "published": "2016-11-10 00:03:34+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Scott, you have a mental model predicting that the Trump presidency will be bad for the US (and possibly the world). A model is only worth taking seriously if it makes testable predictions. What are your testable predictions, say, 6 month, 1 year, 2 years, 4 years down the road? (Please feel free to reframe this question as you see fit, as long as it&#8217;s something testable, at least loosely, say, the way Scott A. #3 describes his &#8220;master persuader&#8221; predictions.)</p>\n]]>", "author": "Shmi Nux", "published": "2016-11-10 00:08:12+00:00", "title": "By: Shmi Nux"}, {"content": "<![CDATA[<p>Hi Scott,</p>\n<p>It&#8217;s not a boat I ever wanted to be in, but I&#8217;m happy to have people like you in it with me. I just wanted to wish you the best of luck today.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Ceglowski:Maciej.html\">Maciej Ceglowski</a>", "published": "2016-11-10 00:13:29+00:00", "title": "By: Maciej Ceglowski"}, {"content": "<![CDATA[<p>I woke up election morning with a nagging sense of guilt about supporting Hillary Clinton and her inevitable victory. In general, one should always side with the uneducated, the salt of the earth, the losers, the people who have nowhere else to go.</p>\n<p>Turns out they didn&#8217;t need my support. But now this has become my silver lining. If this is what my people want, then they shall have it.</p>\n]]>", "author": "jb", "published": "2016-11-10 00:38:47+00:00", "title": "By: jb"}, {"content": "<![CDATA[<p>William #36: I don&#8217;t doubt that many people who voted for Trump had good intentions&#8212;in fact, I took an enormous amount of flak in the comments of a <a href=\"http://www.scottaaronson.com/blog/?p=2931\">previous post</a>, precisely for holding firm to the idea that a person could support Trump for sincere but mistaken reasons.  (Especially if they don&#8217;t know much history, or they do but it doesn&#8217;t weigh heavily on them.)  They&#8217;ve enabled an incomprehensibly large evil&#8212;letting a new authoritarian demagogue loose on civilization, this time with the world&#8217;s largest nuclear arsenal&#8212;but that doesn&#8217;t mean they&#8217;re evil themselves.</p>\n<p>In your case, I&#8217;m glad there was someone you could vote for who shared your pro-life views but wasn&#8217;t Trump.</p>\n]]>", "author": "Scott", "published": "2016-11-10 01:26:15+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>What concerns me the most about Trump being elected is that he is inheriting the office at a time when the executive branch has way too much power to unilaterally execute military ops through JSOC, which Obama expanded significantly during his tenure.  Barack Obama targeted and killed a US citizen (Anwar al-Awlaki) with this power without a judge or jury, and killed his son in a separate operation.  If an intelligent constitutional scholar could commit such an act, what might Donald Trump do with this kind of power?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bowen:Chris.html\">Chris Bowen</a>", "published": "2016-11-10 01:00:59+00:00", "title": "By: Chris Bowen"}, {"content": "<![CDATA[<p>Thanks for writing Scott. I can only hope that I will be as wrong about the consequences of this choice as I was in predicting the result.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barak:Boaz.html\">Boaz Barak</a>", "published": "2016-11-10 01:24:50+00:00", "title": "By: Boaz Barak"}, {"content": "<![CDATA[<p>You and I are in the same boat, in that nobody is going to listen to anything we have to say about anything. On the one hand, the right can dismiss us as smug elitist Jews who think we&#8217;re better than Real Americans and don&#8217;t give a damn for their values. On the other hand, the left sees us as cis het white dudes who don&#8217;t know what it&#8217;s like, so we need to stop *splaining and check our privilege.</p>\n<p>Frustrating as hell, but slightly gratifying in that there really wasn&#8217;t a damn thing you or I could do about this abomination of an election.</p>\n]]>", "author": "BBA", "published": "2016-11-10 01:32:07+00:00", "title": "By: BBA"}, {"content": "<![CDATA[<p>Scott&#8211;</p>\n<p>I encourage you and everyone else to read Fred #20 and do so with as much empathy as you can muster.  </p>\n<p>When faced with obvious dead-end futures for your children, the choice between a deeply flawed candidate who will definitely bring more of the same, and a deeply awful human being who only probably will bring more of the same: well, teams throw Hail Mary&#8217;s even though they know they usually don&#8217;t work.</p>\n<p>Personally I think that if you &#8220;blow up the system&#8221;, the people best able to pick up the pieces will be the rich and powerful.  I think Raoul Ohío&#8217;s description of the dynamic in #50 is a likely one.  A common result of the hail Mary is the interception.  </p>\n<p>But I can wrap my head around &#8220;We were going to lose anyway.&#8221;</p>\n]]>", "author": "Andrew Foland", "published": "2016-11-10 01:32:28+00:00", "title": "By: Andrew Foland"}, {"content": "<![CDATA[<p>Shmi #57: When Bush II got in, I couldn&#8217;t predict the precise ways in which he was going to be horrible&#8212;all I knew was that<br />\n(a) he was an idiot who surrounded himself with other idiots,<br />\n(b) gutting environmental protections and giving large tax breaks to the wealthy would probably be among his &#8220;accomplishments.&#8221;</p>\n<p>I didn&#8217;t the sleeping-at-the-wheel prior to 9/11, the invasion of Iraq, the mortgage bubble, letting North Korea get nuclear weapons, or the non-response to Hurricane Katrina, all of which made him even worse than I&#8217;d imagined.</p>\n<p>Similarly, I don&#8217;t know the precise ways in which Trump is going to be horrible, although gutting environmental protections, giving huge tax breaks to the wealthy, kicking people out of the country, undermining democratic norms, and causing international conflagrations with lunatic remarks are likely to be among them.  My falsifiable prediction is that when I look back in 4 years, it will be obvious that Bush II was a distinguished statesman compared to Trump.</p>\n<p>This is also my answer to Gail #31.  I <i>have</i>, in fact, looked back at various &#8220;apocalyptic-sounding&#8221; things I wrote when Bush II got in, and with 16 years of hindsight, they seem if anything understated compared to the damage he wrought.  A conservative estimate I&#8217;ve seen is that Bush II destroyed about $10 trillion of value (in lives, material wealth, opportunity cost, and more), when you add up the Iraq war, the financial crisis, and all the other things he caused.  How upset do I feel if I cause (say) $10,000 to be wasted?  What does it <i>feel like,</i> internally, to multiply that level of upset-ness by 1 billion?  Surely, it feels much worse than how I actually felt.</p>\n<p>As I implied before, my falsifiable prediction is that Trump will destroy much more than $10 trillion worth of the world&#8217;s value.</p>\n]]>", "author": "Scott", "published": "2016-11-10 01:56:47+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>BBA #63: Dude.  Respek.</p>\n]]>", "author": "Scott", "published": "2016-11-10 01:59:05+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>#54<br />\n&#8220;[&#8230;] if Muslims are no longer safe in the US&#8221;</p>\n<p>Compared to where? Gaza? Tripoli? Mosul?</p>\n]]>", "author": "fred", "published": "2016-11-10 02:33:52+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>In the meantime, Trump has already chosen a &#8220;climate-change skeptic&#8221; to head his panel on environmental policy. What a sigh of relief (sarcasm).</p>\n]]>", "author": "Arko", "published": "2016-11-10 02:41:04+00:00", "title": "By: Arko"}, {"content": "<![CDATA[<p>Could quantum mechanics bring you comfort here Scott?  Specifically, the Many-Worlds-Interpretation?<br />\nThe prediction markets gave Trump about a 17% chance on the eve of the election.  Now presumably, this means that given the known macrostates of this region of the multiverse, in 17% of cases, Trump won.  But all macrostates can ultimately be traced back to QM events if we go far enough back in time.  So given the MWI, in 83% of branches, copies of you (Scott) are breathing a sigh of relief at a  Clinton win.</p>\n<p>In any event, Trump is only one guy, and he&#8217;s going to be heavily constrained by the congress and senate etc.   He doesn&#8217;t really strike me as a hard-core ideologue (his views seemed to shift from day-to-day) so I don&#8217;t think he really means a lot of the things he says (at least, not with any real conviction).  So he might not turn out to be all that bad.</p>\n<p>The problem is that the world is entering a &#8216;critical phase&#8217; with technologies such as artificial intelligence surging , as well as other equally serious problems such as climate change coming to the fore&#8230;Trump may not be the ideal candidate for dealing with these complex issues&#8230;</p>\n]]>", "author": "mjgeddes", "published": "2016-11-10 02:51:30+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>&#8230; on the bright side the 2020 Kanye-Trump debates are gonna be lit af</p>\n]]>", "author": "Mulch Sprongloin", "published": "2016-11-10 02:52:30+00:00", "title": "By: Mulch Sprongloin"}, {"content": "<![CDATA[<p>Raoul #16:</p>\n<blockquote><p>Scott, out of curiosity, what is your view on epistocracy? (the idea of granting more voting power to people with higher degrees or based on some sort of test of basic knowledge of politics and/or history, such as a citizenship test)</p></blockquote>\n<p>Not Scott, but I think this is a pretty bad idea.  Maybe if it&#8217;s just a basic citizenship test it&#8217;d be OK, but I&#8217;d worry about this in general.  Because (to copy a comment I made on SSC), it seems to me that this sort of thing is a great way to have politics totally corrupt society’s idea of what’s true — something that’s already enough of a problem under democracy. Basically it’s supposing that you can hold constant the measure of who’s smart, and let government be determined by that. But the more likely outcome, I believe, is the reverse: That the measure of who’s smart, and what’s true, will be corrupted to serve political ends. Again, this is already enough of a problem right now; but by increasing the amount that politickers need to corrupt the process, you increase the amount that they <i>will</i> corrupt the process by finding ways to control what you mistakenly thought of as the independent variables.</p>\n<p>By contrast, futarchy seems like a decent attempt to actually reduce the influence of politics in government, because markets are actually harder for politickers to subvert than organizations and social structures.</p>\n]]>", "author": "Sniffnoy", "published": "2016-11-10 02:54:43+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Are we great again yet?</p>\n]]>", "author": "O S Dawg", "published": "2016-11-10 03:04:20+00:00", "title": "By: O S Dawg"}, {"content": "<![CDATA[<p>Fred #67, Canada will do nicely.</p>\n]]>", "author": "quax", "published": "2016-11-10 03:06:59+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>mjgeddes #69: No, we can derive no consolation whatsoever from MWI.  For one thing, we have no idea whether Trump <i>actually</i> lost in 83% of universes, or whether the models and prediction markets were simply miscalibrated.  Maybe he lost in only 2% of universes.  Or maybe he lost in 99%, and we&#8217;re even unluckier than we thought.  It&#8217;s a situation of Knightian uncertainty.</p>\n<p>Also, in discussing the &#8220;probability of a Trump loss,&#8221; how far back are we setting the clock?  Presumably, conditioned on the state of the world in 1950, the probability of a Trump win in 2016 was tiny, whereas the probability conditioned on the state of the world 3 days ago was much higher.</p>\n<p>But more importantly: suppose Trump <i>did</i> lose in 83% of universes drawn from some reference set.  Why should one take any solace from that?  Why not instead curse one&#8217;s misfortune to live in the other 17%&#8212;a misfortune that&#8217;s all the more acute, the smaller we make his probability of winning?</p>\n]]>", "author": "Scott", "published": "2016-11-10 03:13:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Oh settle down, Chicken Little. I&#8217;m gonna find this post 3 years from now and rub your nose in the fact that the country is still standing (and probably doing just fine).</p>\n<p>Look, I&#8217;m not super-excited about Trump either, but it&#8217;s times like these that I take comfort in the fact that the POTUS doesn&#8217;t actually have that much power. He&#8217;s not Hitler, he can&#8217;t disband congress. The most likely outcome is that Trump spends the next 4 years loudly blustering and getting nothing done.</p>\n<p>Also consider that people view Trump almost *exactly* the same way that they viewed Reagan in 1980, and that turned out just fine. And at LEAST please enjoy the fact that that obstreperous thunder cunt is finally dead and buried.</p>\n]]>", "author": "Wanda Tinasky", "published": "2016-11-10 03:15:36+00:00", "title": "By: Wanda Tinasky"}, {"content": "<![CDATA[<p>Wanda #75: No, I wouldn&#8217;t say Reagan was &#8220;just fine&#8221;; I&#8217;d say he was terrible.  But just like Bush II, he now looks wonderful in retrospect, compared to even a middle-of-the-road guess for what Trump will do (forget the long tail).</p>\n<p>Also, I confess that I don&#8217;t understand the depth of Hillary-hatred, and will probably never understand it.  Her degree of lying and corruption strikes me as well within the normal range for a politician, less than that of Bush II and Cheney, and absolutely microscopic compared to that of Trump.</p>\n]]>", "author": "Scott", "published": "2016-11-10 03:26:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>My condolences. Were there any election candidates who had a policy to get rid of the Electoral College?<br />\nDifferent topic: What was Weinberg&#8217;s response to the colloquium? Interested to know, given the recent article claiming he wants an overhaul of quantum.</p>\n]]>", "author": "Parth", "published": "2016-11-10 09:40:56+00:00", "title": "By: Parth"}, {"content": "<![CDATA[<p>One thing I find puzzling is that, for someone described as an idiot, Trump has been able to defeat the two parties at their own game. Also, 43 % of college graduates voted for him.</p>\n<p>I guess producing reality shows gave him some serious social engineering/audience manipulation skills?<br />\nRemains to be seen whether he can use that to somewhat subdue all the people who didn&#8217;t vote for him and are currently freaking out&#8230;</p>\n]]>", "author": "fred", "published": "2016-11-10 11:05:00+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>mjgeddes #69</p>\n<p>At best those outcome probabilities (73% chance for HRC to win) are totally useless &#8211; how do you assess their accuracy after the fact for such a non-repeatable event/experiment?<br />\n&#8230; and dangerous in the worst case &#8211; giving a false sense of confidence or panic prior to the election, therefore possibly skewing the election process itself (&#8220;hey, no need to worry and vote, they&#8217;re saying she&#8217;ll win!&#8221;), rendering those prediction numbers even more meaningless.</p>\n]]>", "author": "fred", "published": "2016-11-10 11:23:01+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Some thoughts from a non American:</p>\n<p>a) The so called media closed eyes on secret votes, votes from frustrated people.<br />\nb) You actually lost when you let down a decent guy like Mr. Sanders. How could you choose an untrustworthy character like Mrs. Clinton over Mr. Sanders?<br />\nc) The good news is that the independent candidate&#8217;s votes has risen by nearly 300%!</p>\n]]>", "author": "Reza", "published": "2016-11-10 12:26:08+00:00", "title": "By: Reza"}, {"content": "<![CDATA[<p>Scott, Reagan was great for us the East Europeans. I am sure he helped accelerate the collapse of the USSR block and lift hundreds of millions of people from totalitarian nightmare into freedom. He will remain my hero forever and my gratitude will never disappear. I don&#8217;t know enough about his domestic policy and frankly whatever bad things he might have done pale compared to what he has done for us.</p>\n]]>", "author": "David Kyjovsky", "published": "2016-11-10 13:09:43+00:00", "title": "By: David Kyjovsky"}, {"content": "<![CDATA[<p>I think your &#8220;ifs&#8221; are indeed wishful thinking. The Democrats are to blame for pushing a candidate that not even liberals got excite about. Hillary showed poor results among key demographics, like the young, the poor and rural residents [1], and these are exactly the demographics which didn&#8217;t vote and lost the election as a result. The anti-establishment sentiment is strong in these demographics, rightfully so, and Hillary was not for them. They probably didn&#8217;t vote for Trump, they just didn&#8217;t vote.</p>\n<p>[1] <a href=\"http://www.telegraph.co.uk/news/2016/11/09/hillary-clinton-failed-to-win-over-black-hispanic-and-female-vot/\" rel=\"nofollow\">http://www.telegraph.co.uk/news/2016/11/09/hillary-clinton-failed-to-win-over-black-hispanic-and-female-vot/</a></p>\n]]>", "author": "Sandro", "published": "2016-11-10 13:17:17+00:00", "title": "By: Sandro"}, {"content": "<![CDATA[<p>What was &#8216;terrible&#8217; about Reagan? Per Capita GDP grew at an annualized rate of 3%, which is the only thing that ultimately really matters. Communism crumbled, the economy grew, and we had a leader that everyone actually liked and gave focus to a modern branch of political conservatism. Who gives a fuck about Iran-Contra. It made no long-term impact and was probably the correct short-term thing to do.</p>\n<p>You do realize that your opinion is opposed to the overwhelming historical consensus, right?</p>\n<p>Scandal has followed the Clintons EVERY SINGLE PLACE THEY&#8217;VE BEEN. She has never once seemed even remotely human. She gives the impression of an empty shell programmed by political consultants. Plus she&#8217;s just a broken person. She&#8217;s been married to Bill Fucking Clinton for 50 years! If that isn&#8217;t a referendum on her judgement and character, I don&#8217;t know what it. Plus she&#8217;s just a cunt; every time she cries an angels gets its wings.</p>\n]]>", "author": "Wanda Tinasky", "published": "2016-11-10 05:17:23+00:00", "title": "By: Wanda Tinasky"}, {"content": "<![CDATA[<p>Scott,<br />\n   I was at your talk today and I&#8217;m glad you still gave it. Thanks for powering through.<br />\nAlso, the electoral college sucks. I just hope science funding is not hit too hard by our new president-elect who thinks climate change is a hoax created by China.<br />\nKeep it up.</p>\n]]>", "author": "Alec", "published": "2016-11-10 05:32:03+00:00", "title": "By: Alec"}, {"content": "<![CDATA[<p>I thought this analysis by the leftwing blogger Yves Smith was good:</p>\n<p><a href=\"http://www.nakedcapitalism.com/2016/11/voters-repudiate-clinton.html\" rel=\"nofollow\">http://www.nakedcapitalism.com/2016/11/voters-repudiate-clinton.html</a></p>\n<p>Also I think you&#8217;re underestimating Clinton&#8217;s wrongdoing in the classified info mishandling case.  The FBI shouldn&#8217;t have caused that ruckus just a few days before the election, but they really should have gotten it right the first time and indicted her in July, so the Dems would have been able to put in another candidate.  There is a huge amount of schadenfreude on the Democratic left towards Clinton and the DNC, and I don&#8217;t accept blaming sexism since those same people were exhorting Elizabeth Warren to run early on (she refused, so Sanders got in afterwards and support shifted to him).</p>\n<p>Finally Trump and Clinton are both hugely unpopular with the broader public and whichever one got elected was/is likely to fail to win a second term, so their successor would come from the other party.  So this election only decided which order they came in.</p>\n<p>I was also upset when G. W. Bush became President in 2001.  By now though, Trump sounds like a third term of Bush with different mannerisms, and we already survived two terms of Bush, so we can handle another one.  </p>\n<p>The left wing of the internet isn&#8217;t that upset from what I can tell.  They see Trump as an acceptable price of the overdue destruction of the corrupt Third Way Democratic establishment and the race to the bottom between the major parties.  So there are visible hopes of running populist Democratic candidates in the midterms and in 2020, which would be impossible if the Clinton circle was still running the show.</p>\n]]>", "author": "Anonymous", "published": "2016-11-10 06:03:11+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>Scott #76: See that&#8217;s just it.  You&#8217;re wrong.  You don&#8217;t have the ability to find the information that would help you determine the truth.</p>\n<p>This started in 1995, and has been getting worse since.  It will probably culminate in 2022 (And as a result, people will be forced to adapt).  The sheer volume of available information makes it difficult to find relevant information.  You failed to research everything properly, because you don&#8217;t know how to do research in the current environment.  You&#8217;re probably so used to specialized scientific research that you haven&#8217;t adapted to the changes.</p>\n<p>You&#8217;re wrong about everything in relation to Trump and Hillary.  You&#8217;re exactly as wrong as you think Trump supporters are.  You&#8217;re exactly as wrong as you were right about Bush Jr.<br />\nThat&#8217;s how split and confusing everything is right now.</p>\n<p>I expect you to check your predictions once in a while, because I&#8217;ll be checking mine.<br />\nUnlike yours, though, my predictions are only based on a single observation about Hillary and Trump, and have so far turned out true.</p>\n<p>Here&#8217;s how to do research in the current environment:<br />\n1) look for internal inconsistencies.  Anything based on an internal inconsistency is inherently wrong (example: feminism)<br />\n2) look for instances where complexity is added to make the observations fit together (example: quantum color physics).  All added complexity is inherently false, but the observations are usually true, which makes the interpretation of the observations false.<br />\n3) look for the components that lack this inconsistency or complexity.  Then, check the exact opposite viewpoint in the same way.<br />\n3a) If the inconsistencies and complexities are the same as their opposite, the observations involved are true, and the interpretation has some merit.  The truth is a combination of both and neither.<br />\n3b) If opposing views have different types and levels of inconsistencies and complexities, then the chance of one interpretation being true is a direct ratio of the inverse of their scaled and weighted inconsistencies.  The least inconcistent is more likely to be true.  (eg: 20% inconsistency vs 60% inconsistency = 80:40 ratio chance of being true about any single detail)<br />\n3c) if both opposing views are inconsistent in different ways, both are equally wrong. The truth is something both different and unrelated, and requires both making a new observation and thinking from a different paradigm.<br />\n4) If everyone thinks it&#8217;s true, nobody did any fact-checking or source-checking (example: wikipedia&#8217;s sources about commonly held beliefs (like &#8220;comets are dirty ice balls&#8221;).  It&#8217;s probably based on a false premise, and merely approximates the truth periodically.</p>\n<p>I don&#8217;t expect you to know about this, because only 20% of the first-world population has an ability to do research right now.  And only 20% of that has an understanding of how to do research.  And only 20% of that can explain it to some extent.  To do research in the current environment requires an intuition honed to find inconsistency and complexity.</p>\n<p>TL;DR: You&#8217;re wrong.  The reason you&#8217;re wrong is because you lack the sentience required to understand how the world is different now, and how the world has been changing since 1995.  If you haven&#8217;t figured it out by now, you&#8217;ll probably continue to be wrong until 2022, when the whole world is going to change.</p>\n]]>", "author": "Elliott", "published": "2016-11-10 10:13:27+00:00", "title": "By: Elliott"}, {"content": "<![CDATA[<p>James #42</p>\n<p>&#8220;We can’t compete with laborers working usually in sub-standard conditions and earning a dollar or less an hour.<br />\nEventually those workers won’t be able to compete with robots.<br />\nIn either case, the good paying blue collar jobs aren’t coming back in any substantial way.<br />\nTrump is not going to stem the tide of history and technological progress.&#8221;</p>\n<p>Ok, so technical progress is unstoppable.<br />\nAnd trade agreements and job displacements are its direct consequence.<br />\nSo, the middle class is sacrificed, and the rise of Trump as their hero is therefore unavoidable too?</p>\n<p>It&#8217;s hard for us to relate when it&#8217;s not our job that&#8217;s at stake.<br />\nBut this is not limited to just the manufacturing industry.<br />\nThe first wave of deep learning AI is starting to do the same to service workers:<br />\nAutomated cars will wipe out countless jobs (truck drivers, taxi,&#8230;).<br />\nAnd this is only the start:<br />\n<a href=\"http://www.techtimes.com/articles/175238/20160827/heres-why-facebook-fired-the-team-behind-trending-topics-its-another-case-of-human-vs-machine-intelligence.htm\" rel=\"nofollow\">http://www.techtimes.com/articles/175238/20160827/heres-why-facebook-fired-the-team-behind-trending-topics-its-another-case-of-human-vs-machine-intelligence.htm</a></p>\n<p>The basic problem is this:<br />\nThe world population is currently at 7.4 billions and growing.<br />\nSay that it takes 100,000 births of &#8220;unremarkable&#8221; humans to *produce* one remarkable individual (aka genius).<br />\nThis is only sustainable if that one genius is going to come up during its lifetime with a way to keep the other 100,000 individuals employed.<br />\nThe genius could ignore their needs, but eventually we see that&#8217;s it&#8217;s leading to the equivalent of a &#8220;peasant revolution&#8221;, which is very distracting for the genius because it&#8217;s hard for him to focus when he&#8217;s not feeling safe.<br />\nHaving the genius work on improving automation/AI seems counterproductive&#8230; although, in the long run, better automation/AI will eventually also dramatically reduce the need for geniuses.<br />\nThe sooner we get there, the better?</p>\n]]>", "author": "fred", "published": "2016-11-10 13:48:07+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>It&#8217;s perfectly rational to feel horrible about what happened. The fact that a person who bragged about sexually assaulting women is going to be president ought to be horrifying, especially for someone with a young daughter they are raising in this country.</p>\n<p>But, it happened. It&#8217;s time for acceptance and figuring out what to do. Best case scenario is to recognize the guy has almost no principles, so you should figure out what to do to make the situation not as bad.</p>\n<p>Or, come up here to Canada! UBC is a great school! And so is university of Toronto and I&#8217;m sure you would love it here and be welcomed open arms!</p>\n]]>", "author": "Chris Blake", "published": "2016-11-10 14:56:40+00:00", "title": "By: Chris Blake"}, {"content": "<![CDATA[<p>I generally agree with Scott here. The situation is serious. Its important to focus on the big-picture stuff and not get distracted. Below are my thoughts on what Trump&#8217;s presidency could result in.</p>\n<p>Category I: apocalyptic (my estimate of the probability of at least one of these occurring is 5%)</p>\n<p>1) Trump&#8217;s comments embolden Putin to invade the Baltic states. Europe responds. WWWIII ensues. ICBMs are launched. All major cities are vaporized. Nuclear winter follows. Human civilization ends.</p>\n<p>2) Tensions in the South China sea escalate due to Trump&#8217;s mishandling. War with China ensues. ICBMs are launched. All major cities are vaporized. Nuclear winter follows. Human civilization ends.</p>\n<p>Category II: disastrous (my estimate of the probability of at least one of these occurring is 50%)</p>\n<p>1) Trump triggers a trade war with China. Global trade grinds to a halt due to tit-for-tat escalation of tarriffs and other trade restrictions. The world plunges into Great Depression II.</p>\n<p>2) Trump carries out his proposal to &#8220;renegotiate&#8221; the US national debt, thereby shaking investor confidence. Ratings of US bonds are downgraded. Interest rates on US government debt rise. This strains the US federal budget, calling into question the US government&#8217;s ability to honor its debts, further eroding investor confidence and driving rates even higher. This runaway feedback loop continues until the US finally defaults, thus triggering Great Depression II.</p>\n<p>3) Trump&#8217;s comments embolden Putin to invade the Baltic states. Europe doesn&#8217;t respond. 6 million people lose sovereignty and come under the control of an autocratic and corrupt regime.</p>\n<p>4) Trump kicks Islamophobia into overdrive. Muslims have their visas revoked and are deported. McCarthy-style witch hunts are initiated. Federal employees are forced to take loyalty tests and can be fired merely for associating with Muslims. An inflamed populace sporadically explodes into outbreaks of mob violence against Muslims. Possibly internment camps are built.</p>\n<p>5) Trump attempts to implement his plan for deporting Mexican illegal immigrants. Great human suffering ensues. Families are torn apart. $400 billion is spent.</p>\n<p>6) Haphazardly improvised foreign policy leads to war with a large secondary power, such as North Korea or Iran. Several tens of millions of people are killed.</p>\n<p>Category III: standard republican platform stuff (my estimate of at least one of these happening 95%)</p>\n<p>1) Re-instating torture camps for suspected terrorists.</p>\n<p>2) Trump, in collaboration with republican-controlled congress, instates substantial tax breaks on the rich combined with increased spending, which lead to ballooning deficits.</p>\n<p>3) US pulls out of climate agreements and abandons clean energy efforts. No immediate effects are seen. Decades later, when effects of climate change are costing tens or hundreds of millions of lives and doing trillions of dollars of damage, scientists estimate that a nontrivial fraction of the damage was caused by Trump&#8217;s policies. They are almost certainly correct but about half of Americans don&#8217;t believe them.</p>\n<p>Category IV: miscellaneous</p>\n<p>1) Policy changes on vaccination lead to proliferation of non-vaccinated kids. Thousands of American children unnecessarily die of gruesome diseases.</p>\n<p>I guess the rational thing to focus on is how to prepare for these scenarios. The category I disasters can&#8217;t be prepared for. If they happen we&#8217;re hosed. To prepare for category II, I guess make sure you and your loved ones have up to date passports, maybe buy some gold and stash it in a hiding place, keep your CV up to date, and help your Muslim friends set up plans for employment abroad in case things turn bad in the US? I&#8217;d be interested to hear people&#8217;s suggestions.</p>\n]]>", "author": "semi-anonymous", "published": "2016-11-10 16:07:04+00:00", "title": "By: semi-anonymous"}, {"content": "<![CDATA[<p>Scott, thank you.<br />\nI&#8217;ve been telling people that at least I&#8217;m a white immigrant, so maybe they&#8217;ll come for me last.. it makes one or two of them start thinking. </p>\n<p>My son called from college last night, said &#8220;I just wanted to hear your voices before the apocalypse came&#8221;. </p>\n<p>Gail @31, I remember getting a similar rebuke when lamenting the appointment of George II by the Supremes.  How bad could it be ? Much worse than even I imagined, as it turns out, and Scott explains @65. See also link from my name. </p>\n<p>Remember to tell everyone you meet that Hillary won the popular vote, and in Congress, the Democrats also won the popular vote. We&#8217;re not (yet) in Trump&#8217;s America. </p>\n<p>Given the appointment of climate change denier Myron Ebell to the EPA, we may have come to the end of history. That doesn&#8217;t excuse us from fighting our best on the front lines in the meantime. </p>\n<p>Hope is a state of mind, not of the world. Hope, in this deep and powerful sense, is not the same as joy that things are going well, or willingness to invest in enterprises that are obviously heading for success, but rather an ability to work for something because it is good.<br />\nVaclav Havel</p>\n]]>", "author": "Doug K", "published": "2016-11-10 17:04:19+00:00", "title": "By: Doug K"}, {"content": "<![CDATA[<p>Now we get to find out just how strong the democratic norms of &#8220;the greatest country on Earth&#8221; really are.</p>\n<p>Incidentally, I&#8217;ve never quite bought the &#8220;Trump is a fascist&#8221; idea. Yes, easy for me to say (being a white male), and doubtless some of his supporters are fascists; but I&#8217;m more concerned about his general incompetence and unpreparedness to run the country, and the possibility (okay, likelihood) that he will abuse his position to enrich himself and hound his enemies/critics.</p>\n<p>I guess that makes him like most leaders around the world and throughout history, but in a country with much stronger norms against that sort of thing. Hopefully he won&#8217;t do too much damage. That&#8217;s the optimistic take.</p>\n<p>(As an aside, I think it&#8217;s important to distinguish between the ways Trump is uniquely awful, and the ways he&#8217;s a typical Republican. Sure, it&#8217;s terrible that he will likely set action on climate change back a long way, but that&#8217;s no more true for him than other Republicans. I think they&#8217;re wrong on that, but that&#8217;s a conversation that belongs within the normal sphere of political discourse, where there&#8217;s genuine disagreement about policy. But the main threat from Trump is surely his lack of basic knowledge about policy and the world, the terrible things he says, his bullying, and his abuse of power.)</p>\n]]>", "author": "jonathan", "published": "2016-11-10 16:18:10+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>If there is anything Trump has learned from the election it would be that normal rules don&#8217;t apply to him. He has done lots of things that one would have thought would have ruined his political career: he has alienated his own party, insulted veterans and &#8220;Gold Star Parents&#8221;, insulted women, expressed authoritarian tendencies and admired Putin (who is basically an enemy of the United States). </p>\n<p>Combine this with the rather loose limits on executive power, which are to a large extent based on belief that ignoring the legal limits too much would damage the public opinion of the president, and it paints a rather frightening picture. If Trump&#8217;s advisors tells him that breaking the law would be bad PR I am not sure he would listen, and I don&#8217;t think he would care intrinsically.</p>\n]]>", "author": "Jr", "published": "2016-11-10 16:26:06+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>I&#8217;m feeling better today already.  Just look at how Mark Zuckerberg is reacting<br />\n<a href=\"https://www.thesun.co.uk/news/2157002/mark-zuckerberg-feeling-hopeful-about-america-under-donald-trump/\" rel=\"nofollow\">https://www.thesun.co.uk/news/2157002/mark-zuckerberg-feeling-hopeful-about-america-under-donald-trump/</a><br />\nHe serves as a positive example for us all.</p>\n<p>I&#8217;m still flying out to Israel tomorrow, though.</p>\n]]>", "author": "ari", "published": "2016-11-10 17:24:31+00:00", "title": "By: ari"}, {"content": "<![CDATA[<p>If the Democrats hadn&#8217;t chosen such a divisive candidate, maybe the outcome would’ve been different. </p>\n<p>If Obama had done a better job tackling poverty and inequalvote ity, maybe the outcome would’ve been different. </p>\n<p>If some of those who didn&#8217;t vote at all (47% of electorate?!) voted, maybe the outcome would’ve been different. </p>\n<p>If Clinton had done a better job of explaining her policies and why voting for her was a good idea, maybe the outcome would’ve been different. </p>\n<p>If the Democrats had done a better job of getting their voters out (DEM votes down 7m since last election???), maybe the outcome would’ve been different. </p>\n<p>If US politics wasn&#8217;t so depressingly divided along racial lines, maybe the outcome would’ve been different. </p>\n<p>Lots of reasons on both sides that the outcome could have been different!</p>\n<p>Love the blog, Scott.  </p>\n<p>Marc</p>\n]]>", "author": "marc", "published": "2016-11-10 17:57:33+00:00", "title": "By: marc"}, {"content": "<![CDATA[<p>Marc #97: Obama <i>tried</i> to tackle poverty and inequality.  The Republican Congress blocked almost everything he did, and is now once again rewarded with power for that.  That&#8217;s one of the many depressing ironies here.</p>\n]]>", "author": "Scott", "published": "2016-11-10 18:24:07+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Parth #83:</p>\n<ul>Were there any election candidates who had a policy to get rid of the Electoral College?</ul>\n<p>No.  That seems like it&#8217;s never going to happen.</p>\n<ul>Different topic: What was Weinberg’s response to the colloquium? Interested to know, given the recent article claiming he wants an overhaul of quantum.</ul>\n<p>His comment to me after the talk was simply &#8220;wow.&#8221;  I choose to interpret that as &#8220;wow, what a great talk,&#8221; even though it could also have meant &#8220;wow, what a crappy talk,&#8221; or even &#8220;wow that you did this at all on a day like this.&#8221; 🙂</p>\n<p>In any case, though, in my talk I touched on the idea of quantum computing as an incredibly stringent test of quantum mechanics itself.  That&#8217;s very much in line in Weinberg&#8217;s current thinking&#8212;that we could be doing more to <i>test</i> quantum mechanics, rather than just interpreting it and philosophizing about it.</p>\n]]>", "author": "Scott", "published": "2016-11-10 18:28:51+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>The silent majority have spoken. At least half of the country is hurting. Eight years of the current policies have not helped the working class. Many are left with only part-time work with no benefits, and the premiums of Obamacare are skyrocketing. Some have to work multiple jobs to make ends meet. On Tuesday they’ve found hope in the only candidate who has promised them real positive change and who has a long resume of solving real-world problems successfully. They *love* this man, and for good reasons. Those who are guaranteed employment—lifetime tenure, for example—should at least not stand in the way of problem-solving, if they’re unwilling to be part of the solution.</p>\n<p>It’s unfortunate that the national media have demonized him by accusing him of every ism under the sun, when in fact, his words (if quoted correctly, in context) and past actions do not support it. Such propaganda is unhelpful to the country, to say the least.</p>\n]]>", "author": "Impartial Observer", "published": "2016-11-10 18:42:56+00:00", "title": "By: Impartial Observer"}, {"content": "<![CDATA[<p>&#8220;Impartial Observer&#8221; #100: Except that in this case, the &#8220;silent majority&#8221; wasn&#8217;t actually a majority!</p>\n<p>More broadly: exactly as Scott Alexander warned, people are now pontificating about the &#8220;meaning&#8221; of the vote, the &#8220;message&#8221; the electorate was sending, even though obviously that message is nearly indistinguishable from the one it would have sent had Hillary narrowly won the Electoral College (say, because of a slightly different geographic distribution of her voters) and Trump narrowly lost.</p>\n<p>I will resist any effort to normalize this outcome.  Trump is just an authoritarian strongman who happens to have taken power over my country, or former country, by explicitly promising not to respect its laws, principles, and institutions.  He didn&#8217;t magically become something more than that because of a couple hundred thousand votes in Michigan, Wisconsin, etc that could have just as easily gone the other way.</p>\n]]>", "author": "Scott", "published": "2016-11-10 19:11:58+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I agree with Scott other than his views on the electoral college (which is imperfect but probably necessary).  </p>\n<p>I actually do think it is unreported how much the social justice thing has led to a backlash.  If you read Reddit and online forums where you actually see large amounts of Trump supporters (I find it extremely difficult to actually find these people represented online, either on facebook or elsewhere) you can read that almost every other post is some sarcastic take on pc culture.</p>\n<p>So I don&#8217;t quite agree that it is all about racism and sexism (although that&#8217;s part of it), but the strong backlash against the extremism on the left is ubiquitous.</p>\n<p>One of my great regrets is that it seems like instead of actually listening to what these people say, most of my friends on the left have hardened their positions and stayed within the wrong narrative that the media framed during the elections.</p>\n]]>", "author": "Haelfix", "published": "2016-11-10 18:57:33+00:00", "title": "By: Haelfix"}, {"content": "<![CDATA[<p>semi-anonymous &#8211; Comment #92: I broadly agree with your scenarios. My decision to leave the US was triggered by the Bush Jr. re-election, and that is when I also started to accumulate gold. Bitcoins nowadays are a good option as well (for any scenario less than a full on nuclear apocalypse). Neither regretted my decision to buy gold at $460/oz nor my relocation to Canada.  It is a good country to raise kids.</p>\n<p>mjgeddes #69: Just want to use this opportunity to have it on the record of these historically important archives of Scott&#8217;s blog, that I want to live in a branch of the multiverse where Hitler was killed in an early assassination attempt, Rubin did survive his shooting and Trump had never been born.</p>\n<p>Personally I think this election adjusted my priors for the &#8220;Universe as a Simulation&#8221; hypothesis. Having a Trump presidency foreshadowed in a 15 year old Simpson&#8217;s episode and then actually going for it? C&#8217;mon, it has juvenile hacker&#8217;s joke written all over it.</p>\n<p>Scott #99, very cool to hear that Weinberg and you think about ideas to use quantum computing as an incredibly stringent test of quantum mechanics itself.  I&#8217;ve always hoped to see some concerted research efforts in this area!</p>\n]]>", "author": "quax", "published": "2016-11-10 19:22:40+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Elliot has one thing right: Vote swapping is a bad idea for many reasons. Anyone should be able to figure some of them out.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-10 19:49:13+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Scott #67. Trump is highly likely to be vastly worse than Bush II.</p>\n<p>Trump is actually a total wildcard. No one has any idea what he might do, or if he cares about anything. A lot of what he said is obvious BS that he probably made up on the spot. Maybe he totally does not care what he promised rednecks. He probably got bullied by rednecks himself, as a second generation immigrant. </p>\n<p>However, he is likely to put evil doers in positions of power, much like Bush II, only worse. Hopefully Chris Christie will be in jail before he can become Attorney General.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-10 19:57:26+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>I can explain the Hillary-hatred:</p>\n<p>1. An eight year, multi million $ right wing nut media smear job because she was the likely next candidate.</p>\n<p>2. People who do not want a woman leader.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-10 20:02:20+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Thanks to the effort of Scott and others, I decided to teleport my vote from blue WA to beleaguered Pennsylvania. So even if it was ultimately fruitless, I&#8217;m happy to say we made an effort to stop the orange menace.</p>\n]]>", "author": "Jair", "published": "2016-11-10 20:12:49+00:00", "title": "By: Jair"}, {"content": "<![CDATA[<p>Haelfix #101:</p>\n<ul>I agree with Scott other than his views on the electoral college (which is imperfect but probably necessary).</ul>\n<p>Thanks, but why on earth is it necessary?  Most other democracies have a direct popular vote rather than a tiered majority; why couldn&#8217;t we?</p>\n]]>", "author": "Scott", "published": "2016-11-10 20:15:23+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, It&#8217;s not an authoritarian take over. He won fair and square in the election. Don&#8217;t understand why all these hoopla even before he takes charge in the office.</p>\n]]>", "author": "ks", "published": "2016-11-10 20:27:10+00:00", "title": "By: ks"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>I think that your reply to Shmi #57, was less than intellectually honest.  </p>\n<p>The basic question here is whether your model of the world is correct.  Some might say that your understanding of the world is simply wrong and that Trump would either not matter much while others may even believe that he will do good.  </p>\n<p>At the level of fear that you are demonstrating, it is completely reasonable to ask about specific outcomes that you think will be so bad.  SPECIFIC OUTCOMES that can be tested.  There are many such quantifiable testable outcomes, that can capture various types of issues: do you want to economic questions like count GDP growth? Gini coefficient?  Poverty rates? Maybe Geo-political: Number of wars US is involved with (say weighted by number of soldiers involved)?  Number of dead US soldiers?  Effects on various social groups? Median salary of Hispanic families?  Womens&#8217; average salary compared to Mens&#8217;?  Murder rate?  Infant mortality? </p>\n<p>Pick anything that you want, but it has to be testable, and cannot be something vague or disputed like &#8220;bad judges appointed to the supreme court&#8221; or &#8220;silly things are said about global warming&#8221; or &#8220;this is bad, but will only be proven in the future&#8221;.  </p>\n<p>If you can&#8217;t commit yourself to some concrete testable measures of success/failure that you believe that Trump will totally screw up, then it is hard to take your sense of impending doom seriously.  Maybe your whole world view about society is simply wrong?</p>\n]]>", "author": "Non-American", "published": "2016-11-10 20:32:35+00:00", "title": "By: Non-American"}, {"content": "<![CDATA[<p>&#8220;After all, I wouldn’t feel safe in Erdogan’s Turkey or the Mullahs’ Iran.&#8221;</p>\n<p>Scott, exaggeration can attract attention, provoke, amuse and well express one&#8217;s emotions. But one has to be careful about two things. One (related to some posts in the past and not this one) is that exaggeration can lead to crossing the line between criticism and shaming. The second (related to this post) is that in grave situations when there are serious concerns and a real danger (like the present one) exaggeration can be counterproductive and accuracy is important.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2016-11-10 20:35:35+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<blockquote><p>Scott, It’s not an authoritarian take over. He won fair and square in the election. Don’t understand why all these hoopla even before he takes charge in the office.</p></blockquote>\n<p>Just because you won an election fair and square doesn&#8217;t mean you&#8217;re not an authoritarian.  I&#8217;ve see nothing to indicate that Erdogan cheated at his elections, for instance, but he&#8217;s still an authoritarian.  There&#8217;s more to liberal democracy, and more to the law and constitution, than just elections, you know.</p>\n]]>", "author": "Sniffnoy", "published": "2016-11-10 20:39:01+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>ks #109: It&#8217;s <i>absolutely</i> an authoritarian takeover&#8212;one that half the country happened to want.  What makes it authoritarian isn&#8217;t the manner of the takeover but, rather, Trump&#8217;s open contempt for democratic norms (including inciting violence at his rallies, vowing revenge against journalists who criticize him, and attacking a judge for his ethnic background, just to pick three examples).</p>\n<p>What separates the liberal democracies from the world&#8217;s various dictator-run hellholes isn&#8217;t simply majority rule; rather, it&#8217;s the presence of a web of safeguards to protect individuals and minorities <i>against</i> the whims of the majority.  That&#8217;s what we&#8217;ll no longer have, if the president is anything like the candidate.</p>\n<p>[sorry, crossed comments with Sniffnoy, who says much the same thing!]</p>\n]]>", "author": "Scott", "published": "2016-11-10 20:43:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #113: You said it better, though. 🙂</p>\n]]>", "author": "Sniffnoy", "published": "2016-11-10 20:54:53+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Raoul #105, <i>Hopefully Chris Christie will be in jail before he can become Attorney General.</i></p>\n<p>I fail to see how Giuliani will be any better.</p>\n<p>As to the beleaguered Democrats in the US, I suggested there is one thing to learn from the Republicans: How to play hardball.</p>\n<p>Treat Trump with the same respect that he afforded President Obama.  I suggest the following mantra: Trump is an imposter, he did not win the popular vote, and a hostile foreign power meddled with the election process (Russia admitted as much).</p>\n<p>For now, delegitimizing Trump&#8217;s presidency from the get-go will not change the balance of power, but it may give moderate GOP senators some second thoughts on falling into line &#8211; and the Senate is evenly split. It will also lay the groundwork for the midterm elections, which traditionally sees lower Democratic turn out.</p>\n]]>", "author": "quax", "published": "2016-11-10 20:59:31+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Gil #111: Not only do I not think I&#8217;m &#8220;exaggerating,&#8221; but I&#8217;d submit that anyone who isn&#8217;t ripping-their-hair-out terrified, has simply failed to appreciate the gravity of what just happened.  Either because they celebrate Trump&#8217;s authoritarian tendencies, or because they fail to see those tendencies for what they are, or, ironically, because they&#8217;re far leftists who falsely believe that the US was <i>always</i> a Trumpist authoritarian regime, so what&#8217;s the difference now?  (I&#8217;ve been hearing a lot from that third group in my comment feed&#8212;maybe I&#8217;ll pull one of their nasty screeds out of moderation so you can see.)</p>\n<p>The oft-conjoined concepts of calmness and rationality, I&#8217;d claim, have parted ways and are now on separate galaxies.</p>\n]]>", "author": "Scott", "published": "2016-11-10 21:00:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;But what Trump has decisively shown is that the United States is not special in its anti-authoritarian, anti-loon defense mechanisms—i.e., that there’s nothing about its people or its institutions that protects it from the darkest forces that have ever gripped human civilization.&#8221;</p>\n<p>Mr. Aaronson, where have you been living all your life?<br />\nThose &#8220;darkest forces&#8221; are and were fully at work here for centuries &#8211; just because you personally did not happen to be affected by them you chose to ignore that or dismiss it as fantasy; only now, as you see that you, too, could be affected, you start crying. That&#8217;s not blissful ignorance, that&#8217;s pure egoism combined with criminal negligence on your part.</p>\n<p>I like your blog and your stance on scientific matters, but looking at what you reveal yourself to be as human being &#8230; well,  be happy:<br />\nyou are exactly on the same level Mr. Trump is.</p>\n]]>", "author": "T.", "published": "2016-11-10 21:03:32+00:00", "title": "By: T."}, {"content": "<![CDATA[<p>Scott: in response to your 10-Nov update, I can say that as a postdoc from Africa, I at least have no intention of leaving the US at this stage. I still believe it to be the best country in the world for an academic scientist.</p>\n<p>If the republicans choose to savage the science budget, then I will flee. But as things stand now, I consider myself completely safe in America, or at least as safe as I was two days ago. The US has the largest and most impressive research enterprise in the world, and I am in the US legally, and there exist legal paths for me to stay in the US that I have not heard Trump claiming he will close (I&#8217;m yet to hear Trump, or any other republican, claim they want to shut off all skilled immigration of students whose graduate education the federal government has funded). Academic appointments are made meritocratically (except in cases where affirmative action is applied, but I benefit under these policies), which is more than can be said for basically any other country with the possible exception of Canada and maybe Singapore/Switzerland. (As you likely know, in Europe/the UK/Japan/China/etc., most appointments are made based on hierarchy and connections, not scientific ideas or output. The US remains the outright leader in using a merit-based approach to appointing non-minorities in academia, and I don&#8217;t see this changing as a result of the Trump presidency.)</p>\n<p>So I live in hope, not fear!</p>\n]]>", "author": "abu", "published": "2016-11-10 21:07:16+00:00", "title": "By: abu"}, {"content": "<![CDATA[<p>Scott #108</p>\n<p>That&#8217;s because it was just way more practical this way in the old days:</p>\n<p>Compared to other democracies, the US is a vast territory.<br />\nDealing with total direct votes would involve too many digits, a potential source of confusion.<br />\nSo, small tallies were done locally, and each sub-result was passed to its assigned elector, who then just needed to memorize the name of the winner, not some complicated abstract number. In those days the few people who could read, write, and count were too precious to be wasted as electors (that&#8217;s also why it took so long to come up with the first accurate census in the US).</p>\n<p>Each elector was then sent on a long and perilous journey by horse carriage to the capital (weeks through hostile savage territory).</p>\n<p>The problem was that even if an elector was lucky enough to make it alive to the capital, nobody there could be sure he was the right dude or that he wasn&#8217;t lying about his result (most couldn&#8217;t even remember the name of the winner).<br />\nBut the founding fathers came up with an elegant solution: the electors were only *pledging* to follow the decision of the popular vote and didn&#8217;t even have to honor that pledge.</p>\n]]>", "author": "fred", "published": "2016-11-10 21:33:57+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Here are the facts, shorn of any analysis: </p>\n<p>&#8211; Voter turnout was estimated to be around 57% of the eligible population. So about 43% of eligible voters did not exercise their right to vote.</p>\n<p> &#8211; Nearly 59 million people voted for Trump. About the same number voted for Clinton.</p>\n<p>As the other Scott writes, the election shouldn&#8217;t change whatever narrative one had, provided one arrived at it through an accounting of the facts. </p>\n<p><a href=\"http://slatestarcodex.com/2016/11/07/tuesday-shouldnt-change-the-narrative/\" rel=\"nofollow\">http://slatestarcodex.com/2016/11/07/tuesday-shouldnt-change-the-narrative/</a></p>\n<p>Here&#8217;s the narrative I had before the election: a nonzero fraction of the population heard what Trump has said and proposed (on record!), and found a way to accept it. That narrative remains unchanged. </p>\n<p>On a personal note: Scott, once again I admire that you maintain this blog, and respectfully entertain a range of views on it.</p>\n<p> I personally find some of what has been recently said to you in the comments sections rather appalling. It&#8217;s a tribute to your commitment to Enlightenment values that you don&#8217;t remove these comments outright. You&#8217;re a better person than me.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/Nigam:Nilima.html\">Nilima Nigam</a>", "published": "2016-11-10 21:38:48+00:00", "title": "By: Nilima Nigam"}, {"content": "<![CDATA[<p>1.# 117, That&#8217;s a complete misinterpretation of what Scott is saying in your quote. He&#8217;s not saying that he ever thought those forces didn&#8217;t exist. He&#8217;s saying that their were safeguards in the US against those forces controlling our institutions. That&#8217;s nto the same thing.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2016-11-10 21:50:48+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Scott #108.  Well i&#8217;m sure you know this, but the EC was put in by the founding fathers as a compromise to avoid the possibility of outright secession.  The states with large geographical areas but sparse populations would be essentially irrelevant compared to smaller states with large population centers and those states would be free to essentially dictate terms.</p>\n<p>This is particularly bad for the US.  There&#8217;s a decent .jpg floating around the internet, but you can see that 50% of our population is essentially clumped up into less than 1-2% of the available geographical area.  Meanwhile the other enormous section of &#8216;fly over land&#8217; is basically empty.  </p>\n<p>The EC is a compromise that adds some weight to geography.  Pure majority rule works fine for smaller countries, or those with roughly homogeneous population distributions, but for places like the US or say Russia or Canada you need some sort of weighing method.</p>\n]]>", "author": "Haelfix", "published": "2016-11-10 21:50:58+00:00", "title": "By: Haelfix"}, {"content": "<![CDATA[<p>Raoul #106</p>\n<p>&#8220;2. People who do not want a woman leader&#8221;</p>\n<p>So, in your opinion, the USA has a population that&#8217;s more close-minded than:<br />\nPakistan (Benazir Bhutto), Germany (Angela Merkel), England (Tatcher), Myanmar (Aung San Suu Kyi), Taiwan (Tsai Ing-wen), South Korea (Park Geun-hye), Brazil (Dilma Rousseff), India (Indira Gandhi), Israel (Golda Meir), Argentina (Cristina Fernández de Kirchner), Norway (Erna Solberg), Croatia (Kolinda Grabar-Kitarović), Australia (Julia Gillard), Lithuania (Dalia Grybauskaitė), Bangladesh (Sheikh Hasina), Chile (Michelle Bachelet), Kosovo (Atifete Jahjaga),<br />\nTurkey (Tansu Çiller), Thailand (Yingluck Shinawatra), Indonesia (Megawati Sukarnoputri), Iceland (Jóhanna Sigurðardóttir), Denmark (Helle Thorning-Schmidt), Nepal (Bidhya Devi Bhandari), the Philippines (Gloria Macapagal Arroyo).</p>\n]]>", "author": "fred", "published": "2016-11-10 21:56:44+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>I think I&#8217;m going to watch &#8220;Dr. Strangelove or: How I learned to stop worrying and love the bomb&#8221; tonight.   I think framing a Trump presidency in terms of a dark comedy instead of a tragedy might be helpful for my psyche.  </p>\n<p> &#8220;We&#8217;ll meet again, don&#8217;t know where, don&#8217;t know when&#8230;&#8221;</p>\n]]>", "author": "Jon K.", "published": "2016-11-10 22:02:22+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>Dear Scott, </p>\n<p>You have witnessed first hand the authoritarian wrath of a loud leftist crowd blinded by its own hysteria. And that happened to somebody who agreed with the hysterical shamers 99%! </p>\n<p>There are many many more instances of that, and worse, mostly at US universities and government organization. Too many people are even afraid to speak their mind, and that&#8217;s in colleges, places that are supposed to be open minded!</p>\n<p>I think, or should I say I hope, that the result of the current elections is more of a move against the dictatorship of PC BS rather than toward authoritarianism. We live in a country with checks and balances; I don&#8217;t think it&#8217;s likely or even possible for the president to dictate his will, at least domestically. He may damage US relations overseas, but domestically his actions are likely to be tampered by the other branches of the government. </p>\n<p>Although Congress is republican now, remember that most republicans were not aligned with Trump at all, that many of them publicly denounced Trump before the election. If he tries to make strong authoritarian moves he is likely to be stopped by bi-partisan effort in the Congress.</p>\n<p>I am absolutely NOT a Trump supporter, and not a republican. I just think that our republic is robust enough to withstand an unhinged president. It did that a few times before. No reason to panic and pack your bags.</p>\n]]>", "author": "Michael P", "published": "2016-11-10 22:11:08+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>Re: Erdogan, it&#8217;s worth noting that it&#8217;s taken him many years to consolidate power as much as he has, and reach his full authoritarian extent, aided by a regional crisis (ISIS), and in a nation with much weaker democratic institutions than the US.</p>\n<p>I don&#8217;t think we need to sugarcoat Trump to point out that the US has very strong institutions. There&#8217;s a very good case to be made that they will constrain his worst excesses.</p>\n<p>Indeed, if we look for historical analogies to Trump, the worst are invariably in countries with much weaker democratic institutions, and/or suffering much deeper crises than we are.</p>\n<p>Not that this is cause for inaction &#8212; quite the reverse! Citizen action is exactly one of the institutional mechanisms we have to rein him in.</p>\n]]>", "author": "jonathan", "published": "2016-11-10 22:14:03+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>Scott, if you were awarded the National Medal of Science, would you accept it?</p>\n]]>", "author": "Steve", "published": "2016-11-10 22:19:28+00:00", "title": "By: Steve"}, {"content": "<![CDATA[<p>Steve #127: From Trump?  No way.  Nor would I have accepted the PECASE award in 2009, if I&#8217;d had to shake Trump&#8217;s hand rather than Obama&#8217;s.  If Trump won&#8217;t respect America&#8217;s democratic institutions, then I won&#8217;t accept the legitimacy of his presidency, and I urge every other scientist who feels as I do to follow suit.</p>\n]]>", "author": "Scott", "published": "2016-11-10 22:40:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott @ 108: We don&#8217;t have the institutions for a national popular vote count. Who would certify the results, and who would ensure than none of the 56 states-or-equivalent or none of the several thousand local election officials didn&#8217;t have a finger on the scale? Other countries have a national election commission that has a single standard for voter registration, ballot counting, etc. &#8211; we don&#8217;t even have a uniform law for who&#8217;s allowed to vote. The EC is awful, it produces terrible results like this year and 2000 (I&#8217;m neutral on 1888, and 1876 was terrible but would&#8217;ve been worse without the EC) but it prevents us from having to face these issues. If we could nationalize administration I&#8217;d be behind that, but I doubt that would ever happen. People treat the Constitution as holy writ, even the bits that aren&#8217;t in the Constitution.</p>\n<p>(As a side note, the current system of a popular vote in each state for its members of the EC is not part of the Constitution and wasn&#8217;t even around for the first few elections. It happened more or less by accident and Maine and Nebraska can still produce split slates. In 1789 each state legislature appointed its electors, and it would still be constitutional for, say, Florida to pass a law abolishing the popular vote for President and just letting the GOP-dominated legislature pledge the state to the GOP every time.)</p>\n]]>", "author": "BBA", "published": "2016-11-10 22:35:54+00:00", "title": "By: BBA"}, {"content": "<![CDATA[<p>Mr. T #117 <i>&#8220;there’s nothing about its [US] people or its institutions that protects it from the darkest forces that have ever gripped human civilization.”</i></p>\n<p>Mr. T you are unduly harsh (although I guess that&#8217;s in character) when criticizing Scott for this statement.</p>\n<p>It&#8217;s just an expression of a shattered, garden variety, belief in American Exceptionalism. The latter is a seductively sweet drug when administered by such admirable persons like Obama.</p>\n]]>", "author": "quax", "published": "2016-11-10 22:49:11+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Jon #124<br />\nHaha, for a more chilling depiction of the current situation, watch &#8220;The Dead Zone&#8221;.<br />\nSpoiler: <a href=\"http://www.deepfocusreview.com/reviews/images/deadzone3.jpg\" rel=\"nofollow\">http://www.deepfocusreview.com/reviews/images/deadzone3.jpg</a></p>\n]]>", "author": "fred", "published": "2016-11-10 22:49:25+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Fred #119:</p>\n<p>That&#8217;s not a correct history of the electoral college at all.  This falls into basic &#8220;look it up&#8221; territory, but, in brief:</p>\n<p>The original intention was not for the electoral college to be some proxy for the popular vote; rather, the intention was originally that electors would be chosen in a non-partisan manner, and they would deliberate on who should be president, and vote based on their own judgment rather than just blindly voting for someone they were pledged to.  There isn&#8217;t even any requirements that electors be picked by the people, although it seems the expectation was that they&#8217;d be elected district-by-district[0], and they have on occasion been picked by state legislatures instead. (Indeed, once state-by-state electoral voting became common, Alexander Hamilton drafted an amendment to require district-by-district voting, but it doesn&#8217;t seem to have gotten anywhere.  This amendment also encompassed what would become the 12th amendment.)  The mechanisms for a popular vote did exist at the time; the main obstacle to a popular vote was not being unable to conduct one, but rather the worry that the South wouldn&#8217;t go for it, due to how low their free population (much of the population being enslaved) was compared to the Northern states.</p>\n<p>Josh #121:</p>\n<p>Huh, I thought that comment from T. was one of the &#8220;nasty screeds&#8221; Scott pulled out of moderation. 😛  But I guess it&#8217;s not that nasty compared to how much it possibly could be&#8230;</p>\n<p>Michael P #125:</p>\n<blockquote><p>Although Congress is republican now, remember that most republicans were not aligned with Trump at all, that many of them publicly denounced Trump before the election. If he tries to make strong authoritarian moves he is likely to be stopped by bi-partisan effort in the Congress.</p></blockquote>\n<p>I don&#8217;t buy it.  The Republican Party hardly seems so divided when you look at actual currently serving politicians rather than former ones or writers — seems to me the Reupblicans in actual power have largely rolled over for Trump, for fear of getting voted out.</p>\n<p>Even if that weren’t the case Trump would still be plenty dangerous. How about those executive orders?  Meanwhile, the biggest danger from Trump isn’t some terrible deliberate policy, whether he gets Congress to pass it or goes around them; it’s the constant screwups we can expect from someone who’s not competent to run the executive branch.</p>\n<p>[0]The &#8220;districts&#8221; here aren&#8217;t Congressional districts, note, like in the current mixed system used in Maine and Nebraska, but rather some other sort of district, equal in number to the electoral votes in that state, rather than just the number of representatives.</p>\n]]>", "author": "Sniffnoy", "published": "2016-11-10 23:14:30+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p><a href=\"https://www.washingtonpost.com/news/global-opinions/wp/2016/11/10/im-a-muslim-a-woman-and-an-immigrant-i-voted-for-trump/\" rel=\"nofollow\">https://www.washingtonpost.com/news/global-opinions/wp/2016/11/10/im-a-muslim-a-woman-and-an-immigrant-i-voted-for-trump/</a></p>\n]]>", "author": "fred", "published": "2016-11-10 23:25:17+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Fred 133, <a href=\"http://www.spiegel.de/politik/ausland/rassismus-nach-wahlen-in-den-usa-ich-hatte-nie-so-viel-angst-a-1120717.html\" rel=\"nofollow\"> here&#8217;s the counter programming (the text in German you can ignore, the American tweets is what counts).</a></p>\n]]>", "author": "quax", "published": "2016-11-10 23:35:50+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Oops, actually, according to <a href=\"http://www.newyorker.com/magazine/2008/10/13/rock-paper-scissors\" rel=\"nofollow\">this article</a>, the proposal at the Constitutional Convention to have direct popular election of the president was even less popular than I said; only Pennsylvania went for it.</p>\n]]>", "author": "Sniffnoy", "published": "2016-11-11 00:15:29+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>The last few years didn&#8217;t felt well with respect to optimistic hopes for the future, and the last year felt especially bad. Syria, Ukraine, Brexit, post-coup purges, &#8230; Are normal non-jew people &#8220;allowed&#8221; to fell scared under such circumstances, and ponder questions like <a href=\"http://philosophy.stackexchange.com/questions/36765/what-could-a-jew-do-when-he-arrived-with-a-train-in-auschwitz\" rel=\"nofollow\">What could a jew do, when he arrived with a train in Auschwitz?</a> </p>\n<p>And I don&#8217;t know how to describe the feeling when you talk with somebody in a more or less public place (like a train) about such topics, and complete strangers (sometimes people from Russia or Turkey, but not always) suddenly interrupt you and tell you that you have been manipulated by the &#8220;controlled quality media&#8221; of your country, but are unable to get more concrete when you ask back what they mean specifically.</p>\n]]>", "author": "gentzen", "published": "2016-11-11 00:24:19+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>Scott, the left has been tormenting you all your life, as you stated right here on this blog. Right now they are rioting and burning things in the city you live in, and making dire death threats in every direction. Meanwhile, I have to wonder if you&#8217;ve ever even _met_ a Trump supporter. And yet, you reel in terror before the one but not the other. Why is this?</p>\n]]>", "author": "Sweden", "published": "2016-11-11 01:18:13+00:00", "title": "By: Sweden"}, {"content": "<![CDATA[<p>So do you guys still think that this war of independence was such a great idea?<br />\nYou could be South-Canada now without George Washington and his fellow revolutionaries &#8230;  </p>\n<p>In this case I suspect James Corden would have the Late Show and Colbert would come after him, which would be a good thing imho.</p>\n<p>😎</p>\n]]>", "author": "wolfgang", "published": "2016-11-11 01:44:53+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>wolfgang #138: I think there are any number of arrangements that might&#8217;ve been better, including the colonies forming separate countries, the northern US combining with Canada, or Lincoln saying &#8220;OK, knock yourselves out&#8221; when the South seceded, and building an economy that utterly dwarfed the South&#8217;s (and then the South abolishing slavery a bit later, when the evolution of social norms made it unavoidable).  All we know is that, in <i>this</i> timeline, strong Enlightenment norms in the US had a very long run&#8212;since the Revolution, Andrew Jackson, or the Civil War, depending on how you count&#8212;and are now over.  We don&#8217;t know whether they would&#8217;ve lasted longer or not as long under one of those other arrangements.</p>\n]]>", "author": "Scott", "published": "2016-11-11 02:32:42+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Any country with anything resembling Jim Crow lacks &#8220;strong Enlightenment norms.&#8221; I&#8217;d set the Enlightened period to a maximum of 50 years, and even that&#8217;s a stretch.</p>\n]]>", "author": "BBA", "published": "2016-11-11 02:44:26+00:00", "title": "By: BBA"}, {"content": "<![CDATA[<p>BBA #140: Jim Crow was terrible, but even at its height, we didn&#8217;t have presidents saying they wouldn&#8217;t accept the election outcome if they lost, and that their enemies should be roughed up or thrown in jail.  This is something genuinely new.  So, before, an optimist could treat all the injustices as local aberrations that the error-correcting machinery of democracy would eventually get around to fixing, if not in this generation then in the next one.  Now the error-correcting machinery itself is broken, and such optimism is no longer possible.</p>\n]]>", "author": "Scott", "published": "2016-11-11 02:53:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>@Scott</p>\n<p>So you did not like the season finale of &#8220;America&#8221;  &#8230; but consider the alternative: If Hillary would have won, the pressure would almost certainly have continued to build until something much worse could have happened.</p>\n<p>I think Trump might be a way to let the steam out of the pressure cooker, even if it makes a nasty noise for a while.<br />\nBut judging from the first two days after the election, he might surprise many relative to his campaign, a necessary lesser evil until this country gets out of its current hysteria<br />\nand learns how to deal with the scary 21st century.</p>\n]]>", "author": "wolfgang", "published": "2016-11-11 03:12:48+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Fred #123,</p>\n<p>I did not say that about all Americans, but some fraction that was probably more than the margin that Trump won by.</p>\n<p>Just as a wild guess, I would estimate that for American white males about</p>\n<p>10% are moderately or more misogynistic, and</p>\n<p>20% are moderately or more racist. </p>\n<p>On a related note, It is clear that the white vote seemed a lot more racist than in the last two elections. I think a lot were radicalized by the BLM phenomena. The fact is that in every country, every day, berserkers are shot by police. That is their job; otherwise people would be getting murdered left and right. There should be an inquiry as to if a police shooting was justified or not. The Fergerson MO case that launched BLM was obviously justified. If the person shot was white, that would have been the end of the story. The ensuing pressure on police to not do anything about black thugs has not worked so well. In particular, the rate of blacks murdered by blacks has exploded, I think by hundreds/year in Chicago alone.  A lot of people resented being called a racist for suggesting that this is not a good state of affairs. A lot of them voted for Trump.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-11 05:14:47+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>A lot of this sounds like hysteria and tribal/cultural bias to me. I&#8217;ve noticed a lot of people with similar backgrounds as you are instinctively terrified of any strong nationalist leader, as if they are all potential Hitlers to you. That&#8217;s understandable I suppose, but also potentially pathological. I would calm down and see what happens before drawing any overwrought analogies to the 1930s.</p>\n]]>", "author": "Blackstone", "published": "2016-11-11 06:20:42+00:00", "title": "By: Blackstone"}, {"content": "<![CDATA[<p>Regarding the update I think US institutions (particularly private ones) will continue to entice researchers with prestige and money. But the second tier of good, young researchers, currently based in the US, might be tempted by opportunities in Europe. I saw the Hausdorff Center advertising vacancies on Twitter with #USelection2016 so I am not the only one who thinks so. Of course German institutions did the same thing immediately after Brexit.</p>\n<p>Incidentally, you may be interested to learn that some British descendants of Jewish refugees from Nazi Germany and Austria are now applying for citizenship in those countries to maintain their EU citizenship.</p>\n]]>", "author": "Chris", "published": "2016-11-11 06:42:42+00:00", "title": "By: Chris"}, {"content": "<![CDATA[<p>Scott, I thing we have fairly close views and concerns regarding Trump. I was quite obsessed about these elections <em>before</em> the elections (<a href=\"https://gilkalai.files.wordpress.com/2016/10/vh.jpg\" rel=\"nofollow\">my view: here </a> and <a href=\"https://www.facebook.com/photo.php?fbid=10154574587723792&set=a.10154324408588792.1073741829.592958791&type=3&theater\" rel=\"nofollow\">here</a> and <a href=\"https://www.facebook.com/gil.kalai.1/posts/10154688060228792?pnref=story\" rel=\"nofollow\">here</a> and <a href=\"https://www.facebook.com/photo.php?fbid=10154387743273792&set=p.10154387743273792&type=3&theater\" rel=\"nofollow\">here</a> and <a href=\"https://www.facebook.com/photo.php?fbid=10154389410708792&set=a.10152568316953792.1073741826.592958791&type=3&theater\" rel=\"nofollow\">here</a>) and indeed felt that it is very important to the US and the world that Trump would not be elected. Still I&#8217;d strongly  recommend people and scientists to visit the US and not only the blue areas but also the red areas and chat with people of all political views. I myself visited<a href=\"https://gilkalai.wordpress.com/2009/06/19/istanbul/\" rel=\"nofollow\"> &#8220;Erdogan’s Turkey&#8221; in 2009</a>  ( True, I would not feel comfortable visiting now. At that time I was quite hopeful about Turkey as a bridge between cultures,) and also visited &#8220;Putin&#8217;s Russia&#8221; a decade ago and China (but not yet Singapore). It would be nice to visit Iran one day. Indeed Trump&#8217;s behavior gives reason to worry regarding US democracy (and also  he will try to implement policies that we might strongly oppose) but I think that it is likely that the US democracy is strong enough to prevail.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2016-11-11 06:49:26+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>RE: your update.<br />\nThat&#8217;s not the way it&#8217;s going to work.  In fact, you&#8217;ll see 20% of thinkers want to run away or avoid the US, and 20% of thinkers will want take refuge in the US.  For the 20% who want to be in the US, Donald Trump has secured the US as the last bastion of free speech and free thinking.  For the 20% who want to run away, Donald Trump is leading a kingdom of hate.<br />\nFor the remaining 60%, there&#8217;s a gradient of &#8220;this could be good for science&#8221; to &#8220;this could be bad for science&#8221;.</p>\n<p>You are still under the misguided belief that everyone who voted for trump is wrong or dangerous.<br />\nStop being so afraid.  I mean, you&#8217;ll get over it a few months after Trump takes office, but still.  It&#8217;s in your best interest to get over your freak-out as soon as you can.</p>\n<p>And I advise against further posting-while-drunk.  You&#8217;re clearly drunk on your emotions and fears right now.  Sober up for your next post.</p>\n]]>", "author": "Elliott", "published": "2016-11-11 06:59:49+00:00", "title": "By: Elliott"}, {"content": "<![CDATA[<p>Scott #139:<br />\nNo, enlightenment went into a downward spiral starting in 1995.  And will continue to go down until 2022.  The people who voted for Trump are the ones who want the downward spiral to stop, or at least stop being so damaging until people realize what&#8217;s going on.</p>\n<p>You think enlightenment ended on election night.  It ended when 3rd wave feminism started, 20 years ago.  You&#8217;ve just been so steadfast in your belief system that you never realized it.<br />\nAnd the death-knoll hasn&#8217;t happened yet.  That&#8217;ll happen in 2022, when something better will take its place.</p>\n]]>", "author": "Elliott", "published": "2016-11-11 07:06:58+00:00", "title": "By: Elliott"}, {"content": "<![CDATA[<p>What you&#8217;re feeling now is shock from the realization that reality is different from your imagination.  It&#8217;ll fade.  At best, you&#8217;ll discover reality for the first time in your life.  At worst, you&#8217;ll create an imaginary world that you can pretend to be addicted to.</p>\n<p>What you need to do to make the best outcome happen is realize that you were wrong.  Your version of reality is wrong.</p>\n]]>", "author": "Elliott", "published": "2016-11-11 07:13:38+00:00", "title": "By: Elliott"}, {"content": "<![CDATA[<p>I found this informative: <a href=\"https://www.reddit.com/r/The_Donald/comments/5c5ctg/they_just_dont_fucking_get_it/\" rel=\"nofollow\">https://www.reddit.com/r/The_Donald/comments/5c5ctg/they_just_dont_fucking_get_it/</a></p>\n<p>At the end of the day, no matter how strong our priors are, it is worth sampling from all kinds of narratives&#8212;especially if it constitutes nearly half of the data!</p>\n]]>", "author": "cc", "published": "2016-11-11 07:24:00+00:00", "title": "By: cc"}, {"content": "<![CDATA[<p>@Wolfgang,</p>\n<p>So he&#8217;s made some conciliatory noises. I don&#8217;t put much weight on that, of course he finds it easy to be magnanimous now, and he wants everybody to unite under him. It does slightly raise the probability that he is an unprincipled egoist as opposed to a crazy man. But he has said nothing that suggests the totalitarian impulse in him is not as strong as ever, or that all the terrible policies he&#8217;s espoused such as ignoring global warming, getting rid of free trade or gutting a woman&#8217;s right to choose are not still on the table.</p>\n]]>", "author": "Jr", "published": "2016-11-11 08:42:20+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Random Oracle #16,</p>\n<p>Let us not give up on democracy just yet, especially considering that a better functioning democracy without the electoral college would have stopped Trump this time.</p>\n<p>I never thought democracy was a system that worked well in an absolute sense, only the best compared to the alternatives. Limiting votes to the knowledgeable might not be practically a huge difference, and perhaps I would even prefer the policies it would lead to, but I would highly doubt it would be any sort of guarantee against totalitarianism. Note how many academics in social science subjects endorsed Marxism, which seems like completely crazy to us now. Some forms of totalitarianism may well be more popular with educated people than with the masses. </p>\n<p>The racial implications of the idea in the US are also impossible to deal with, since it is hard to imagine that it would not disenfranchise people from some minorities primarily. And finally, there is the principle of the thing. Maybe treating people equally is just the right thing to do in this case.</p>\n]]>", "author": "Jr", "published": "2016-11-11 08:54:20+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>The positives, imo:</p>\n<p>&#8211; If you were worried about the GOP getting back in power, then Trump is the best possible outcome.<br />\nRemember, Trump is actually a third party candidate. Just like Sanders on the Democrats side, Trump got in the GOP because that&#8217;s the only realistic way to get elected.<br />\nTrump is way less of a conservative than he made it look like during the campaign (basically he said what the party base wanted to hear).</p>\n<p>&#8211; Getting friendlier with Russia is a good thing imo. Russia is part of Europe (unlike, say, Turkey). After the end of the cold war, instead of building up on the positive momentum, the US and NATO allies gave Russia the cold shoulder and treated them like losers (you&#8217;d think after WW1 and WW2 we would have learned our lesson). Sure, Putin is dangerous, but he rose up because of the way we treated Russia.</p>\n<p>&#8211; The American public always wants less hyper-interventionism, but neither party ever followed up on that, quite the opposite. Sanders and Trump both pledged to reduce the international police work of the US. It&#8217;s about time.</p>\n<p>&#8211; The trade deals. Again, both Trump and Sanders favor a serious re-examination of these. If you&#8217;re gonna piss off China, you might as well do it over something really practical, not some pissing contest in the South China sea (this is up to the Asian countries to settle this, and there&#8217;s no way around the fact that China is a global power now).</p>\n]]>", "author": "fred", "published": "2016-11-11 13:28:36+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Raoul #152</p>\n<p>&#8220;In particular, the rate of blacks murdered by blacks has exploded, I think by hundreds/year in Chicago alone.&#8221;</p>\n<p>I&#8217;m so fed up with people talking about &#8220;racism&#8221; out of context.<br />\nAs though it&#8217;s all just about some fuzzy feeling inside people&#8217;s brain.</p>\n<p>The source of the problem is poverty and lack of future for the people!<br />\nThere&#8217;s black on black violence because there&#8217;s a lack of good jobs and basic infrastructure. Having millions of whites take to the streets with &#8220;black is beautiful&#8221; signs wouldn&#8217;t help them a bit.<br />\nThen the majority always blames the minorities when there&#8217;s a global lack of good jobs and people just sit around idle all day, unable to take care of themselves and their loved ones. It&#8217;s got nothing to do with skin color, that&#8217;s the way people are wired.</p>\n<p>Fix the job situation and everyone will get along much much better: once people are busy working and can feel secure taking care of their family, the vast majority can&#8217;t give two shits about hating on each other.</p>\n]]>", "author": "fred", "published": "2016-11-11 13:49:52+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>quax #134</p>\n<p>well, here&#8217;s the counter counter programming</p>\n<p><a href=\"https://www.youtube.com/watch?v=EMux_UHmpvc&#038;oref=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DEMux_UHmpvc&#038;has_verified=1\" rel=\"nofollow\">https://www.youtube.com/watch?v=EMux_UHmpvc&#038;oref=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DEMux_UHmpvc&#038;has_verified=1</a></p>\n]]>", "author": "fred", "published": "2016-11-11 14:00:18+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Gil #155,</p>\n<p>We in Iran welcome you and other fellow Israeli scientists and we look forward to meeting you. </p>\n<p>Scott, the Iranian people has been tolerating guys like Trump for more than 37 years!</p>\n]]>", "author": "Reza", "published": "2016-11-11 14:20:47+00:00", "title": "By: Reza"}, {"content": "<![CDATA[<p>Here&#8217;s the take I&#8217;ve been reassuring myself with. If Hillary lost to Donald Trump, she was clearly going to lose to any white, male opponent put up by the GOP. That person could have been Jeb Bush, who would suavely implement the same reactionary policies as Donald, without being nearly as blunt and in-your-face and raising as much awareness about the white supremacist agenda. That person could also, and more likely, have been Ted Cruz, who actually believes the crazy shit he says and would attempt to impose his fundamentalist beliefs on the country. So maybe we should count our blessings. Donald Trump doesn&#8217;t give a crap about abortion or same-sex marriage, and I don&#8217;t even think he feels all that strongly about immigration. I don&#8217;t necessarily think he&#8217;d be any worse (and he may possibly be better) on other issues than the other Republican hopefuls. He tends to lie a lot, as you may have noticed, so I wouldn&#8217;t be surprised if he&#8217;s been lying to his base this whole time about what he really believes in. They are going to get what they think they asked for, and they may not like it.</p>\n]]>", "author": "Bob Strauss", "published": "2016-11-11 14:29:40+00:00", "title": "By: Bob Strauss"}, {"content": "<![CDATA[<p>Reza #165: Thanks for your message!  I really, truly look forward to the day when I feel safe enough to visit Iran, with my Israeli wife and passport full of Israeli stamps.  So many of my friends, colleagues, and students are Iranian that it&#8217;s about time I visit for myself.</p>\n<p>But while it&#8217;s true that you&#8217;ve been tolerating &#8220;guys like Trump&#8221; for 37 years &#8230; well, that&#8217;s the problem right there.  May the good people in your country stand up to your Trumps, and may the good people in our country stand up to ours.</p>\n]]>", "author": "Scott", "published": "2016-11-11 14:46:09+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Elliott,</p>\n<p>You&#8217;re clearly dying for someone to ask you this, so I&#8217;ll bite:</p>\n<p>What exactly do you expect to happen in 2022, and why 2022 in particular?</p>\n]]>", "author": "g", "published": "2016-11-11 14:49:14+00:00", "title": "By: g"}, {"content": "<![CDATA[<p>Jr #161:</p>\n<ul>Limiting votes to the knowledgeable might not be practically a huge difference, and perhaps I would even prefer the policies it would lead to, but I would highly doubt it would be any sort of guarantee against totalitarianism. Note how many academics in social science subjects endorsed Marxism &#8230; The racial implications of the idea in the US are also impossible to deal with &#8230;</ul>\n<p>Very well.  As long as we&#8217;re fantasizing, I would like votes to be allocated based on more-or-less the same criteria that top math, CS, and physics departments use to select their graduate students.  Namely: analytical and quantitative reasoning ability, scores on standardized tests, etc., with strong affirmative action for races and genders that this system causes to be underrepresented.</p>\n<p>And before you laugh in my face, call me a nerd supremacist, etc., name for me one single case in the history of the world where my proposed system would&#8217;ve led to a worse outcome than the alternatives that have been tried. 😀</p>\n]]>", "author": "Scott", "published": "2016-11-11 14:54:08+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #168</p>\n<p>It&#8217;s all fine and dandy, but don&#8217;t you see that the real problem is the choices of candidates we&#8217;re given?!<br />\nThe problem isn&#8217;t as much about quality of the &#8220;votes&#8221; vs quality of the what you&#8217;re voting for.<br />\nDon&#8217;t you see there&#8217;s a fundamental issue with the control the two parties have over the election process? (Trump beat the GOP at its own game, but that&#8217;s a one in a thousand event).</p>\n<p>Here&#8217;s a simple change &#8211; add a third option on every ballot:<br />\n&#8220;None of the above&#8221;.<br />\nIf the majority selects &#8220;None of the above&#8221;, the parties have to come up with new candidates.</p>\n]]>", "author": "fred", "published": "2016-11-11 15:02:50+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Elliott #158: On the contrary, &#8220;my version of reality&#8221; was already a pretty depressing one, and it&#8217;s held up just fine.</p>\n<p>I expected Hillary to win the popular vote, and she did.</p>\n<p>I expected the outcome to be incredibly close, and it was.</p>\n<p>I expected a ~10-20% probability of a Trump win (even if parts of me suppressed the thought), simply because that&#8217;s what the betting markets said, and I don&#8217;t think I can systematically improve over them.</p>\n<p>When someone confidently tells me that &#8220;my version of reality is wrong,&#8221; I almost always take them seriously&#8212;sometimes <i>too</i> seriously&#8212;<i>unless</i> they&#8217;ve given me a compelling reason not to.  So in your case, your constant, bizarrely-specific references to the year 2022 have helped tremendously to set my mind at ease.</p>\n]]>", "author": "Scott", "published": "2016-11-11 15:05:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>While not ignoring the magnitude of the 11/9 bummer, I think Scott is taking it a bit too seriously. Comparing incoming foreign students expectations on coming to the US with his going to post revolution Iran is rather a stretch. For people from most parts of the world, the US is still a vast improvement over local conditions.</p>\n<p>Like Scott, I live in a university town surrounded by a vast sea of red counties. So far (two days), I have not seen any knuckle dragging deplorables roaming the streets. Today&#8217;s &#8220;Inside Higher Ed&#8221; listed a dozen odd events of things like someone scrawling &#8220;Trump&#8221; on the door of the Muslim prayer room: <a href=\"https://www.insidehighered.com/news/2016/11/11/students-many-colleges-reporting-ethnic-or-racial-harassment-election-day\" rel=\"nofollow\">https://www.insidehighered.com/news/2016/11/11/students-many-colleges-reporting-ethnic-or-racial-harassment-election-day</a></p>\n<p>It is not clear that this is a trend as opposed to a brief bump in the background of idiot actions at colleges.</p>\n<p>My guess is that the &#8220;Bummers to come&#8221; are not so much the deplorables, but the courts and policy changes to facilitate robber barons. Ars Technica (the go-to place for insight on tech world issues) has about a dozen articles in the last two days on likely outcomes. Here is a good example:</p>\n<p><a href=\"http://arstechnica.com/tech-policy/2016/11/what-the-trump-win-means-for-tech-science-and-beyond/\" rel=\"nofollow\">http://arstechnica.com/tech-policy/2016/11/what-the-trump-win-means-for-tech-science-and-beyond/</a></p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-11 15:34:45+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Bob Strauss #166: &#8220;Donald Trump doesn’t give a crap about abortion or same-sex marriage, and I don’t even think he feels all that strongly about immigration.&#8221;</p>\n<p>You could not be more wrong about immigration. That&#8217;s one of his main priorities. And not just illegal, but also legal immigration. He plans to restrict all immigration altogether, bringing it down to &#8220;historical norms&#8221;, whatever that means. And a part of that he can do without help from congress.</p>\n]]>", "author": "Gail", "published": "2016-11-11 15:45:24+00:00", "title": "By: Gail"}, {"content": "<![CDATA[<p>fred</p>\n<p>You are completely in the dark about Trump and the Republicans.</p>\n<p>He will implement the Republican agenda and the all of the most extreme elements of it. That is what he ran on.</p>\n<p>He sounded like an outsider but he was right in line with the Republican agenda. </p>\n<p>Think of Kansas and extend that to the whole country. How&#8217;s that working out?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-11-11 15:46:43+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>I&#8217;m very worried about the Trump presidency because of the group of war-mongering neo-cons he&#8217;s arranged around himself. </p>\n<p>Unfortunately, I think that there is a very high chance that Trump will start a war with Iran. His key advisors are the most anti-Iran group of people imaginable. Gingrich for example left half-way through the campaign in July to go to Paris for an MEK conference (a terrorist cult with no support among the Iranian people that has been propped up by foreign powers and advocates violent overthrow of Iranian regime) with prince Faisal (Saudi Intelligence), and he&#8217;s becoming the secretary of State. Guiliani is also heavily involved in MEK. There are also a variety of other people in his Foreign policy team (e.g. Joseph Schmitz former Blackwater exec, Jim Woolsey necon and MEK supporter, John Bolton the most extreme neocon and MEK supporter) who will be pushing for war.</p>\n<p>Once Trump&#8217;s unreleastic economic policies and promises begin to fail and he stops &#8220;winning&#8221;, he may make a choice very common among authoritarian leaders: to stay popular he may start a war, and Iran is the most clear target and one he will pushed towards by the people he&#8217;s surrounded himself with.</p>\n]]>", "author": "Amir Safavi", "published": "2016-11-11 15:59:39+00:00", "title": "By: Amir Safavi"}, {"content": "<![CDATA[<p>One of the reasons HRC and her supporters lost is that they decided to run against a conspiracy theory instead of Trump (ironically, considering their own rhetoric about Trump&#8217;s &#8220;facts-free&#8221; campaign). </p>\n<p>This post, incidentally, is yet another example of that:</p>\n<p><i>If Russia and WikiLeaks hadn’t interfered by hacking one side and not the other, maybe the outcome would’ve been different.</i> </p>\n<p>An assertion for which no proof or even substantive evidence has yet been provided. (Leaving aside for now the question of, &#8220;So what?&#8221;).</p>\n<p><i>For that matter, if Russia or some other power hacked the trivially-hackable electronic voting machines that lack paper trails—machines that something like a third of American voters still used this election—there’s an excellent chance we’d never find out.</i> </p>\n<p>Actually, it is rather easy to detect electoral fraud through statistical methods (and is sure to have happened by now if this was a real thing). For that matter, it is repeatedly done within hours of Russian elections ending, LOL.</p>\n]]>", "author": "akarlin", "published": "2016-11-11 16:10:01+00:00", "title": "By: akarlin"}, {"content": "<![CDATA[<p>Gail #173</p>\n<p>&#8220;He plans to restrict all immigration altogether, bringing it down to “historical norms”, whatever that means.&#8221;</p>\n<p>Immigration has always been restricted one way or another.<br />\nThe number of H1 visas is limited (most of them going to India IT workers, with lots of lobbying from the US IT industry to keep increasing them).<br />\nAnd programs like the diversity visa lottery have been created to give more immigration tickets to countries that are under-represented (e.g. most countries besides India, China and Ireland)</p>\n]]>", "author": "fred", "published": "2016-11-11 16:13:44+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>James #174</p>\n<p>&#8220;fred, You are completely in the dark about Trump and the Republicans.&#8221;</p>\n<p>Man, everyone is in the dark about Trump, including the republican party&#8230; As of three weeks ago the entire party had turned its back on him. You really think he owes them something?!</p>\n]]>", "author": "fred", "published": "2016-11-11 16:17:01+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Regardless of whether Trump was just &#8220;playing the election game&#8221; and saying horrible things to attract voters, and regardless of whether he&#8217;ll &#8220;be a reasonable president after all, no need for panic, just wait and see&#8221;, the kind of bottled-up hatred that his discourse has enabled is damaging in and of itself.<br />\nCase in point:</p>\n<p><a href=\"https://twitter.com/i/moments/796417517157830656\" rel=\"nofollow\">https://twitter.com/i/moments/796417517157830656</a></p>\n]]>", "author": "Daniel", "published": "2016-11-11 16:42:14+00:00", "title": "By: Daniel"}, {"content": "<![CDATA[<p>scott, i think your proposition in #169 is extremely misguided. You are basically saying that we should measure human beings along the stick of their purported intelligence and education and mete out voting rights in proportion. This shows an enormous disdain for other human beings. The idea of a democratic society is that we refrain from judging the relative worth of people: everybody has equal rights. While this may in some cases be non-optimal, i.e. one can figure out which groups use their voter rights for a better society than other&#8217;s, I believe that removing this notion of fundamental human equality as a principle is far worse. Since why, if some people simply cannot &#8216;think&#8217;, don&#8217;t we just get rid of these people entirely, or force them to do certain things for which we have calculated that they will be optimally suited. I think it is a slippery slope that you don&#8217;t want to go down on.</p>\n]]>", "author": "Barbara Terhal", "published": "2016-11-11 17:04:42+00:00", "title": "By: Barbara Terhal"}, {"content": "<![CDATA[<p>Daniel #179</p>\n<p>check the youtube link I posted in #164.</p>\n<p>Sadly, there are indeed assholes on either side, and Trump&#8217;s rhetoric and victory has enabled all of them (the &#8220;winners&#8221; and the &#8220;losers&#8221;).<br />\nBut the bottled-up hatred has been there all along. Trump didn&#8217;t create a rift in America, he exploited it&#8230; but the anger has been simmering for decades and both parties have been ignoring it (remember &#8220;Occupy Wall Street&#8221;?)</p>\n<p>It&#8217;s likely that the Trump supporters won&#8217;t even get the changes they wanted, but at least this buys a little bit of time for the Democrats to finally get over the &#8220;Clinton era&#8221;, and come up with a fresh approach on their core values in 4 years&#8230;</p>\n]]>", "author": "fred", "published": "2016-11-11 17:31:32+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott #169: Good idea. Why not go further. How about limiting voting rights to nobel laureates?</p>\n]]>", "author": "ks", "published": "2016-11-11 18:02:48+00:00", "title": "By: ks"}, {"content": "<![CDATA[<p>Barbara Terhal #180</p>\n<p>&#8220;While this may in some cases be non-optimal, i.e. one can figure out which groups use their voter rights for a better society than other’s, I believe that removing this notion of fundamental human equality as a principle is far worse.&#8221;</p>\n<p>But worse in which sense? A moral sense? If it&#8217;s simply a question of morality I believe that&#8217;s something we can live with. I can think of situations where a democracy would be worse and not just in a moral sense. Suppose you have 100 people, 5 of which are educated and understand the severity of climate change, whereas the remaining 95 are not. And suppose they&#8217;re asked to vote on whether to take measures to prevent man-made climate change. This would be a very costly process so ultimately each voter would have to consider whether it is worth it. The 95 who are not well informed about the issue could simply say &#8220;well, we&#8217;ve been told about climate change, but we don&#8217;t really see this happening, maybe the science is wrong, scientists have been wrong before&#8221; or &#8220;so it gets a little warmer, so what?&#8221;. So the majority will decide to not take preventive measures and everyone is screwed in the long term. You could say that those 5 people should do everything they can to educate the 95 on the dangers of climate change, but if this is unsuccessful or takes too long everyone is still screwed in the long term.</p>\n<p>I agree that it is a slippery slope, but I think that one should consider other options and keep an open mind. I also think that if the appropriate safeguards are put in place it would prevent situations like the one you described (discarding the people who don&#8217;t think).<br />\nWe shouldn&#8217;t become religious about democracy and say that we should keep it because it has always pretty much worked and the alternatives could take us down very dark paths. It seems that democracy itself can take us down very dark paths. </p>\n<p>Also, it&#8217;s not about having a system that is optimal, but something that is at least as good as democracy in the results it achieves for all people (even if those results come at the cost of denying votes to some).</p>\n<p>One last thing: countries usually require people applying for citizenship to take a test about the history, culture, politics etc of that particular country. Upon passing this test those people *earn* the right to vote and have a say in that society. Why is it that people who were born there should be granted this right freely? Shouldn&#8217;t we expect them to be equally as informed about the society they are making choices for?</p>\n]]>", "author": "Random Oracle", "published": "2016-11-11 18:20:00+00:00", "title": "By: Random Oracle"}, {"content": "<![CDATA[<p>Scott, your voting proposal is dreadful. Extremely intelligent people tend to be vulnerable to a) the Dunning-Krueger effect in areas they are not actually familiar with &#8212; all the physicists and so forth who fell for psychic phenomena, for example, b) emotional instability, as repeatedly demonstrated in this comment section, c) a general technocratic attitude that by the right nudges, control, and logic society will respond as they wish, d) a belief that somehow you can just openly ignore and mock the masses and that won&#8217;t come back to bite you. Fundamentally they tend to not be real clear on how human beings actually work, and respond to human beings being ornery by trying to crack down on them. A country run by this comments section would be a charnel house within a month.</p>\n]]>", "author": "Sweden", "published": "2016-11-11 18:52:56+00:00", "title": "By: Sweden"}, {"content": "<![CDATA[<p>As for the electoral college, he (as a mathematician and game-theorist) should know better than most that an ex-post accounting is not honest. If the &#8216;popular-vote&#8217; rule was in place, both players would play a very different game. Why is he assuming that current winner would also not win that one?</p>\n]]>", "author": "ou", "published": "2016-11-11 19:21:02+00:00", "title": "By: ou"}, {"content": "<![CDATA[<p>akarlin #176, you are erecting a straw-man Russian conspiracy that&#8217;s easy to knock down.  Hacking the voting machines is very difficult to pull off on a grand scale, and it&#8217;s the least we have to be concerned about.  </p>\n<p>Let&#8217;s just stick to the facts before we go into some more convincing speculation.<br />\n<a href=\"http://www.npr.org/2016/08/06/488876597/how-the-trump-campaign-weakened-the-republican-platform-on-aid-to-ukraine\" rel=\"nofollow\"><br />\n1) Trump had no interest in changing the GOP platform presented at the Republican convention, with one exception, he pulled all the hawkish lingo that condemned the Russian intervention in the Ukraine.</a><br />\n&#8211;<a href=\"https://www.washingtonpost.com/news/the-fix/wp/2016/08/19/paul-manaforts-complicated-ties-to-ukraine-explained/\" / rel=\"nofollow\"><br />\n2) His second campaign manager Paul Manafort spent considerable time in the Ukraine working for the former president, and Russian asset, Viktor Yanukovych. He had to step aside when this connection became too much of an obvious liability to the Trump campaign.</a><br />\n&#8211;<a href=\"https://www.washingtonpost.com/world/moscow-had-contacts-with-trump-team-during-campaign-russian-diplomat-says/2016/11/10/28fb82fa-a73d-11e6-9bd6-184ab22d218e_story.html\" rel=\"nofollow\"><br />\n3) The Russian deputy minister confirmed that they were in contact with the Trump campaign through-out the election process.</a><br />\n&#8211;<a href=\"http://www.mobypicture.com/user/aravosis/view/19488016\" rel=\"nofollow\"><br />\n4) According to a CNN report, a Kremlin advisor admitted they coordinated with Wikileaks.</a><br />\n&#8211;<a href=\"http://time.com/4433880/donald-trump-ties-to-russia/\" / rel=\"nofollow\"><br />\n5) Trump has considerable business interests in Russia and visited the country often.</a><br />\n&#8211;<a href=\"http://www.affairhandbook.com/index.php/facts-about-donlad-trump-affairs/\" / rel=\"nofollow\"><br />\n6) Trump exhibits considerable sexual appetite.</a><br />\n&#8211;<a href=\"https://en.wikipedia.org/wiki/Kompromat\" rel=\"nofollow\"><br />\n7) Russian &#8220;political culture&#8221; perfected the art of compromising politicians with embarrassing material, they even have a word for it.</a><br />\n&#8211; <a href=\"http://www.motherjones.com/politics/2016/10/veteran-spy-gave-fbi-info-alleging-russian-operation-cultivate-donald-trump\" rel=\"nofollow\"><br />\n8) Mother Jones reported that a retired Intelligence officer came forward, alleging that this is exactly what has been done to Trump.</a><br />\n&#8211;<br />\nIMHO Scott&#8217;s concerns are well founded, but the reality may even be worse, you may very well end up with the ultimate Manchurian candidate in the White House.</p>\n]]>", "author": "quax", "published": "2016-11-11 19:48:15+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>ou #185: Where did I say, anywhere here or elsewhere, that Hillary would have won if the popular vote had been what mattered?  I have no idea.  In any case, it now seems clear that, with either the popular vote <i>or</i> Electoral College systems, Hillary wins in some branches of the wavefunction and Trump wins in others.  Not at all surprisingly to my inner pessimist, we&#8217;re in an unlucky branch.</p>\n<p>To me, what makes Trump an illegitimate president is not that Hillary won the popular vote; rather, it&#8217;s Trump&#8217;s open contempt for the most fundamental democratic norms.  And after he and his supporters declared that they wouldn&#8217;t accept Hillary as a &#8220;legitimate president&#8221; if they lost, isn&#8217;t it hypocritical for them to complain if much of the other side now refuses to accept Trump as a legitimate president, and does anything it thinks will be effective to undermine him?</p>\n]]>", "author": "Scott", "published": "2016-11-11 19:53:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Disagree with Gail #173. </p>\n<p>It is unlikely that Trump gives one hoot about immigration. He only ran with it because it was a huge hit with the deplorables.</p>\n<p>If you are under the impression that Trump cares about all the crap he spouted, it is wishful thinking. It has been reported that the crazier stuff in his platform has been disappearing from his web site. </p>\n<p>Obviously lots of people voted for Trump because he was an outsider and he got on the bandwagon for whatever goofy causes would get him attention and votes. But actually trying to put them into place is 100 times harder. You can only do so much, and there is always horse trading. You can be sure his crew will favor the stuff he and his cronies actually care about way over the stuff popular with rednecks. And the only thing Trump cares about is (1) being famous, (2) making money, and (3) grabbing women&#8217;s crotches.</p>\n<p>He will probably have to cut back on (3) now that he is in office.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-11 20:04:28+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>>> we’re in an unlucky branch</p>\n<p>If only we understood how this happened the quantum interpretation puzzle would be solved.</p>\n]]>", "author": "wolfgang", "published": "2016-11-11 20:05:02+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Amir Safavi #175.</p>\n<p>That is a reasonable theory, but hopefully they will start a war they can win. No one can win a war in Iran. It is huge and full of mountains. That would be like the Nazi&#8217;s trying to win in Greece in WW2.</p>\n<p>If they want a war for a publicity stunt, they should follow Reagan&#8217;s example and invade somewhere like Granada.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-11 20:10:12+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>fed 178</p>\n<p>&#8220;After campaigning on a promise to “drain the swamp” in Washington, D.C., President-elect Donald Trump is stocking his transition team with lobbyists for major energy and communications corporations.&#8221;</p>\n<p><a href=\"http://talkingpointsmemo.com/livewire/trump-picks-lobbyists-to-drain-swamp-dc\" rel=\"nofollow\">http://talkingpointsmemo.com/livewire/trump-picks-lobbyists-to-drain-swamp-dc</a></p>\n<p>You&#8217;ve been scammed and don&#8217;t even know it.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-11-11 20:56:14+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p># 183: I agree that one can ask for minimal requirements related to voting, based on age, citizenship etc. but this was not what Scott was talking about. The question was whether &#8216;intelligence&#8217; should be used in determining whether someone is allowed to vote. I indeed find this idea morally reprehensible as I believe that intelligence is not necessarily a marker for superiority as a person. The idea of governance by elites has been tried out in the past: it is hard to avoid abuse of power or exploitation of those without a voice. I believe that it is progress that democracies give this right to every citizen and work on educating everyone so that people exert this right in the best possible way. I am not claiming that we have found the ideal solution.</p>\n]]>", "author": "Barbara Terhal", "published": "2016-11-11 21:35:10+00:00", "title": "By: Barbara Terhal"}, {"content": "<![CDATA[<p>Scott: Could you delete my comment that&#8217;s stuck in moderation?  It&#8217;s screwing up my comment numbering.  (Obviously approving it would be silly at this point as it&#8217;s now redundant.)  Thank you!</p>\n<p>To everyone discussing how democracy might be improved: Once again, have you considered futarchy?</p>\n<p>Scott #187: You might want to say something like &#8220;liberal democratic norms&#8221; or &#8220;Enlightenment democratic norms&#8221; before someone starts picking on your language and saying &#8220;What do you mean? Trump was elected democratically!&#8221; :-/</p>\n]]>", "author": "Sniffnoy", "published": "2016-11-11 21:51:35+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Letting only people who are well in math/physics/CS vote is a terrible idea and I fully agree with Sweden (#184) on this. Just look at how the typical physics department is managed&#8230; Thinking that you are better in &#8216;politics&#8217; because you are good at something specialized like math, sounds weird to me. I know many people that can do no math whatsoever and are most likely not as good in &#8216;quantitative analysis&#8217;, but would be much better politicians than me (with a PhD in theoretical physics) and at least as capable to vote.   </p>\n<p>I think notions like these are part of the reason why many people are fed up with the current situation. I can&#8217;t stand Trump and similar politicians in Europe, but some people seem to vote for him out of anger against this elitism. And I do believe there is some justification in this anger. From many lunch conservations around the world at many universities I can confirm that many &#8216;academic elites&#8217; do look down on many people (see also Peter Woits blog post right before the election). Actually from my partners experience in social service, the same can be said about the higher layers of government. </p>\n<p>So perhaps we are to blame a bit as well. If so, writing comments right after this election outcome that it might be a good idea if people that do not belong to our special subgroup would not be allowed to vote, seems like a bad idea.</p>\n]]>", "author": "Henk", "published": "2016-11-11 22:24:04+00:00", "title": "By: Henk"}, {"content": "<![CDATA[<p>Barbara #192: Given the respect and admiration for you that I&#8217;ve always felt, I&#8217;m sorry to part ways from you so completely on this issue.</p>\n<p>David Deutsch taught me that what&#8217;s really important about democracy is not the fetishization of some particular aggregation rule, like the popular vote (which, of course, would have led to a Hillary Clinton victory) or the Electoral College (which led to the opposite outcome).  What&#8217;s important, instead, is having a Popperian process in place where <i>bad ideas can be criticized and rejected.</i>  Any democratic system is only as good as its success at achieving that goal.  And, thanks in large part to a stupefyingly uninformed electorate, the United States of America is now a Putin-style autocracy, in which it&#8217;s possible that we&#8217;ll never recover the Popperian tradition of criticism again.</p>\n<p>There&#8217;s a reason why Socrates and Plato obsessed about the dangers of democracy, and why the founders of the US refused to institute a direct democracy, but instead set up a complicated system of checks and balances, in which the &#8220;will of the masses&#8221; would get filtered through people who&#8217;d hopefully taken some time to understand the issues.  This week, arguably for the first time in its 240-year history, that system has catastrophically failed: if it can&#8217;t prevent Trump, then what <i>can</i> it prevent?</p>\n<p>In academia, too, we try to do most things more-or-less democratically.  But imagine there&#8217;s some faculty committee that&#8217;s spent years going over the department&#8217;s budget.  And imagine that one day I barge in, not having attended any of the previous meetings, and say that it would be great if we put $10 million toward a giant statue of a USB drive to go in the lobby, and that other stuff like hiring and academics and food could be cut to make up for it.  The committee members immediately shoot down my proposal, but tell me that I&#8217;m welcome to sit in on the meetings for a while and learn more if I&#8217;m interested in contributing.  I get deeply offended, just like you did:</p>\n<ul>Are you not showing incredible disdain for your colleague?  Do I not have equal rights in the department to you?  Am I somehow &#8220;lesser&#8221;?  Why not just get rid of me entirely?  Isn&#8217;t this a slippery slope?</ul>\n<p>The response seems obvious: &#8220;just like we said before, you&#8217;re welcome to contribute, <i>if</i> you take the time to learn the issues.&#8221;</p>\n<p>In the fantasy system that I suggested, it would open to any citizen to learn some relevant skills and background knowledge (e.g., statistics, logic, economics, American history), and demonstrate having learned those skills, in order to earn the right to contribute to making decisions about the country&#8217;s future.  Indeed, I think such a system would be <i>more</i> democratic than our current one, since it would have no need for an arbitrary age cutoff: a 12-year-old who demonstrated the relevant skills would be perfectly welcome to contribute.</p>\n<p>(Incidentally, for whatever it&#8217;s worth: I&#8217;d much rather live in a society governed by physicists than in a society governed by the people who just elected Donald Trump, even though I&#8217;m not a physicist myself, indeed am constantly getting annoyed by physicists, and in the former society would have no power whatsoever.  Ditto for a society governed by Silicon Valley entrepreneurs.)</p>\n<p>I&#8217;m well aware that this &#8220;epistocracy&#8221; idea is a fantasy: it&#8217;s been a fantasy ever since Plato wrote his <i>Republic</i>, and will probably always remain a fantasy.  But it&#8217;s a <i>good</i> fantasy, in the sense that the best moments in the sorry history of our species (for example: ancient Athens, the Enlightenment, the American Revolution, the victory of Allied scientists and technocrats in WWII) have almost invariably coincided with when the fantasy has come the closest to being realized.</p>\n]]>", "author": "Scott", "published": "2016-11-11 22:39:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Sniffnoy #193: OK, thanks, fixed!  (Both things.)  I&#8217;m sorry about your comments getting stuck in my spam filter.</p>\n]]>", "author": "Scott", "published": "2016-11-11 22:50:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Sweden #184:</p>\n<ul>Extremely intelligent people tend to be vulnerable to a) the Dunning-Krueger effect in areas they are not actually familiar with — all the physicists and so forth who fell for psychic phenomena, for example&#8230;</ul>\n<p>Are you seriously claiming that the percentage of physicists who fell for psychic phenomena, has ever been even remotely comparable to the percentage of <i>ordinary people</i> who fell for psychic phenomena??</p>\n]]>", "author": "Scott", "published": "2016-11-11 22:52:32+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Raoul #50, Maciej #58, Nilima #120: Thank you so much!  It lifts my spirits not to be totally alone here.  (And sorry for the delay&#8212;comments have coming faster than I can respond to them.)</p>\n]]>", "author": "Scott", "published": "2016-11-11 22:57:11+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Of course Turkey is not a Scandivian democracy, but comparing Erdogan&#8217;s Turkey with Iran is a huge exaggeration in my opinion. I&#8217;ve been living in Turkey safely for years, and I observed that Turkey has still vibrant secularists alongside a  dynamic opposition with nonnegligible vote. Erdogan is just being demonized way more than he actually is. Apart from the Erdogan&#8217;s increasing power which can be placed somewhere in between Vlad Putin and Viktor Orban realistically, Turkey has even a better democratic tradition than Israel in many senses. Remember Erdogan&#8217;s party barely won the previous elections and had to compromise lately for another political party, which is not what you expect in a up-to-date &#8216;dictatorship&#8217;.</p>\n]]>", "author": "Hus", "published": "2016-11-11 23:04:57+00:00", "title": "By: Hus"}, {"content": "<![CDATA[<p>Scott #195: Arguably you could say it failed earlier with Andrew Jackson.  And, like, it took <i>65 years</i> after Jackson&#8217;s election to even truly begin undoing the damage he caused with the spoils system.</p>\n<p>That&#8217;s the thing &#8212; before Jackson, &#8220;You don&#8217;t just blatantly give out government jobs as patronage&#8221; wasn&#8217;t a <i>law</i>, it just, y&#8217;know, <i>wasn&#8217;t done</i>.  But once Jackson started it, well, how could any party win if they <i>didn&#8217;t</i> promise to do so?  Ultimately the only way to stop it was getting an explicit law passed to stop it, which took decades.  And it&#8217;s not at all clear that that can even work for everything Trump has damaged or will damage.</p>\n]]>", "author": "Sniffnoy", "published": "2016-11-11 23:19:41+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Epistocracy is inherently unstable.  The advantage of a democratic system is that it ensures a peaceful transition of power.  If voting power is uneven, the larger class of citizens without representation could overpower the elite minority in control by violent revolution.  The only way those in power could prevent this from happening is through authoritarian measures.  </p>\n<p>Furthermore, those currently in power would have every reason to create metrics for voting suitability that privilege those with their own point of view.  This is not a new idea &#8211; literacy tests were used in the South with the aim of disenfranchisement of black voters.  You might say that these tests were clearly unfair, and better ones can be devised.  But who writes these exams?  The people currently in power.  Can you imagine taking a biology exam written by Ted Cruz?</p>\n<p>This form of government would be, in practice, indistinguishable from oligarchy.</p>\n]]>", "author": "Jair", "published": "2016-11-11 23:33:12+00:00", "title": "By: Jair"}, {"content": "<![CDATA[<p>Scott #195: I believe the drawback of the “epistocracy” idea is that it introduces arbitrary parameters and is therefore more vulnerable to corruption. Specifically, what level of knowledge is sufficient for participation, and who gets to determine this?</p>\n<p>Wouldn&#8217;t it be a more elegant solution to keep the conventional democratic framework whilst working towards raising the overall knowledge of the masses?</p>\n]]>", "author": "Dan J.", "published": "2016-11-11 23:43:34+00:00", "title": "By: Dan J."}, {"content": "<![CDATA[<p>Scott,</p>\n<p>While your fear of an authoritarian takeover of America is way too plausible for comfort, I think it&#8217;s unlikely.</p>\n<p>Yes I&#8217;d expect incrementally more voter suppression, but the whole voter fraud narrative was damaged by his being elected, which will make it hard to provide motivation for changes.</p>\n<p>If there&#8217;s one thing for sure about America, is that it&#8217;s extremely money driven. Authoritarian rule would cause a lot of civil unrest, and civil unrest is bad for business. His inner circle would stand too much to lose, and wouldn&#8217;t want that to happen.</p>\n]]>", "author": "Jonathan", "published": "2016-11-12 00:15:14+00:00", "title": "By: Jonathan"}, {"content": "<![CDATA[<p>Dan J. #202: there are plenty of methods to differentiate competency of voters. How about this: you get 1 vote for citizenship + 1 more vote for producing a high school diploma + 1 more vote for producing a college degree + 1 more vote for demonstrating that you paid nationwide median amount of taxes last year + 1 more vote for special considerations (veterans, etc). Voila! Suddenly uneducated unemployable vote is worth 1/5th of a well educated revenue producing veteran. It&#8217;s not difficult at all to suggest reasonable parameters like that. However, implementing them would be very difficult, if possible at all.</p>\n]]>", "author": "Michael P", "published": "2016-11-12 00:20:38+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>@Hus #199</p>\n<p>Yes, my family had its usual annual holiday in Turkey this August just after the recent coup attempts, Turkey is still a reasonably safe place. Erdogan has over-reacted to the coup I think, but we hope he will become more moderate in the next couple of years, otherwise it will be a worry.</p>\n<p>Not many people realise how secular a country Turkey was for most of the twentieth century, head scarves were not allowed in schools, hospitals or any other government buildings until recently, and bars and clubs selling alcohol were popular in many towns and cities. </p>\n<p>Tony Blair was a big big champion of Turkey in the 1990s, the European Union should have embraced them &#8211; but Germany, France and others opposed membership, now Angela Merkel admits a million Syrians. </p>\n<p>Makes one wonder why the Palestinians had nowhere to go for so many decades.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2016-11-12 00:43:26+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>Scott #195- The problem is that what was driving so many white men without college degrees into Trump&#8217;s arms was that they felt nobody was listening to them. As you yourself pointed out, their way of life was dying and instead of sympathy, they got accusations of privilege and racism. Removing the vote from people like that would just alienate them further and might result in violence.<br />\nAlso, since the better-educated tend to be wealthier, such a system would be biased against the poor.<br />\nAlso, there&#8217;s the problem of choosing the right skills to test- look at the Chinese civil service exams in the late 18th and 19th centuries, which produced officials that knew a lot about Confucian philosophy but nothing about how to run a country in the modern world.<br />\nThere&#8217;s also the problem that sometimes all the &#8220;smart people&#8221; can be wrong and the &#8220;dumb people&#8221; can be right- exhibit A- all the pollsters that said Trump would lose and Brexit would never go through.</p>\n]]>", "author": "Michael", "published": "2016-11-12 00:50:15+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Scott, of course i understand your points, but that does not mean that i agree. If I start judging my fellow countrymen too stupid to vote (they obviously do not see it this way), then it is unclear how I could ever find common ground with them. And you tell me then how your country can move forward. In some places the hatred against liberals etc. is so enormous, I don&#8217;t understand where it comes from, but it needs to be addressed, not rationalized as just them being uneducated (i may still believe that they are mistaken but that is besides the point).</p>\n]]>", "author": "Barbara Terhal", "published": "2016-11-12 00:52:44+00:00", "title": "By: Barbara Terhal"}, {"content": "<![CDATA[<p>Jair #201 and Dan J. #202</p>\n<p>Isn&#8217;t age already an arbitrary parameter? Who establishes what the age cut-off should be?<br />\nRegarding who would make these tests, how about the same people who make citizenship tests? Or an independent panel of randomly selected experts from various fields an universities. </p>\n<p>While I lean towards epistocracy, Scott&#8217;s fantasy system is a bit too extreme for me. I agree with Jair in that such a system would have a majority of citizens without representation that would revolt against it. </p>\n<p>So I&#8217;d opt either for:<br />\na) A comprehensive test in which, say, the lowest scoring 10-20% are denied the right to vote (at least temporarily, since citizens should be allowed to retake the test after a certain period of time). That way, the majority of people are still able to vote.<br />\nb) Everyone starts off with 1 vote and earns more votes proportional to the score they get on such a test.</p>\n<p>People have different levels of understanding of the complex economical, social and political issues, so a weighted average based on their level of understanding seems like a better solution than just a direct average.</p>\n]]>", "author": "Random Oracle", "published": "2016-11-12 00:53:42+00:00", "title": "By: Random Oracle"}, {"content": "<![CDATA[<p>The political philosophy of &#8216;checks-and-balances&#8217; suggested an idea for friendly AGI , which I posted in several forums.</p>\n<p>The idea is that instead of having a single unified goal that we want an AGI to optimize, we instead put multiple goals on an equal footing, such that the system has to learn internal conflict-resolution and coordination procedures to balance these multiple goals.  So internal &#8216;checks and balances&#8217; prevent  any one goal from roaring out of control in a crazy optimization way.</p>\n<p> And the internal coordination procedures are *themselves* values (new emergent values), which could form the basis for a universal meta-ethics.</p>\n<p>In terms of the ideal political system, I think you have to look at things on an issue-by-issue basis- democracy is good for *some* things, but not others.  For instance, provision of public goods that needs large-scale coordination (for example clean environment and health-care) is arguably better handled by social-democracy, whereas most economic policy probably isn&#8217;t.</p>\n<p>I&#8217;m not a fan of democracy when it comes to basic human rights (negative rights) for instance, which are better protected by a constitution and simply enforced regards of what the majority thinks, whereas for other kinds of rights (positive rights), a more democratic approach seems reasonable (social contract approach for example).</p>\n<p>So really it depends on what the issue is.</p>\n]]>", "author": "mjgeddes", "published": "2016-11-12 01:30:11+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>[&#8230;] In the comments of my last post, an international student posted a heartbreaking question: [&#8230;]</p>\n]]>", "author": "Shtetl-Optimized  Blog Archive  Never, never, never normalize this", "published": "2016-11-12 02:42:01+00:00", "title": "By: Shtetl-Optimized » Blog Archive » Never, never, never normalize this"}, {"content": "<![CDATA[<p>Scott #195: &#8220;the founders of the US refused to institute a direct democracy, but instead set up a complicated system of checks and balances, in which the &#8216;will of the masses&#8217; would get filtered through people who’d hopefully taken some time to understand the issues. This week, arguably for the first time in its 240-year history, that system has catastrophically failed&#8221;</p>\n<p>I think you misunderstand. The system of checks and balances set up by the US constitution is not primarily designed to prevent demagogues from being *elected*; it is mostly, or at least just as much, designed to prevent them from doing too much damage *in office*.</p>\n<p>In other words &#8212; if we assume that Trump is as bad as you think &#8212; this is exactly the type of situation that the US system was designed for! This is what people who complain about &#8220;gridlock&#8221; in the American system don&#8217;t understand: gridlock is a consciously designed feature, not an unintended bug. If the US had a parliamentary system, you would perhaps be right that the very election of a demagogic chieftain already constitutes a failure. As it is, it&#8217;s just putting the system to the test.</p>\n<p>We may now be about to reap the benefits of &#8220;not being able to get things done&#8221; in &#8220;better&#8221; times.</p>\n<p>(Of course, maybe the system won&#8217;t actually turn out to work I&#8217;m not saying anyone is necessarily wrong to worry about that.)</p>\n]]>", "author": "komponisto", "published": "2016-11-12 02:50:16+00:00", "title": "By: komponisto"}, {"content": "<![CDATA[<p>@Scott<br />\n>> I’d much rather live in a society governed by physicists</p>\n<p>I am a physicist and would like to point out that smart physicists, as smart as John von Neumann, got us into system(s) during the cold war, which several times almost wiped out all life on earth.<br />\nIn one case Earth only survived because a low-level Soviet colonel trusted his instincts more than the clever system designed by smart experts.</p>\n<p>Btw my favorite anecdote about Los Alamos is about the possibility that the 1st nuclear explosion could have set the atmosphere on fire and wipe out all life on Earth. Of course, now we know that this does not happen, but at the time Edward Teller estimated the probability to be 1:1000<br />\nThe physicists decided that this was low enough to go ahead with the test.</p>\n<p>So no I don&#8217;t think replacing democracy with an assembly of smart experts is such a good idea.</p>\n]]>", "author": "wolfgang", "published": "2016-11-12 03:36:29+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>If Mrs. Clinton were to &#8220;win&#8221; the outcome of the electoral process in this election, how many Americans&#8212;at least those on this thread&#8212;might have entertained the idea of the weighted vote, where the value of the weight is other than the unity? Why might some otherwise reasonable people want to entertain this idea? for what <em>structural</em> reasons? &#8230; In this comment, let me explore this matter, in my own way, a lengthy, meandering, even a very boring way&#8230;</p>\n<p>Thinking of this thing&#8212;what are the structural reasons that might lead to entertaining the very idea of the weighted votes&#8212;I think that the following fact gives the necessary clue.</p>\n<p>The USA today is a <em>mixed</em> economy. It does not have a full Laissez-Faire Capitalistic system, i.e. a system where there is a complete separation of government and economic (or productive) activities. The domain of the government in the USA today far exceeds the limited mandate it should be given in conducting its activities. In the system as it exists by now, by controlling the economic life of a man (even if only partially), the modern American system also goes on to control <em>all</em> other aspects of a man&#8217;s life, coloring all his decisions, whether to small or great degrees (even if rather indirectly in spheres other than economic).</p>\n<p>It is due to the improper existence of the government control in the life of the citizen that elections can at all assume such a  huge, unduly high, importance. </p>\n<p>To Americans: If you have ever wondered why many otherwise active non-American bloggers didn&#8217;t post a lot on their own blogs or didn&#8217;t participate in your elections-related discussions a lot, the reason is: they are not under your <em>government</em>. Whatever actions your government undertakes, it affects them only indirectly, via international relations and trade, and sometimes not at all&#8212;whether positively or negatively. For example, during the times of the enormously overwhelming license-quota raj in India, Indian entrepreneurs did <em>not</em> benefit much from the relatively greater freedom you enjoyed under your the then governments&#8212;and <em>you</em>, understandably (and properly), didn&#8217;t even care for the most part. </p>\n<p>In other words, (i) the government controls <em>do</em> matter, (ii) the <em>improper</em> ones among the government controls matter most crucially, and (iii) <em>all </em>government controls&#8212;whether proper or improper&#8212;matter in a most direct manner <em>only</em> to those who are being governed under that government.</p>\n<p>To return to the main theme: elections have become so (god)damn important only because the system is not free: your system is part-statism, and therefore, only in part free. </p>\n<p>It is only because of the intrusions of a government in the areas of the life of a citizen where it should not be intruding, that elections assume so hugely undue an importance. </p>\n<p>The undue importance of elections is a <em>structural</em> feature of the present-day American political system; it is not a passing social trend. You get so excited about your elections, only due to this fundamental reason. In a complete Laissez Faire Capitalistic system, you would <em>not</em> have got so excited (and much more!)</p>\n<p>The election of (any) one party, under such a structure (of being at least in part conforming to statism), has the immediate effect that decisions regarding <em>all</em> aspects of an ordinary citizen&#8217;s life are taken in accordance with (or at least in preference to) that party&#8217;s agenda which &#8220;wins&#8221; the election. It does not matter whether the party in power is R or D. There is no scope for R&D here; the matter is straight-forward, regardless of whether it is R or D which comes to power. Whatever be the party in power, it is not only allowed but even encouraged, by the structural features of the system itself, to act as if each vote for it had got had carried a weighting factor that is greater than unity.</p>\n<p>In principle, even just a single vote that gives a &#8220;victory&#8221; to an internal party of a single nation acquires undue importance only because it assumes an <em>improperly</em> high strength of the structural leverage to coerce the lives of all: including the lives of the &#8220;loosers.&#8221; The structure of the polity itself is such that it in principle paves a way for the majority to control the manner in which the individuals constituting the minority might not otherwise have conducted their own, individual lives. (It also affects those in the majority in a decidedly bad manner, but this bad occurs over a rather long run, and so let me not get into it here; otherwise, this comment would become <em>even</em> longer, and you don&#8217;t want me to do that, do you?)</p>\n<p>Thus, it is the structural feature of the present-day American government system which is such that, due to the improper presence of government in the areas of life in which it has no business of being in, the unavoidable <em>effect</em> it produces is as if the democratic electoral process were to add a high weightage to the individual votes on the &#8220;winning&#8221; side.</p>\n<p>The party that loses the election may now think of not having this (objectively undue, coerced) burden on them, and in order to counter-act the same, it may wonder if each of <em>their own</em> votes could not have carried a weight such that it would have numerically exceeded the &#8220;victor&#8221;&#8212;even if only by a $latex \\epsilon \\in \\mathcal{Re}$, not $latex \\mathcal{N}$. </p>\n<p>The point to realize is that none would have to direct his thoughts towards <em>any</em> weighting schemes if the government itself were always to be kept limited to its proper sphere. [As to what constitutes the proper functions of government, I suggest, see Ayn Rand.]</p>\n<p>Your present system <em>is</em> bad, but there <em>are</em> things which are even worse than your present system. An introduction of a weighting scheme at the electoral stage is one of them.</p>\n<p>First of all, since the statism-related parts in the governmental system have not been addressed and therefore even possibly touched at all, the objective grievances due to an improperly large, increasingly statist, government would still continue to exist regardless of which party comes to power through whatever weighting scheme.</p>\n<p>Second, the weighting scheme, right in the medium run, would seamlessly integrate a new&#8212;and bad&#8211;structural tendency into the polity: that of permanently producing a higher and higher weightage to whichever party that then happens to be in power. Observe that the particulars of a weighting scheme would be under the authority of those who already are in power, and the details therefore would be tweaked so as to benefit them.</p>\n<p>This being a <em>structural</em> feature, it would fast accelerate, in a nonlinearly fast manner, the transition from a &#8220;mere&#8221; mixed economy to an establishment of a total dictatorship. </p>\n<p>(May be Raoul Ohio is a closet dictator himself! &#8230; Are you, Raoul?&#8230; Just want to check before actually accusing you, that&#8217;s all.) </p>\n<p>The solution, therefore, is in understanding the place where the source for the existing (implicit) weighting system is located, and then removing it. </p>\n<p>The solution is not seeking to add yet another weighting scheme, now also to the electoral process, thereby also maundering this, relatively cleaner, part of the political system. </p>\n<p>The solution, to repeat, is to remove <em>all</em> weightings&#8212;explicit and implicit, whether at the electoral stage or at the governance stage.</p>\n<p>The solution, I do realize, does not seem to be a very smart way of thinking. At least, it does not tease the creative juices of the Shtetl-Optimized blog-readers into thinking which of the electoral-process weighting schemes would be better and why. The proposed solution therefore may look staid and boring&#8230; Perhaps the only thing more boring might be having to have read this much through this shitty comment. &#8230; Don&#8217;t worry, one or two <em>more</em> paragraphs are coming up!</p>\n<p>No matter how &#8220;old&#8221; and &#8220;boring&#8221; the proposed solution may look, as to its being &#8220;old,&#8221; well, it has never existed <em>in toto</em> anywhere&#8212;not even in the history of the USA. </p>\n<p>As to its being &#8220;boring,&#8221; well, boring it may be, to some, but it will work, always, and for all, because it is the one which is in harmony with the metaphysical nature of man&#8212;with a view of man as an autonomous living being, as one who has free will and can shape his life according to his own individual choices. To bring this view of man into politics <em>is</em> to have a system that is free of any improper coercion by a government. The original American system was <em>close</em> to this ideal. </p>\n<p>Sure, cleansing a polity at the systemic level <em>is</em> harder, in that it takes sustained efforts over the long term. But effecting the cleansing at the systemic level also are strong, very strong. </p>\n<p>To see how strong and large effects are produced due to changes at the systemic level, consider the fact that America could prosper to such a great extent in the 19th century&#8212;even during the times that slavery had not yet been abolished, and later on, even when women (of any race) were not allowed to vote. Keeping women out of the voting <em>was</em>, effectively, a weighting scheme&#8212;with a weight of zero. Removing this part, which occurred only in the 20th century, must have been great, but they are not very clear for us to see or isolate. The trouble was: the 20th century also was the time when, structurally, America began embracing statism. (Taxes were introduced only in the 20th century.) And, as I told you, the systemic changes are far stronger than the electoral process reforms, and so, even effecting the universal suffrage, thereby expanding the voter population by a factor of two, still could not compensate the bad effects due to the tilt towards statism. </p>\n<p>Today, USA grows only at about 2%, and despite being one of the wealthiest nation (owing to its better past), there is an increasing discontent, even rage in the American society&#8212;even if American women now can not only vote but one of them in fact came so close to becoming a President! The cause, once again I suggest, is to be located in the <em>structural</em> features of the polity&#8212;there is a hidden weighting scheme residing in the mixed nature of the polity itself, and you have to get rid of it.</p>\n<p>[Don&#8217;t worry, I will not post any more replies on this thread. I should in fact also take this comment as a post at my own blog some time later&#8212;once my job-related situation becomes clear.]</p>\n<p>Best,</p>\n<p>&#8211;Ajit<br />\n[E&OE]</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2016-11-12 03:52:10+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Ajit #213: WTF?</p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-12 04:28:09+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Raoul #214:</p>\n<p>Ummm&#8230; Seems like you missed the humour&#8230; Never mind; sorry if you were offended.</p>\n<p>Best,</p>\n<p>&#8211;Ajit<br />\n[E&OE]</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2016-11-12 04:44:16+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Dan #202:</p>\n<ul>Wouldn’t it be a more elegant solution to keep the conventional democratic framework whilst working towards raising the overall knowledge of the masses?</ul>\n<p>To me, that&#8217;s a bit like asking: rather than admitting some people to grad school and not others, wouldn&#8217;t it be a more elegant solution to just work to raise <i>everyone&#8217;s</i> knowledge of solid-state physics?  Yes, of course, one should do the latter as well.  But I&#8217;d say the entire point of a representative democracy&#8212;i.e., a republic&#8212;is that there&#8217;s a specialization of labor, that some people have the job of familiarizing themselves with the issues more carefully than others.  And while it&#8217;s open to anybody to <i>seek</i> that job, not everyone <i>will</i> have the job, nor should they.  To me, epistocracy is just a logical extension of this.</p>\n<p>The Founders imagined that the people sent to Congress, or chosen as Electors, would be more educated about the issues than the general public; and they wouldn&#8217;t imagine that the system could work without such an assumption.  Today, though, media bubbles allow people to choose representatives who are every bit as uninformed as they are.</p>\n<p>If you visit sites like MathOverflow, StackExchange, etc., you&#8217;ll see a form of Internet democracy that actually <i>works</i>: one where anyone can contribute, but where there are also mechanisms (not at all unrelated to my <a href=\"http://www.scottaaronson.com/blog/?p=1820\">&#8220;eigendemocracy&#8221;</a> proposal) for quickly identifying the people who know what they&#8217;re talking about on a given topic, and giving their contributions higher weight.  It seems plausible that, if Jefferson and Hamilton and Madison were alive today, they&#8217;d be extremely interested in the huge natural experiment we&#8217;re now doing with these social error-correcting mechanisms.  At any rate, <i>I&#8217;m</i> interested, because the old error-correcting mechanisms strike me as irreparably broken.</p>\n]]>", "author": "Scott", "published": "2016-11-12 05:58:38+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Sweden #137:</p>\n<ul>Scott, the left has been tormenting you all your life, as you stated right here on this blog. Right now they are rioting and burning things in the city you live in, and making dire death threats in every direction. Meanwhile, I have to wonder if you’ve ever even _met_ a Trump supporter. And yet, you reel in terror before the one but not the other. Why is this?</ul>\n<p>There have been too many threads for me to answer all of them, but I at least wanted to answer this.</p>\n<p>Yes, the left has been &#8220;tormenting me all my life,&#8221; but <i>they&#8217;ve only been able to torment me because I&#8217;ve actually cared what they think.</i>  After all, whatever excesses the left has been guilty of, <i>they&#8217;re</i> the ones who have historically been associated with reason and Enlightenment and democracy and tolerance and environmentalism and almost everything else I&#8217;ve ever considered to be good.  They&#8217;ve been on the right side of history about slavery and women&#8217;s suffrage and Nazism and civil rights and gay rights and climate change, which is a pretty impressive track record (on the other side of the ledger, we have Marxism and its cultural offshoots, but those were never part of <i>my</i> leftism anyway).</p>\n<p>So sure, my respect for liberal ideals gave my fellow liberals the power of shame over me, and maybe it&#8217;s not surprising in retrospect that some of them tried to abuse that power.</p>\n<p>I confess: these past few days, I&#8217;ve reflected on the irony that, in my uncompromising rejection of Trumpism, one of my closest <a href=\"http://www.salon.com/2016/11/09/the-misogyny-apocalypse-turns-out-being-white-and-male-counts-for-more-than-intelligence-grace-or-decency/?utm_source=facebook&#038;utm_medium=socialflow\" rel=\"nofollow\">&#8220;allies&#8221;</a> is now Amanda Marcotte.  And, in desperately searching for the tiniest silver lining from this week&#8217;s catastrophe, I&#8217;ve wondered whether I should be happy that at least <i>Marcotte&#8217;s</i> upset, and it serves her right for cruelly bullying me? But then I find that, no, I can&#8217;t work up any schadenfreude about it.</p>\n<p>(For one thing, as <a href=\"http://slatestarcodex.com/2016/09/28/ssc-endorses-clinton-johnson-or-stein/\" rel=\"nofollow\">others have pointed out</a>, Trump&#8217;s rise to power will probably just make the social-justice people even more self-certain about the urgency of their cause, and hence more merciless in cracking down on shy male nerds like me.)</p>\n<p>The power that Trump supporters have over me is purely temporal: even if, let&#8217;s say, a bunch of right-wing goons threw me into prison and beat me savagely while calling me a kike, there&#8217;s a sense in which it wouldn&#8217;t get to me, because <i>I don&#8217;t care what they think.</i>  Whereas a single negative word from a really intelligent feminist would bother me a thousand times more.</p>\n<p>You might ask: will my standing side-by-side with the social-justice feminists, in our shared urge to deny the slightest legitimacy to Trump&#8217;s rule, cause any of those feminists to change their view of me?  Judging from the above thread, my guess is no: you can already see several SJWs attacking me as an even bigger white male cishet douchecanoe than they imagined, because I cry about the destruction that Trump will wreak, yet I fail to acknowledge that the United States is <i>already</i> a racist, sexist dystopia that Trump couldn&#8217;t possibly make any worse.</p>\n<p>So, let&#8217;s suppose for the sake of argument that the more vociferously I agree with the SJWs in their anti-Trumpism, the more they just invent new reasons to hate me.  Should that cause me to rethink my anti-Trumpism itself?  If it does, then I&#8217;m a moral weakling and coward.  Here&#8217;s my prayer for tonight: God, though you sit inertly while our world goes to hell, still, grant me the strength to choose my allies because of my principles, rather than my principles because of my allies.</p>\n]]>", "author": "Scott", "published": "2016-11-12 07:05:31+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Michael P #204, Random Oracle #208, Scott #216: Thanks for the thoughtful responses.</p>\n]]>", "author": "Dan J.", "published": "2016-11-12 06:51:59+00:00", "title": "By: Dan J."}, {"content": "<![CDATA[<p>Out of curiosity: on the topic of pro-life voters on-average having sided more with Trump than Hillary, I could believe that this was the right choice given their values. Which leads me to ask &#8211; are there good counterpoints to the argument in the following editorial?</p>\n<p><a href=\"http://www.christianpost.com/news/hillary-clinton-is-the-best-choice-for-voters-against-abortion-170258/\" rel=\"nofollow\">http://www.christianpost.com/news/hillary-clinton-is-the-best-choice-for-voters-against-abortion-170258/</a></p>\n<p>My brief attempt to test the claims there about abortion statistics let me here:</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Abortion_statistics_in_the_United_States\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Abortion_statistics_in_the_United_States</a><br />\n&#8230;and to think that the editorial might be overselling or exaggerating the magnitudes of the changes or trends. But the number aren&#8217;t inconsistent with the general thesis: at-best slight decreases in abortion rates during Reagan & the Bushes, significant decreases during each of Clinton & Obama. Having not dug deeper, and knowing the perils of real-world data, I can also imagine ways in which these statistics would turn out in fact to be misleading. </p>\n<p>In broad strokes, what, if anything, am I missing?</p>\n<p>(In case it&#8217;s not clear from this post&#8217;s tone, I&#8217;m genuinely truth-seeking here and open to persuasion to either side of the matter.)</p>\n]]>", "author": "Anonymous", "published": "2016-11-12 14:37:36+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>Regarding fantasy alternatives to democracy, mine would be a combination of standardized testing, sortition on the 99th percentile to make gaming the test uneconomical, and a conventional election from there. By coincidence, I wrote about it today here: <a href=\"https://medium.com/@LyleCantor/an-alternative-to-democracy-e4ba2af07a85#.sqhoquqgc\" rel=\"nofollow\">https://medium.com/@LyleCantor/an-alternative-to-democracy-e4ba2af07a85#.sqhoquqgc</a></p>\n]]>", "author": "Lyle_Cantor", "published": "2016-11-12 14:59:37+00:00", "title": "By: Lyle_Cantor"}, {"content": "<![CDATA[<p>Rahul Ohio 151:</p>\n<p>I don&#8217;t think Trump is the right person to address those causes. He just used that rhetoric to appeal to voters. My point here is that don&#8217;t assume people voted for Trump for his misogyny or racism. They voted because between the choices they were given he was the one who voiced those concerns.</p>\n<p>On TPP, Trump may kill it but replace it with something much worse. On immigration I think he will follow up on his promise and build a wall and deeper illegal immigrants and make it harder for people from Asian and African countries to migrate to the USA. Europeans and Latin Americans who immigrate legally will probably won&#8217;t be affected by the policies. For tech it will be interesting how he deals with Indian immigrants. Also Chinese immigrants. If he wants to get reelected he will do something to keep the voters in the rust belt with him and that is going to be trade and immigration.</p>\n<p>Socially he will move the US to right, not because he himself is against lgtbq rights or abortion, he is not, but because Republicans now control Congress, Presidency, and supreme Court. This is a total disaster for a liberal. But it is a reaction to mistakes that the political establishment in DNC made. You don&#8217;t put a candidate with such high unpopularity and scandals and close ties to financial institutions in a election like this.</p>\n]]>", "author": "Sanders supporter", "published": "2016-11-12 16:58:49+00:00", "title": "By: Sanders supporter"}, {"content": "<![CDATA[<p>Reza (#165) Thanks!</p>\n<p>I also share the opinion  that limiting people&#8217;s right to vote based on education or any similar suggestion is a very bad idea: It is immoral, undermines democratic norms more severely than anything we have recently witnessed, and would (further) harm weak sectors of society. (But it is natural, especially in times of crisis,  to examine also bad ideas.)</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2016-11-12 17:07:50+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Btw just one more contribution to the idea that physicists and scientists in general should perhaps have more weight in politics.<br />\nThey already do!</p>\n<p>Robert Mercer is the money man behind Breitbart and the Trump campaign. He holds a BS in physics and math and a PhD in computer science. He made his money together with Jim Simons, who hired him, in case you are wondering.</p>\n]]>", "author": "wolfgang", "published": "2016-11-12 18:50:38+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>wolfgang #223: So if the franchise had been restricted (let&#8217;s say) to PhD&#8217;s in math, CS, and physics, it would&#8217;ve been merely 90-10 or 95-5 for Hillary, rather than 100-0?</p>\n]]>", "author": "Scott", "published": "2016-11-12 19:14:28+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>@Scott  </p>\n<p>I think you overestimate how many math, CS and physics Ph.D&#8217;s stay liberals outside of academia<br />\nA lot have e.g. found jobs in finance and changed their politics once they left university; I know several of them.</p>\n]]>", "author": "wolfgang", "published": "2016-11-12 20:09:09+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>I&#8217;m not going to tell you you&#8217;re over-reacting, but as far as silver linings may I propose the following&#8230;</p>\n<p> &#8211; Trump will, in all likelihood, deescalate our current tensions with Russia.</p>\n<p> &#8211; This is the first time (that I know of) that the campaign chairperson for the winning presidential candidate was a woman. </p>\n<p> &#8211; This is the first election (again that I know of) where an openly gay man was a key-note speaker at the Party of God & Guns&#8217; national convention and rather than being booed off the stage, has was met with enthusiastic cheers/applause. Likewise when the republican presidential candidate stood on stage promised to protect the LGBT community from violence/hate-crimes the crowd cheered.</p>\n]]>", "author": "hlynkacg", "published": "2016-11-12 20:19:46+00:00", "title": "By: hlynkacg"}, {"content": "<![CDATA[<p>Btw a Pew survey from 2014 found that &#8220;Democrats lead by 22 points (57%-35%) in leaned party identification among adults with post-graduate degrees. The Democrats’ edge is narrower among those with college degrees or some post-graduate experience (49%-42%),&#8221;</p>\n<p>I could not find a survey for STEM graduates only, but would guess that the numbers are closer than for all academic degrees.<br />\nIN my experience there are a lot of libertarians at reddit, slashdot, less wrong and wherever else the nerds accumulate &#8230;</p>\n]]>", "author": "wolfgang", "published": "2016-11-12 20:56:08+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Libertarians are pretty different from Republicans &#8212; assuming you&#8217;re talking about the sort of libertarians who gather at such places, anyway (I realize other sorts exist).  In my experience, such libertarians, if they vote for one of the big two, will generally vote for the Democrats.</p>\n]]>", "author": "Sniffnoy", "published": "2016-11-13 00:31:23+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Relevant, from Scott Alexander&#8217;s <a href=\"http://slatestarcodex.com/2014/09/30/i-can-tolerate-anything-except-the-outgroup/\" rel=\"nofollow\">&#8220;I Can Tolerate Anything Except The Outgroup&#8221;</a>:</p>\n<blockquote><p>On last year’s survey, I found that of American LWers who identify with one of the two major political parties, 80% are Democrat and 20% Republican, which actually sounds pretty balanced compared to some of these other examples.</p>\n<p>But it doesn’t last. Pretty much all of those “Republicans” are libertarians who consider the GOP the lesser of two evils. When allowed to choose “libertarian” as an alternative, only 4% of visitors continued to identify as conservative. But that’s still…some. Right?</p>\n<p>When I broke the numbers down further, 3 percentage points of those are neoreactionaries, a bizarre sect that wants to be ruled by a king. Only one percent of LWers were normal everyday God-‘n-guns-but-not-George-III conservatives of the type that seem to make up about half of the United States.</p></blockquote>\n]]>", "author": "Sniffnoy", "published": "2016-11-13 00:36:38+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Gail #31, etc: Scott&#8217;s reacting entirely reasonably. This is an appropriate reaction for any member of the intelligentsia. We fare pretty poorly under authoritarian rule, and if you don&#8217;t know that, you haven&#8217;t been doing your lifelong homework. </p>\n<p>The people now in power do not like universities, though they covet the prestige, and they do not like or trust intellectuals, though they crave their approval. You should not forget that.</p>\n]]>", "author": "amy", "published": "2016-11-13 06:11:58+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Scott #169,</p>\n<p>Well it has not been tested so we can only speculate. But are we supposed to imagine that people just accept being told, in effect, they are too stupid to vote? I can&#8217;t imagine that happening. That there is a test which singles you out as personally unworthy makes it more humiliating than denying the vote to broad groups like children, non-citizens and (in the past) women. I foresee a great deal of resentment.</p>\n<p>I also note that many of natural scientists were quite taken in by the Soviet Union. Many started losing faith when the Lysenko affair happened, which the cynic would point out was when they saw the impact on people like themselves. Maybe your proposed system would have caused at least some countries to vote in a communist dictatorship. In Germany I think Hitler had broader support among the educated classes than among the working classes, and that may well have included natural scientists. </p>\n<p>I also think there would be a great deal of political fighting about exactly who gets to vote. The content of the test would be subject to debate. The right would want to add question on economics, while the left would want to add question on gender studies and other left-wing subjects. The details of the affirmative action would also be strongly contested by the various sides.</p>\n]]>", "author": "Jr", "published": "2016-11-13 09:52:26+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>wolfgang #225: OK, I&#8217;ll trust you on that.  Among all the hundreds of math/CS/physics PhDs I know, there are a few (quasi-)libertarians, and people who ignore politics or are impossible to categorize, but the only open Trump supporter I can think of is Lubos (who of course isn&#8217;t an American citizen anyway).</p>\n]]>", "author": "Scott", "published": "2016-11-13 11:16:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p><i>&#8220;A lot have e.g. found jobs in finance&#8221;</i></p>\n<p>Having gone through business school and taken a closer look at that industry, I can confirm that it seems to be damaging to one&#8217;s soul.</p>\n]]>", "author": "quax", "published": "2016-11-14 02:31:56+00:00", "title": "By: quax"}]