[{"content": "<![CDATA[<p>A bit off-topic, a question about QM/QC.</p>\n<p>Does the amount of entanglement in a system have any particular measurable &#8220;cost&#8221; or is it just a &#8220;free lunch&#8221;?</p>\n<p>I have two situations, similar to the setup in the EPR paradox.<br />\n1) two entangled particles.<br />\n2) the same two particles but not entangled.<br />\nBesides saying that in one case the wave function is shared and that in the other case we have two wave functions, is there any other difference between the two cases, e.g. slightly different energy?<br />\nAre we really able to entangle more and more particles (i.e. realizing qbits) without limit?<br />\nIt would seem reasonable to think that nature has to make some sort of &#8220;trade-off&#8221; to be able to entangle more and more particles (maybe that question is the same as asking if there are any hidden local variables?).</p>\n]]>", "author": "Fred", "published": "2014-02-05 14:04:52+00:00", "title": "By: Fred"}, {"content": "<![CDATA[<p>Assuming we want a public crypto alternative that&#8217;s resistant to Shor-breaking if and when a scalable QC arrives, how good  are the lattice based crypto options?</p>\n<p>i.e. Is it proven than a QC-based attack is impossible / hard? Or are we just waiting for the right kind of &#8220;Shor-plus&#8221; that can defeat them?</p>\n]]>", "author": "Rahul", "published": "2014-02-05 14:19:54+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Fred #59: Asking whether there&#8217;s any limit to the number of particles you can entangle, is a lot like asking whether there&#8217;s any limit to the number of people who can share a secret.</p>\n<p>In principle, the answer is no: just keeping letting in more and more people!  The effort only scales linearly with the number of people, not exponentially or anything crazy like that.</p>\n<p>In practice, the difficulty is obvious: the more people you let in, the greater the chance that <i>one</i> of them will upload the secret to WikiLeaks.  Then, ironically, you&#8217;ll have overshot your target: while you &#8220;merely&#8221; wanted a thousand or a million people (all of whom you were keeping track of) in on your secret, now the <i>entire world</i> is in on it.</p>\n<p>In the same way, the more particles you entangle, the greater the chance that one of them will overshoot the target, entangling itself with the measuring apparatus, the air molecules and EM field in the room, etc.  In which case, your first response might be &#8220;great! even more entanglement than I&#8217;d bargained for!&#8221;  But once the entanglement has spread so far that you can&#8217;t keep track of it, it&#8217;s just as if a measurement has been made, and you no longer have any hope of doing an interference experiment that would <i>reveal</i> the entanglement.</p>\n<p>Now, the whole point of quantum fault-tolerance is to spread the entanglement &#8220;secret&#8221; more cleverly among the particles, so that even if (say) any 1% of the particles get entangled with the environment, the secret is still secure with the other 99%&#8212;and indeed, the secret can then be &#8220;fortified&#8221; so that it remains secure even if <i>another</i> 1% of the particles get entangled with the environment, etc.  If and when quantum fault-tolerance becomes a reality, there should no longer be any practical limit on the number of particles that can be shown in experiments to be entangled (the current limit, I think, is a few billion particles, e.g. in solid-state and superconducting experiments).</p>\n<p>If there <i>were</i> a limit (not coming from cosmology) on the number of particles you could entangle, then something would have to be wrong either with quantum mechanics itself, or with some other extremely basic assumption of modern physics.</p>\n]]>", "author": "Scott", "published": "2014-02-05 15:55:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Rahul #60:</p>\n<ul>Is it proven than a QC-based attack [on lattice-based crypto] is impossible / hard? Or are we just waiting for the right kind of “Shor-plus” that can defeat them?</ul>\n<p>Currently, there&#8217;s no security proof for <b>any</b> public-key cryptosystem, even if you&#8217;re willing to assume (say) P&ne;NP, or NP&nsub;BQP, or the existence of one-way functions.  You <i>always</i> have to make some problem-specific hardness assumption, so the only questions are which assumption, how well has it been studied, etc.</p>\n<p>Having said that, the approximate shortest vector problem (and related lattice problems) <i>have</i> been very well-studied by now, and people have tried and failed to find quantum algorithms for these problems for at least 16 years.  And we understand in some detail why &#8220;Shor-plus&#8221; won&#8217;t suffice: at the very least, you&#8217;ll need &#8220;Shor-plus-plus-plus.&#8221; <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />   (In particular, you&#8217;d first need to generalize Shor&#8217;s algorithm to nonabelian groups like the dihedral group; and even then, lattice problems don&#8217;t <i>exactly</i> fit into the nonabelian HSP framework, but only approximately.)</p>\n]]>", "author": "Scott", "published": "2014-02-05 16:09:36+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #55,</p>\n<p>BTW, in British slang, </p>\n<p>(1) a Boffin is a top notch scientist,</p>\n<p>(2) an Egghead, Nerd, or Geek is scientist,</p>\n<p>(3) social scientists and philosophers are &#8220;trick cyclists&#8221;.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-02-05 16:33:09+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Scott at #58: Personally, my probability for the development of Scalable QC is dominated not by my uncertainty about the difficulty of achieving it, but by uncertainty about the future of funding to do the work.</p>\n<p>On the one hand, basic science research funding has had a terrible time of late; on the other hand, VCs backing a DWave++, or Google, or the NSA, might decide to open up a firehose of money to fund development of production-quality Scalable QC.</p>\n<p>Yes, the Manhattan Project achieved an atomic bomb in five years; but that&#8217;s because the U.S. Government threw the equivalent of thirty billion dollars (in current money) at it.</p>\n<p>My estimate of the likelihood of this happening is pretty thoroughly Knightian.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lennox:Jon.html\">Jon Lennox</a>", "published": "2014-02-05 16:53:57+00:00", "title": "By: Jon Lennox"}, {"content": "<![CDATA[<p>Scott #61: thanks for the detailed answer Scott, that&#8217;s a really striking analogy <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Fred", "published": "2014-02-05 18:01:01+00:00", "title": "By: Fred"}, {"content": "<![CDATA[<p>Jon Lennox, the sad thing is that the NSA and British Intelligence spent 100 billion in just one year to hack into your smart phone and Angry Birds. That&#8217;s the evil of classified research. Mediocrity, favoritism, fraud and abuse are quickly made top secret.</p>\n<p>How about the probability that China will pour 30 billion into developing a QC? I&#8217;ve noticed that in the last 2 years, the number of QC papers in arXiv with monosyllabic Chinese names as authors has skyrocketed. China has 4 times the population of the US. They are hungry to prove themselves. They have given carte blanche to their QC scientists. Their students consistently do better than American students in Science.</p>\n]]>", "author": "rrtucci", "published": "2014-02-05 19:10:06+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>Scott #57 Thanks for elaborating.  Obviously I prefer to look at the bright side of the story, but I also want to stick to the facts.</p>\n<p>And there&#8217;s no two ways about it, so far evidence for quantum speed-up has been elusive.  Yet, hope flows eternal <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "quax", "published": "2014-02-05 19:18:13+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>correction: it&#8217;s probably more like 100 billion dollars total, not in just one year</p>\n]]>", "author": "rrtucci", "published": "2014-02-05 19:25:52+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>Scott:</p>\n<p>What&#8217;s the latest on the experimental work on Boson Sampling? Can I request a  blog post? That work seems tantalizingly interesting in the early optics experiments you posted about a year ago. Have the experimentalists succeeded in scaling those? Are we getting closer to the point where Boson Sampling is solving a problem large enough to be challenging for a classical simulation?</p>\n]]>", "author": "Rahul", "published": "2014-02-06 11:15:44+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>I simply couldn&#8217;t go away your web site before suggesting that I extremely loved the standard information an individual supply on your guests? Is gonna be back often in order to investigate cross-check new posts</p>\n]]>", "author": "wiertła", "published": "2014-02-06 12:21:17+00:00", "title": "By: wiertła"}, {"content": "<![CDATA[<p>NSA metadata reveals that<br />\nFeb 6:<br />\n9:00 AM<br />\nScott Aaronson reads cover story in TIME magazine which is highly favorable to D-Wave<br />\n9:15 AM<br />\nScott plays Angry Birds for 15 minutes<br />\n9:30 AM<br />\nScott plays with daughter Lily for 30 minutes using Xbox<br />\n10:00AM<br />\nScott uses iphone to call MIT infirmary, complaining of severe abdominal pains<br />\n11:00AM<br />\nScott hospitalized at Mass General for severe bleeding ulcer, probably stress induced</p>\n]]>", "author": "rrtucci", "published": "2014-02-06 13:52:06+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>Rahul #69: Dude, I posted about Scattershot BosonSampling (which was a spectacular idea that emerged from the experimental groups) just a few months ago.  I haven&#8217;t heard anything similarly big since then, but if I <i>do</i> hear something, then sure, I&#8217;ll blog about it.</p>\n<p>(As I keep pointing out, science doesn&#8217;t move at blog-speed or news-cycle-speed, no matter how many people want it to!  And also, the experimentalists don&#8217;t always keep me in the loop!  I learned about most of the earlier experiments when the papers appeared on the arXiv, just like everyone else.)</p>\n]]>", "author": "Scott", "published": "2014-02-06 14:01:57+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>rrtucci,</p>\n<p>Your kidding? Time Magazine is still being published?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-02-06 16:28:05+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p><a href=\"http://content.time.com/time/magazine/article/0,9171,2164806,00.html\" rel=\"nofollow\">http://content.time.com/time/magazine/article/0,9171,2164806,00.html</a></p>\n]]>", "author": "rrtucci", "published": "2014-02-06 16:34:34+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>Are D-Wave&#8217;s innards really the coldest spot in the Universe? Or is that TIME article starting off with an exaggerated fantasy? Too bad the whole thing&#8217;s gated.</p>\n]]>", "author": "Rahul", "published": "2014-02-06 18:00:01+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul, #74 they don&#8217;t hold the record, but <a href=\"http://wavewatching.net/2013/08/12/out-of-the-ai-winter-and-into-the-cold/\" / rel=\"nofollow\">they run much colder than deep space</a>.  (Article at the link has a nice chart that shows this in context).</p>\n<p>The hold-over background radiation makes deep space cozy warm in comparison.</p>\n]]>", "author": "quax", "published": "2014-02-06 18:11:23+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>quax:</p>\n<p>Thanks! But colder than deep space is hardly special these days right? A lot of these solid state physics experiments routinely exceed 1 K? </p>\n<p>To make D-Wave sound like *the* coldest spot in the universe is  a huge exaggeration. And he makes it sound as if this changes something major in how astronomers view the coldness of the universe.</p>\n]]>", "author": "Rahul", "published": "2014-02-06 18:33:19+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Gentlemen: You can move this discussion over to today&#8217;s post, if you like. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Scott", "published": "2014-02-06 18:36:22+00:00", "title": "By: Scott"}]