[{"content": "<br /><i>Anyone who somehow thinks there doesn&#39;t remain active bias against women in mathematics, engineering, and computer science hasn&#39;t been talking to actual women in these fields.</i><br /><br />I am a person who thinks there is a serious, world-breaking, systemic bias against women in these fields, and only radical change or a really long amount of time has a chance of bringing about a level playing field.  I support such radical changes, like an imposed 50%+ enrollment of women in technical majors with sufficient demand (like CS).<br /><br />But in no other area of science or sociology or rational discourse would I ever say or accept &quot;just talk to the people harmed by the current system&quot; as a way to exhibit its flaws.  Would you accept &quot;just talk to the white men harmed by affirmative action if you don&#39;t think it&#39;s a problem&quot;?  So why is it different here?  This is a symptom of tribalism.  In this case, you happen to be in the right tribe.  But if this is one of your primary indicators, then you are only right on accident, and thus stochastically culpable for many other injustices that could have been similarly justified.", "author": "Anonymous", "published": "2017-08-12 15:37:13.423000-04:00", "title": ""}, {"content": "Anonymous:  I think I disagree with you.  <br /><br />I am happy to admit that my statement does not by itself rise to the level of a scientific study, and if that&#39;s what one needs to feel convinced, then one should go do so.  <br /><br />However, let us take as a hypothesis we would like to verify that there is systemic bias against women in these fields.  Certainly, one approach to determining if this was the case was to qualify what &quot;systemic bias&quot; is or looks like, and then ask a sample of women if they have experienced it.  An example of systemic bias, in my understanding, would be having people in authority tell you that you are less qualified or otherwise likely to be unsuccessful in various career paths in mathematics, engineering, and computer science because you are a woman.  A second example would be having your male classmates repeatedly espouse similar ideas.  I&#39;m sure we can come up with other examples.  I would say that (easily) over 90 percent of the women I&#39;ve talked to in these fields over the age of 30 about these issues can clearly detail experiences of this kind.  I would view this as sufficient evidence of flaws in the system that need to be addressed.  <br /><br />So I think where I take issue in your analysis is I have not selected people a priori who have been harmed to talk to;  I&#39;ve talked to sufficient numbers for my purposes;  and I&#39;ve got a clear sense of at least some examples of what systemic bias would look like.  This is surely not the only evidence.  But in my mind it&#39;s clear and convincing evidence just the same.  Because of the scale of this evidence, I am further convinced that people who (with open mind) talked to women in these fields about their experiences would reach similar conclusions.  <br /><br />I think it would be perfectly reasonable to talk to white men generally and see if they feel they&#39;ve been harmed by affirmative action, after devising some reasonable ideas ahead of time as to what would qualify as such harm.  I have talked with people about these and similar issues.  I have not seen any such clear and convincing evidence (or anything close) on this issue.  <br /><br />So I think we disagree in part, and perhaps agree in part.  Certainly I would agree that talking to those affected is not the only way to exhibit problems such as bias, and in some cases it may not be the best way.  In this case, however, I believe that the systemic bias is sufficiently widespread and so easily found that this approach would and should provide sufficient evidence for most people.  (Naturally, finding additional evidence and understanding is important as well;  I&#39;m not suggesting that is the stopping point, but rather a good starting point.)  In this regard, you seem at least to agree with me that the bias is indeed widespread, so I&#39;m not sure why you would argue I&#39;m right only by accident, except perhaps that you believe that there are other, more difficult cases of &quot;bias&quot; where this approach would not be sufficient.  That&#39;s a worthwhile point, but I don&#39;t believe it negates mine.    <br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2017-08-12 16:25:49.296000-04:00", "title": ""}, {"content": "<br />There are things in between &quot;just talk to women&quot; and a full-blown scientific study (which is notoriously difficult to do correctly and accurately in the social sciences).  The following statement is either not patronizing, or intended to be universally patronizing:  In general, people tend to see themselves as the victims in situations where there is a power differential, and they tend to villainize those with more power/resources, even if they themselves would embrace and maintain a power differential were it in their favor.  And, of course, there are truly villainous people in the world who are often held up as examples of the problem, even though they are the exceptions.<br /><br />I talk to women in tech, and especially CS students.  I don&#39;t think the fact that I don&#39;t trust people to be completely objective about things in which they are personally, emotionally, and financially invested means I have a lack of empathy.  Yes, it seems cruel to say that sentence about a disadvantaged class.  Try having Israeli friends and Palestinian friends (two &quot;disadvantaged&quot; sides in opposition) and hearing them talk in extremely negative terms about the motivations of the other.  Please note:  I am not saying that my experiences should bear any weight whatsoever, just that your sentence is literally saying &quot;If you disagree with me, you haven&#39;t talked to women.  And if you have, you didn&#39;t listen.&quot;<br /><br />I think the Google memo and the public outcry is valid, but much ado about the wrong thing.", "author": "Anonymous", "published": "2017-08-12 17:24:03.921000-04:00", "title": ""}, {"content": "I agree that probably there are various biases going against women in STEM fields. However, I think these should be addressed at an earlier stage in the funnel, not at the end, in this example, at Google recruiting. I found the linked article unconvincing. If the number of positions at Google is finite (more so than the space at the beach), you can only give more to someone if you take away from someone else.<br /><br />Let me ask something, I don&#39;t mean to be provocative at all, it is an honest question that I have pondered myself and have not yet received a convincing answer to. The &quot;numerus clausus&quot; laws of the 20s (in various countries) capped the ratio of jewish university students at roughly the same proportion as the ratio of jews in society. Now we see these laws (rightly, I would say) as discriminatory, and a slippery slope that lead to even worse laws later, and ultimately to the holocaust. But at the time, those who proposed the laws argued, in most cases, not via antisemitism, but for the &quot;protection&quot; and &quot;empowerment&quot; of poor kids from the countryside, who being less privileged than (mostly urban) jewish kids (for instance by not having educated parents, not having proper role-models, etc) were otherwise less likely to achieve success in university. The ratios in these cases were not 50-50, but depending on the country, say 15:85 or 20:80. What is the difference between the diversity-initiatives today, and the numerus clausus laws of the 20s?", "author": "Anonymous", "published": "2017-08-13 07:31:44.311000-04:00", "title": ""}, {"content": "Another point of the Google memo which I have not seen properly addressed by anyone is that since the 80s, as factors holding women back from stem fields arguably decreased, the ratio of women in stem fields surprisingly also decreased. On a similar note, as you go from least progressive to most progressive societies, say Iran -&gt; Eastern Europe -&gt; Western Europe -&gt; Scandinavia, the ratio of women in stem fields decreases. Both points are well documented. This seems to show rather convincingly, that as they have more freedom to choose, women choose stem fields less, and roles traditionally seen as feminine (e.g. nursing) more. <br />Do you argue that such data is invalid, or can you offer an interpretation of such data different from the google memo? Thanks.", "author": "Anonymous", "published": "2017-08-13 07:40:44.360000-04:00", "title": ""}, {"content": "Sigh.  To anonymous people, I encourage you to read.  As I&#39;ve said, many people can respond to your arguments better than I can.  But I can see why you stay anonymous -- your arguments are embarrassing.  With the &quot;numerus clausus&quot;, let&#39;s find something completely non-analogous (a quota system against a targeted minority) and act like it&#39;s somehow analogous to the current situation (a non-quota system for ameliorating historical bias against a targeted group).  With the &quot;freedom to choose&quot; argument, let&#39;s take an unjustified assumption (&quot;since the 80s, as factors holding women back from stem fields arguably decreased&quot;) and cherry-picked data (there&#39;s various stuff online about societal differences, get better data and include other countries), and ignore other competing societal trends (women increasing participation in other fields -- both medicine and law, which have less cultural baggages than STEM), as well as the actual issues in front of us (for example, women who are choosing STEM fields facing bias), and act as though we have an argument.<br /><br />My post wasn&#39;t meant as a clearing-house for the tired, non-responsive arguments that arise everywhere this topic comes up.  I apologize not to these anonymous posters but to those who take the time and trouble to refute these points better than I for not having the time and ready background to address these points further.  But I also don&#39;t expect with the effort of the strongest of arguments I&#39;d change minds of those who are posting these arguments anyway. <br /><br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2017-08-13 11:04:50.849000-04:00", "title": ""}, {"content": "I am sorry you feel this way, I have not followed these discussions sufficiently to realise that my arguments were tired. I certainly wouldn&#39;t want to waste anyone&#39;s time and I too have better things to do. But you are wrong in one thing, a convincing counter-argument would have changed my mind. It appears to me that you are the one who has made up his mind before the discussion, and you think that it is just a matter of the effort of digging out the right data and arguments. Well, I&#39;ll wait to see that data and I&#39;ll decide afterwards. Until then I remain with my doubts.  As for anonymity, I&#39;m sorry, I have a family to feed.", "author": "Anonymous", "published": "2017-08-13 12:09:06.146000-04:00", "title": ""}, {"content": "Also, thanks for pointing out medicine and law, as fields with increased participation of women. Does this not strengthen the argument of Damore, as these are fields more about people and less about &quot;things&quot;? <br />Again, I&#39;m sorry if my comments annoy you (judging by the starting &quot;Sigh&quot;), I&#39;ll stop adding comments and thanks for hosting the discussion.", "author": "Anonymous", "published": "2017-08-13 12:37:13.677000-04:00", "title": ""}, {"content": "Last anonymous:  I find the whole &quot;people&quot; and &quot;things&quot; string vague.    The idea that computer science does not offer ample opportunity to do &quot;people&quot; -- whether that&#39;s creating products that can help the lives of people at large-scale, or that&#39;s working/interacting with people to create something -- is not correct in my mind and in my experience.  If that&#39;s the argument, then indeed we in CS/engineering need to do a better job in letting people know the opportunities for &quot;people&quot; interaction in our field, which would suggest more, rather than less, of outreach and targeted programs.  <br /><br />With regard to other fields, having interacted substantially with the legal field in work as an expert witness, I would say that a large part of the law is an awful lot about &quot;things&quot; rather than &quot;people&quot; to the extent that I think I understand what that means.  To the extent that medicine over the last decade or two has become less about interaction with people (and more about interaction with insurance companies), I think it has become a less appealing career in this regard, but women increasingly enter the field.  I don&#39;t see how this helps Damore&#39;s argument.  <br /><br />There are, naturally, more obvious interpretations you seem to be going out of your way to avoid.  That these fields had similar large-scale disparities and have managed to ameliorate them significantly over a relatively short period of time (when at the time you would have found similar arguments explaining that these fields were not somehow suitable for women) does not seem to suggest to you that there are biases in CS/engineering that could and should be addressed.  I&#39;d ask that you consider which interpretation matches the data better.  <br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2017-08-13 13:01:21.540000-04:00", "title": ""}, {"content": "To one of several anonymouses here.<br /><br />I don&#39;t think a blog comment thread is suitable for anyone to change their mind about such an issue. If you are truly serious about being willing to change your mind, I&#39;d recommend something like reddit change my mind subreddit. Here are few things to consider in any case.<br />For a company like Google, there is a simple utilitarian argument for diversity. The work culture is certainly improved by a more diverse workforce. There is evidence that teams do better work when they are diverse. A &quot;meritocratic&quot; selection process is a meaningless term in their situation, imho. They select a small fraction of the people they interview, and are aware that the interview system is a very very noisy signal. They can afford to set a threshold high enough that there are few false positives. They don&#39;t necessarily care about false negatives. If there is evidence that this signal is biased for whatever reason (and I would expect that several companies have such evidence, but wouldn&#39;t publish it for obvious reasons), they can ignore the problem and that wouldn&#39;t effect the quality of the people they hire. But if they want to get diversity for whatever reason, it makes sense for them to play with the thresholds within the noise level.<br />Re. statistics on women. I think I, and many others agree with Damore that not seeing gender balance is not an evidence of discrimination per se, and it is possible that in a hypothetical future where we have removed all biases, we will not get to 50% of employees in the tech sector being women. But I see that argument, and similarly arguments about freedom to choose, as being a diversionary tactic that many otherwise smart people often fall for. When we get to anywhere near that hypothetical future, it would make sense to discuss this. But at this point, you would have to have been living under a rock to think that women do not face active bias in the tech sector. I encourage you to search for Uber and for Binary Capital to read things that happened and got reported very publicly in the last few months.<br />", "author": "Anonymous", "published": "2017-08-13 19:46:42.129000-04:00", "title": ""}, {"content": "Thanks Anon 10.  I think we&#39;re in general agreement!<br /><br />In particular, I was wondering where this idea that people are saying &quot;50% of all tech workers should be computer scientists&quot;.  In my wanderings online on the topic, I&#39;ve seen all sorts of stuff saying, &quot;Liberals want 50% women in XXX, even if that means they have to force women into careers they don&#39;t want and will be unhappy with.&quot;  Hunh?  Perhaps there are some out there people making comments like that (although I would hope they were just making a rhetorical point), but I don&#39;t think that&#39;s what Google&#39;s said, what I&#39;ve said, or what anybody I actually know has said.  What we are saying are variations of what you said so nicely:  let&#39;s get to a point where bias isn&#39;t the problem -- where 50-50 is at least a theoretical possibility -- and then there may be other issues to discuss.  <br /><br />So it seems like a diversionary argument to me as well.   ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2017-08-13 21:17:11.466000-04:00", "title": ""}, {"content": "Sorry, that starting line was &quot;50% of all tech workers/computer scientists should be women&quot;.  Should have proofread more carefully.  ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2017-08-13 21:18:59.285000-04:00", "title": ""}, {"content": "I do think the aftermath of the memo was evidence of one clear bias -- against conservative thought in the Silicon Valley tech industry. <br /><br />And for more &quot;evidence&quot;, try asking right-of-center professors whether they feel comfortable expressing their views in academic environments. ", "author": "Anonymous", "published": "2017-08-13 21:36:28.514000-04:00", "title": ""}, {"content": "Thanks Anon #13 for randomly changing/ignoring the subject. <br /><br />I think you&#39;re confusing how people feel about &quot;conservative thought&quot; and how people feel about &quot;not-well-reasoned arguments&quot;.  To be clear, I understand that &quot;conservative thought&quot; and &quot;not-well-reasoned arguments&quot; are two different things.  I find in practice when people say professors don&#39;t feel comfortable expressing right of center views, what they really mean is when right-of-center professors get upset in cases where they do not provide well-reasoned arguments and are called on it.  That&#39;s understandable.  Most people I know get upset when they are called on not providing well-reasoned arguments, regardless of political stripe.  <br /><br />When I was an undergrad at Harvard, I took two classes (electives, by choice) from Harvey Mansfield.  https://en.wikipedia.org/wiki/Harvey_Mansfield <br /><br />I enjoyed his classes, I enjoyed him.  As a professor at Harvard, I&#39;ve continued to see him in action.  He&#39;s a well-known conservative that has had quite a successful academic career.  He seems quite comfortable speaking his mind.  Here&#39;s an article from August 2017.<br />http://www.bostonmagazine.com/news/article/2017/08/13/harvey-mansfield-interview/<br /><br />I disagree with him on a great many things.  I can recognize when he&#39;s giving a reasoned argument, even when I disagree with him.  I&#39;m sure I&#39;m not alone.<br /><br />I acknowledge this is Harvard-specific.  But most professors I know, liberal or otherwise, are pretty wedded to the idea that faculty are allowed to have views and express them.  That doesn&#39;t mean they&#39;ll agree.   <br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2017-08-13 22:02:16.095000-04:00", "title": ""}, {"content": "Issue is not just the percentage but also how seriously women taken at work. When I interviewed at Google Zurich office, 3/5 of my interviewers were women. I have interviewed with many companies in the US (including Google, Microsoft and other big companies which certainly employ women), but all my interviewers were men. This might be somewhat anecdotal but still shows there might be a more subtle bias.", "author": "Anonymous", "published": "2017-08-14 19:51:07.966000-04:00", "title": ""}]