[{"content": "<![CDATA[<p>@ Tony #133</p>\n<p>It&#8217;s possible that continuing to have the lectures on OCW would put curious students at risk, especially if they decided to contact him. Removing the videos is one way of reducing that risk. This kind of concern doesn&#8217;t exist in your scenario, so that reasoning might not match up with the present situation.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/Dixon:Michael.html\">Michael Dixon</a>", "published": "2014-12-13 15:06:52+00:00", "title": "By: Michael Dixon"}, {"content": "<![CDATA[<p>Michael #135: There is, of course, an inherent tension in arguing that taking down the videos is justified because</p>\n<p>(a) their continued availability puts curious students at risk, <i>and</i></p>\n<p>(b) it&#8217;s no big deal, since the videos are available elsewhere anyway.</p>\n<p>My preferred solution, again, is for the videos to remain as fully accessible as they were before (either on MITx or on some other site with the same discussion forums and other functionalities), <i>after</i> everyone has been duly warned (as they now have been) that they get in touch with the professor at their own risk.</p>\n]]>", "author": "Scott", "published": "2014-12-13 15:27:03+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;Given the recent cases of reported rape&#8221;&#8230;.</p>\n<p>You mean the fake &#8220;Jackie&#8221; rape? You&#8217;re kidding, right? Is Lewin supposed to be sacrificed as another victim of Jackie&#8217;s false accusations?</p>\n<p>Whatever Lewin did (and it would be nice if they would tell us and not just say &#8220;trust us &#8211; it&#8217;s really bad&#8221;) was done online and he never laid a finger (or any other part) on anyone.</p>\n]]>", "author": "JackD", "published": "2014-12-13 15:44:08+00:00", "title": "By: JackD"}, {"content": "<![CDATA[<p>Scott says #129:</p>\n<p>&#8220;At the same time, it seems impossible to believe that male physicists, mathematicians, and computer scientists (many of whom are extremely shy and nerdy…) are committing sexual harassment and assault at an order-of-magnitude higher rate than doctors, lawyers, veterinarians, and other professionals. And yet the latter fields have already reached or surpassed gender parity. From these facts, we conclude that fear of harassment and assault can’t possibly be the main explanations for the paucity of women in STEM fields.&#8221;</p>\n<p>My guess is that sexual harassment is mildly less in STEM than in &#8220;doctors, lawyers, etc.&#8221;. But, how about areas where harassment is orders of magnitude more? Such as the performing arts? While obviously I don&#8217;t have any numbers, I know plenty of people involved in college theater productions and/or attempting to make it in Hollywood or the NYC theater scene. A plausible estimate for the rate of young newbies being pressured for sex by &#8220;those with clout&#8221; in college theater is 0.5. In Hollywood or NYC, it happens all the time. There are 1000&#8217;s of people vying for each opportunity, and anyone with any glimmer of fame or major connections can insinuate that they can make things happen. Sometimes they can. Don&#8217;t believe me? Ask someone you know from those worlds.</p>\n<p>Has this resulted in females avoiding the performing arts? I think not.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-12-13 18:53:16+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Conflating the course materials and video lectures with whatever actions are now charged against Walter Lewin is a fundamental error in logic.</p>\n<p>At least up until a few years ago he continued to have an mit.edu email address.</p>\n<p>Entering the speculative world at this point: conceivably MIT would now want to terminate that particular association, and any such a response would seem to me a matter completely within its normal administrative realm.</p>\n<p>If (say) MIT is concerned about a potential viewer of the lectures then contacting Lewin after seeing the videos and being subject to any sort of irresponsible response from him, their sense of extended <i>in loco parentis</i> has gone badly astray.</p>\n<p>In the extreme case, MIT could ensure that its sites contain no contact information for him at all, and even include a pointer to their original news announcement about the severance of any formal association with him: -on the OCW course sites themselves-.</p>\n<p>Instead, what has resulted is a new kind of virtual book-burning, and I wonder whether such &#8220;protection&#8221; is really meant for some hypothetical future student &#8212; or is instead a misguided and unnecessary defense of MIT itself.</p>\n]]>", "author": "Wayne", "published": "2014-12-13 21:08:10+00:00", "title": "By: Wayne"}, {"content": "<![CDATA[<p>@Michael #135</p>\n<p>Following that activist attitude, shouldn&#8217;t we, the concerned citizens, send somebody to check on his house and his movements, because some young people, who may come in contact with him, may also be at risk?</p>\n<p>I mean, if you want to prevent any crime from reoccurring, the logical approach then is to vaporize every criminal on the spot and erase any trace of person&#8217;s existence because there are so many paths by which an unsuspecting victim may get in contact with the criminal.</p>\n]]>", "author": "Tony", "published": "2014-12-13 22:17:01+00:00", "title": "By: Tony"}, {"content": "<![CDATA[<p>The idea that private or public activist entities can supplement the law by extending the punishment mandated by the law, in the name of declaring their support for the law, or sending the exemplary educational message to the wider population, can only result in the modern version of witch-hunt.</p>\n]]>", "author": "Tony", "published": "2014-12-13 23:16:02+00:00", "title": "By: Tony"}, {"content": "<![CDATA[<p>@Scott #136</p>\n<p>Oh, I definitely agree. I was just bringing up an example of why some of the other comparisons and hypotheticals don&#8217;t necessarily encapsulate the situation.</p>\n<p>@Tony #140</p>\n<p>MIT is limited in how it can respond to a situation like this. The things you bring up are certainly out of the question for a private university.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/Dixon:Michael.html\">Michael Dixon</a>", "published": "2014-12-13 23:51:44+00:00", "title": "By: Michael Dixon"}, {"content": "<![CDATA[<p>Fred #131 is the article incomplete? I think it has a good opening I expected more and got disapointed. OTOH, I have issue with people who take it that sexual harassments is rife in the hard sciences other than humanities etc. Can such a claim be verified scientifically? Educate me please!!</p>\n]]>", "author": "aviti", "published": "2014-12-14 01:38:53+00:00", "title": "By: aviti"}, {"content": "<![CDATA[<p>Scott, I&#8217;d beg to differ. Look at norms in tech, and norms in medicine. Medical conferences are far friendlier to women than tech conferences are, and there are reasons for that, not least of which have been lawsuits. In other words, those who run medical institutions have learned, slowly and painfully, that it&#8217;s wisest to avoid even the appearance of old-fashioned grab-assery. You will find, though, that sexism and misogyny still abound in the more macho and better-compensated areas of medicine, like orthopedic surgery, and the M:F numbers reflect that. </p>\n<p>If an institution&#8217;s going to support the career of a guy who contributes to what the feds call a hostile environment, they&#8217;re essentially saying it&#8217;s not that big a deal. Hosting the videos supports Lewin&#8217;s career. Should they do that &#8212; should a marquee like MIT do that &#8212; no, I don&#8217;t think so. He&#8217;s of course free to make and promote his own videos like anyone else in business.</p>\n<p>As for the &#8220;shy and nerdy&#8221; bit&#8230;you know, some of the gropiest, most misogynistic guys I&#8217;ve met have been of the shy and nerdy persuasion. I can only speculate on why that&#8217;s so, but no, I would certainly not equate shy/nerdy with harmless. In fact I think a shy/nerdy-normed world would be a significantly worse world for women. (Not least because so many nerdy guys are certain that they&#8217;re extremely fairminded and rational, when instead what they are is naive about both social structures and how many things play out in reality, and unwilling or unable to fathom that other people&#8217;s reactions to events might be both different from and as valid as their own.) </p>\n<p>Also, you want credit for not being a supporter of keeping sexual harassers on payroll? Okay, but only if you&#8217;re going to give me credit for not being a supporter of brain tumors. I think I agree with the &#8220;baseline&#8221; comment above. Seriously, this is the kind of thinking that leads to divorces, where a guy wants applause for doing some (though not nearly half) of the house/kid-related work. I mean think about what you&#8217;re asking.</p>\n<p>aviti: Google awaits you. Please do not ask others to do your homework for you. You might start with the tenure-track gender ratios, humanities:hard-sci, and also consider the relative sophistication of humanities and hard-sci professionals when it comes to issues like sexual harassment and gender equity. I find actually that this is a significant barrier to gender equity in STEM: the women tend to be far, far ahead of the men when it comes to reading in, discussion of, understanding of these issues. It&#8217;s tough to have a conversation when half the people in the conversation don&#8217;t have the requisite vocabulary.</p>\n]]>", "author": "Amy", "published": "2014-12-14 02:39:14+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Amy,</p>\n<p>In my experience, at STEM (set subtract) {social sciences} events, the amount of OFGA (&#8220;old-fashioned grab-assery&#8221;) is approximately zero. I think you will find that OFGA is actually a lot higher in the medical world. This opinion comes from spending some time waiting in big hospitals, and observing the scene. And, make no mistake, it is a &#8220;scene&#8221;, and some players got clout. One can guess what goes on at conventions, where agents of pharm companies have tons of money and favors to pass out.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-12-14 03:34:31+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>I wasn&#8217;t going to post anything, mainly because I found the comments on this thread so depressing (including some of Scott&#8217;s comments, much to my sadness).</p>\n<p>But I first just had to say a thank you to Amy. I hope whoever she is, she knows that there really are people out here who agree with her.</p>\n<p>I&#8217;ll add the unsurprising observation that there&#8217;s been precious little empathy here for the actual victims of Lewin&#8217;s behavior, and the behavior of so many people in positions of power like him. Once again, the loudest, most pained voices are coming not from actual victims, but from those who have been slightly inconvenienced by the consequences &#8212; say, by having to go to a different website for some lecture videos. (Truly you know suffering.)</p>\n<p>Scott dismissed deterrence pretty much out of hand, bringing up a &#8220;a good example&#8221; involving killing the families of suicide bombers. (Could that example be given honorary inclusion into Godwin&#8217;s law?) All that happened in this case is that MIT won&#8217;t endorse or host the lecture videos. No government agency or secret police is going around and erasing them from existence. Lewin is free to do whatever he wants with them, but no one will think for a moment that MIT is backing him anymore.</p>\n<p>But the truth is that this will have a deterrent effect on tenured (and emeritus) faculty who think of themselves as beyond the reach of punishment. (And yes, there are those who do.) The laws of gravity have now been extended slightly farther than before. Despite all the belly-aching around here about MIT&#8217;s decision, it will likely have a real effect on the behavior of top faculty, who will think twice now that they know such a prominent individual has been disciplined so rigorously (and fittingly) and had his legacy permanently and publicly damaged. Had MIT not gone this far, there would have been little publicity and little discussion of the Lewin incident, and lessons would not have been taken to heart by the people in positions of power who needed to take them to heart.</p>\n<p>Given how angry so many people here seem to be, just imagine how angry you&#8217;d all be if you were actually the victims of something really terrible or something that truly damaged your careers &#8212; like, you know, the sorts of things that many (though not all) women and other under-represented populations go through regularly in in many science and tech fields.</p>\n<p>In my ideal world, people, especially very smart people, would be able to exercise that level of imagination. If you all really internalized what&#8217;s been going on for so many under-represented populations in science and tech for so many decades (centuries?), you&#8217;d really be outraged. Maybe things would even finally change.</p>\n]]>", "author": "Reader297", "published": "2014-12-14 03:59:49+00:00", "title": "By: Reader297"}, {"content": "<![CDATA[<p>By removing the videos, MIT is making a statement. That statement, in its entirety, is &#8220;we are removing the videos&#8221;.</p>\n]]>", "author": "Zilch", "published": "2014-12-14 04:11:42+00:00", "title": "By: Zilch"}, {"content": "<![CDATA[<p>Zilch #147: No, at the least, they&#8217;re also making the statements they made in their <a href=\"https://newsoffice.mit.edu/2014/lewin-courses-removed-1208\" rel=\"nofollow\">statement</a> about the videos&#8217; removal.</p>\n]]>", "author": "Scott", "published": "2014-12-14 10:31:37+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8230;..the actual victims of Lewin’s behavior</p>\n<p>No, call them &#8220;survivors&#8221;.  A slightly senile old man said something off color in an email to a precious little flower and now she is damaged forever and his name must be ruined and his life&#8217;s work must be destroyed as punishment (and even that is not enough).  I swear to you that we are going back to Victorian times.</p>\n]]>", "author": "JackD", "published": "2014-12-14 13:26:03+00:00", "title": "By: JackD"}, {"content": "<![CDATA[<p>This reminded me of Nazi Germany, when undesirable scientists and philosophers were expelled out of country with their property confiscated and their books were burnt by nazi activists as a ritual. This reminded me of North Korea, where, after the second person in the country was executed, he was removed from all the photographs, videos and news articles.</p>\n<p>Yay! Viva freedom of speech and democracy the American way!</p>\n]]>", "author": "Anonymous", "published": "2014-12-14 13:44:07+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>JackD, </p>\n<p>We don&#8217;t know exactly what he did here, but I  suspect that it was a lot more than something &#8220;slightly off color&#8221; and your immediate rush to assume that it must be just that says more about you than anything about the situation in question.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/z/Zelinsky:Joshua.html\">Joshua Zelinsky</a>", "published": "2014-12-14 14:34:49+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Aviti #143</p>\n<p>The podcast itself is more interesting than the accompanying article/synopsis.<br />\nThe main thing was that in the 80s the first home computers were marketed as a toy for boys. Pop culture then reinforced the computer wiz boy myth.<br />\nThese days &#8220;nerd&#8221; culture is more gender balanced it seems.</p>\n]]>", "author": "Fred", "published": "2014-12-14 18:22:18+00:00", "title": "By: Fred"}, {"content": "<![CDATA[<p>I agree it would be better if the lectures were left on the OCW site. The other disciplinary actions taken by MIT seem sufficient to manage the school&#8217;s reputation and protect future potential victims. I disagree with the commenters who said it is inconsequential if the material is taken down from the site because OTHER sites will host the material anyway. Students from around the world watch lectures on OCW and some who might benefit from these lectures might never become aware of their existence if they are only available off-site.</p>\n<p>I also understand the concern that even if Dr. Lewin were banned from the site, students who watched his lectures online might find other ways of contacting him to ask questions (at which point he might repeat his previous unacceptable behaviors.) Someone suggested that the lectures should be left on the site together with a warning. This seems like a very reasonable compromise and would actually do MORE to protect students than pulling the lectures and having bootlegs proliferate off-site without this warning.</p>\n<p>As another compromise (one which I believe would protect students, act as a deterrent, spare victims the pain of having their victimizer remain in public view, and also serve the interest of students who might benefit from these lectures), I PROPOSE THE MOST SALIENT CONTENT OF THE LECTURES SHOULD BE PRESERVED WHILE THE NAME AND LIKENESS OF THE OFFENDING PROFESSOR IS CAST OUT FROM THE SITE (i.e. an avatar and voice actor should be used to recreate the lectures.) I admit this is somewhat silly, but would argue it&#8217;s LESS silly than punishing thousands of students for the actions of a professor.</p>\n<p>Even though I agree it is important to protect potential future victims from harm, I propose this pragmatic compromise only grudgingly, because whatever the specifics of this case, there is an important principle that is worth not losing sight of. If we were to censor the work of everyone who was personally a jerk or even a criminal, imagine how much poorer the world would be! Who decides where to draw the line? Do we ban the work of Kant because he was a racist? How about Twain because he used the &#8220;n&#8221; word in Huck Finn? (Some argue that context doesn&#8217;t matter and we should censor ANYTHING that might offend, even unintentionally.) Do we remove Caravaggio&#8217;s artwork from galleries because he stabbed someone? Do we burn copies of Einstein&#8217;s papers because he was an adulterer who married his cousin? Do we burn every copy Henry Ford&#8217;s anti-Semitic screed, or leave it in the historical record as a testament to his ignorance and intolerance?</p>\n<p>The activity of censorship is not only distasteful and illiberal, but inimical to the *very purpose* of a university. Undermining that purpose for all by the most extreme cases of physical self-defense should be judged completely unacceptable (though passionate debate exists around this issue, I do believe it is justifiable and prudent to censored certain information like detailed blueprints for nuclear weapons or the genomes of deadly pathogens.)</p>\n<p>I realize I have contradicted myself by saying censorship is unacceptable but the lectures should be taken down and replaced with a sanitized version.</p>\n<p>My high-mindedness dictates that censorship beyond that which is absolutely necessary for our continued survival and we find ourselves standing on the shoulders of midgets like Savonarola or 13th century Mongol hordes who destroyed the House of Wisdom. </p>\n<p>My pragmatism says sometimes its okay to compromise. Creativity can make certain dilemmas obsolete and we can create win-win outcomes.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/t/T:Jordan.html\">Jordan T</a>", "published": "2014-12-14 19:52:20+00:00", "title": "By: Jordan T"}, {"content": "<![CDATA[<p>I&#8217;d say that comments #144 and #146 win the thread. I was thinking about what to post (usually just being a lurker) but now I don&#8217;t have to.</p>\n]]>", "author": "Tyle", "published": "2014-12-14 19:53:14+00:00", "title": "By: Tyle"}, {"content": "<![CDATA[<p>A key point in this discussion is that it appears that no one actually has any idea what the triggering event was. It is increasingly common for zero details to be released in legal situations. While this might have some good aspects, it eliminates the public&#8217;s opportunity to form an informed opinion about if &#8220;justice was served&#8221;, &#8220;someone got away with it&#8221;, &#8220;the judicial system has gone bonkers&#8221;, or other possibilities that are reasonable concerns of everyone.</p>\n<p>Reader297 suggests the Lewin event is a major crime, JackD suggests it is basically nothing. My guess is that it is somewhere in the middle. The only relevant information I observed above is some other quotes of Lewin, rounded up by John Sidles, that I characterized as &#8220;borderline weird&#8221;.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-12-14 20:13:15+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Raoul, if you&#8217;re XY and over 45, it&#8217;s likely you&#8217;re not detecting OFGA because no one&#8217;s wanting to play it with you. I mean come on. You&#8217;re not the target. If you&#8217;d bother to do some homework, you&#8217;d notice that women in tech who&#8217;ve so much as publicized the stripper-party atmosphere of some of the conferences have been hounded out of jobs, been the target of rape and death threats online, and been set upon by online mobs generally. I know of exactly one STEM guy who&#8217;s been subject to anything resembling similar treatment, did not lose his job, and has found the whole experience so traumatizing he&#8217;s busy trashing professional and personal relationships over it and generally behaving like a PTSD victim, which he more or less is. The women meanwhile are treated as though they brought the problem on themselves by &#8220;attention-seeking&#8221; and expected to make heavy-duty amends if they want to go on working in the field.</p>\n<p>Fred, nerd culture is anything but gender-balanced except, it seems to me, in comm. I&#8217;m in the midst of a collaboration on a sci-game project in which we are actively seeking women developers, because in funded project after funded project, the developers are guys, nearly everyone on the project is a guy until you get to outreach, where &#8212; voila &#8212; women. And that shows in the nature of the game designs. Whoop-de-do, yet another sci game that&#8217;s all about being King Points.</p>\n<p>There&#8217;s heavy overlap between nerd culture and PUA/MRA culture, unfortunately. </p>\n<p>I think Scott&#8217;s correct about the statement. And, Anon #150, you&#8217;re reminding me of booksellers and publishers who also railed about freedom of speech back in the 90s, when M&As were killing off small/midsized presses and independent bookstores left and right. They got the First just as wrong as you do here. The First does not guarantee you an audience or a market, and it does not guarantee you MIT hosting. It guarantees that your speech will not result in police thugs breaking down your door and hauling you off to a gulag. And I don&#8217;t see anyone even whispering such things about Dr. Lewin. Do you? Without crazy hyperbole?</p>\n]]>", "author": "Amy", "published": "2014-12-14 20:24:16+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Sorry, Raoul, that should be XY *or* over 45.</p>\n]]>", "author": "Amy", "published": "2014-12-14 20:24:55+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Oh, and thank you, Reader297. Yeah, a lot of people see dozens of comments like these and figure there&#8217;s no point, that these problems will never be solved. And not too many people really want to spend their time fighting, reasonably enough. </p>\n<p>STEM has been particularly shocking to me because I hadn&#8217;t been prepared for the degree of backwardness in the view of women and gender equity. Things are changing, slowly, but the conversations I hear sound like such throwbacks, and the things women say and believe about themselves and what&#8217;s acceptable are heartbreaking. I mean it sounds like 1985 a lot of the time. Or earlier, in some environments. And I really think it&#8217;s partly because so few people in STEM fields pay any serious attention to what&#8217;s gone on outside their fields.</p>\n]]>", "author": "Amy", "published": "2014-12-14 20:47:36+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>I share the opinion that Amy&#8217;s #144 is a valuable comment. One of the all-time highlights of Shtetl-Optimized (which had many highlights over the years that I followed it), and it is also a highlight post on the science blog-sphere as a whole, in giving a valuable perspective on women in the STEM and blog environment.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2014-12-14 21:49:28+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>[&#8230;] instances of this have appeared on the blogosphere recently. Scott Aaronson blogged recently about MIT&#8217;s decision to take down Walter Lewin&#8217;s online videos after [&#8230;]</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/w/Walk:The_needs_of_the_many,_privilege,_and_power_|_An_Ergodic.html\">The needs of the many, privilege, and power | An Ergodic Walk</a>", "published": "2014-12-14 22:17:45+00:00", "title": "By: “The needs of the many,” privilege, and power | An Ergodic Walk"}, {"content": "<![CDATA[<p>MIT instructed Lewin &#8216;not to contact any MIT students or online learners, either current or former&#8217;. Clearly, they think he may not comply so &#8216;MIT is indefinitely removing Lewin’s online courses, in the interest of preventing any further inappropriate behavior&#8217;.</p>\n<p>I have little doubt that MIT is only concerned about a potential lawsuit. There is a lot of cash that may change hands, given a good lawyer and they did all the necessary political posturing to prevent that.</p>\n<p>What about Lewin&#8217;s ISP? Shouldn&#8217;t they also be concerned about being sued as the enabler in crime and cut off his Internet connection?</p>\n<p>It is amazing how a simple idea that men&#8217;s (still unknown) crime should not result in banishing of his valuable work eventually degrades to daytime-TV-like cries about considering (still unknown) damage to his victim and statements how STEM is full of male pigs.</p>\n<p>Clearly, something must be done, because there is no bigger crime than widely publicized one that can be used for politically correct witch-hunts. And there is a lot of cash that may be flowing to self-appointed committees too.</p>\n]]>", "author": "Tony", "published": "2014-12-14 22:20:42+00:00", "title": "By: Tony"}, {"content": "<![CDATA[<p>It is unfortunate that some people feel that to fight against injustices in the world, it is necessary to create fictional injustices to go along with the real ones.</p>\n]]>", "author": "Zilch", "published": "2014-12-14 22:28:57+00:00", "title": "By: Zilch"}, {"content": "<![CDATA[<p>Amy: thanks for your comment.  I actually did give up on this thread because of the commentary here and wrote a response elsewhere because I think there&#8217;s a massive amount of &#8220;not getting it&#8221; over here.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sarwate:Anand.html\">Anand Sarwate</a>", "published": "2014-12-14 22:43:11+00:00", "title": "By: Anand Sarwate"}, {"content": "<![CDATA[<p>Raoul, you are just not sexy enough</p>\n]]>", "author": "Tony", "published": "2014-12-14 22:54:20+00:00", "title": "By: Tony"}, {"content": "<![CDATA[<p>Amy #156: I am XY, but I must report that women haven&#8217;t been grabbing my butt much since I was 35, so thanks for the 10 year bonus!</p>\n<p>Actually though, I was referring to observer status, not active participant. I still see pretty good.</p>\n<p>Our different experiences might be due to differing contexts: The vast majority of my adult live has been in the Academic world, and you might be referring to the workplace, which probably has a different atmosphere. When I worked as an engineer for a couple of years, there was only one woman in the (rather small) company, and she was treated with respect. She was a former girlfriend of mine, so we might have engaged in some slight flirting. She is an executive now, and making vastly more money than I do. Good for her.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-12-15 00:04:03+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>BTW Anand, your parallel: </p>\n<p>&#8220;The good of the many — everyone speaking English, the dominant language — outweighs the good of the few. This attitude again speaks from a place of privilege and power, and it reinforces a kind cultural superiority&#8221; </p>\n<p>is perfect for this case.</p>\n<p>Pity you are not as concerned with the culture in India, where rape is as normal as flatulence. That would have been a bit more related, don&#8217;t you think?</p>\n]]>", "author": "Tony", "published": "2014-12-15 00:13:50+00:00", "title": "By: Tony"}]