[{"content": "<![CDATA[<p>A new article by Aubrey D.N.J. de Grey claims to have partially solved the Hadwiger-Nelson problem, that is, the chromatic number of the plane with an edge between unit distance points: &#8220;https://arxiv.org/abs/1804.02385&#8221; . What shall we do? Wait for Gil&#8217;s comment?</p>\n]]>", "author": "jonas", "published": "2018-04-09 18:37:10+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>Dear Scott,</p>\n<p>I agree that we should use paper ballots. However, I thought the video was not very clear. How exactly was the election run, and who ran it? If Halderman was in charge of running the election, it shouldn&#8217;t be a surprise that he was able to hack it.</p>\n]]>", "author": "87987", "published": "2018-04-09 20:52:49+00:00", "title": "By: 87987"}, {"content": "<![CDATA[<p>jonas #12: Wow!  I&#8217;ve had a soft spot for the Hadwiger-Nelson problem since I first learned about it at a math camp in 1996.  I&#8217;ll be very interested to see whether this holds up, and wouldn&#8217;t venture a guess right now.  Given the need to run a brute-force coloring algorithm on a 1567-vertex graph (and the lack of use of automated verification tools), I guess people will fully believe it when and only when it&#8217;s confirmed using an independent code base.</p>\n<p>Incidentally, is this the same Aubrey de Grey who&#8217;s famous for life extension research?</p>\n]]>", "author": "Scott", "published": "2018-04-10 11:48:49+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>87987 #13: I thought the video made it reasonably clear: the election was run using standard electronic voting machines, identical to ones used in real elections, after Alex and his students had been given about 30 seconds to open the machines and load new software into them.</p>\n<p>(While you obviously couldn&#8217;t see this part from the video, it&#8217;s software that silently alters the results, then deletes itself and leaves no trace that it was ever there, except for that provided by a paper trail.)</p>\n<p>And <i>of course</i> running a &#8220;Michigan vs. Ohio State&#8221; election was just a publicity stunt (the good kind, I think); you can read Alex&#8217;s papers to learn about their actual research results.</p>\n]]>", "author": "Scott", "published": "2018-04-10 11:54:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott: Tobias Kildetoft claims that it is the same biologist Aubrey de Grey: &#8220;https://chat.stackexchange.com/transcript/message/43907768#43907768&#8221;</p>\n]]>", "author": "jonas", "published": "2018-04-10 12:47:31+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>Further Hadwiger-Nelson update: The 1567-vertex graph doesn&#8217;t work (apparently there was a bug in the code that produced it) but the revised code produced a 1585-vertex graph which has now been independently verified via SAT solver. <a href=\"https://gilkalai.wordpress.com/2018/04/10/aubrey-de-grey-the-chromatic-number-of-the-plane-is-at-least-5/#comment-40108\" rel=\"nofollow\">https://gilkalai.wordpress.com/2018/04/10/aubrey-de-grey-the-chromatic-number-of-the-plane-is-at-least-5/#comment-40108</a></p>\n<p>And yeah, seems to be the same Aubrey de Grey&#8230;</p>\n]]>", "author": "Sniffnoy", "published": "2018-04-10 22:28:28+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Also wow I had no idea so many people cared about infinitary combinatorics&#8230;</p>\n]]>", "author": "Sniffnoy", "published": "2018-04-11 00:06:05+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Sniffnoy: Erdős cared about exactly this sort of stuff, colorings of infinite graphs. That makes mathematicians flock there, because we know Erdős usually asked the right questions.</p>\n]]>", "author": "jonas", "published": "2018-04-11 07:50:28+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>jonas #19,</p>\n<p>I don&#8217;t think the Erdős connection is all that is going on here. The problem has the virtue of being very visual and also very easy to understand. The fact that the prior best bounds of 4 and 7 can be explained in a few minutes makes it even more appealing as a problem.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2018-04-11 12:44:19+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>jonas #19: I know Erdős did a bunch of stuff regarding infinitary combinatorics, but I don&#8217;t heard it talked about much!</p>\n]]>", "author": "Sniffnoy", "published": "2018-04-11 23:10:51+00:00", "title": "By: Sniffnoy"}]