[{"content": "<![CDATA[<p>fred #134: Yup.</p>\n]]>", "author": "Scott", "published": "2017-03-27 14:24:51+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>jonas #132: That&#8217;s a superb question, which I phrase by simply asking whether QFT or quantum gravity might lead to anything beyond quantum computation in terms of what we can efficiently compute.  So far, from the work by Jordan, Lee, and Preskill on simulating QFTs, and from the general philosophy of AdS/CFT that even quantum gravity should be holographically dual to a QFT, the indications seem to be &#8220;no&#8221; &#8212; i.e. that BQP might really be the end of the line, the difficulties with QFT and quantum gravity being fearsome and technical but not much affecting the asymptotics.  But these are early days, and it&#8217;s entirely possible that there are further surprises in store.</p>\n]]>", "author": "Scott", "published": "2017-03-27 14:29:29+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Hi Scott! I have just a small terminological question. In your responses you write about the Church-Turing thesis and connect it to whether the universe can be simulated. I was under the impression that this connection is &#8216;established&#8217; by the Church-Turing-Deutsch principle, whereas the &#8216;weaker&#8217; Church-Turing thesis &#8216;merely&#8217; states that there are no fundamentally different modes of computation than Turing computation.</p>\n<p>So, in this sense the Church-Turing thesis could be true, but the universe might still not be simulated by a Turing Machine (i.e., the Church-Turing-Deutsch principle is false). Do you find that distinction useful or do you think they collapse into the same statement?</p>\n]]>", "author": "Max", "published": "2017-03-27 15:02:57+00:00", "title": "By: Max"}, {"content": "<![CDATA[<p>Max #137: I&#8217;m not sure that I even understand the distinction here.  I would say: if we found a box on the beach that could solve the halting problem in finite time in all cases, then to whatever extent the Church-Turing Thesis ever said anything about reality, the thesis is false.  At any rate, whenever <i>I</i> use the term &#8220;Church-Turing Thesis,&#8221; I always mean the interesting falsifiable claim about empirical reality, rather than the boring definition.  As a meta-principle of physics, I&#8217;d say that the CT Thesis has a similar sort of status as (say) reversibility, or no superluminal signaling.  The fact that the people who first stumbled on this physical principle were called &#8220;mathematical logicians&#8221; rather than &#8220;physicists&#8221; is irrelevant.</p>\n]]>", "author": "Scott", "published": "2017-03-27 16:06:10+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Here are some simple calculations that (for me at least) illuminate some of the issues under consideration in regard to the universe as a simulation (or not), the feasibility of Quantum Supremacy (or not), and the truth of the Church-Turing Thesis (in its extended form, or not).</p>\n<p>Let&#8217;s start by turning off gravity and the weak interactions, and consider a QED universe whose elementary fermions comprise electrons and the stable nuclei, and whose sole gauge field is the photon.  The fundamental mass, charge, length and time units of the QED universe may be taken to be \\(m_e=e=\\hbar=\\epsilon_0=1\\}; the sole adjustable parameter of the theory may be taken to be the magnetic constant \\(\\mu_0\\); in these units \\(c=1/\\sqrt{mu_0}\\) and \\(\\alpha=\\sqrt{mu_0}/(4\\pi)\\); note in particular that in this convention the Bohr radius (the chemical length scale) and the Hartree energy (the chemical energy scale) are not tunable, but rather are fixed constants of order unity. </p>\n<p>Now let&#8217;s consider the effect of varying the magnetic constant \\(\\mu_0\\).  In the limit \\(\\mu_0\\to 0\\), all of biology and much of condensed matter physics (including superconductivity) survives.  There are however no photons; hence no radiative decoherence; in many respects (not all) the scalable design of quantum computers becomes much easier.  It&#8217;s true that BosonSampling experiments have to be done with lattice phonons, but heck, this might be easier without those lossy gauge photons flying around!  Therefore we identify (provisionally) the limit \\(\\mu_0\\to 0\\) as the limit in which Quantum Supremacy is <i>easiest</i> to demonstrate.</p>\n<p>On the other hand, in our physical universe we have \\(mu_0 \\simeq (4\\pi/137)^2 \\simeq 0.0084\\), which is small but not zero.  This is a universe in which photons ubiquitously convey information (good!) and decoherence (bad).  Therefore we identify (provisionally) the regime \\(\\mu_0 \\sim 10^{-2}\\) as characteristic of universes in which Quantum Supremacy plausibly is <i>infeasible</i> to demonstrate, and concomitantly the Extended Church-Turing Principle (which asserts all physical systems can be simulated in PTIME with classical computing resources) plausibly <i>does</i> reign supreme. </p>\n<p>These considerations are compatible with a 21st century in which Quantum Supremacy is (eventually) proved rigorously to be feasible in the no-photon QED limit (i.e., \\(\\mu_0\\to 0\\)), and compatibly (albeit contrastingly) the Extended Church-Turing Principle is (eventually) proved rigorously to hold in the weak-photon QED limit (i.e., \\(\\mu_0 \\sim 10^{-2}\\)).  </p>\n<p>Needless to say, achieving these two milestones will require tremendous progress in quantum information theory&nbsp;&hellip; which is why it&#8217;s cool that they are compatible.  Because in the best of all possible worlds (as it seems to me) these two milestones <i>both</i> are achievable, and <i>both</i> milestones convey to us information that is exceedingly valuable.</p>\n]]>", "author": "John Sidles", "published": "2017-03-27 18:45:10+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>[now with LaTeX fixed (for me, there&#8217;s no LaTeX preview)]</p>\n<p>Here are some simple calculations that (for me at least) illuminate some of the issues under consideration in regard to the universe as a simulation (or not), the feasibility of Quantum Supremacy (or not), and the truth of the Church-Turing Thesis (in its extended form, or not).</p>\n<p>Let&#8217;s start by turning off gravity and the weak interactions, and consider a QED universe whose elementary fermions comprise electrons and the stable nuclei, and whose sole gauge field is the photon.  The fundamental mass, charge, length and time units of the QED universe may be taken to be \\(m_e=e=\\hbar=\\epsilon_0=1\\); the sole adjustable parameter of the theory may be taken to be the magnetic constant \\(\\mu_0\\); in these units \\(c=1/\\sqrt{\\mu_0}\\) and \\(\\alpha=\\sqrt{\\mu_0}/(4\\pi)\\); note in particular that in this convention the Bohr radius (the chemical length scale) and the Hartree energy (the chemical energy scale) are not tunable, but rather are fixed constants of order unity. </p>\n<p>Now let&#8217;s consider the effect of varying the magnetic constant \\(\\mu_0\\).  In the limit \\(\\mu_0\\to 0\\), all of biology and much of condensed matter physics (including superconductivity) survives.  There are however no photons; hence no radiative decoherence; in many respects (not all) the scalable design of quantum computers becomes much easier.  </p>\n<p>It&#8217;s true that BosonSampling experiments have to be done with lattice phonons, but heck, this might be easier without those lossy gauge photons flying around!  Therefore we identify (provisionally) the limit \\(\\mu_0\\to 0\\) as the limit in which Quantum Supremacy is <i>easiest</i> to demonstrate.</p>\n<p>On the other hand, in our physical universe we have \\(mu_0 \\simeq (4\\pi/137)^2 \\simeq 0.0084\\), which is small but not zero.  This is a universe in which photons ubiquitously convey information (good!) and decoherence (bad).  </p>\n<p>Therefore we identify (provisionally) the regime \\(\\mu_0 \\sim 10^{-2}\\) as characteristic of universes in which Quantum Supremacy plausibly is <i>infeasible</i> to demonstrate, and concomitantly the Extended Church-Turing Principle (which asserts all physical systems can be simulated in PTIME with classical computing resources) plausibly <i>does</i> reign supreme. </p>\n<p>These considerations are compatible with a 21st century in which Quantum Supremacy is (eventually) proved rigorously to be feasible in the no-photon QED limit (i.e., \\(\\mu_0\\to 0\\)), and compatibly (albeit contrastingly) the Extended Church-Turing Principle is (eventually) proved rigorously to hold in the weak-photon QED limit (i.e., \\(\\mu_0 \\sim 10^{-2}\\)).  </p>\n<p>Needless to say, achieving these two milestones will require tremendous progress in quantum information theory, which is why it&#8217;s cool that they are compatible.  Because in the best of all possible worlds (as it seems to me) these two milestones <i>both</i> are achievable, and <i>both</i> milestones convey to us information that is exceedingly valuable.</p>\n]]>", "author": "John Sidles", "published": "2017-03-27 18:50:21+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Scott #138<br />\nBut if we&#8217;re wondering what CT Thesis is saying about &#8220;reality&#8221;, why are we considering hardware with unlimited resources?</p>\n<p>When it comes to cosmology, physicists do care about the *actual* amount of matter and energy that&#8217;s out there (expension/contraction, Mach&#8217;s principle,&#8230;).</p>\n]]>", "author": "fred", "published": "2017-03-27 19:55:00+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>@jonas #132</p>\n<p>>> Boltzmann brains</p>\n<p>I think there should be variant of Godwin&#8217;s law, that every debate of physics on the internet ends if somebody mentions Boltzmann brains &#8230;</p>\n]]>", "author": "wolfgang", "published": "2017-03-27 21:43:40+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>But wolfgang,</p>\n<p>The Boltzmann brain thought experiement is actually quite a good argument against mathematical reality.</p>\n<p>You know, I used to swallow the ‘reality is mathematics’ cult hook-line-and-sinker, and thought Max Tegmark’s mathematical ‘Multiverse’ /Anthropic reasoning etc. was all amazing stuff.</p>\n<p>As the years past, it slowly dawned on me that it didn’t add up at all. The universe we live in is very simple, but the vast majority of mathematical structures are very complex, so why do we find ourselves in such a simple universe?  So that&#8217;s a big problem with the Tegmark multiverse right there.</p>\n<p>Then you have all the strange anthropic reasoning stuff, where you have to consider the space of all possible observers and try to pick the class you&#8217;re in.  For instance, why indeed is the universe so large, if, for example, the majority of conscious observers could just randomly pop into existence temporarily in a much smaller region of space-time? </p>\n<p>So real problems with the mathematical universe right there.</p>\n<p>I realized that the class of mathematical objects to which we grant the status &#8216;real&#8217; would have to be seriously restricted somehow, and that&#8217;s why I abandoned full-blown mathematical platonism and now favor a more restricted mathematical universe of the type proposed by (for instance) Stephen Wolfram, where only computational objects are granted the status &#8216;real&#8217;.</p>\n<p>But even restricting the mathematical universe to computational objects still doesn&#8217;t solve the problems plaguing the whole idea of reality as math.  Still many possible &#8216;computational realities&#8217;, most of them messy and complex, but our own observed reality is very simple.</p>\n<p>The bottom-line is that Tegmark multiverse is gross violation of the principle of Occam&#8217;s razor.</p>\n]]>", "author": "mjgeddes", "published": "2017-03-28 03:39:20+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>A few things:</p>\n<p>1) Scott, congrats on another kid.  It&#8217;s nice that you share your personal life, political views, and other non-Quantum Complexity stuff on your blog.</p>\n<p>2) I love this topic!  And I am glad people are engaged in the debate.  Just like it is lazy to say &#8220;the universe is a simulation&#8221; and not try to explain how this view is compatible with the laws of physics as they are currently understood, I also think it is lazy to just roll your eyes and not engage all the interesting points various flavors of &#8220;digital physics&#8221; theories have to offer.  I look forward to reading more posts on this topic; Please don&#8217;t close this thread!!</p>\n<p>3) I&#8217;m a little disappointed nobody has commented on my movie ad. (#11) I understand that self-promotion is not very becoming, and I don&#8217;t have a PHD in physics, but come on, how many movies get made that reference Gödel, the halting problem, it from bit, and other subjects related to this conversation?  Plus, it&#8217;s FREE on Amazon Prime.</p>\n<p>4) In a recent talk, Max Tegmark invited scientists to work in the space where neuroscience, physics, and AI overlap.  Do you think future breakthroughs in physics will come from interdisciplinary considerations, or have interdisciplinary implications?</p>\n]]>", "author": "Jon K.", "published": "2017-03-28 04:04:19+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>@mjgeddes #143 </p>\n<p>Instead of contemplating Boltzmann brains you should wonder about mosquito brains: We actually know that billions of mosquito brains exist and they are much better organized than the vast majority of Boltzmann brains would be and therefore much more likely to provide for an &#8216;experience&#8217;. </p>\n<p>Perhaps you want to read the blog post of Jacques Distler:<br />\ngolem.ph.utexas.edu/~distler/blog/archives/002652.html</p>\n]]>", "author": "wolfgang", "published": "2017-03-28 08:49:20+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>#143 </p>\n<p>From Tegmark&#8217;s Mathematical Universe abstraction:</p>\n<p>I hypothesize that only computable and decidable (in Godel&#8217;s sense) structures exist, which alleviates the cosmological measure problem and help explain why our physical laws appear so simple. I also comment on the intimate relation between mathematical structures, computations, simulations and physical systems.</p>\n<p><a href=\"https://arxiv.org/abs/0704.0646\" rel=\"nofollow\">https://arxiv.org/abs/0704.0646</a></p>\n<p>From my understanding, unlike Tegmark, Wolfram doesn&#8217;t necessarily think that we live in the computable multiverse, but rather thinks there is one computation that the universe is doing&#8230; although he has a particular interest in causal networks which have a &#8220;causal invariance&#8221; property, meaning you could update the graph connections in any order following the specified rules, and any agent encoded in this graph system would see their world in exactly the same way under each of these possible updates. It&#8217;s not exactly a multiverse, but it seems related.</p>\n]]>", "author": "Jon K.", "published": "2017-03-28 11:43:11+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>At a higher level, is this asking whether a certain type of reality/system/physics can be leveraged to compute/simulate (perfectly) a sub-system of itself?</p>\n<p>E.g. building a QC in the real world, or running a new instance of The Game of Life using The Game of Life,&#8230;</p>\n<p>Is this the same as asking whether a system is &#8220;Turing complete&#8221;?</p>\n]]>", "author": "fred", "published": "2017-03-28 14:21:12+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Incidentally, Jonas #132:</p>\n<ul>On a less related topic, after this blog post, which asks whether we live in a simulated universe, will you ask next whether we are Boltzmann brains with fake memories that accidentally came into existence in the infinitely long boring part of time after the heat death of the universe.</ul>\n<p>We&#8217;ve already discussed Boltzmann brains many times on this blog&#8212;and they show up in <a href=\"http://www.scottaaronson.com/papers/giqtm3.pdf\" rel=\"nofollow\">The Ghost in the Quantum Turing Machine</a> as well.  In general, the simulation argument, Boltzmann brains, etc. etc. are all topics that, in a forum like this one, recur infinitely often in the limit&#8212;much like Boltzmann brains themselves.</p>\n]]>", "author": "Scott", "published": "2017-03-28 14:33:38+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>With the assumptions:</p>\n<p>&#8211; our reality is computable</p>\n<p>&#8211; computers appear &#8220;spontaneously&#8221; in our reality (life and intelligence being transient steps for this).</p>\n<p>Isn&#8217;t it unavoidable that there would be a recursive hierarchy of universes simulated inside other universes?</p>\n]]>", "author": "fred", "published": "2017-03-28 15:44:39+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>JimV: thanks. I was aiming at making this familiar, but also to highlight what are the differences. In normal FEM, at large enough N, your numerics give you an approximation to the continuum model (which you probably don&#8217;t believe), and to any other model which is different from your simulation only at short distances, including actual reality. This allows you to be agnostic about what really happens at short distances. </p>\n<p>Because of points (1) and (2) in my original comment, this is not what happens when you simulate continuum Quantum Field Theory. The existence of certain structures at low energies is a sensitive probe to short distance physics. Which is great! Those hints are few and far between, and exact Lorentz invariance at short distances does narrow things quite a bit.</p>\n<p>None of that means those discrete models cannot be extremely useful, for example to get physical results, or for understanding generic phenomena (say, quantum chaos, growth of complexity, etc.) in a simpler setting. For many purposes this really does not matter much. It does prevent you from taking the results of any single simulation too literally, certainly it should give you a pause if you want to base your metaphysics on it.</p>\n]]>", "author": "Moshe", "published": "2017-03-28 19:25:20+00:00", "title": "By: Moshe"}, {"content": "<![CDATA[<p>Jon.K,</p>\n<p>Tegmark&#8217;s whole ediface is just a creaking, overly-complex mess.  As I pointed out, I don&#8217;t think that restricting the multiverse to &#8220;only computable and decidable structures&#8221; is enough to solve the measure problem.</p>\n<p>This is why I think the option of giving up reductionism and suggesting that reality is a &#8216;cut and paste&#8217; of 3 fundamental, irreducible properties (information, fields and cognition) is still in the running.</p>\n<p>With a triple-aspect reality, each of the 3 properties can be &#8216;created&#8217; (and constrained) by the other 2 in a circular loop (think impossible stair-case or snake biting it&#8217;s own tail &#8211; this is a &#8216;bootstrap&#8217; theory).</p>\n<p>The big advantage of this idea is that you could seriously constrain the size of the multiverse (if not dispense with it altogether), and you could get a neat elegant explanation for reality as a whole (it&#8217;s a circular, entirely self-contained boot-strap).</p>\n<p>The big disadvantage of course, is giving up reductionism, and it has some peculiar implications it&#8217;s own (for instance it does imply panpsychism or pan-proto-psychism, the idea that there are mental properties in everything aka Chalmers).</p>\n]]>", "author": "mjgeddes", "published": "2017-03-28 20:19:09+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>#146 </p>\n<p>Am I allowed to comment on my own comment?&#8230;  So I tried to draw what I perceive as the distinction between Wolfram and Tegmark&#8217;s work, which is that Tegmark is considering the computable multiverse and the Wolfram is looking for one computable universe&#8230; But then I was thinking, maybe those two points of view could be reconciled&#8211;if I am even characterizing them correctly in the fist place&#8211;at which point I recalled  Juergen Schmidhuber&#8217;s talk about his single, short program, that computes all computable (&#8220;toy&#8221; or &#8220;real&#8221; depending on your opinion) universes.  So depending on what level you view that program on, you can see it as a single computation/universe or multiple computations aka a multiverse.  There could also be other similar programs with this same dualistic POV property.  Any &#8220;infinite&#8221; subset of computable programs which you systematically step through should have that same property, if I&#8217;m thinking about this correctly.</p>\n]]>", "author": "Jon K.", "published": "2017-03-28 21:37:03+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>#151</p>\n<p>Is your view similar to and consistent with Godel&#8217;s analysis of Closed Timelike Curves?</p>\n]]>", "author": "Jon K.", "published": "2017-03-28 21:40:44+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>Jon K.</p>\n<p>I think you&#8217;re right about Tegmark/Wolfram distinction yes, I saw a recent short interview that John Horgan did with Wolfram for his &#8216;Cross Check&#8217; column in &#8216;Scientific American&#8217;.</p>\n<p>Wolfram is agnostic towards the multiverse, but is indeed looking to pick out one particular computation from &#8216;the computational universe&#8217; (so that fits with Schmidhuber).</p>\n<p>As regards my bootstrap theory, no, I don&#8217;t think it needs CTCs.</p>\n<p>There was a recent article in &#8216;Quanta&#8217; magazine about a revival of bootstrap ideas in physics, also recently discussed by Lubos Motl on his blog.  </p>\n<p>Here&#8217;s the link to the &#8216;Quanta&#8217; article:<br />\n<a href=\"https://www.quantamagazine.org/20170223-bootstrap-geometry-theory-space/\" rel=\"nofollow\">https://www.quantamagazine.org/20170223-bootstrap-geometry-theory-space/</a></p>\n<p>Lubos points out that:</p>\n<p>&#8220;Theories of quantum gravity may be reasonably believed to worship the bootstrap paradigm in the full generality. In particular, I would add that it is rather clear that quantum gravity never allows you to strictly separate objects to elementary and composite ones.&#8221;</p>\n<p>and</p>\n<p>&#8220;The pure constructive or &#8220;reductionist&#8221; description of physics will be viewed as an artifact &#8230;&#8221;</p>\n<p>I&#8217;m simply suggesting that we generalize the bootstrap idea further, to include mathematical and mental properties as well as physical ones.</p>\n<p>A version of Chalmer&#8217;s idea of panpsychism or pan-proto-psychism would automatically fall out.</p>\n<p>In my bootstrap reality theory, consciousness is both an (almost) irreducible property in it&#8217;s own right *and* an (almost) composite property composed of a combination of material processes and information processing (almost reducible to matter and information but not quite).</p>\n]]>", "author": "mjgeddes", "published": "2017-03-28 22:59:53+00:00", "title": "By: mjgeddes"}]