[{"content": "<![CDATA[<p>It seems to me that the main deficiency in realism is the assumption that cars choose a route based on knowledge of the current global transit time.  In reality, unaided cars choose a route based on the local situation (are most cars choosing a or A at the moment?), or if they have access to traffic-and-transit reports, based on information about the most congested segment.</p>\n]]>", "author": "John Cowan", "published": "2015-06-19 14:43:54+00:00", "title": "By: John Cowan"}, {"content": "<![CDATA[<p>Fascinating subject and article.  It appears cars in this simulation choose a complete travel route (&#8220;color&#8221;) when leaving the origin, and then do not update that choice as traffic conditions change.  This situation does not appear optimal (cars choose B vs. b using out-of-date information) nor necessarily reflective of current and future driver behavior (aided by continuously updating GPS and smart phone).  I wonder if the apparent synchronicity of Ab/ab vs. aB/AB depends on this assumption, leaving open the possibility of even more complicated system behavior in a perfectly selfish, perfectly informed world.</p>\n]]>", "author": "Anne L", "published": "2015-06-19 18:59:41+00:00", "title": "By: Anne L"}, {"content": "<![CDATA[<p>It was surely true when Braess wrote in 1968 that drivers could only guess or extrapolate from local conditions. But now? Everybody has live traffic info on a GPS unit or smartphone, no? One of the big questions is whether more complete information leads to more extreme oscillations.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2015-06-19 20:48:17+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>In the first version of the program, cars re-evaluated the expected travel time at each node and chose their next segment accordingly. I switched to the current scheme &#8212; with an irrevocable commitment at the point of departure &#8212; for two reasons. First, it seemed a little more in the spirit of the original Braess model. Second, I intended the program mainly as a tool for visualization, not research, and having cars change color in mid course turned out to be visually confusing. </p>\n<p>Of course real drivers do have opportunities to change their minds, so you clearly have verisimilitude on your side. I could probably add it as yet another option in the already comically busy control panel.</p>\n<p>But let me also note that I did not see any qualitative difference in the outcome when I switched from one protocol to the other. Cars did revise their choices; occasionally they even changed their mind twice, crossing the bridge and then making a U turn to go the way they originally planned. But the overall statistics were not much affected.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2015-06-19 21:10:02+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>Really fascinating article. I&#8217;d love to see a comparative analysis of the different approaches mentioned (perfectly selfish, perfectly informed vs perfectly selfish, poorly informed). There should be some difference, but how much and in what way? Do the oscillations even out, or become more extreme, etc?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Anderson:Carl.html\">Carl Anderson</a>", "published": "2015-06-19 21:45:51+00:00", "title": "By: Carl Anderson"}, {"content": "<![CDATA[<p>Doubtless.  But unless it can predict the future, it doesn&#8217;t tell you how long it will take <i>you</i> to traverse a particular pathway starting now.</p>\n]]>", "author": "John Cowan", "published": "2015-06-20 04:01:24+00:00", "title": "By: John Cowan"}, {"content": "<![CDATA[<p>Seems like this will in fact become a potentially bigger problem as we begin putting autonomous vehicles on the roads. I wonder what if any guards are available to prevent this from happening. With humans at least you have people who always follow the same route because it&#8217;s familiar. With ai there will always need to be a min or max function based on time. If adding a road can cause pile ups then adding a new route could do the same, e.g. When the best routes available are already at capacity adding a new route between destinations could actually make things worse.  Would a route finding algo be able to determine that its fallen into a local maximum &#8220;saddle ridge&#8221; because of this paradox?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hatfield:James.html\">James Hatfield</a>", "published": "2015-06-20 14:04:19+00:00", "title": "By: James Hatfield"}, {"content": "<![CDATA[<p>One data point: Choosing routes at random consistently outperforms any selfish routing algorithm.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2015-06-20 17:39:52+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>I like the simulation, but it seems wrong that the <em>AB</em> traffic is blocked on the <em>A</em> section due to the <em>Ab</em> traffic unable to enter the <em>b</em> section. If AB is infinite, it should seem there would be a &#8220;turning laying&#8221; that the <em>b</em> bound traffic gets stuck in, but as it stands in the bridge open case, I observed AB get the worse time, which it should not be the case according to the theory.</p>\n]]>", "author": "Simeon Pilgrim", "published": "2015-06-22 01:53:25+00:00", "title": "By: Simeon Pilgrim"}, {"content": "<![CDATA[<p>It&#8217;s yet another choice one has to make when implementing the model. I chose to view the nodes of the graph as ordinary surface-road intersections, which can be occupied by only one car at a time. One could think instead of highways with overpasses and underpasses. That would also be a valid model, but it&#8217;s not the model I built.</p>\n<p>As for cars on the <em>AB</em> route taking a longer time, that&#8217;s the case even without contention for resources at intersections. <em>AB</em> is roughly twice as long as <em>ab</em>, and 1.5 times the length of <em>Ab</em> and <em>aB</em>.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2015-06-22 13:51:26+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>While it may not be able to predict the future, Google Maps does give people an approximation of travel time based on it&#8217;s understanding of traffic conditions. I know a number of people who use it for this very purpose.</p>\n]]>", "author": "Mike C", "published": "2015-06-22 19:26:59+00:00", "title": "By: Mike C"}]