[{"content": "<![CDATA[<p>Scott, <a href=\"http://www.scottaaronson.com/blog/?p=1596#comment-96379\" rel=\"nofollow\">36</a>, saying that the CIA wouldn&#8217;t assassinate the president because he&#8217;s the boss is like saying that coups never occur. What lead to your belief that the CIA only assassinates under the president&#8217;s orders? the org chart, as your comment implies? Have you taken into account the <a href=\"http://www.aarclibrary.org/publib/contents/church/contents_church_reports_ir.htm\" rel=\"nofollow\">Chuch Committee</a>? I haven&#8217;t read its report, but a quick glance suggests that <a href=\"http://www.aarclibrary.org/publib/church/reports/ir/html/ChurchIR_0010b.htm\" rel=\"nofollow\">even they don&#8217;t know</a>:</p>\n<blockquote><p>The picture that emerges from the evidence is not a clear one. This may be due to the system of deniability and the consequent state of the evidence which, even after our long investigation, remains conflicting and inconclusive. Or it may be that there were in fact serious shortcomings in the system of authorization so that an activity such as assassination could have been undertaken by an agency of the United States Government without express authority.</p></blockquote>\n<p>They were not even sure that all the assassinations were authorized by the Director of the CIA.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Knight:Douglas.html\">Douglas Knight</a>", "published": "2013-12-05 00:05:44+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Scott #26: Darwin does not explain our vast & beautiful universe. Is the &#8220;hypothesis&#8221; that someone put these giant balls in motion the one we should accept today?</p>\n<p>I think biologists may take issue with your &#8220;optimizations&#8221;. Do birds really fly optimally? Aren&#8217;t dogs quite dumb? Isn&#8217;t communications between dolphins very poor? Where do you draw the line to be impressed enough to require a planner behind?</p>\n<p>What about the hypothesis itself? Is a hypothesis that predicts nothing really better than having no hypotheses at all?</p>\n<p>(Sorry, this is way off topic. I am with you on ascribing more to severe incompetency over extreme competency in general, including JFK&#8217;s assassination.)</p>\n]]>", "author": "Koray", "published": "2013-12-05 00:38:29+00:00", "title": "By: Koray"}, {"content": "<![CDATA[<p>It&#8217;s worth noting that &#8220;Oswald acted alone&#8221; is not equivalent to &#8220;Oswald was the only shooter&#8221;.</p>\n<p>Suppose a second assassin &#8212; sent by the mafia, the KGB, LBJ, or whoever &#8212; fired at Kennedy at almost exactly the same time as Oswald without either of the two knowing of the other. The second shooter snuck away sheepishly, and only Oswald was caught. Nobody set up or prompted Oswald in any way, and evidence pointing to the second shooter was simply overlooked by investigators.</p>\n<p>So why isn&#8217;t the &#8220;Multiple Shooters, No Conspiracy&#8221; hypothesis more popular? I imagine it&#8217;s because it occupies an uncomfortable place between &#8220;Oswald Only&#8221; and conspiracy theories: it requires more to be explained than the basic story, but doesn&#8217;t provide any mechanism (a grand conspiracy) to take care of it.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/K:George.html\">George K</a>", "published": "2013-12-05 01:24:48+00:00", "title": "By: George K"}, {"content": "<![CDATA[<p>Douglas Knight #53: I didn&#8217;t say it was <i>impossible</i> for a coup to happen in the US, and I agree with you that it isn&#8217;t.  All I did was dispute Vadim&#8217;s contention that the idea of such a coup &#8220;doesn’t even seem terribly exotic.&#8221;</p>\n]]>", "author": "Scott", "published": "2013-12-05 01:45:39+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Yet again I learn never to ask two questions in one comment.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Knight:Douglas.html\">Douglas Knight</a>", "published": "2013-12-05 01:50:29+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>George K #55: I rather like your theory, though I&#8217;d call it the &#8220;History&#8217;s Craziest Coincidence Theory.&#8221;  Why was this other, unrelated, chickening-out assassin (for whom we have no evidence, of course) sent on precisely the same day as Oswald?</p>\n<p>Still, I think your theory deserves to take its place alongside <a href=\"http://www.theonion.com/articles/new-theories-suggest-kennedy-wasnt-shot,2244/\" rel=\"nofollow\"><i>The Onion</i>&#8216;s theory</a>: that JFK was never shot at all; instead his head spontaneously combusted when a passing peanut truck stimulated his allergies.</p>\n]]>", "author": "Scott", "published": "2013-12-05 01:52:27+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Chris Wood #51: That was an <i>extremely</i> interesting article!  I don&#8217;t know how I missed it before.  Thanks very much for linking to it.</p>\n<p>I think that article goes in precisely the right direction, for those who want to investigate further: namely, to take seriously that Oswald acted on his own initiative, but seek new information that would help to clarify his motives.</p>\n<p>In particular, I hadn&#8217;t heard about the theory that the idea of assassinating JFK was planted in Oswald&#8217;s head by the Cuban leftists who he met in Mexico (even if they didn&#8217;t &#8220;send&#8221; Oswald <i>per se</i>, and were as shocked as anyone else when he actually did it).  This theory has the advantage of being, on its face, rather plausible (e.g., we know that Oswald <i>did</i> go to Mexico a few weeks before the assassination, and he <i>did</i> meet Fidelistas there in a position to be outraged about JFK&#8217;s attempts to assassinate their leader).</p>\n<p>Given that (as I said in the post) one of the Warren Commission&#8217;s explicit concerns was to avoid precipitating war with Cuba, and given the embarrassment surrounding the failed Castro assassination attempts, we&#8217;d also have an explanation for why the WC didn&#8217;t pry very hard in this direction.  Ironically, while the WC wouldn&#8217;t have been trying to cover up the US government&#8217;s totally-nonexistent role in JFK&#8217;s murder, some of its members might indeed have been trying to cover up the US&#8217;s very real, continuing role in <i>Fidel Castro</i>&#8216;s attempted murder!</p>\n<p>Having said that, one obvious problem for the theory is that, by the time he visited Mexico, Oswald was <i>already</i> an attempted political assassin (as well as militant Communist and Castro sympathizer), having tried and failed to assassinate General Walker.  So one could easily believe that he could form the idea to assassinate JFK all by himself, without any additional encouragement from Cuban emigres.  Still, it sounds entirely possible that, at least in Oswald&#8217;s mind, the Cuban emigres who he met in Mexico <i>did</i> give him such additional encouragement.  I hope we learn more, before anyone in a position to clarify further is dead.</p>\n]]>", "author": "Scott", "published": "2013-12-05 02:25:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>George K&#8217;s your comment while interesting does have the problem of just being extremely unlikely. I suspect that most people would guess that the need for very careful timing there would almost be enough that P(Conspiracy|multiple shooters) > P(No conspiracy|multiple shooters), unless you start with an extremely low prior on a conspiracy (probably even lower than where Scott estimates it now).</p>\n<p>Also, somewhat relevant xkcd: <a href=\"http://xkcd.com/690/\" rel=\"nofollow\">http://xkcd.com/690/</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/z/Zelinsky:Joshua.html\">Joshua Zelinsky</a>", "published": "2013-12-05 03:07:04+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Yet another example of an assassination that is thoroughly documented in history and much-celebrated in art is <b><a href=\"http://en.wikipedia.org/wiki/Medgar_Evers#Assassination\" rel=\"nofollow\">the 1963 assassination of Medgar Evers by Byron De La Beckwith</a>.</b></p>\n<p>In song, Bob Dylan immortalized the story of Ever&#8217;s assassination in his stunning performance of <b><a href=\"http://www.youtube.com/watch?v=nRffIeHPlRw\" rel=\"nofollow\"><i>Only a Pawn in Their Game</i></a></b> (beginning minute 3:18) at the 1963 March on Washington. </p>\n<p>In prose, Eudora Welty wrote&nbsp;&mdash; within a single day upon hearing the news of Ever&#8217;s assassination&nbsp;&mdash; an immortal short story titled <b><a href=\"http://web.mit.edu/norvin/www/somethingelse/welty.html\" rel=\"nofollow\">Where Is the Voice Coming From?</a></b>.</p>\n<p>Dylan&#8217;s song and Welty&#8217;s prose vividly illuminate the cognition and the social context of Evers&#8217; assassination.  </p>\n<p><b>Conclusion</b>&nbsp; Both historically and artistically, we know  far more about supremacist conspiracies and the cognition of Byron De La Beckwith than we are ever likely to know about the assassination of John Kennedy and the cognitiion of Lee Harvey Oswald.  </p>\n<p>It is worth asking: How much more do we need to know?  What is it that we are seeking to understand?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2013-12-05 12:00:39+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>@Raoul Ohio #50.</p>\n<p>I kind of do not know what to tell. I just think these guys misestimate the time horizon needed for the things to happen.</p>\n<p>For instance, Shafarevich also harbored some negative views of humanity. While in no sense he was a conspiracy theorist. <a href=\"http://en.wikipedia.org/wiki/Igor_Shafarevich\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Igor_Shafarevich</a></p>\n<p>I think regions in the brain incharge of fear, entitlement and temporal reasoning misfire and encode the fundamental region of reasoning in the brain. So whenever the mechanism needed to recover from disillusionment boots up, I feel it charges from this fundamental region which once becomes corrupted cannot make the individual reason properly or makes the individual overrun evidences that can be asserted with Occam&#8217;s razor.</p>\n]]>", "author": "J", "published": "2013-12-05 21:41:55+00:00", "title": "By: J"}, {"content": "<![CDATA[<p>Eh, I dunno, some of your points don&#8217;t really hold weight. Quoting xkcd as evidence for certain psychological states seems pretty unfair. Other points I agree with. Here are some points I don&#8217;t:</p>\n<p>(6) and (7) is clearly false. There are several major works that mention both. One that comes immediately to mind is Peter Dale Scott&#8217;s Deep Politics and the Death of JFK. Scott has unearthed the fact that General Walker was involved in a right-wing, anti-communist private intelligence organisation called the &#8220;International Committee for the Defence of Christian Culture&#8221; that was run by other military men (Major General Charles Willoughby, the head of US military intelligence in WW2) and oil tycoons (H.L. Hunt and his sons). General Walker was also forcibly retired by the Military for barraging his troops with John Birch Society propaganda (see his NYT obituary). Individuals that were associated with this organisation (Willoughby, among others) were named in the Warren Commission as spreading the idea that the CIA was behind the murder.</p>\n<p>If (14) is true, explain the size of the intelligence apparatus in governments worldwide. The US has several highly secretive intelligence organisations with thousands to tens of thousands of people working for them. The Snowden-NSA leaks is obviously a data point in favor of (14), but other organisations (like say, the NRO) still remain large, complex, and we don&#8217;t know much about their daily operations and actions. Add in another group like the various JSOC task forces, or the Intelligence Activity. These guys have military operations all over the planet (Afganistan, the Horn of Africa, the Phillipines), yet we don&#8217;t know much about their daily activities, their operations, nor their scope.</p>\n<p>Point (20) is a silly counter-argument and a species of category error. You are comparing gathering of scientific knowledge with a phenomenon that is prima facie secretive. Please outline for me how you would go about gathering knowledge in a scientific manner on a JSOC kill team, or any other organisation that might have counterintelligence, security, or deception capabilities. </p>\n<p>Of course, the problem with all this conspiracy talk isn&#8217;t conspiracists. It is nerds that are the problem, skeptical nerds to be more exact. Here you have some of the best minds on the planet that don&#8217;t actually really engage with a supposed conspiracy at all. Instead they engage the people doing the conspiracy theorizing, and go after the most wacky aspects of the conspiracy theory. That&#8217;s why you find the fedora-wearing skeptics of places like LessWrong, reddit, and xkcd go after easy-pickings like holographic planes, the illuminati, contrails, or bigfoot. But if you start talking about the death of David Kelly, Iran-Contra, the BCCI, Ali Mohamed, the Al Kifah Refugee Center, the various Saudi embassy associated people who funneled money to the 9/11 hijackers (Faha al Thumairy, Omar al-Bayoumi, and Haifa bint Faisal. That last one being a member of the House of Saud); then, suddenly they turn silent. Shit arguments that can be batted down with lists of fallacies from Wikipedia are ok, but investigating anything resembling an organisation that has security or counterintelligence capabilities is too much of a challenge. Better go back to watching anime.</p>\n<p>It&#8217;s like white, male, skeptic nerds have a pre-programmed bug in their head to take on the stupidest of shit, and expect a pat on the back for acting like little professors like their hero Neil Degrasse Tyson. Conspiracy theorists really deserve a better class of conspiracy theorizer closer to that of an investigative journalist (something like Marcy Wheeler&#8217;s Emptywheel blog). But given that nerd culture assigns high status to debunking, that&#8217;ll never happen. What we are left with is mainstream media ignoring certain aspects of stories, crazed loons latching onto bullshit, and skeptic nerds attacking the loons. It&#8217;s a real sad state of affairs, and this blog post certainly adds to it.</p>\n]]>", "author": "Name", "published": "2013-12-06 09:03:26+00:00", "title": "By: Name"}, {"content": "<![CDATA[<p>Keep believing!</p>\n<p><a href=\"http://thebackbencher.co.uk/3-things-you-didnt-want-to-know-about-nelson-mandela/\" rel=\"nofollow\">http://thebackbencher.co.uk/3-things-you-didnt-want-to-know-about-nelson-mandela/</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Blind:Not.html\">Not Blind</a>", "published": "2013-12-06 14:21:07+00:00", "title": "By: Not Blind"}]