[{"content": "<![CDATA[<p>Jud, @22</p>\n<p>Seems like a &#8220;large&#8221; missed opportunity&#8230;</p>\n]]>", "author": "Guy", "published": "2017-05-12 06:13:44+00:00", "title": "By: Guy"}, {"content": "<![CDATA[<p>Ummm&#8230; Checked this blog a couple of times (with a couple of reloads each time) over the last few days; knew, couldn&#8217;t possibly be of any help; but noticed that (i) the reloads kept the revealed email IDs the same, and (ii) the separate times I visited this blog, different IDs were pre-present. Thus, got to know two IDs. Have forgotten which ones, by now.</p>\n<p>But anyway, just to let you know: Right now, there is no leaked ID visible. &#8230; May be something you tried has worked.</p>\n<p>But the comment # it shows below in the preview (as I type) is 1, even if I can see that there are 25 comments visible above. &#8230; Just in case it&#8217;s of any help.</p>\n<p>Best,</p>\n<p>&#8211;Ajit</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2017-05-12 17:03:53+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Its not just your email that is being exposed.  I was given your bank details and password.   </p>\n<p>However I&#8217;m now starting to think that being a scientist doesn&#8217;t pay as much as I first thought 🙂</p>\n]]>", "author": "skendo", "published": "2017-05-12 23:30:50+00:00", "title": "By: skendo"}, {"content": "<![CDATA[<p>So I took a look at the html and the Name/email fields are being filled directly in the html itself (i.e. it is generated by the wordpress php code).  This suggests that one of the following things is wrong:</p>\n<p>1)  you installed some wordpress plugin that isn&#8217;t working right.  So first step I suggest try disabling any plugins (especially those regarding commenting) and see if it fixes the problem.</p>\n<p>2) Something is wrong with your caching setup so it is serving cached pages when it shouldn&#8217;t.  Try disabling any caching plugins you are running.</p>\n<p>3) I guess it could also be a corrupt database or perhaps your wordpress code got screwed up.  Maybe try reinstalling/upgrading your wordpress install.  It is possible the auto update process messed something up (e.g. upgraded only some files leaving you in an inconsistent state).</p>\n<p>&#8212;</p>\n<p>I just spent far too much time when I should have been doing my computability theory research instead building my own wordpress theme so if you don&#8217;t get any better offers I would be happy to check things out.</p>\n<p>But at the moment I&#8217;m assuming someone will likely comment with the exact answer.  Though if you want a better educated guess sharing what plugins you are using and the version of wordpress wouldn&#8217;t hurt.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gerdes:Peter.html\">Peter Gerdes</a>", "published": "2017-05-13 22:59:58+00:00", "title": "By: Peter Gerdes"}, {"content": "<![CDATA[<p>I should have said is either generated by the php or improperly cached.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gerdes:Peter.html\">Peter Gerdes</a>", "published": "2017-05-13 23:00:44+00:00", "title": "By: Peter Gerdes"}, {"content": "<![CDATA[<p>Ohh and if you have a caching plugin like W3Cache installed you might be able to get a sense if it is causing the problem by looking in the wp-content directory and seeing if there are any saved html files in there showing your comments (they might be zipped) already populated with names/emails.  They shouldn&#8217;t be.  But the easier thing to do is just going into it&#8217;s config it wp-admin and clear the cache or turn it off.</p>\n<p>Though, hmm, up until a few minutes ago I was running into the problem and now it is returning only my name.  If it isn&#8217;t fixed it is sounding more and more like an issue with caching.  Either on your server or someone is running a cache in front of it.</p>\n<p>Especially since something seems to populate my name and email into other browsers on this computer I&#8217;ve never used with your blog.  That strongly suggests some process is caching the page returned based (in part) on IP and that got screwed up.  Erase any caches you can.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gerdes:Peter.html\">Peter Gerdes</a>", "published": "2017-05-13 23:17:31+00:00", "title": "By: Peter Gerdes"}, {"content": "<![CDATA[<p>So can we factor/discrete log with Boson Sampling? What classically hard task can Boson Sampling do?</p>\n]]>", "author": "HopesBSisnotBS", "published": "2017-05-14 09:38:51+00:00", "title": "By: HopesBSisnotBS"}, {"content": "<![CDATA[<p>Hi, did you see the Quanta piece in which you&#8217;re quoted?<br />\n How do you feel about the characterization &#8220;Scott is thinking in a theoretical sense&#8221;?</p>\n<p>(As if 1TB keys and 100 hours of CPU time for single message description, let alone quantum computers, are not theoretical)</p>\n]]>", "author": "Amir", "published": "2017-05-15 17:06:21+00:00", "title": "By: Amir"}, {"content": "<![CDATA[<p>HopesBSisnotBS #31: BosonSampling <i>is itself</i> a classically hard task.  The task, roughly speaking, is to output an nxn matrix A with probability ~&mu;(A) |Per(A)|<sup>2</sup> (omitting normalization), where &mu;(A) is the probability of A according to the i.i.d., N(0,1) Gaussian measure, and Per(A) is the permanent of A.  In other words, &#8220;sample a random matrix, but in a way that&#8217;s biased toward matrices with larger permanents.&#8221;</p>\n<p>As I&#8217;ve said loudly and clearly many, many times, it&#8217;s an open problem whether the ability to solve BosonSampling implies the ability to solve any classically-hard <i>decision</i> problems.  Certainly we don&#8217;t know how to do (e.g.) factoring or discrete log this way, or anything else of relevance to cryptography.  On the other hand, if we just want something that&#8217;s classically hard, the case that BosonSampling is classically hard is arguably <i>stronger</i> than the case that factoring and discrete log are.</p>\n]]>", "author": "Scott", "published": "2017-05-15 20:30:21+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Amir #32: Yes, I saw that piece.  I don&#8217;t agree that the worries about the resulting cryptosystem&#8212;that it requires terabyte-long keys, and is vulnerable to polynomial improvements in algorithms&#8212;are particularly &#8220;theoretical.&#8221;</p>\n<p>Maybe the best way to summarize the situation is as follows.<br />\n We&#8217;ve long known that if scalable QCs are built, then RSA as we all know it collapses.  This paper doesn&#8217;t <i>challenge</i> that conclusion, so much as study the question of how much cryptography security could still be salvaged from the heap of charred rubble that was once RSA.  (The answer, as it turns out, is &#8220;not much.&#8221;)</p>\n<p>I don&#8217;t agree with the closing quote that &#8220;the conventional wisdom is wrong.&#8221;  This seems to me more like an elaboration of the conventional wisdom (which long allowed for the possibility of &#8220;merely-polynomial&#8221; public-key security, as for example with Merkle puzzles, even supposing that factoring and discrete log were solvable in polynomial time).</p>\n]]>", "author": "Scott", "published": "2017-05-15 20:38:58+00:00", "title": "By: Scott"}]