[{"content": "<![CDATA[<p>As a big fan of yours who wants to see you live a long life, I do hope you will also use this sabbatical to focus a bit on your physical body and health (you&#8217;re still young enough to do important lifestyle changes relatively easily)  🙂</p>\n]]>", "author": "fred", "published": "2017-11-06 13:18:07+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #30: Well, my current plan is simply to get a little bit fatter and weaker every year, until I die of a heart attack in my mid-50s&#8212;but taking care to have proved most of the quantum complexity theorems I want to have proved by then, and also to have cleared the starred emails from my inbox.  The rationale for this plan is that I love eating and despise exercising&#8212;and I spent the first quarter-century of my life that way and didn&#8217;t get fat, and I refuse to accept that anything has changed.  I have my own alternative facts.</p>\n<p>Having said that: yes, your rather different plan merits consideration as well.  Taken under advisement.  🙂</p>\n]]>", "author": "Scott", "published": "2017-11-06 17:47:13+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #31<br />\nIt can be something as simple as buying a good pair of running shoes and taking long walks everyday &#8230; and you can still think about quantum complexity while doing it!</p>\n]]>", "author": "fred", "published": "2017-11-06 20:47:13+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Is shadow tomography easier if the input state is known to be pure?</p>\n]]>", "author": "Pure state shadow tomography", "published": "2017-11-06 22:51:25+00:00", "title": "By: Pure state shadow tomography"}, {"content": "<![CDATA[<p>[off-topic] I don&#8217;t want to spam your email but I have a (probably) dumb question about QCSD.  Are you still entertaining those?  If so where?</p>\n<p>I&#8217;m one of those 10/10 readers of the book.  It&#8217;s one of my ten favorites and I understand 1/10 of it.  🙂</p>\n]]>", "author": "Don McKenzie", "published": "2017-11-07 00:12:05+00:00", "title": "By: Don McKenzie"}, {"content": "<![CDATA[<p>fred #32: Well, I also hate driving, so I do walk just about anywhere that I&#8217;m able to.  That&#8217;s probably why I&#8217;m not even unhealthier than I am!</p>\n]]>", "author": "Scott", "published": "2017-11-07 00:34:10+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>PSST #33: No, it&#8217;s not significantly easier for pure states&#8212;at least not in terms of the number of states you need, which was my main concern in the paper (it might be up to quadratically faster in computation time).  One way to see this is that we can purify any mixed state at the cost of doubling log(D), which would affect my bound on the number of states by only a constant factor.  So if we <i>did</i> have a significantly better algorithm for pure states, it would imply a better algorithm for mixed states as well.</p>\n]]>", "author": "Scott", "published": "2017-11-07 00:39:32+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Don #34: Eh, go ahead and ask your question here.</p>\n<p>Glad you liked the part of QCSD that you understood!</p>\n]]>", "author": "Scott", "published": "2017-11-07 00:41:05+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>scott #23: exactly/ agreed, any comprehensive hidden variable theory proof or disproof might be nearly a BQP=?BPP proof wrt complexity class separations. but flipping this around, plz take this overall idea seriously: imagine a QM algorithm that attempts to construct &#8220;problem instances&#8221; to submit to a QM computer to test if that QM computer truly has more power than BPP, using a finite # of trials and interpreting the results. what would such an algorithm look like? what would be the best/ optimal sample problems to submit to the QM to determine its capabilities? obviously this is going on in a informal way every time QM researchers implement an algorithm, but thinking outside the box & in a more mathematical/ systematic way, what would be the &#8220;ultimate&#8221; such algorithm?</p>\n]]>", "author": "vzn", "published": "2017-11-07 03:39:22+00:00", "title": "By: vzn"}, {"content": "<![CDATA[<p>The comment “uuuuuuuuuuuuuuu” is actually the announcement of the first quindecaquark particle, a major breakthrough in physics!</p>\n]]>", "author": "Raoul Ohio", "published": "2017-11-07 05:58:20+00:00", "title": "By: Raoul Ohio"}]