[{"content": "<![CDATA[<p>Can you identify the remarkable formulas on the blackboard behind Trudeau?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2016-04-18 11:57:56+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Difficult to give a mark without first establishing the desired outcome of an assignment. The assumption here seems to be that 10/10 would require true, informative, non trivial statements about QC in ten seconds. Seems like a pretty tall order. I think a better assignment for &#8220;Quantum Computing for Politicians&#8221; might be: care enough to ask about the subject, listen to the answer, regurgitate without making any serious mistakes. On that basis I think he gets closer to full marks.</p>\n]]>", "author": "Chris", "published": "2016-04-18 14:28:52+00:00", "title": "By: Chris"}, {"content": "<![CDATA[<p>Chris #37: It was more like a minute&#8212;but in any case, treating the assignment as &#8220;explain quantum computing to laypeople in one minute,&#8221; I&#8217;m comfortable with the grade I gave.  And I like to think Trudeau might appreciate that I respected him enough to not give full marks just because I like his politics (to whatever extent I do&#8212;I don&#8217;t follow Canadian politics as closely as I should), or because I think being obsequious to politicians is the way to ensure continued funding for science.  It may &#8220;only&#8221; have been a B+ answer, one any bright teenager could also have given after hearing people explain QC for an hour, but it was an honest B+. 🙂</p>\n]]>", "author": "Scott", "published": "2016-04-18 14:46:40+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Jeb Bush did worse when asked a trig question- though to be fair he really could not have expected the question. See</p>\n<p><a href=\"http://blog.computationalcomplexity.org/2013/08/how-much-trig-does-your-governor-know.html\" rel=\"nofollow\">http://blog.computationalcomplexity.org/2013/08/how-much-trig-does-your-governor-know.html</a></p>\n]]>", "author": "gasarch", "published": "2016-04-18 15:51:59+00:00", "title": "By: gasarch"}, {"content": "<![CDATA[<p>re gasarch #39:</p>\n<p>Excellent post. Does anyone reading this blog know the angles of a 3-4-5 triangle without help from a calculator? I doubt it. I hope the majority know 1/3 of the answer!</p>\n]]>", "author": "Raoul Ohio", "published": "2016-04-18 21:36:55+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>CNN asked on Twitter &#8220;Can you explain quantum computing like Justin Trudeau?&#8221;  This got me to wondering whether, in a single tweet, one could address both of the two questions Trudeau seemed to be answering: how does QC improve on classical, and what would that be good for?  My best shot at this can be seen at<br />\n<a href=\"https://twitter.com/PrattWhittemore/status/722225433584869376\" rel=\"nofollow\">https://twitter.com/PrattWhittemore/status/722225433584869376</a></p>\n<p>Challenge: improve on this.  (I paid 5 characters including the space to reply to @CNN, replying to me would cost you 17 characters so either reply to @CNN or to no one&#8212;you&#8217;re welcome to the extra 5 characters. 🙂  No fair replying with a link to an explanation with more than 140 characters.)</p>\n]]>", "author": "Vaughan R Pratt", "published": "2016-04-19 02:09:17+00:00", "title": "By: Vaughan R Pratt"}, {"content": "<![CDATA[<p>How about &#8220;QC lets us use parallel universes as scratchpaper&#8221;</p>\n]]>", "author": "Dave", "published": "2016-04-19 18:48:43+00:00", "title": "By: Dave"}, {"content": "<![CDATA[<p>Dave #42: Doesn&#8217;t get across the restrictions on how you can access the scratch paper.</p>\n]]>", "author": "Scott", "published": "2016-04-19 22:25:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Grade D- , if he showed the same vague misunderstanding of economic theory he would be ridiculed, and rightly so.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2016-04-20 00:41:47+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>James #44: Firstly, much as it pains me to say so, it&#8217;s <i>probably</i> more important that politicians understand economics than that they understand quantum computing theory!  But secondly, if you asked economists, I&#8217;m sure they&#8217;d tell you that politicians have a long history of misunderstanding basic economic theory <i>much</i> more egregiously than any misunderstanding Trudeau showed about QC, and being not only not ridiculed but lauded for that.</p>\n]]>", "author": "Scott", "published": "2016-04-20 02:28:13+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Regarding the 8 quantum researchers attempts: Scott is the only one who actually attempted to answer the question. And he did OK in the sense that if you know the subject already, you can see that some key aspects were touched on. Not likely that anyone &#8220;outside the loop&#8221; would have a clue what he is talking about.</p>\n<p>My first impression is to give Scott a B+, a couple of the others a D,  and flunking everyone else.</p>\n<p>About half of the answers are totally loony, about what you would expect from Time magazine. Maybe Krysta Svore heard the question wrong, perhaps thinking they asked &#8220;what is magic fairy dust?&#8221;.</p>\n<p>I suppose it is not fair to grade the responses as if they were answers on a test that people had time to prepare for. Probably people got asked with no time to think about it, and since it seems like an impossible task, just blabbed some generalities about how wonderful QC will be. Hardly the time to point out the inconvenient fact that there might never be a working quantum computer.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-04-20 03:57:41+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Listening to the answers is more enlightening than reading them. </p>\n<p>Many of us will recognize and perhaps identify with Scott&#8217;s delivery: the excitement of an expert with a chance to talk about something that she or he really likes. I get into that zone when teaching discrete math or algorithms, but not so much with programming.</p>\n<p>Next up comes Krysta: A great imitation of a big city TV station weather person reading a press release. It is a lot more fluid than than, say, a baseball announcer reading a mini advertisement between pitches, but the cadence of reading an announcement is clear.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-04-20 04:21:08+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Raoul: I don&#8217;t agree that I&#8217;m the only one who tried to answer the question.  For one thing, Martin Laforest gave much the same answer I did.  For another, &#8220;explain QC in 35 seconds&#8221; is such an absurd request that it&#8217;s no surprise people would interpret it very differently!  Aephraim answered &#8220;is a QC just like a classical computer but faster, and if not, why care about it?&#8221; while Krysta answered &#8220;what are the conceivable applications of QC that would most benefit humanity?&#8221;</p>\n<p>But more to the point: if no one got above a B+, then OK, great &#8230; <b>how would <i>you</i> do this in 35 seconds?</b>  A test that it&#8217;s impossible to get an A on is just a badly-normed test.</p>\n]]>", "author": "Scott", "published": "2016-04-20 09:26:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I was at PI that day, so I wanted to just point out two things about that speech:</p>\n<p>(i) He *did* answer the ISIL question immediately afterwards. People who are saying he dodged it just watched an edited version of the video where the second part was cut.</p>\n<p>(ii) People are complaining that he didn&#8217;t *really* know what he was talking about, but I don&#8217;t think it was supposed to sound like he did. It was more like he rehearsed this so he could joke around with that particular audience. Everyone laughed, then everyone cheered, but no one thought &#8220;Oh wow, our PM is so smart, he knows what quantum computers are&#8221;. How this has propagated into the world&#8217;s media afterwards is a different story.</p>\n]]>", "author": "Daniel", "published": "2016-04-20 12:25:05+00:00", "title": "By: Daniel"}, {"content": "<![CDATA[<p>The fist two &#8220;explanations&#8221; are even more embarassing than Trudeaus&#8217;s since they come from &#8220;experts&#8221;. Hype and half-truths are nowadays far too common in order to promote certain parts of  sciences. Scott&#8217;s answer is probably the best and more honest.</p>\n]]>", "author": "anon", "published": "2016-04-20 13:26:27+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>Scott, bet you just loved the answer from Barry Sanders, no?  🙁</p>\n]]>", "author": "mike", "published": "2016-04-20 14:09:25+00:00", "title": "By: mike"}, {"content": "<![CDATA[<p>It&#8217;s notable that Justin Trudeau&#8217;s 96-word explanation of quantum computing has a Flesch-Kincaid Grade Level of 7.58, which is a markedly lower grade level than any of the other explanations offered (the metrics are summarized below). </p>\n<p>Here is a quantum computing explanation that is crafted to be even simpler than Justin Trudeau&#8217;s, in the sense that its product of &#8220;words times Flesch-Kincaid Grade Level&#8221; (henceforth the &#8220;wtfk&nbsp;unit&#8221;) is even less:<br />\n<blockquote>When we make things run faster and better&nbsp;&#8212; including computers&nbsp;&#8212; we find that old ideas of space and time aren&#8217;t good enough. Instead, our daily lives reflect a hard-to-see &#8220;quantum&#8221; world of change and flow. Some scientists imagine that the quantum world is made of long lists of numbers. Others imagine it is made of shorter lists of equations.  But no one really knows, because the math is very hard and so is the science. Building good computers helps us all to learn about the quantum world and what we can do with it.</p></blockquote>\n<p>Here the notion that &#8220;the world is made of short lists of equations&#8221; is reflected in two of the Perimeter Institute&#8217;s <a href=\"https://www.perimeterinstitute.ca/research/research-initiatives\" rel=\"nofollow\">research initiatives</a> &#8220;Tensor networks: from entangled quantum matter to emergent space time&#8221; and &#8220;From discretuum to continuum: computational tools that bridge the gap&#8221;.</p>\n<p><b>Metrics</b>&nbsp; Some comparative reading-difficulty metrics are (in order of increasing wtfk-score):</p>\n<p>• 0625 wtfks:&nbsp; the above quantum computing explanation<br />\n&nbsp;&nbsp;&nbsp;&nbsp;(96 words times Flesch-Kincaid Grade Level 6.51)</p>\n<p>• 0735 wtfks:&nbsp; Justin Trudeau&#8217;s explanation<br />\n&nbsp;&nbsp;&nbsp;&nbsp;(97 words times Flesch-Kincaid Grade Level 7.58)</p>\n<p>• 1097 wtfks:&nbsp; Barry Sanders&#8217; explanation<br />\n&nbsp;&nbsp;&nbsp;&nbsp;(67 words times Flesch-Kincaid Grade Level 16.37)</p>\n<p>• 1133 wtfks:&nbsp; Murray Thom&#8217;s explanation<br />\n&nbsp;&nbsp;&nbsp;&nbsp;(98 words times Flesch-Kincaid Grade Level 11.56)</p>\n<p>• 1369 wtfks:&nbsp; Aephraim Steinberg&#8217;s explanation<br />\n&nbsp;&nbsp;&nbsp;&nbsp;(148 words times Flesch-Kincaid Grade Level 9.25)</p>\n<p>• 1583 wtfks:&nbsp; Krysta Svore&#8217;s explanation<br />\n&nbsp;&nbsp;&nbsp;&nbsp;(103 words times Flesch-Kincaid Grade Level 15.65)</p>\n<p>• 1675 wtfks:&nbsp; Davide Venturell&#8217;s explanation<br />\n&nbsp;&nbsp;&nbsp;&nbsp;(101 words times Flesch-Kincaid Grade Level 16.58) </p>\n<p>• 1700 wtfks:&nbsp; Martin Laforest&#8217;s explanation<br />\n&nbsp;&nbsp;&nbsp;&nbsp;(118 words times Flesch-Kincaid Grade Level 14.41)</p>\n<p>• 1917 wtfks:&nbsp; Scott Aaronson&#8217;s explanation<br />\n&nbsp;&nbsp;&nbsp;&nbsp;(131 words times Flesch-Kincaid Grade Level 14.62)</p>\n<p>The above Flesch-Kincaid Grade Levels are computed with the interactive &#8220;Readability Calculator&#8221; that is hosted at the web-site &#8220;Online-Utility.org&#8221;.</p>\n<p><b>A quantum challenge</b>&nbsp; Can quantum computing be reasonably explained in 500&nbsp;wtfk&nbsp;units or&nbsp;fewer?  (my own attempts at this level of quantum simplicity have failed)</p>\n]]>", "author": "John Sidles", "published": "2016-04-20 14:12:09+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>mike #51: Barry, who I know, could explain as well as I could everything that&#8217;s wrong about the &#8220;run all possible answers at the same time&#8221; explanation.  I think his mistake was not that he actually believes such a thing (or was trying to mislead anyone), but rather, that he simply thought that if you&#8217;re summarizing in a few sentences for a layperson then there&#8217;s no possible way to do better.  Personally, I think it IS possible to do better, but the way to do better is not obvious, and only emerges from a lot of trial and error.</p>\n]]>", "author": "Scott", "published": "2016-04-20 14:29:11+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>John Sidles #52: I can do even better than that, and achieve a Flesch-Kincaid grade level of 4.1 in a mere 22 words:</p>\n<ul>Duh.  Duh.  Quantum computers very small.  Also very fast.  Exciting!  Solve all problems.  Try all answers in parallel.  Me Tarzan.  You Jane.</ul>\n]]>", "author": "Scott", "published": "2016-04-20 16:13:09+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Here is a humorous take on Justine Trudeau&#8217;s QC lesson:</p>\n<p><a href=\"http://syruptrap.ca/2016/04/delirious-exhausted-justin-trudeau-still-explaining-quantum-computing-to-journalists/\" rel=\"nofollow\">http://syruptrap.ca/2016/04/delirious-exhausted-justin-trudeau-still-explaining-quantum-computing-to-journalists/</a> </p>\n<p>It&#8217;s great when political leaders are not afraid of science.</p>\n]]>", "author": "Lisa Adam", "published": "2016-04-20 16:53:44+00:00", "title": "By: Lisa Adam"}, {"content": "<![CDATA[<p>Did John Sidles just define a &#8220;wtfk unit?&#8221; 🙂</p>\n]]>", "author": "Anon", "published": "2016-04-20 18:37:46+00:00", "title": "By: Anon"}, {"content": "<![CDATA[<p>Extending Lisa Adams&#8217; comment (#55), how many <i>Shtetl Optimized</i> readers recall that (former) US President George W. Bush is also a pretty fair <a href=\"http://www.theonion.com/article/bush-finds-error-in-fermilab-calculations-1463\" rel=\"nofollow\">amateur physicist</a>?<br />\n<blockquote>It&#8217;s true, I dabbled in the higher maths during my Yale days. But I didn&#8217;t have the true gift for what Gauss called &#8216;the musical language in which is spoken the very universe.&#8217;  If I have any gift at all, it&#8217;s my instinct for process and order.</p></blockquote>\n<p>Lisa&#8217;s reminder that &#8220;<a href=\"http://www.skepticalscience.com/checking-ted-cruz-climate-denial-howlers.html\" rel=\"nofollow\">It’s great when political leaders are not afraid of science</a>&#8221; is  grounds for sober reflection too. 🙁</p>\n]]>", "author": "John Sidles", "published": "2016-04-20 18:42:36+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Scott #48: </p>\n<p>I agree that I should not be grading anyone&#8217;s response, because I cannot come up with a passing answer.</p>\n<p>I would have trouble giving a 35 second comparison of John Sidles&#8217;s new &#8220;wtfk unit&#8221; with the traditional computer world &#8220;WTF&#8221; unit. Maybe I should go with an example: </p>\n<p>&#8220;The Canadian Prime Minister can explain QC with 0735 wtfk units. The American presidential primaries achieve a rare 9 on the 10 WTF scale.&#8221;</p>\n]]>", "author": "Raoul Ohio", "published": "2016-04-20 21:01:34+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Ok here, goes, genuine 35 sec typing attempt:</p>\n<p>QC is a</p>\n<p>Ah fuck, start again (this is genuine)</p>\n<p>QC is is misguided attempt to aplly technonlogy to a not very well understood scientoicf equation &#8211; the scroedinger eqaution, assuming it is continuos in time and allows almost infinite information to be harnessed.</p>\n<p>Oh dear, well there you go, probably correct apart from the grammar and spelling.  🙂</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2016-04-20 23:06:11+00:00", "title": "By: James Gallagher"}]