[{"content": "<![CDATA[<p>Patrick #30: What Terry described sounds closely related to hybrid arguments.  But in a typical TCS hybrid argument, you change your original probability distribution step-by-step to one that&#8217;s extremely <i>far</i> from the original, and argue that the two distributions are nevertheless <i>computationally</i> indistinguishable (say, to all polynomial-time algorithms), under some cryptographic assumption.</p>\n]]>", "author": "Scott", "published": "2018-04-15 17:43:45+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>In insurance and finance, the bad event regulators want companies to avoid is insolvency.  Lots of theorizing is done to calculate how much &#8220;capital cushion&#8221; is needed to avoid insolvency, at say a 99% likelihood level.  (The regulations are far more complicated, but this level of detail is good enough for this discussion.)</p>\n<p>Right now, actuaries are looking at how to quantify longevity risk for companies that have sold annuities, taken on pension plan liabilities, or have some other commitment that will keep paying people as long as they are alive.</p>\n<p>There seems to be two different schools of thought when trying to calibrate the capital cushion as it relates to longevity risk.  1) Extrapolate historical improvement rates, and assume improvement trends and random fluctuation will be comparable to historical experience.  2) Throw out the historical trends, and look at the underlying science of biology.  Try to understand how regenerative medicine, anti-aging technologies, synthetic biology, machine learning, and other  technologies on the horizon might have an effect on life spans over the next couple decades.</p>\n<p>As you can imagine, people can get very different answers depending on which kind of model they use.  Any thoughts on dealing with &#8220;black swan&#8221; events? (I assume there is no need for a reminder about what happened during the financial crisis a decade ago, which were fueled, in part, by financial models that didn&#8217;t accurately reflect risk.)</p>\n]]>", "author": "Jon K.", "published": "2018-04-16 15:40:56+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>[&#8230;] Bounding Probabilities by Scott Aaronson &#8211; Scott Aaronson gives step by step guidelines for bounding probabilities. References alot of technical math. [&#8230;]</p>\n]]>", "author": "Rational Feed  deluks917", "published": "2018-04-16 16:06:53+00:00", "title": "By: Rational Feed – deluks917"}, {"content": "<![CDATA[<p>Jon K. #34: That&#8217;s not my field; the tail risks I deal with professionally are ones that can in principle be rigorously upper-bounded.  For me, though, the basic question about the 2008 financial crisis has always been, to what extent was it caused by traders <i>actually</i> failing to understand systemic risk, and to what extent was it caused by them understanding the risks perfectly well, but hoping (in many cases, correctly) that they could stick someone else with the tab?</p>\n]]>", "author": "Scott", "published": "2018-04-16 17:26:47+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, what do you mean by &#8220;traders&#8221;? The salesmen who dealt with individual house buyers didn&#8217;t have any skin in the game, but pretty much everyone else involved, everyone I would call a &#8220;trader&#8221; failed to stick other people with the tab. They handed a lot of it to other parties, but they kept a lot for themselves. The main exception is that Goldman-Sachs stuck AIG with the tab, which almost didn&#8217;t work. And I think the timing of that suggests that they didn&#8217;t have a lot of foresight, just enough to keep ahead of everyone else.</p>\n<p>More specifically, the companies that employed traders were stuck with the tab. The traders themselves got to keep their annual bonuses, except when they were in the form of company stock.</p>\n<p>I think that if the traders saw it coming, they would have gotten out of housing in, say, 2006, like the retail sellers did. This probably would have taken them to some other part of finance, which might not have done any better in 2008, but that&#8217;s what I&#8217;d expect.</p>\n]]>", "author": "Douglas Knight", "published": "2018-04-16 19:47:26+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Thanks for this post, this has given me a focused guide to approaching some problems that I was preparing to break out the old probability texts and flail around until I found something remotely resembling applicable.</p>\n]]>", "author": "Sandro", "published": "2018-04-17 12:36:36+00:00", "title": "By: Sandro"}, {"content": "<![CDATA[<p>Hi Scott. Per your response in comment #4, you state that you speculate that the &#8220;mathematicized paranoia&#8221; that is a characteristic of TCS may be the reason why Israelis are over-represented in that field, in comparison to other areas of math, physics, or CS.</p>\n<p>I know you meant that comment to be half-joking, but my initial reaction was to whether Israelis are, in fact, over-represented in TCS in comparison to other branches of math or computer science. </p>\n<p>If in fact this is true, I would have speculated that this may have been due to large numbers of Israelis being descended from Ashkenazi Jews from Russia (including very recent emigres from Russia or elsewhere in the former Soviet Union), and thus perhaps inheriting the academic mathematical traditions that produced the likes of Andrey Kolmogorov, a pioneer in the field of TCS among many other fields.</p>\n]]>", "author": "Aaron G", "published": "2018-04-17 17:48:27+00:00", "title": "By: Aaron G"}, {"content": "<![CDATA[<p>Aaron G, I don&#8217;t know the history of TCS in Israel. However, looking at some of the main characters, especially in Jerusalem, none seems to be of Russian origin or to have any special connections to Kolmogorov. For example, Michael Rabin who I believe is one of the fathers of TCS in Israel, did his PhD in Princeton with Church.</p>\n]]>", "author": "Yiftach Barnea", "published": "2018-04-19 15:53:59+00:00", "title": "By: Yiftach Barnea"}, {"content": "<![CDATA[<p>A couple of additions (for my version of the algorithm, anyway).<br />\n(3a) is the bad event that something doesn&#8217;t show up as often as it should? Try Janson&#8217;s inequality.</p>\n<p>(4a) It&#8217;s a martingale, the worst-case differences are too big for Azuma to help, but it looks like they should really happen very rarely. Try Friedman&#8217;s inequality; if that fails skip straight to (8) as it (usually) means the probability of a bad event really is too big.</p>\n]]>", "author": "Peter", "published": "2018-04-19 20:16:22+00:00", "title": "By: Peter"}, {"content": "<![CDATA[<p>To Yiftach, comment #40,</p>\n<p>Thanks for looking into this. It looks like my speculation about the history of TCS in Israel is incorrect.</p>\n]]>", "author": "Aaron G", "published": "2018-04-20 12:04:26+00:00", "title": "By: Aaron G"}]