[{"content": "<![CDATA[<p>Chris #16: Yee-haw!</p>\n]]>", "author": "Scott", "published": "2016-10-26 19:09:01+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>AJ #17: Yup.  As we say down in Texas, PP &sube; P<sup>#P</sup> &sube; PSPACE &sube; EXP.</p>\n]]>", "author": "Scott", "published": "2016-10-26 19:09:49+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Concerns regarding unwanted connotations of &#8220;supremacy&#8221; give added weight to John Preskill&#8217;s long-standing request (in his on-line essay <a href=\"https://quantumfrontiers.com/2012/07/22/supremacy-now/\" rel=\"nofollow\">&#8220;Supremacy Now&#8221;</a>, see also Preskill&#8217;s arXiv:1203.5813, &#8220;Quantum computing and the entanglement frontier&#8221;):<br />\n<blockquote>&#8220;I&#8217;m not completely happy with this term [&#8220;Quantum Supremacy&#8221;], and would be glad if readers could suggest something better.&#8221;</p></blockquote>\n<p>Here are some resources and references that bear upon Preskill&#8217;s request for supremacy-alternatives.</p>\n<p><b>Resources for sampling quantum ouliphany</b>&nbsp; The free-as-in-freedom command-line phrase-sampler <i>ouliphany</i>&nbsp;&mdash; which is available as the shell-script &#8220;<a href=\"http://tinyurl.com/ouliphany\" rel=\"nofollow\">ouliphany.bash</a>&#8221;&nbsp;&mdash; applies the methods of OuLiPo to sample hundreds of thousands of alternatives to &#8220;quantum supremacy&#8221;.</p>\n<p>The results include some personal favorites:</p>\n<p>• <b>#5</b>&nbsp; <i>quantum hilarity</i>&nbsp;&hellip; in&nbsp;tribute&nbsp;to Baruch Spinoza<br />\n• <b>#4</b>&nbsp; <i>quantum comity</i>&nbsp;&hellip; in&nbsp;tribute&nbsp;to Friends<br />\n• <b>#3</b>&nbsp; <i>quantum iatromechanics</i>&nbsp;&hellip; in&nbsp;tribute&nbsp;to medicine<br />\n• <b>#2</b>&nbsp; <i>quantum <a href=\"https://books.google.com/books?id=0DOOxEjIK0MC&pg=PA263\" rel=\"nofollow\">querencity</a></i>&nbsp;&hellip; in&nbsp;tribute&nbsp;to Jorge Luis Borges<br />\n• <b>#1</b>&nbsp; <i>quantum <a href=\"https://www.google.com/search?tbo=p&tbm=bks&q=celerity+inauthor:Patrick+inauthor:O%27Brian&num=8\" rel=\"nofollow\">celerity</a></i>&nbsp;&hellip; in&nbsp;tribute&nbsp;to the friendship of Stephen Maturin and Jack Aubrey</p>\n<p>The five phrases each are grounded in a vast and beautiful literature&nbsp;&hellip; so vast indeed, that no mere blog-comment can survey it.</p>\n<p>This comment&#8217;s limited objective, therefore, is to observe that the quest for quantum supremacy can be naturally regarded&nbsp;&mdash; with strengthened philosophical hilarity, social comity, medical practicality, and pedagogic querencity&nbsp;&mdash; as a quest for <i>quantum celerity</i>.</p>\n<p><b>The postulate of quantum celerity</b>&nbsp; <i>Some physical processes can be simulated efficiently only by quantum computing resources</i></p>\n<p>Here &#8220;quantum celerity&#8221; is suggested as a drop-in replacement for the phrase  &#8220;quantum supremacy&#8221;, with no modification to John Preskill&#8217;s original conception required or imputed.  In regard to the existing literature, the global replacement <i>supremacy</i>&nbsp;->&nbsp;<i>celerity</i> generically &#8220;just works&#8221;; see for example Preskill&#8217;s arXiv:1203.5813 and Scott&#8217;s various on-line &#8220;Quantum Supremacy&#8221; talks (recently at Oxford, Redmond, Banff, and the White House). </p>\n<p><b>The <i>querencia</i> of quantum iatromechanics</b>&nbsp; How does the quest for quantum celerity illuminate the literature of Kalai-style quantum skepticism?  In what sense(s) does quantum iatromechanics&nbsp;&mdash; here appreciated as the study of the quantum dynamical processes that are associated to biological processes and medical practice in particular&nbsp;&mdash; present a model for Kalai-style quantum skepticism?  Can quantum iatromechanics provide young researchers with nurturing <i>querencias</i> (in the sense of Borges)?<br />\n<blockquote>&#8220;<em>Querencia</em> is a typical <i>gaucho</i> word used in the Argentine field and pampas; it literally means &#8216;attachment, fondness, longing,&#8217; but its actual, metaphorical meaning refers to a horse&#8217;s perceived home or base.  When left along and without guidance, a horse will follow its longing or attachment, that is, it will head <i>home</i> [to its <em>querencia</em>]&#8221;</p></blockquote>\n<p>In a nutshell, the <i>querencia</i> of quantum iatromechanics encompasses:</p>\n<p>• shared resources like the (rapidly growing) bioRXiv preprint server<br />\n• articles like the bioRXiv preprints &#8220;Predicting binding free energies: Frontiers and benchmarks&#8221; (doi:10.1101/074625) and &#8220;Two-Dimensional NMR Lineshape Analysis&#8221; (doi:10.1101/039735)<br />\n• research collaborations like the Drug Design Data Resource (D3R)<br />\n• retrospectives and roadmaps like Cathy Peishoff&#8217;s &#8220;Computational chemistry looking forward: How can we as a community improve our field?&#8221; (2016)</p>\n<p>When we read the above quantum iatromechanical works in parallel with quantum celerity works&nbsp;&mdash; in parallel with, for example, the Martinis Group&#8217;s preprint (which is wonderful as it seems to me) &#8220;Characterizing quantum supremacy in near-term devices&#8221; (arXiv:1608.00263v2)&nbsp;&mdash; the fundamental similarities are more striking (to me) than the fundamental differences.</p>\n<p>On the other hand, &#8220;It is difference of opinion that makes horse races&#8221;, and perhaps the most pronounced contrast between the quantum celerity literature and the quantum iatromechanical literature is the role of noise.  </p>\n<p>In the quantum iatromechanical literature noise is no &#8220;<i>Dreckeffect</i>&#8221; in which &#8220;<i>soll man nicht w&uuml;hlen&#8221;</i>&#8221; (after Wolfgang Pauli), but rather is &#8220;the ever flowing source of all that&#8217;s good and the&nbsp;cure of&nbsp;all&nbsp;ills&#8221; (after Karl Marlantes)&nbsp;&hellip; as far as efficient quantum simulation is concerned, anyway!&nbsp;🙂</p>\n<p>This contrasting view of noise can be summarized in two iatromechanical postulates (the first one weak and the second one stronger)</p>\n<p><b>The weak postulate of quantum iatromechanics</b>&nbsp; <i>All&nbsp;naturally evolved biological processes can be simulated efficiently by classical computing resources</i></p>\n<p>Here the feasibility of iatric simulational efficiency is computationally ascribed (consistent with quantum orthodoxy) to the noisy vacuum of a liquid-water environment.</p>\n<p><b>The strong postulate of quantum iatromechanics</b>&nbsp; <i>All&nbsp;technologies that can be feasibly constructed by evolved biological organisms&nbsp;&mdash; as contrasted with hypothetical </i><i>gedankentechnologies</i>&nbsp;&mdash; can be simulated efficiently with classical computing resources</p>\n<p>Here the feasibility of universal simulational efficiency is computationally ascribed (consistent with quantum orthodoxy) to the noisy vacuum of quantum electrodynamics; this strong postulate is simply the Extended Church-Turing Thesis (ECT), expressed in iatromechanical/Kalai-compatible terms.</p>\n<p>Obviously, much more could be said&nbsp;&mdash; indeed many books can be and are being written&nbsp;&mdash; regarding the entangled relation of quantum celerity to quantum iatromechanics&nbsp;&hellip; and fortunately for young researchers especially, the entangled <i>querencias</i> of arXiv preprints and bioRXiv preprints are alive with people exploring and sharing these wonderful&nbsp;ideas!&nbsp;🙂</p>\n]]>", "author": "John Sidles", "published": "2016-10-27 09:23:15+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>I&#8217;m wondering whether one can precisely define the parameters for a &#8220;fair&#8221; demonstration of quantum supremacy. It wouldn&#8217;t do to compare the quantum circuit to a simulation running on a laptop. It would also be unfair to pit the quantum circuit against the best supercomputer we have.</p>\n<p>Maybe one could say that if the quantum circuit solves in 1 day a problem that takes 1 month to be solved in some dedicated classical hardware of comparable cost, quantum supremacy is convincingly demonstrated?</p>\n]]>", "author": "Mateus Arajo", "published": "2016-10-27 13:07:12+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>For what it&#8217;s worth, I like &#8220;quantum celerity&#8221;. But maybe that something you should post on Preskill&#8217;s blog?<br />\n <a href=\"https://quantumfrontiers.com/author/preskill/\" rel=\"nofollow\">https://quantumfrontiers.com/author/preskill/</a></p>\n]]>", "author": "Jay", "published": "2016-10-27 13:18:13+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Jay, I have posted the suggestion <i>supremacy</i>-><i>celerity</i> to John Preskill&#8217;s <i>Quantum Frontiers</i> weblog, as a comment that concludes:<br />\n<blockquote>Please let me express too, my boundless admiration of, and my personal gratitude for, the on-line cnotes (and textbook-draft) for CalTech&#8217;s course &#8220;<a href=\"http://www.theory.caltech.edu/people/preskill/ph229/\" rel=\"nofollow\">Ph219/CS219 Quantum Computation</a>&#8220;, that you and Alexei Kitaev have been teaching for the past decade.  Not very many physics textbooks deserve to be called &#8220;historic&#8221;, but this one (I think) will qualify.</p></blockquote>\n<p>I&#8217;m posting this comment here, mainly because the Preskill/Kitaev course-notes are an excellent resource for students, but also because it&#8217;s not entirely clear (to me) whether Preskill&#8217;s 2012 &#8220;Supremacy Now&#8221; blog-essay is still accepting comments (the most recent previous comment dates back to 2012).</p>\n]]>", "author": "John Sidles", "published": "2016-10-27 19:07:24+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>An experimental demonstration of what is infelicitously called quantum supremacy (I prefer &#8220;classical retardation&#8221;) would be way less earthshaking than the Higgs boson.  It would be much more like the experimental demonstrations of Bell and CHSH violations:  a validation of what we have every right to expect, based on the unblemished success of quantum theory so far.  Discomfiting an annoying rear guard who feel, for no good reason they can name, that quantum computers gotta not work is less important than making a real scientific discovery like the Higgs.  As I believe you have already emphasized, it is the opposite outcome&#8212;the discovery of some fundamental breakdown of quantum mechanics (e.g. by nonlinearity, physical collapse, etc) that prevents quantum computers from working as advertised&#8212;that would be earthshaking.  And speaking of preventing something from working, I think that someone who uses language as carefully and effectively as you should eschew the biz-speak barbarism of using &#8220;showstopper&#8221; to mean an obstacle or roadblock, the opposite of its original theatrical meaning.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bennett:Charles_H=.html\">Charles H. Bennett</a>", "published": "2016-10-27 20:57:46+00:00", "title": "By: Charles H. Bennett"}, {"content": "<![CDATA[<p>Charles #24: The trouble with that argument is that physicists <i>also</i> had every right to expect the Higgs to be there.  Granted, they weren&#8217;t quite as certain of that as they are of QM, and there was one parameter (the mass) that was genuinely unknown.  But finding the Higgs had a broadly similar character as experimental demonstrations of QM, in that anything <i>other</i> than the sought-after phenomenon would&#8217;ve been a tremendously greater scientific surprise than the phenomenon itself.</p>\n<p>As for &#8220;showstopper,&#8221; <a href=\"https://en.wiktionary.org/wiki/showstopper\" rel=\"nofollow\">Wiktionary</a> gives me the following:</p>\n<ul>1. A performance or segment of a theatrical production that induces a positive audience reaction strong enough to pause the production.<br />\n2. Any impediment that prevents all further progress; especially a software bug that must be fixed before any further development is possible.<br />\nUsage notes<br />\nAmbiguous connotation, depending on context: very good or very bad.</ul>\n<p><a href=\"http://www.merriam-webster.com/dictionary/showstopper\" rel=\"nofollow\">Merriam-Webster</a> also gives the sense that I used.</p>\n<p>But, OK, I&#8217;ll duly note that even though I&#8217;ve got the dictionaries on my side, there are people who get annoyed by the use of &#8220;showstopper&#8221; to mean &#8220;obstacle&#8221; or &#8220;roadblock,&#8221; and I&#8217;ll substitute a different word whenever I remember to.</p>\n]]>", "author": "Scott", "published": "2016-10-27 21:28:01+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>John Sidles #20: Being a language aficionado, I hope you won&#8217;t mind if I contact you for advice on some names I have coined (w.r.t. representation of uncertainty in data, propagation of uncertainty in calculations). Choosing names for new concepts is a tricky business.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-10-28 03:45:03+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Hi Charles, everybody,</p>\n<p>Greetings from Tel Aviv, it could be useful to give a brief account of my view on the matter (representing my work of the last decade or so).</p>\n<p>A) Noisy quantum circuits with the standard modelling of noise and noisy BosonSampling represent a very low-level (or &#8220;retarded,&#8221; if you prefer) computational power.</p>\n<p>B) In the small scale, this very low-level computational power cannot support quantum supremacy and cannot support quantum error-correction of the quality needed for quantum fault-tolerance.</p>\n<p>C) This deems both quantum supremacy and quantum fault-tolerance impossible at all scales. It also leads to interesting consequences for modeling noisy quantum systems in the large scale.</p>\n<p>You can read more about it in my <a href=\"http://www.ams.org/journals/notices/201605/rnoti-p508.pdf\" rel=\"nofollow\">Notices AMS paper &#8220;The quantum computer puzzle,&#8221;</a>  its <a href=\"https://arxiv.org/abs/1605.00992\" rel=\"nofollow\">expanded version on the arXive</a>, and, regarding BosonSampling,  my paper with Guy Kindler &#8220;<a href=\"https://arxiv.org/abs/1409.3093\" rel=\"nofollow\">Gaussian noise sensitivity and BosonSampling</a>.&#8221; Item B) is coming now to test in the various experimental efforts to demonstrate &#8220;quantum supremacy&#8221; (that Scott talked about above) and efforts to demonstrate high quality encoded qubits.</p>\n<p>In my view, a failure of &#8220;quantum supremacy&#8221; and &#8220;quantum fault-tolerance&#8221; is indeed an important possibility with important consequences! However, this failure <em>does not</em> account for some fundamental breakdown of quantum mechanics. Rather, &#8220;quantum supremacy&#8221; is an artifact of an incomplete account of the locality principle in the model of quantum circuits (and the other models Scott considered).</p>\n<p>Of course, you need to account for locality because otherwise it is very easy to devise quantum evolutions (or even classical evolutions) that takes you directly from the question to the answer for computationally intractable problems. The standard noise model for quantum circuits does lead to an appropriate modeling of locality, but people overlooked the multi-scale analysis required for fully understanding this model.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2016-10-28 08:49:13+00:00", "title": "By: Gil Kalai"}]