[{"content": "<![CDATA[<p>I had to put it into <a href=\"https://www.wolframalpha.com/input/?i=G(d)+%3D+-39+*+log92(d%2F0.005)+%2B+36\" rel=\"nofollow\">Wolfram</a></p>\n]]>", "author": "Evgeniy", "published": "2016-08-06 22:44:45+00:00", "title": "By: Evgeniy"}, {"content": "<![CDATA[<p>I don&#8217;t know about wires, but with shotgun bores it&#8217;s like this: A 10ga bore indicates that it takes 10 solid lead spheres of that diameter to make a pound. So a 2ga bore would be shooting half-pound slugs, for example.</p>\n]]>", "author": "Hayden Jones", "published": "2016-08-06 23:37:25+00:00", "title": "By: Hayden Jones"}, {"content": "<![CDATA[<p>Slugs? Now we&#8217;re cooking with gravity. I&#8217;ll take my steak cut 1/12 the thikness of of a dead kings foot please.</p>\n]]>", "author": "Justome Guy", "published": "2016-08-07 04:46:28+00:00", "title": "By: Justome Guy"}, {"content": "<![CDATA[<p>Related to music theory, a more commonly known logarithmic scale is the decibel loudness scale which describes ratios of power (or similar quantities). The bel represents a ratio of 10, and therefore decibel represents a ratio of \\(\\sqrt[10]{10}\\), which conveniently is approximately \\(\\sqrt[3]2\\).</p>\n<p>These logarithmic scales provide a nice way to work with logarithms without actually doing the logarithm calculation. For instance, the equitempered semitone scale gives a nice way to approximate products of some fractions with small numerators and denominators, which works by approximating ratios of logarithms of these fractions by fractions. (Whoa.) There are scales with 31 tones per octave, but I don&#8217;t think 39th roots will make any easier for composers to find harmonies.</p>\n]]>", "author": "kktkkr", "published": "2016-08-07 06:13:22+00:00", "title": "By: kktkkr"}, {"content": "<![CDATA[<p>I&#8217;m a piano tuner, and reading through the first section I was struck by the realisation that this is the second high-order root that I&#8217;ve encountered to do with pianos. Piano wire of course uses the AWG system with steel, with a smooth progression from about 14 gauge at the top down to about 21 gauge towards the bottom before the strings start getting wrapped in copper to add mass, including half gauges.</p>\n<p>So I was pleased to see you describe the 12-ET tuning system. I felt special enough just knowing I worked with the 12th root of 2 in my daily life, now I know I also work with the 29th root of 92!</p>\n]]>", "author": "Phil", "published": "2016-08-07 14:11:26+00:00", "title": "By: Phil"}, {"content": "<![CDATA[<p>Also a log rule with &#8220;prefered numbers&#8221; (or Renard numbers) : <a href=\"https://en.wikipedia.org/wiki/Preferred_number\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Preferred_number</a></p>\n]]>", "author": "bedouinfou", "published": "2016-08-07 20:36:17+00:00", "title": "By: bedouinfou"}, {"content": "<![CDATA[<p>Since a pound is legally defined as 0.45359237 kg, we can leave gravity out of it. (But my car <em>does</em> get 40 rods to the hogshead, and that <em>is</em> the way I likes it.)</p>\n]]>", "author": "Austin", "published": "2016-08-07 22:07:53+00:00", "title": "By: Austin"}, {"content": "<![CDATA[<p>Thanks much for this! I am delighted to learn about &#8220;preferred numbers.&#8221; The Wikipedia article mentions several pertinent examples, such as resistor values, as well as <em>f</em>-stops and film speeds in photography. And the references include a link to a 1978 technical report from the National Bureau of Standards that has much more background and commentary, such as this:</p>\n<blockquote><p>The need for a systematic method to cover a range with the fewest terms first occurred to the French engineer Colonel Charles Renard (1849-1905), between 1877 and 1879, when he made a rational study of the elements necessary in the construction of captive balloons. He found that 425 different sizes of cable were used for mooring purposes and, in working on various systems for the reduction of this variety, he finally developed a sizing system based upon a geometric series of values for mass per unit length, which only required 17 cables to cover the total range.</p></blockquote>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2016-08-08 18:36:40+00:00", "title": "By: Brian Hayes"}]