[{"content": "<![CDATA[<p>Donated &#8211; thanks for the post and the donation link.</p>\n<p>This not about being a sore loser (although that&#8217;s exactly what I am). If it only discourages future efforts to hack votes (due to the possibility of being found out by audits) it seems worth doing to me.</p>\n]]>", "author": "JimV", "published": "2016-11-24 18:50:45+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>Jonas #30: Of course, eventually reality will pop the bubble, as it always does.  But if I don&#8217;t create at least a temporary bubble, then I won&#8217;t be able to go on with life.</p>\n<p>And believe me: even before Trump, I had wondered about the morality of bringing kids into a world with so much horribleness, and which shows every sign of heading toward an environmental cataclysm.  But then I thought about the game theory: if every decent person reasons that way, then only horrible people will have kids, and they&#8217;ll instill horrible values in them, and the horrible will inherit the earth.  I hope to raise Lily, and whatever future kids I have, into people who can make a positive contribution, standing up for the values of reason, enlightenment, etc even if (as I expect) there are very dark times ahead.</p>\n]]>", "author": "Scott", "published": "2016-11-24 18:54:50+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>DPRA doesn&#8217;t really sound fancy enough for that crowd.</p>\n<p>As for the projecting: it&#8217;s a standard abusive-guy technique, and as soon as I watched him going at HRC in the second debate, I thought, holy shit, pay attention to whatever he accuses her of, because that&#8217;s what he&#8217;s doing. So I started wondering about the election as soon as &#8212; from nowhere &#8212; he started talking about the election&#8217;s being rigged. It&#8217;s the kind of accusation that makes the other party crazy, because it sounds completely crazy, and then the focus is on proving that you&#8217;re innocent of this crazy thing. Of course you&#8217;re innocent of this crazy thing: it&#8217;s meant to be a distraction and an offensive move. </p>\n<p>And as the results came in I also started worrying that he had a guy like Thiel on his team, because some weeks earlier I&#8217;d thought, &#8220;You know, a guy like this doesn&#8217;t just drop some money and go home. This guy plays to win.&#8221; But all you heard about was dropping some money, cryptically defending the choice, and going home. And I thought, something&#8217;s not right there.</p>\n]]>", "author": "amy", "published": "2016-11-24 18:59:07+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Can foreigners donate to the recount effort?</p>\n]]>", "author": "Jr", "published": "2016-11-24 19:04:24+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Jr #35: Good question.  If not, then presumably the website will say something to prevent you from doing it.</p>\n]]>", "author": "Scott", "published": "2016-11-24 19:16:47+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, I believe that Alex&#8217;s research is important and should inform both voting technology and audit strategy in all elections.<br />\nIf evidence is found of fraud or hacking then it should be thoroughly investigated.<br />\nBut tying these issies to this election only makes the CS researchers seem partisan and makes it less likely to get bipartisan support for such efforts. </p>\n<p>Anyway, happy thanksgiving, and lets hope that Donald Trump turns out not as terrible as we both fear.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barak:Boaz.html\">Boaz Barak</a>", "published": "2016-11-24 19:21:34+00:00", "title": "By: Boaz Barak"}, {"content": "<![CDATA[<p>Scott #25: I think we basically agree on most points. Yes, recounts should happen automatically, and yes, even if they don&#8217;t, a recount should certainly happen in this election, and yes, I think the stakes are higher in this election than in others.</p>\n<p>The only thing I think we disagree about is whether &#8220;democrats&#8221; still need to preserve credibility, or whether Donald Trump&#8217;s actions have made that either unnecessary (because he&#8217;s so &#8220;bad&#8221;), or because his actions have proven that it doesn&#8217;t matter anyway.</p>\n<p>I think we shouldn&#8217;t mix up Trump the candidate, and *some* of  the groups that were pro-Trump, with the majority of the population. I think plenty of people are &#8220;reasonable&#8221;, or at least persuadable. Lots of people really, honestly believed that Trump and Clinton were comparably bad. Trying to reach out to these people and proving &#8220;our&#8221; side is the right thing to do. And while I agree that President Trump raises the probability of &#8220;dark times ahead&#8221;, it&#8217;s not 100% &#8211; we do need to care about the case where Trump is more-than-averagely bad, but is not so terrible that he destroys American democracy itself, in which case replacing him in 4 years is the &#8220;easy&#8221; way to get rid of him. For that, you need credibility</p>\n<p>Note: I don&#8217;t live in the States, so I&#8217;m guessing about how &#8220;average people&#8221; feel, on both sides, mostly based on online conversations and reading.</p>\n]]>", "author": "Edan Maor", "published": "2016-11-24 19:47:47+00:00", "title": "By: Edan Maor"}, {"content": "<![CDATA[<p>Boaz #37: I&#8217;ll give thanks for life, health, family and friends, the warm welcome we received from so many in Austin, and the millions of decent people who&#8217;ve stood up against autocrats now and in the past, who often lost but (incredibly) sometimes won.  And I&#8217;ll express a hope: that as long as I live, I never be placed into any position where I &#8220;need to appear non-partisan,&#8221; or speak for any entity other than myself.  Let that be left to those who are able! 🙂</p>\n]]>", "author": "Scott", "published": "2016-11-24 20:03:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Maybe now that *both* sides are calling the election &#8220;rigged&#8221;, we could, *after* the whole recount brouhaha blows over, finally get some concerted action to improve the reliability of the process?  Any idea how to seed that now, while people are riled up, so that it doesn&#8217;t get forgotten when the urgency goes away?</p>\n]]>", "author": "David Karger", "published": "2016-11-24 21:14:47+00:00", "title": "By: David Karger"}, {"content": "<![CDATA[<p>Edan #38: that&#8217;s simply madness. Trump &#8212; even if you ignore his entire history before the race &#8212; spent nearly two years attacking immigrants, Mexicans, women, black people. Threatening people left and right with jail, attacking journalists. To great hurrahs. In public, broadcast to all, inescapable unless you were in a complete media blackout. Voting for Trump meant deciding that none of that really mattered, that a guy like that would make a fine president anyhow. There is no other way to put it.</p>\n]]>", "author": "amy", "published": "2016-11-24 21:51:33+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Obama lost taxs by 1.2 million votes while Clinton only lost by 800000 votes.</p>\n<p>Clinton had more margin in California than Obama.</p>\n<p>Inspite of these Trump had more votes in 48 states than Clinton.</p>\n<p>I think this is highly unlikley.</p>\n<p>Any statisticians here to calculate the likelihood?</p>\n]]>", "author": "A", "published": "2016-11-25 03:19:03+00:00", "title": "By: A"}, {"content": "<![CDATA[<p>Edan #38, have to fully concur with amy on this, I don&#8217;t think you have any idea what kind of &#8220;political culture&#8221; Trump unleashed on America.</p>\n<p>Go to a site like zerohedge.com that until recently was mostly hardcore libertarian, focused on market analytics. The comment sections there have been taken over by people who blatantly advocate Nazism. And I mean the hardcore variant. I.e. Poland provoked Hitler into the war, and it was all a Jewish conspiracy to begin with.</p>\n<p>I noted that this kind of thinking gained credence on some investment related sites even before Trump. But only now has the scope of this movement become apparent. </p>\n<p>If you aren&#8217;t frightened than you aren&#8217;t paying attention.</p>\n]]>", "author": "quax", "published": "2016-11-25 05:09:20+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>@A- Trump had more votes in THIRTY states than Clinton.</p>\n]]>", "author": "Michael", "published": "2016-11-25 16:30:14+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Nate Silver Tweeted &#8220;Not saying this Jill Stein thing is a scam, but if it were a scam, it would probably look a lot like this.&#8221;<br />\n<a href=\"https://twitter.com/NateSilver538/status/802200073375510529\" rel=\"nofollow\">https://twitter.com/NateSilver538/status/802200073375510529</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Miller:James.html\">James Miller</a>", "published": "2016-11-25 18:34:26+00:00", "title": "By: James Miller"}, {"content": "<![CDATA[<p>James #45: My understanding is, they&#8217;re going to go to judges in Wisconsin, Pennsylvania, and Michigan within the next few days and request recounts.  If the judges invent some ground to deny the requests, then they&#8217;ll donate the money to election integrity efforts.  This is a pretty specific promise, testable within the next week.  If it didn&#8217;t happen, I&#8217;d consider myself to have been defrauded, and would be glad to join a class-action suit against the Stein campaign.</p>\n]]>", "author": "Scott", "published": "2016-11-25 19:52:54+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>quax #43 &#8212; I always thought zerohedge was just one corner of it, and I spent years yelling about the organizing platform sites like reddit and twitter and even fb were becoming for neo-Nazis, essentially. Always got shouted down by the free-speech-fundamentalist SV guys who had trouble imagining themselves vulnerable to anything. It&#8217;s why I thought it was so bizarre that the people calling for YC to disassociate itself from Thiel were upset by him: they were perfectly fine with the openly misogynist white-supremacy stuff on reddit, and tended to switch tracks in what I thought was a weird rhetorical move if you criticized its burgeoning white-supremacist mode: talking as though it was a therapeutic matter and that the victims had some sort of private feeling of being misunderstood. Very weird in an Esalen mode. You wonder where the hell their line was if Thiel suddenly set them off. </p>\n<p>I did at one point try to get SPLC engaged in it, but they had no idea how to go at the problem with lawyers, so they just left it alone.</p>\n]]>", "author": "amy", "published": "2016-11-25 22:18:03+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Reporting once again from the formerly progressive upper midwest, where Christian rock and Christian manliness married to Babbittry are once again in vogue on campus: I think this article&#8217;s probably the clearest speech I&#8217;ve heard so far on the &#8220;try to understand&#8221; impulse. And, as someone who grew up with one foot in an Orthodox Jewish community, I can vouch for its accuracy about fundamentalisms more generally. </p>\n<p><a href=\"http://www.alternet.org/election-2016/rural-america-understanding-isnt-problem\" rel=\"nofollow\">http://www.alternet.org/election-2016/rural-america-understanding-isnt-problem</a></p>\n]]>", "author": "amy", "published": "2016-11-25 22:31:28+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>@Michael </p>\n<p>Obama in 2012 led by 5 million votes overall. Since CA he led by 3 million and TX he lost by 1.25 million in remaining 48 states he led by 3.25 million.</p>\n<p>Clinton in 2016 leads by 2.1 million votes overall. Since CA she leads by 3.8 million and TX she lost by 0.8 million in remaining 48 states she is losing by 0.9 million votes.</p>\n<p>This is a swing of 4.15 million. </p>\n<p>Population that voted for the two parties in remaining 48 states in 2012 is 106 million while population that voted for the two parties in remaining 48 states in 2012 is same at 106 million.</p>\n<p>You are looking at a 4% shift when the incumbent party is sound economically. There was not this much pickup in white vote. This was my point. I may very well be very wrong.</p>\n]]>", "author": "A", "published": "2016-11-25 22:58:53+00:00", "title": "By: A"}, {"content": "<![CDATA[<p>Jr #35: Unfortunately not. Only after you&#8217;ve filled your personal details, the web form reveals the Contribution Rules, #1 of which is that you must be either a U.S. citizen or a lawfully admitted permanent resident of the United States.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kiviranta:Mikko.html\">Mikko Kiviranta</a>", "published": "2016-11-25 23:21:36+00:00", "title": "By: Mikko Kiviranta"}, {"content": "<![CDATA[<p>amy #47: If the problem is just that white supremacists can use Facebook and Twitter and Reddit to organize the same way anyone else can use them, then I don&#8217;t see any remedy for the problem that&#8217;s compatible with a free society.  Yes, we could&#8217;ve pressured Facebook to do better with its news algorithm, and other voluntary interventions around the edges, but the main we need to do (or rather&#8212;needed to have done, now it&#8217;s probably too late) is to prevent these people from gaining political power.  Maybe I&#8217;m wrong, but I don&#8217;t see that hate speech laws in Europe have done much to arrest the growth of far-right nationalist parties there&#8212;on the contrary, such parties feed off censorship; it&#8217;s part of their ammunition.</p>\n<p>Maybe someday, someone will create an epistocracy that could serve as a better line of defense against takeovers by the know-nothings.  Failing that, the only thing I see to do is fight for more and better democracy (no Electoral College, selective disenfranchisement of minorities, etc), which also would&#8217;ve kept Trump out of power in this election, and Bush out of power in 2000.  And if democracy really does lead (as it can) to a clear majority deciding that the country should have no place for Jews, Muslims, Mexicans, etc&#8212;in that case, what becomes most important is that the targeted populations have some other country to flee to.  If their leaving contributes to impoverishing the country that expelled them, so much the better.</p>\n]]>", "author": "Scott", "published": "2016-11-26 01:26:11+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>hey scott agree with you that this is a highly troublesome election both in the result and the possibility of &#8220;irregularities&#8221;. am frustrated that in our supposedly advanced/ leading democracy we are still left to wring our hands and be a bit paranoid over whether votes are getting counted accurately. it seems sometimes election boxes are also the ultimate in &#8220;black boxes&#8221;. am really wishing maybe there were some improvements that could be made with technology eg cryptographic systems in particular. and what do you think about all the so-called &#8220;fake news&#8221; circulating on facebook? is russia involved? decided to write it all up in a blog with lots of research/ links & hope concerned others will drop by.</p>\n<p><a href=\"https://vzn1.wordpress.com/2016/11/25/fake-news-in-election-cybersec-facebook-social-media/\" rel=\"nofollow\">https://vzn1.wordpress.com/2016/11/25/fake-news-in-election-cybersec-facebook-social-media/</a></p>\n]]>", "author": "vzn", "published": "2016-11-26 01:13:28+00:00", "title": "By: vzn"}, {"content": "<![CDATA[<p><i>Maybe I’m wrong, but I don’t see that hate speech laws in Europe have done much to arrest the growth of far-right nationalist parties there.</i></p>\n<p>The problem is that much to the frustration of German politicians Facebook has pretty much ignored the German hate laws. Merkel even brought it up in person with Zuckerberg to no avail. And now he is sued over it:</p>\n<p><a href=\"http://www.politico.eu/article/facebook-boss-mark-zuckerberg-sued-over-hate-speech/\" rel=\"nofollow\">http://www.politico.eu/article/facebook-boss-mark-zuckerberg-sued-over-hate-speech/</a></p>\n]]>", "author": "quax", "published": "2016-11-26 02:19:59+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Scott#52/amy#47:  I think there is a deeper problem than just the internet giving white supremacy an easy way to organize.  Positive organization and positive contributions are difficult to achieve, even with the internet, but inherently destructive movements become far easier.  Whoever the groups were that spent the past 2 years stirring up hatred and making the internet increasingly vitriolic, the web&#8217;s anonymity and relative lack of consequences make their job far easier than the job of groups that encourage civil discussion.  Hate speech is just one particularly nasty face of this tendency for netizens to tear things down.  Online shaming campaigns(*) are another aspect of this, as are a lot of &#8220;popular revolution&#8221; or &#8220;spring&#8221; movements across the world.</p>\n<p>With suggestions of foreign hacking thrown into the mix, it&#8217;s starting to seem like the internet is turning into an incredibly effective way to destabilize states and turn neighbors against each other.  I do not know how to reverse this trend, and it seems like it will only get worse since there&#8217;s no way to stop the breakneck pace of technological progress.  We need more of these silicon valley geniuses (and more of the SV middle-of-the-line folks too!) to think about about and work on mitigating this problem, but without a major economic incentive, I just don&#8217;t see it happening.</p>\n<p>(*)  I&#8217;m a first time poster here, but Scott&#8217;s shy nerd blog post really hit home with me when I read it years ago.  I&#8217;ve been in a great place in life for the past few years, but there was a time when I felt very very similar.  The shaming campaign that followed seriously harmed my image of and willingness to join parts of the progressive movement.  I&#8217;m glad to see Scott made it through okay.</p>\n]]>", "author": "OiledGuruLyle", "published": "2016-11-26 02:20:17+00:00", "title": "By: OiledGuruLyle"}, {"content": "<![CDATA[<p>I 100% agree to a recount, for the non-conspiracy reasons stated.<br />\nI 100% agree that we should be checking to see to what extent Russia hacked whatever.<br />\nI think that Electors have the right to be unfaithful.<br />\nI think that Trump has the right to not promise anything before knowing what&#8217;s going to happen (RE: the election results).</p>\n<p>From all accounts, the previous 4 elections had obvious election rigging, and this election does not have obvious election rigging.  If there was election rigging, it&#8217;s subtle.  We know for a fact that Hillary&#8217;s team rigged the DNC primaries, so I was expecting a lot of obvious rigging in Hillary&#8217;s favor.  Like, for example, on the first day of early voting in Texas, where the voting machines had to be replaced with paper ballots in some counties because they were clearly rigged in Hillary&#8217;s favor.  After that event, I didn&#8217;t find any other instances of obvious rigging.</p>\n<p>I think this is the least-rigged election in 20+ years, and I think the reason this is the least rigged election in 20+ years is because: 1) Leftist media was f*ing stupid in their analysis of the polls, which made Hillary think she was going to win in a landslide; and 2) Trump called out the possibility of election rigging before the election, which made it more difficult to rig.</p>\n<p>I&#8217;m not going to donate to a recount because I think this case will cause the opposite of my desired result of a recount: to set the precedent of always doing a recount.<br />\nI think this because the people trying to push for a recount this time are reactionary people who would have demonized Trump for pushing for a recount if the roles were reversed.  Reactionary people set a negative precedent.</p>\n<p>Still, I agree with the concept of a recount, and I wish Jill Stein luck in getting a recount to happen.</p>\n]]>", "author": "Elliott", "published": "2016-11-26 02:40:58+00:00", "title": "By: Elliott"}, {"content": "<![CDATA[<p>Given that Democrats don&#8217;t have the power to amend the constitution to get rid of the anachronistic electoral college system, one non-hypothetical debate they&#8217;ll need to have before 2020 is whether to make their presidential primary a national popular vote among registered party members. The disadvantage would be tipping the scales in favor of contenders able to raise money for national advertising rather than grassroots support and town hall campaigning in Iowa and New Hampshire, but the advantage would be more democracy (no superdelegates or caucuses that disallow secret ballots).</p>\n]]>", "author": "BPP = NEXP", "published": "2016-11-26 03:54:06+00:00", "title": "By: BPP = NEXP"}, {"content": "<![CDATA[<p>For anyone who thinks recounts never change anything, there is the fun example of the 2004 Washington state governor&#8217;s race.    See the <a href=\"https://en.wikipedia.org/wiki/Washington_gubernatorial_election,_2004\" rel=\"nofollow\"> Wikipedia article</a> about the race.</p>\n<p>This was a difference of only a few hundred votes out of 2.7 million but it included a batch of a few hundred ballots discovered as uncounted during the original tally and a final manual count (on top of an electronic recount) that increased the total tallies for the candidates by over 4000 votes.   That&#8217;s roughly .15% of the original vote total.</p>\n<p>The vote total was pretty close to the total this time in Wisconsin and it could give some estimate of the kinds of differences that we could expect when recounts happen and it is a lot less than the nearly 74000 vote swing needed to change the outcome there.  (That would require many more uncounted ballots than the margin &#8211; the 2004 example of 4000 uncounted votes  yielded only around a 400 vote swing.)</p>\n<p>That all being said, the process of counting carefully certainly gives impetus to &#8220;improve&#8221; processes even if they don&#8217;t change outcomes.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Beame:Paul.html\">Paul Beame</a>", "published": "2016-11-26 08:50:36+00:00", "title": "By: Paul Beame"}, {"content": "<![CDATA[<p>Scott #52, if men were debate-club angels, I&#8217;d shrug and say &#8220;of course&#8221; to radical free speech in societies. But they aren&#8217;t: they&#8217;re on the whole not particularly thoughtful, they&#8217;re frequently dishonest, they&#8217;re not good with numbers and abstractions, and they like to shout in mobs, and then they get tired of just shouting. So I think it is good societal housekeeping to do one&#8217;s best to reduce the frequency of angry little nucleating phrases by keeping them marginalized and sounding not-done, not-like-us, to most of society. Earnest argument will not keep them marginalized, but I think the law, abetted by the schools, actually did a nice job of it in Germany before online life began for most.</p>\n<p>We were like that 20 years ago, and then tens, hundreds of millions of us in the US went to live in an online cesspool, which started out shocking, and then wasn&#8217;t. And now we have Nazis congregating in a federal building and sieg-heiling their freshly elected leader. </p>\n<p>Even now, if the major social-networking sites had people at the top who had their backgrounds in government, political science, sociology, history, rhetoric &#8212; rather than tech, tech, tech and fealty to highly naive, even adolescent notions of how societies work and ought to work &#8212; they could fix the problem that&#8217;s just been noticed: the swamping of news by propaganda. The web was custom-built for propaganda (I&#8217;ll repost here something I wrote about this a year or so ago), but it&#8217;s something that can also be shut down algorithmically &#8212; if the site owners are willing to do it.</p>\n<p>And they&#8217;re not.</p>\n<p>Because revenue, and because historical and governmental illiteracy, and because of this naive and inflexible notion that the highest good is total speech freedom, even as society falls apart under the weight of propaganda and the voice of actual news and thought is smothered. </p>\n<p>Or, as TMBG put it: &#8220;I should be allowed to glue my poster, I should be allowed to think.&#8221;</p>\n<p>Meaning that the best reddit will do is see its CEO surreptitiously editing posts that attack him personally.</p>\n<p>I would be very grateful if the grownup schoolmaster returned to the island now to bring the boys back to school.</p>\n]]>", "author": "amy", "published": "2016-11-26 16:45:10+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>amy #58: If there were ever a legitimate reason to restrict freedom of political speech, preventing racist demagogues from taking control of a country (and then, among other things, curtailing freedom of speech) would surely be it.  But I&#8217;m still not convinced.  For me, the fundamental problem is that I don&#8217;t trust the people who would get to decide what&#8217;s hate speech and what isn&#8217;t.  A case in point: you mentioned the SPLC in one of your previous comments.  To me, the SPLC is a perfect example of an organization that accumulated enormous goodwill and credibility, then squandered it all by choosing to designate as &#8220;hate speech&#8221; things that probably the majority of reasonable people wouldn&#8217;t classify as anything close to that: e.g. they condemned Ayaan Hirsi Ali, who I consider a human rights heroine, as well as guys publishing &#8220;how to get laid&#8221; guides and silly stuff like that.  It seems to me that this creeping expansion in what counts as &#8220;hate speech&#8221; is a perfect example of what provokes a militant overreaction from the other side&#8212;yet in the sort of regime you&#8217;re talking about, I would have no idea how to prevent such an expansion.</p>\n]]>", "author": "Scott", "published": "2016-11-26 19:27:09+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>@Amy- the problem with censorship is that it depends on whose ox is being gored. Take those European &#8220;hate speech&#8221; laws that you&#8217;re defending- many of those countries with such laws didn&#8217;t have any laws against excusing or denying Communist crimes. In the Ake Green case, a pastor was tried for preaching more or less standard Pentecostal doctrine about homosexuality in Denmark and embarrassingly it turned out that there was no ban in Denmark on excusing Stalinist or Maoist crimes. Yes, he won on appeal but the fact that many left-wingers in Denmark thought that Pentecostalism is worse than Stalinism or Maoism speaks for itself.<br />\nIn the United States, people like the Hollywood Ten are often thought of as martyrs to free speech but the fact of the matter is that they did often deny or excuse Stalin&#8217;s crimes. And they did demonize the victims. DuBois, for example, referred to the kulaks as &#8220;bloodsuckers&#8221;.<br />\nWhat you&#8217;re conveniently forgetting about the world 20 years ago before the internet is that the marginalization of misogynistic, racist, etc. views came at a price. There might have been no misogynist websites blaming women for men&#8217;s dating problems, for example, but adult male virgins were also left to feel like they were the only ones-that they were freaks.<br />\nThink about your initial conversation with Scott- the lesson was that society&#8217;s unwillingness to discuss difficult problems because the conversation becomes &#8220;creepy&#8221; often hurts the innocent.</p>\n]]>", "author": "Michael", "published": "2016-11-26 19:14:18+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Scott #58: Broadly, first: There is always a slippery slope. Always. Because polities are about accommodations and compromises, not logically coherent anythings. Which is why cleaving to any absolutism, includent speech freedoms, will land you in serious trouble. The same is true when looking at ghastly beliefs: going to the logical endpoint is a mistake. I don&#8217;t, for instance, believe that my near neighbors think I&#8217;d make a nice lampshade. They&#8217;d be appalled by the idea and hurt that I&#8217;d think such a thing of them. But I do believe that there&#8217;s enough baked-in and rather old antisemitism, and nativism, that they&#8217;d be readily convinced that everyone would probably be better off if I was sent to live among my own kind, and that this would allow them to sit by while people who did like the lampshade idea came and collected me. The goal then is to prevent things from aligning such that this scenario becomes a realistic possibility: primarily by making it unlikely that they&#8217;d listen to a word the Nazis said, or that the Nazis would be on the stage in the first place.</p>\n<p>In other words: everything is ad hoc. There&#8217;s just long and short ad hoc.</p>\n<p>Narrowly: I actually told SPLC to go to hell, once upon a time, because it has the same blind spot so many liberal-white-college-guy-hero outfits do: white middle-class women. Their moms and sisters, in other words. There&#8217;s no exoticism to make things heroic with us, no brotherhood of man, no right-side-of-gay-politics, etc. I think it&#8217;s their own sexism at work (and that the same sexism colors their coverage of immigrant women of color and white-supremacy girlfriends). Which is why they were so weird and clumsy when they finally got around to surveying the &#8220;manosphere&#8221; back in 2012, iirc. And why they backed away from such stories again until they were being scooped by the likes of Inc. on Gamergate. But they are the undisputed champs of hate-crime tracking, and as we all know, if it ain&#8217;t documented, it didn&#8217;t happen. (See under NASA, earth science.) So I am very happy to tell people to report incidents to them.</p>\n<p>I was quite happy to see them call out PUA culture, however clumsily &#8212; you may see no harm in what they do, but there was a very popular guy roaming around advocating sexual assault as part of trying to get laid, and the entire culture of it advocates for treating women as objects. Semi-enemy objects, at that. I regret to say that my daughter&#8217;s already running into it, with boys running the numbers, and that nothing&#8217;s changed: a refusal to behave like an object for the boy&#8217;s benefit meets with immediate attacks and nastiness, and then it shuts off as the boy moves on to maltreat other girls. Meanwhile, the girl, trained to be nice and value friendship, tries to repair a friendship that doesn&#8217;t exist.</p>\n]]>", "author": "amy", "published": "2016-11-26 20:23:19+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Michael #59 &#8211; again, if you were looking at this from the perspective of how societies work, rather than &#8220;this, so logically should be that&#8221;, you&#8217;d understand why the hate speech laws covered what they did, and ignored other things.</p>\n<p>It&#8217;s not going to be easy for Christian fundamentalists here to start a religious war, because we have no national history of religious wars. The tropes are not already in us. Few of us have families that knew the religious wars of Europe. It&#8217;s a naive country in that sense. But if they do manage to make one &#8212; a real one, with killing &#8212; we will know, and for generations it will be much easier to make another religious war here. We will already know how it goes, already know the things to say, already know whom to hate, already have vendettas and grievances.</p>\n<p>Stalinism didn&#8217;t happen in Western Europe. Neither did Maoism. If they had, a whiff of it would be enough to alarm, and there would have been hate laws directed at their suppression. Fascism, though, they understand. And religious wars. And the racisms that adhere to colonialism. Those are what the hate laws are about.</p>\n]]>", "author": "amy", "published": "2016-11-26 20:28:38+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>&#8220;includent&#8221;? Sorry. I have no explanation.</p>\n]]>", "author": "amy", "published": "2016-11-26 20:31:34+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Also, that&#8217;s Scott #60, not Scott #58&#8230;.</p>\n]]>", "author": "amy", "published": "2016-11-26 20:32:54+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>@Amy#59- okay but the problem with that reasoning is that it ignores future threats . In Czechoslovakia after the war, there were bans on the fascist parties but not the Stalinist parties. Guess how well that worked out.<br />\nMore to the point, how do you think that a moderate Pentecostal feels knowing that Denmark took more action against his church than a Stalinist or a Maoist? It just radicalizes him further.<br />\nSimilarly, how do you think a Pole feels when the Hollywood Ten are lionized as free speech heroes? And then the same liberals that do that claim that free speech cannot be used as an excuse for hate.<br />\nLeft-wingers are just as bad as right-wingers when it comes to understanding the outgroup:<br />\n<a href=\"http://slatestarcodex.com/2014/09/30/i-can-tolerate-anything-except-the-outgroup/\" rel=\"nofollow\">http://slatestarcodex.com/2014/09/30/i-can-tolerate-anything-except-the-outgroup/</a></p>\n]]>", "author": "Michael", "published": "2016-11-26 21:25:41+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>@Scott#60- you yourself have criticized the PUAs in the past. How is what the SPLC doing anything different. And some of them are definitely hateful, like Roosh:<br />\n<a href=\"https://en.wikipedia.org/wiki/Roosh_V\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Roosh_V</a></p>\n]]>", "author": "Michael", "published": "2016-11-26 21:29:05+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Any consistent laws on hate speech would see the New Testament, The Quran and the Torah made illegal. That this is not advocated, while criticism of religion often gets labeled as hate speech, shows how subjective and malleable the entire concept is.</p>\n<p>Of course, if the US had hate speech laws that would be great for Trump. All the leftists who denounce western culture, and use &#8220;white male&#8221; as practically an insult, could be locked up.</p>\n]]>", "author": "Jr", "published": "2016-11-26 22:26:15+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Scott #60, I think if you go down the road of censorship, the way to keep it in check is to restrict it to broadcast/media amplified speech (i.e. no infringement on private speech whatsoever).</p>\n<p>Also it should only be concerned with the denial of facts (i.e. as usually understood in the scientific sense). E.g. the denial of clearly established historical events such as the Holocaust.</p>\n]]>", "author": "quax", "published": "2016-11-26 23:05:51+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>amy #61: The trouble is that, at least as the world is going to interpret it, condemnation by the SPLC is way too blunt of an instrument.  It has only one mode: &#8220;this is utterly beyond the pale of civilization.&#8221;  There&#8217;s no room to say: &#8220;yes, this woman has said a few things she should probably walk back, but she&#8217;s also risked her life to help women oppressed by FGM and Islamic fundamentalism, so on balance, is a huge net benefit to the world.&#8221;  Or: &#8220;yes, these advice guides have a certain degree of misogyny in them, but alas, there&#8217;s nothing out there today that could actually help these guys that&#8217;s 100% free of misogyny&#8212;whether because no one has cared enough to write it, or simply because it&#8217;s a hard problem that no one has yet solved.  And if guys go through life never learning how to form relationships, that could <i>really</i> make them misogynists.  So, OK guys, go ahead and read anything that might help you&#8212;but read critically and alertly, and never, ever compromise your principles.&#8221;</p>\n<p>This is also my answer to Michael #66, about the difference between me criticizing the PUAs and the SPLC criticizing them: if I do it, it&#8217;s just me; it doesn&#8217;t have the thermonuclear implications of coming from an institution set up to fight cross-burnings and things of that kind.</p>\n<p>As Jr #67 aptly points out, any consistent laws on hate speech would also ban the Bible (and, we could add, Plato, Shakespeare&#8230;)  But once we have tools at our disposal beyond blanket condemnation, the problem is solved: we can criticize the bad parts of Plato, Shakespeare, and the Bible, just as we criticize the bad parts of everything else, without leaving the implication that the offending works shouldn&#8217;t be read or have no legitimate value to anyone.</p>\n]]>", "author": "Scott", "published": "2016-11-27 00:19:43+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Michael #65, governments react to what has happened, not to what will happen. That&#8217;s why thinly-populated states have so little law in comparison with, say, Massachussets or New Jersey. It&#8217;s also why pilots say that every FAA reg has behind it a pilot who bought the farm. </p>\n<p>It works that way because it&#8217;s very difficult to persuade a populace of a potential future harm if they haven&#8217;t seen it before in a highly literal, one-to-one correspondence way. Consider the lunacy and the religious war brewing now: the starting gun for Islamic militancy was the collapse of the Soviet empire and the end of that stalemate, the end of east-west as the dominant tension. But nobody gave a rat&#8217;s ass here about any of that, including the question of where Russia&#8217;s nukes had gone, until 9/11. And then hundreds of millions of people cared very much, and the library boys at PNAC could pull out their maps and campaign plans, and off we went. And now here we are talking about a registry for Muslims and watching CNN ask a neo-Nazi&#8217;s question about whether Jews are people.</p>\n<p>I&#8217;d say the terrists won, wouldn&#8217;t you? But the point is that without video of the WTC with black smoke billowing out of it, nothing. No imagination of what might happen. The exception, I&#8217;d say, is any oft-told story from the Bible. That people can imagine because they&#8217;ve been imagining it since childhood. But anything else, no. </p>\n<p>Jr #67, of course hate laws are not consistent. No laws are consistent. They&#8217;re people laws, not theorems. And that&#8217;s just the legislation writing and passage. It&#8217;s a sitcom once you get to the courthouse, what with the lawyers who don&#8217;t actually know the laws and the judges who&#8217;ve seen it all before.</p>\n]]>", "author": "amy", "published": "2016-11-27 01:31:35+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Michael #65, I should amend that: governments react to what has happened *to people powerful or loud enough to bestir the legislators and prod them all the way into passing a law*.</p>\n<p>As a single mother, I&#8217;ve stopped finding it remarkable when it turns out that laws are not written with my circumstances in mind.</p>\n]]>", "author": "amy", "published": "2016-11-27 01:35:03+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Scott #69 &#8211; the propaganda cannonballs SPLC sends out are by a long chalk the thing I find most offensive about them. I keep on supporting them, though, because I understand that the sort of smart thing you&#8217;re suggesting above does not create a donor base. </p>\n<p>In the week after the election I wrote something about how, for as long as anyone&#8217;s known me, I&#8217;ve pissed on efforts to tag me as an ally of this or that and indeed on the whole language of allies in culture wars. You know all that. But I also said that I thought we were approaching one of those seasons in which simply coming in as yourself becomes an unobtainable luxury: you&#8217;ll be lucky if you can declare for yourself rather than having someone louder than you declare for you. And then it&#8217;s remarkably difficult to get away from propaganda. </p>\n<p>One of the reasons that poets and artists become so important in a time like this is that it&#8217;s extremely difficult to turn their work into propaganda. It&#8217;s much too complex for that, and not nearly literal or argumentative enough. So the best a regime can do is to call it and its maker degenerate.</p>\n]]>", "author": "amy", "published": "2016-11-27 01:44:59+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>amy #70: The fact that no human laws are completely consistent, seems to me like a convincing response to someone who claims that they need to be consistent or else.  But it doesn&#8217;t seem like a convincing response to any <i>particular</i> inconsistency that someone points out.</p>\n<p>And amy #72: I suppose the tradeoff (not at all unique to SPLC) is that the stuff that creates a donor base, might also create new enemies, turn away thoughtful observers, and undermine the organization&#8217;s long-term effectiveness.</p>\n]]>", "author": "Scott", "published": "2016-11-27 02:11:30+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #73: If you ask about a given inconsistency (&#8220;Why does it cover this but not that?&#8221;) the answer is likely to be &#8220;Nobody thought of it.&#8221; Which is another way of saying that it wasn&#8217;t important to anyone while the bill was being written and amended. It could also be that that particular thing had an enemy in the chamber and the bill as a whole had a greater chance of succeeding without it. Or it could be that there&#8217;s a real answer, a real reason why it wasn&#8217;t felt that it was necessary to include this thing. Or maybe it was traded away. Or maybe a big donor came in at the last minute and said &#8220;You have my support but I don&#8217;t like that, take it out.&#8221; Whatever the inconsistency, you could probably get the story, but the particular story would belong to the particular inconsistency. </p>\n<p>As for the fundraising and the longterm harm &#8212; you know, again, this is about ad-hoccery. Strategic and hypothetical considerations like that seldom get a look-in; they aren&#8217;t as immediate as other things. </p>\n<p>The whole ivory-tower thing is tired and overstated, but one thing I notice that academia takes for granted is that it will continue to exist. You assume your university will continue to exist, and your department, and your grant, and you can decide that two months isn&#8217;t enough to get something running and you&#8217;ll do it next year, and you can actually think about things that will happen five years ahead. I&#8217;ve never known any other environment like that. Companies come and go, jobs come and go, and who knows if your job will exist in six months, let alone five years. My college roommate worked for a law firm 110 years old; one day they come in and find out the business is gone, they&#8217;re shutting down in a few weeks, get your stuff and go, we&#8217;ll let you know about vacation pay. </p>\n<p>So I don&#8217;t think SPLC worries very much that they might be upsetting some potential donors. As for enemy creation, hey, that&#8217;s their main business.</p>\n]]>", "author": "amy", "published": "2016-11-27 02:25:35+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>amy #74: If we&#8217;re asked to defend why this or that law is <i>good</i> or <i>just</i>, I&#8217;m not sure we get to respond by simply telling a historical story about how the law came to be.  After all, every law, no matter how disgusting in hindsight, has <i>some</i> story involving <i>some</i> group of people finding it a good idea (or maybe the least bad option) at the time!</p>\n<p>Also, talking about &#8220;inconsistency&#8221; makes it sound like the only people harmed by inconsistencies in the law are a few hairsplitting mathematical logicians!  To put it in more amy-friendly language, I think what we&#8217;re really talking about here is <i>injustice</i>.  E.g., consider the case of a hypothetical university that will censure you as a bigot for accidentally misgendering someone, but not for saying that Jews are death-deserving parasites.  If Jews are afraid to enter the university, is it a defense to say that the people who wrote the rules simply weren&#8217;t thinking about the two issues in the same context?</p>\n]]>", "author": "Scott", "published": "2016-11-27 03:50:48+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, what is inconsistent about hate speech laws that are restricted to counterfactual speech? I.e. as long as any idea has any merits as to make it worthy of debate if will automatically fall outside the scope of such a free speech restriction.</p>\n]]>", "author": "quax", "published": "2016-11-27 04:17:11+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>quax #76: Nothing is necessarily inconsistent about it, but it does require setting up a court to decide historical atrocities it&#8217;s illegal to deny&#8212;and indeed, which ones were atrocities at all.  Experience suggests that whichever group happens to be in power at a given moment (including white nationalists, Islamic fundamentalists, you name it&#8230;) will be tempted to redefine any loss of power it ever experienced in its past as a &#8220;genocide,&#8221; which everyone else then needs to respect on pain of imprisonment.  This is why, on reflection, I side with the Holocaust historian <a href=\"https://en.wikipedia.org/wiki/Deborah_Lipstadt\" rel=\"nofollow\">Deborah Lipstadt</a> in opposing even the European laws against Holocaust denial, even though if any such restrictions in human history were ever morally justified, it would be those.</p>\n]]>", "author": "Scott", "published": "2016-11-27 04:40:16+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, I&#8217;m not saying that the laws &#8212; any laws &#8212; are good or just. Nor frankly do I think that this is the primary motive for making laws. (And in the hypothetical case you mention, that&#8217;s probably exactly what would happen &#8212; and unless there had actually been a faculty member telling a Jewish student that he was a death-deserving parasite, and there were university Jews and Abe Foxman thronging the president&#8217;s office, my guess is that the prevailing sentiment would be that there&#8217;s no reason to make an endless censure list for problems that don&#8217;t appear to exist or have no influential champion. There would probably then be some conversation about whether to make a general &#8220;do not say under pain of censure&#8221; rule, and then you&#8217;d have the usual arguments about the line between broad and meaningless.)</p>\n<p>I&#8217;ll preface this for benefit of others with IANAL, but have worked for national-level legislators and helped write state legislation, also helped block state legislation.</p>\n<p>Laws are either administrative &#8212; you have to have schools, roads, dental clinics, etc., and there have to be rules for how these things operate &#8212; or they&#8217;re about something bad that happened, when the absence of a law to handle it made things worse. (Or they&#8217;re about reshaping rules to your own advantage, as lobbyists do, but that&#8217;s a different class of laws and not what I&#8217;m talking about here.) In general if nothing bad has happened nobody has a reason to make a law. Sometimes the administrative laws are also because of bad things but often it&#8217;s just that common agreement on the rules is necessary and maybe they&#8217;re simply lifted from elsewhere after some study and a decision that yeah, that should work, and we&#8217;ll change it if it doesn&#8217;t. </p>\n<p>It seems to me that when legislators make a law, assuming they&#8217;re serious about it, the main concern is whether the law will work. Not whether it&#8217;s good and complete and just, but whether it&#8217;s good enough, complete enough, and just enough to work, meaning that it settles the kinds of arguments that arise often and doesn&#8217;t sow confusion in the courts and does not make a proliferation of new cases. Or constitutional challenges. And in the end the arbiters of these things will usually be judges who interpret them with the aid of custom. Not justice, not goodness, but custom, because if they cut very much against the grain of what the society views as acceptable, if they&#8217;re a reasonable novelty, you get an uproar. The society has to be ready for that uproar before you get the ruling. (I believe all three state supreme-court justices in Iowa who ruled for the legality of gay marriage and were up for reelection in the following cycle lost their jobs.)</p>\n<p>Sometimes the politics land you with laws that fail spectacularly to work, like the three-strikes laws. But I think this is the exception and that usually the failures are slow-burn failures of imagination or come from simple ignorance on the part of the lawmakers. I&#8217;ll give you a boring example: </p>\n<p>My state is fairly progressive on the garnishing of wages for child support; it doesn&#8217;t matter whether the parent is a statutory employee or a contractor, if you pay the parent regularly, you can be told to garnish the wages. If the parent owns a company, the parent him or herself can receive the court order to garnish: pay yourself a salary, pay the support. There&#8217;s a hole in the law, though, where single-member limited liability corporations come in. The IRS treats them as legal fictions, which they are. It&#8217;s basically a sole proprietorship. LLC owners don&#8217;t have to pay themselves a salary; they can just treat revenues as their own personal income, so there&#8217;s no step at which to garnish a wage, even though the money is there. But the state treats them as corporations, expecting them to keep normal corporate books, pay salaries, etc. And yes, people do try to use LLCs to evade support obligations.</p>\n<p>I ran into this about a year ago, when my ex stopped paying support for a while and formed an LLC. So I got in touch with my state rep and said hey, there&#8217;s a problem with the code, even your assistant AG doesn&#8217;t know what to do with it, and the code needs amending to cover the issue. And she was quite helpful about it, got herself up to speed on the issue, was ready to write language when I solved the problem another way, at which point it became hypothetical. That rep and I had worked on related problems several years ago, when the state issued debit cards to receive state payments including child support; the bank handling the transactions took the opportunity to profiteer by attaching all sorts of fees and nickel-and-diming the poor, single parents, the disabled, etc. And I believe that problem got fixed. </p>\n<p>Even a hate-speech law is a response to a pressing, existing problem, written in the knowledge that amendment or overturn will someday likely happen. A similar thing: extremely severe punishment for knowingly transmitting AIDS. A lot of states have these laws, and they were written in the 80s and early 90s not only out of homophobia but because AIDS meant you&#8217;d die. These days AIDS probably doesn&#8217;t mean you&#8217;ll die, but the cases are rare anyway. As they come to court, though, the issue arises, there&#8217;s an activist outcry, and maybe the law changes or is rescinded altogether. </p>\n<p>It&#8217;s also important to recognize that most of the people writing the laws &#8212; assuming it&#8217;s legislators and not some sharpie &#8212; aren&#8217;t terrifically bright, and they&#8217;re trying to solve existing problems by fashioning a new blunt instrument in the law. And the question is whether the problem is bad enough that you&#8217;ll take a blunt instrument over nothing at all. </p>\n<p>When I see large numbers of neo-nazis aggregating, organizing, ginning each other up, and making new myth for themselves on large social-media platforms, and see their language and baloney stories leaking out into more general conversations, I say yeah, let&#8217;s have that blunt instrument. Push that stuff back into the corners. And if we&#8217;re lucky, we fix what there is to fix in the law later.</p>\n]]>", "author": "amy", "published": "2016-11-27 07:05:46+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>It looks as though the Stein fundraising campaing has ground to a halt (after covering a lot of ground). I&#8217;d credit media raspberries with that, with everyone from Nate Silver to Salon to the Post saying it&#8217;s stupid and/or probably a scam. </p>\n<p>I&#8217;d actually categorize it as a failure of science communication. I think few people read, let alone understood, what Alex was saying in his Medium piece, and that the overwhelming fundraising message people heard was &#8220;Overturn the election result!&#8221; Even though everyone involved in this thing was quite careful to say that this is *not* what it&#8217;s about. </p>\n<p>I think what it comes down to is that people don&#8217;t much care whether or not the election is hacked unless it results in election theft. They don&#8217;t perceive threats to future elections, don&#8217;t see a reason to be concerned. I think that story wasn&#8217;t told plainly and vividly enough, the &#8220;why to care&#8221; story. Which is not a trivial problem: it took most of a decade for someone to come up with and deliver a resonant &#8220;why to care story&#8221; for polar ice melting.</p>\n]]>", "author": "amy", "published": "2016-11-27 17:38:04+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Scott, conveniently we already have <a href=\"https://en.wikipedia.org/wiki/International_Criminal_Court\" rel=\"nofollow\">a world court in Den Haag</a> set-up to deal with current and future atrocities.  I don&#8217;t think it would be too much of a stretch to extend its mandate to define all 20th century atrocities  (which it should be pragmatically be restricted to), that clearly can be established as historical fact.  </p>\n<p>There are several that come to mind, that while not on the scope of the industrialized Holocaust, seem to clearly quality: Rwanda, Darfur, Bosnia, the Khmer Rouge genocide, the Armenian death marches, Stalin&#8217;s extermination campaigns against the Kulaks, and Crimea Tatars.</p>\n<p>I think everything of that magnitude that happened during the last century is well enough documented, and to me it seems self-evident that no lasting peace can be achieved, before the truth of these atrocities and grievances is acknowledged. IMHO there is a clear mandate for governments to now allow extremists to use media amplification to spread counterfactual myths that undermine our very social fabric. Admittedly, I am probably hyper-sensitive to this, since we&#8217;ve seen this movie before in Germany.</p>\n]]>", "author": "quax", "published": "2016-11-28 01:26:32+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>quax, re media amplification: I wrote this about a year ago, after having been away from social media for a month. About why online conversation skews so quickly to shouting and propaganda.</p>\n<p>&#8212;</p>\n<p>Just had a brief dip back into twitter and Jezebel and was reacquainted with the world of horrible things. Rapes, murders, you name it. Oh, and a lot of showing off about prizes and whatnot.</p>\n<p>I think I see what happened, though, why the online social world turned into that. The medium’s actually being used as it was meant to be used: it’s a freely available press. The problem is that most people have nothing much to say. The people who do have something to say are generally either propagandists or eyeball-seekers — they’ve got a cause, or they’re promoting something, or they’re trying to package and sell an audience. So of course they overwhelmed the place almost as soon as it opened up, and things get worse and worse, because they have to outshout each other, and recruit other people to shout on their behalf, preferably for free. And now and then a volunteer shouter can’t handle the shouting anymore and gets so mad that he actually leaves his house and tries to attack the other-side people for real.</p>\n<p>That’s why it’s almost impossible not to get into polemical arguments as soon as you show up there, and why you have this ridiculous situation where polite, friendly conversation’s squeezed in and among a lot of yelling about blood and sales. It’s not a conversational medium anymore and hasn’t been for a long time. Back in USENET days, yes, it was conversational — polemical, sure, but because it was mostly academics talking, they were already bound by codes of collegiality and fear of professional repercussions. No such things exist in online argument now&#8230;.</p>\n<p>I don’t know whether it’s possible to have ordinary conversation again online.</p>\n]]>", "author": "amy", "published": "2016-11-28 06:48:09+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>amy, astute observation. The fact that monetization rewards clicks is not helping either. But the fact that  academics manage to have more civil online chats lends me to believe that teaching how to use this media may make a difference.  Maybe if this was started early on it could lead to a generation that is less emotionally crippled when it comes to online speech.</p>\n<p>As it is, I find that these days only platforms that are moderated in some form facilitate meaningful online conversations  (occasional exception non-withstanding).</p>\n<p>That is why I&#8217;ve came around with regards to European style hate speech laws (which for a while I considered relics), since it would make such moderation mandatory.</p>\n]]>", "author": "quax", "published": "2016-11-28 18:33:51+00:00", "title": "By: quax"}]