[{"content": "<![CDATA[<p>Does P = BQP imply NP = QMA?</p>\n]]>", "author": "Mris Ozols", "published": "2016-11-26 22:22:37+00:00", "title": "By: Māris Ozols"}, {"content": "<![CDATA[<p>Vadim #19:</p>\n<ul>What about *quantum* public-key cryptography? Is it much more likely to exist?</ul>\n<p>If you mean that a quantum computer is used to compute the encryption function, but the encrypted message is still classical: no, in 20+ years, I don&#8217;t think anyone has come up with any plausible candidates for public-key encryption schemes where that would help you (someone correct me if there&#8217;s a counterexample).</p>\n<p>If you mean that the encrypted messages are quantum: well, at that point, you probably might as well use <a href=\"https://en.wikipedia.org/wiki/Quantum_key_distribution\" rel=\"nofollow\">quantum key distribution</a>, which doesn&#8217;t depend on any computational assumptions at all!</p>\n]]>", "author": "Scott", "published": "2016-11-27 02:22:24+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Māris #23: Good question (even if off-topic)!  No, I don&#8217;t know such an implication.  The best I know is that if PromiseP=PromiseBQP, then NP=QCMA.</p>\n]]>", "author": "Scott", "published": "2016-11-27 02:46:58+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Tim Duty #14,</p>\n<p>I don&#8217;t understand the logic of your point. Let&#8217;s apply it to CRISPR. Was there any (real world) problem so that it&#8217;s entire resolution is limited by lack of CRISPR? Of course not, but do you have any doubts that it&#8217;s a game changer? </p>\n<p>In other words, do you consider unlikely that, if some quantum simulator was developped, the practice of physics will change at least as much as genetic is changing right now because of CRISPR?</p>\n]]>", "author": "Jay", "published": "2016-11-27 17:46:50+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Hi Scott,</p>\n<p>With regards to quantum computing applications, have there been any results that have altered your thoughts on quantum machine learning since your &#8220;Read the fine print&#8221; article?</p>\n]]>", "author": "Chris", "published": "2016-11-28 00:08:52+00:00", "title": "By: Chris"}, {"content": "<![CDATA[<p>Chris #27: There was a paper by Jordan Kerenidis and Anupam Prakash on <a href=\"https://arxiv.org/abs/1603.08675\" rel=\"nofollow\">quantum recommendation systems</a> that I found quite striking.  It&#8217;s another potential example of an &#8220;end-to-end&#8221; application of the phase estimation and HHL techniques for machine learningish problems, of exactly the sort I was asking for in my &#8220;Read the Fine Print&#8221; essay.  On the other hand, in both that case and in the others, I think the necessary work to rule out an efficient classical algorithm for the same task still remains to be done (and we could hopefully actually do so in this case, since it&#8217;s &#8220;just query complexity&#8221;).  This is another problem that I&#8217;d love to work on myself in my copious free time.  But everyone else, feel free to solve it first. 🙂</p>\n]]>", "author": "Scott", "published": "2016-11-28 01:20:54+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott re #11, obvious followup questions.  1. Do you believe that lattice-based public key cryptography in particular is secure against quantum attacks?  2. Do you believe that there exist classical fully homomorphic encryption schemes that are secure against quantum attacks?</p>\n]]>", "author": "jonas", "published": "2016-11-28 11:27:41+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>jonas #29: I don&#8217;t know.  Lattice-based schemes have by now withstood quantum attack for ~20 years, which is not a negligible amount of time.  As long as they stand, the &#8220;default guess&#8221; is presumably yes to both questions, but it&#8217;s really no more than that.  (Someone correct me if I&#8217;m wrong, but my understanding is that FHE no longer requires ideal lattices, as in Gentry&#8217;s original construction, but can now be based on a variety of assumptions that are close in spirit to the security of lattice-based crypto itself.)  I don&#8217;t know whether Lior and Peter&#8217;s attempt should cause a Bayesian to update upwards or downwards, or neither.</p>\n]]>", "author": "Scott", "published": "2016-11-28 12:12:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, I guess this question is more for Gil , but let me ask it anyway: Do the arguments against scalable quantum computers (entangled noise etc.) even apply to a topological approach?</p>\n]]>", "author": "wolfgang", "published": "2016-11-28 20:15:07+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>wolfgang #31: Well, I haven&#8217;t met anyone who believes that noise will unavoidably kill non-topological QC, but <i>not</i> kill topological QC.  As you said, it&#8217;s really a question for Gil, but the QC skeptics all seem perfectly happy to assert that their arguments, which I&#8217;ve never understood even in the non-topological case, should apply with minimal change in the topological case as well.</p>\n]]>", "author": "Scott", "published": "2016-11-28 23:37:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Can Scott give an explanation of what P not equal to NP entails for quantum mechanics. Does it rule out all hidden variable interpretations including Bohemian Mechanics.</p>\n]]>", "author": "Harold", "published": "2016-11-29 17:49:38+00:00", "title": "By: Harold"}, {"content": "<![CDATA[<p>Scott #24: Interesting! However, quantum key distribution requires two-side communication (although it only needs to be quantum in one direction), whereas classical public key cryptography only needs one-side communication for transmitting messages, once the keys are already established. So, maybe there is some interesting public key cryptography protocol with quantum messages that also has this property?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kosoy:Vadim.html\">Vadim Kosoy</a>", "published": "2016-11-29 20:29:42+00:00", "title": "By: Vadim Kosoy"}, {"content": "<![CDATA[<p>Harold #33: P&ne;NP is a purely mathematical conjecture.  Assuming (as I do) that it holds, I don&#8217;t think it entails anything directly about the interpretation of quantum mechanics.  But closely-related conjectures, such as BPP&ne;BQP, would rule out all hidden-variable theories that reproduce the predictions of quantum mechanics while using a polynomial amount of classical computation.</p>\n<p>Since Bohmian mechanics <i>doesn&#8217;t</i> demand only a polynomial amount of classical computation&#8212;on the contrary, it has the entire wavefunction of standard QM, plus the hidden variable on top of it&#8212;Bohmian mechanics isn&#8217;t affected by any of that.  Now, I <a href=\"http://www.scottaaronson.com/papers/qchvpra.pdf\" rel=\"nofollow\">showed in 2005</a> that, if you want to see the entire <i>history</i> of a Bohmian-like hidden variable (i.e., not just where it is now, but everywhere it&#8217;s been in the past), then that requires resources that probably exceed what you could efficiently simulate using a standard computer.  So, <i>if</i> you thought Nature should be &#8220;limited to the resources of standard quantum computation and no more,&#8221; then you could take that as a sort of argument against Bohmian mechanics.  On the other hand, it&#8217;s interesting that even in the unphysical scenario where you could see the hidden variable&#8217;s entire history, it <i>still</i> looks unlikely that you could solve NP-complete problems in polynomial time.</p>\n]]>", "author": "Scott", "published": "2016-11-29 22:08:59+00:00", "title": "By: Scott"}]