[{"content": "<![CDATA[<p>gh #38: Again, if you <b>knew</b> FLT or RH were undecidable in some reasonable formal system, then you would also know they were true.  I&#8217;m not disputing that!</p>\n<p>But, again, it&#8217;s logically possible for RH to be undecidable, and for its undecidability to itself be unprovable, and so on forever.  In that case, RH would indeed be &#8220;Platonically true,&#8221; but we would never get any formal indication of it.  I.e., we would remain forever in exactly the same epistemic state that we&#8217;re in now.</p>\n]]>", "author": "Scott", "published": "2015-04-24 21:39:48+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>How does the mathematical community come up with good problems? I mean what is the general process? There has to be something common in the history of good problem definitions.</p>\n]]>", "author": "Ashley", "published": "2015-04-25 08:20:27+00:00", "title": "By: Ashley"}, {"content": "<![CDATA[<p>Ashley #40: That&#8217;s sort of like asking, &#8220;how does the Internet community come up with good memes?&#8221;  Someone suggests something; then if other people like it they repeat it (in talks, papers, conversations, open problem lists, etc).  Maybe the problem gets quickly solved, or shown to be equivalent to some previously-known problem, but maybe subsequent study shows the problem is even richer and more interesting than originally thought.  If the original proposer is famous, it might increase the chance of the problem being noticed, but that&#8217;s by no means necessary (e.g., Riemann was a mathematical giant independently of his Hypothesis, and Poincar&eacute; independently of his Conjecture, but Goldbach and Collatz were not).</p>\n]]>", "author": "Scott", "published": "2015-04-25 11:16:53+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #39:</p>\n<p>Thank you for the clarification. But I am still not convinced! Even if the hierarchy of undecidability that you described were to exist, then this, in itself, would imply that no counter example to RH (or FLT) could ever be computed or found! This, to me, would be proof that the RH is true.</p>\n]]>", "author": "gh", "published": "2015-04-25 13:15:26+00:00", "title": "By: gh"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>I was more asking about the sequence of things before the event &#8216;Someone suggests something&#8217; (I should have asked how a mathematician comes up with good problems &#8211; my bad. I used the word &#8216;community&#8217; because I thought in general this event could be a culmination of decisive contributions from various individuals).</p>\n<p>Mathematicians don&#8217;t randomly generate problems and then select the good ones, so what is it that they do? Of course we definitely do not understand this process well enough to write computer programs, but we may be able to say things like they try to generalize known facts, or they modify &#8216;existing&#8217; problems etc. (It could be that there are multiple such &#8216;ways&#8217; mathematicians generally come up with problems, but not numerous ones).</p>\n<p>(Do they have good books on this kind of thing, somewhat analogous to &#8216;How to solve&#8217; kind of books on the problem solving thought process?)</p>\n]]>", "author": "Ashley", "published": "2015-04-25 14:11:47+00:00", "title": "By: Ashley"}, {"content": "<![CDATA[<p>gh #42: Once again you&#8217;re failing to distinguish between the hierarchy of undecidability <i>existing</i>, and our <i>knowing</i> that it exists.  Maybe there&#8217;s this hierarchy for the Riemann Hypothesis right now, but we don&#8217;t know it!  But you wouldn&#8217;t say on that basis that we already have a proof of RH, would you?  I don&#8217;t know how else to explain it to you.</p>\n]]>", "author": "Scott", "published": "2015-04-25 14:19:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Ashley #43: Rather than asking about these things in the abstract, it would probably be better if you dipped into some particular area of math (maybe one requiring little background, like elementary number theory?) so you could get a sense for mathematicians&#8217; thought processes.  For example, you could try the book <i>Unsolved Problems in Number Theory</i> by Richard Guy.  Briefly, though, the usual ways to come up with new problems include these:</p>\n<p>&#8211; You play around with things, notice a pattern, and wonder whether always holds or whether there&#8217;s a deeper explanation for it<br />\n&#8211; You&#8217;re trying to do something very concrete (say, solve an equation), notice a difficulty, and wonder whether the difficulty represents an inherent limitation of the tools you&#8217;re using<br />\n&#8211; Someone else proves something, and you wonder whether it can be generalized, or whether the converse is also true (&#8220;but is it an if and only if?&#8221;), or whether it&#8217;s still true if you drop an assumption, or whether an analogous result holds for something you personally care about<br />\n&#8211; You&#8217;re trying to compute something, and you wonder whether there&#8217;s a faster way to do it<br />\n&#8211; You know from experience or history that asking a certain kind of question tends to be fruitful&#8212;so when a new mathematical object is proposed, you immediately ask that question about it<br />\n&#8211; (My personal favorite <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> ) Someone else says something you think is wrong, and you wonder how to <i>prove</i> it&#8217;s wrong</p>\n]]>", "author": "Scott", "published": "2015-04-25 14:26:22+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>gh #42,</p>\n<p>There a few issues here going on, and Scott has touched on most of them, but I&#8217;d like to make one of them more explicit: if I prove in some broad sense that say RH is undecidable in some axiomatic system (say ZFC), then I haven&#8217;t proven in ZFC that RH is true, but I&#8217;ve only proven it true in some larger metamathetical sense.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2015-04-25 18:14:07+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Maths is just a consequence of some rules. In  tic-tac-toe (or &#8220;noughts and crosses&#8221; where I live) you can show that the 2nd player must place a cross/zero on a diagonal to avoid defeat (assuming the first player played the centre square). As the domain and rules get bigger there are far more complex possibilities,</p>\n<p>There shouldn&#8217;t be any puzzlement that complex stuff arises, but also we wouldn&#8217;t expect a HUGE number of surprises &#8211; we are aren&#8217;t performing magic by creating a few rules/axioms in the first place</p>\n<p>Nature, also, surely has a ruleset &#8211; and discovering that is a much bigger deal.</p>\n<p>Unfortunately us dumb humans find approximations to nature&#8217;s rules and then extrapolate this in fantasy worlds that are much more complex than anything in nature.</p>\n<p>There&#8217;s mystery in mathematics, because it&#8217;s unnatural, if we ever meet an alien species I&#8217;m sure they will have discovered weird mathematics beyond number theory etc that will astound us, just as they may be astounded by inter universal teichmuller theory and other weird stuff that we&#8217;ve managed to create.</p>\n<p>But nature has only one possible correct interpretation, and it surely won&#8217;t involve a lot of the more esoteric areas of mathematics.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2015-04-25 22:13:41+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>You&#8217;re conflation (in the article) of the issue of propositions being independent of the axioms of a system and Godel undecidability is unhelpful here; what Godel proved was that there must be propositions where only one answer is consistent with the axioms of a system but nonetheless can&#8217;t be proven from those axioms.</p>\n<p>I think the possibility of the undecidability of open problems should be considered a serious possibility precisely because, for many of the problems you mention, unprovability of undecidability is or is nearly a logical consequence of undecidability. So I&#8217;m uncomfortable saying the Godelian gremlin hasn&#8217;t reared its head when there are plenty of problems where a) it could have and b) if so we&#8217;ll almost certainly never know that it has.</p>\n<p>To make my point more concrete let&#8217;s consider the possible universes for P vs NP:</p>\n<p>1. P = NP and this can be proven.<br />\n2. P = NP and this is impossible to prove.<br />\n3. P != NP and this can be proven.<br />\n4. P != NP and this is impossible to prove.</p>\n<p>P = NP seems less likely precisely because most of the proof for it has been written &#8212; all we need is a polynomial time algorithm for an NP-complete problem, and if P = NP then such an algorithm certainly exists. That makes #2 almost impossible. I say almost, because there is a remote possibility that algorithms exist that have a polynomial runtime bound, but it is impossible to prove that their runtime is polynomially bounded. So to prove the undecidability of P vs NP you would need to show that either P != NP or that it will be impossible to prove that the runtime bound of any polynomial algorithm to an NP-complete problem is actually polynomially bounded. That would be a truly miraculous proof; I would be quite surprised to discover that it is possible to prove that and not possible to establish P vs NP. I am not holding my breath for that proof. But the remaining possibilities are, we will either some discover a proof one way or the other, or we will beat our heads endlessly against this problem never knowing that it is impossible and we should just add P != NP as an axiom. I see no reason to doubt that last possibility; it seems quite likely. It is even more likely that, among the various open questions you mentioned, there is at least one problem like that. We&#8217;ll never know that to be true; we&#8217;ll only maybe see a few of them knocked off the open questions list and figure the problems we can&#8217;t solve seem no different from the problems we had a lot of difficulty solving but ultimately did.</p>\n]]>", "author": "Eric L", "published": "2015-04-26 00:11:50+00:00", "title": "By: Eric L"}, {"content": "<![CDATA[<p>@Eric <a href=\"http://en.wikipedia.org/wiki/P_versus_NP_problem#Polynomial-time_algorithms\" rel=\"nofollow\">http://en.wikipedia.org/wiki/P_versus_NP_problem#Polynomial-time_algorithms</a></p>\n]]>", "author": "Jay", "published": "2015-04-26 05:28:26+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Much of this discussion of the mystery of math is about the foundations of math. When physicists like Wigner talk about the mystery of math, I don&#8217;t think that they care about these foundational issues at all.</p>\n]]>", "author": "Roger", "published": "2015-04-26 06:10:36+00:00", "title": "By: Roger"}, {"content": "<![CDATA[<p>Why should we be surprised that ZFC resolves a lot of classical mathematical statements- it didn&#8217;t &#8220;come out of nowhere&#8221;; it was designed for that purpose. Indeed, suppose a sudden spate of inconsistency results presented themselves: I mean, really classical questions like Goldbach&#8217;s Conjecture, Riemann Hypothesis, etc. were shown to be independent of ZFC. Then wouldn&#8217;t we look at the axioms again?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hopkins:Sam.html\">Sam Hopkins</a>", "published": "2015-04-26 14:50:20+00:00", "title": "By: Sam Hopkins"}, {"content": "<![CDATA[<p>Partial answers to the questions asked by several commenters (<i>e.g.,</i> Kalai #25 and #33; Ashley #40 and #43; Eric L #48, <i>etc.</i>) are supplied by mathematical luminaries&nbsp;&mdash; that include Fields Medalists Noam Elkies and Terry Tao&nbsp;&mdash; in comments-and-answers to the <i>MathOverflow</i> question  &#8220;For which Millennium Problems does undecidable -> true?&#8221;.</p>\n<p>In particular, it is natural to sharpen the question to<br />\n<blockquote>Which of the Millennium Prize problems can be stated as a postulate that can be falsified by a $\\Pi^0_1$ counterexample?</p></blockquote>\n<p>There are two classes of answers.  </p>\n<p>The first class of answers accepts the problem statements in their present form: then if we further assume P&ne;NP, then the Riemann Hypothesis is the sole Millennium Prize problem that can be falsified by an $\\Pi^0_1$ counterexample whose form can presently be envisioned.</p>\n<p>The second class notes that Millennium Prize problem statements <i>can</i> be amended (at the discretion of the  Scientific Advisory Board (SAB) of the Clay Mathematics Institute (CMI)).  </p>\n<p>Then the following question is (seemingly) entirely open<br />\n<blockquote>Can any of the Millennium Prize problem statements be reasonably amended&nbsp;&mdash; PvsNP in particular&mdash;&nbsp; so as to be stated as a postulate that can be falsified by a $\\Pi^0_1$ counterexample?</p></blockquote>\n<p>Opinions vary widely in regard to the second question&nbsp;&hellip; this variation signifies a healthy and vigorous mathematical community (needless to say). </p>\n<p><b>Conclusion</b>&nbsp; It is reasonable to consider whether amended postulates associated to the Millennium Prize statement of the PvsNP problem might simultaneously evade proof obstructions <i>and</i> still address practical questions like &#8220;do there exist dynamical systems&nbsp;&mdash; including both physical systems and ciphers&nbsp;&mdash; that provably <i>cannot</i> be simulated/solved in with resources in P?&#8221;</p>\n]]>", "author": "John Sidles", "published": "2015-04-26 13:06:33+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Sam #52</p>\n<p>Good point, in fact it&#8217;s not clear (afaik) whether Mochizuki&#8217;s recent claimed proof of the abc conjecture satisfies ZFC &#8211; but suppose his argument turns out to be quite persuasive, but requiring an addition axiom(s) &#8211; how would the mathematics community respond?</p>\n<p>I was fascinated by the <a href=\"http://en.wikipedia.org/wiki/Goodstein%27s_theorem\" rel=\"nofollow\">Goodstein Theorem</a> as a student, since it was a very concrete example of a sequence of numbers which converge to zero (incredibly after massive explosive growth) &#8211; but the convergence can not be proved in Peano arithmetic. There are no infinities involved, the sequence just grows very large but finite and always descends back to zero. However, you just need to add an axiom to allow transfinite ordinals, then the proof is simple!</p>\n<p>So I lost my fascination, as it seemed just a clever game where you can find &#8220;mysteries&#8221; but you solve them by additional rules to cover the &#8220;mystery&#8221;</p>\n<p>side note: I attended a public lecture at the Cambridge Newton Institute shortly after Andrew WIles had claimed a proof of FLT, the proof was still not verified. John Coates gave the lecture and at the end Stephen Hawking asked a question &#8211; &#8220;Does the proof use the axiom of choice?&#8221; &#8211; Poor John Coates was very uncomfortable giving an answer, he said no, it was all very straightforward constructions that didn&#8217;t employ AC. To be fair to professor Coates, the proof was not fully understood at the time, and Wiles had yet to provide the crucial Euler system to fix a big error. As it turns out, it is now accepted that the axiom of choice IS required in Wiles&#8217; proof.</p>\n<p>So how do people feel about a proof of FLT requiring a slightly &#8220;dodgy&#8221; (&#8220;unnatural&#8221;?) axiom &#8211; is that satisfactory? Should we require a proof in ZF alone (not ZFC)?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2015-04-26 18:02:09+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>James, FLT does not require AC. Wiles&#8217;s proof does not use AC, and even if it did, Shoenfield says that it can be removed.</p>\n]]>", "author": "Douglas Knight", "published": "2015-04-26 21:56:27+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Douglas</p>\n<p>Ok, it seems tricky point, in fact Wiles&#8217; proof may involve even worse stuff  like <a href=\"http://mathoverflow.net/questions/35746/inaccessible-cardinals-and-andrew-wiless-proof\" rel=\"nofollow\">Grothendieck Universes</a></p>\n<p>If  &#8220;Shoenfield&#8221; has a paper can you link ?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2015-04-26 22:27:21+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>James #55: Wiles&#8217;s original proof did indeed use Grothendieck universes, which go outside ZF, but it&#8217;s now known that that was just a convenience, and that the proof can be reformulated within ZF.  (On the other hand, it&#8217;s still open how to do the proof in PA; almost all experts think it&#8217;s possible, but it seems to require genuinely new ideas.)  See <a href=\"http://www.cwru.edu/artsci/phil/Proving_FLT.pdf\" rel=\"nofollow\">here</a> for more.</p>\n<p>Also, Douglas was referring to <a href=\"http://en.wikipedia.org/wiki/Absoluteness\" rel=\"nofollow\">Schoenfeld&#8217;s absoluteness theorem</a>, which tells us that all the <i>purely arithmetical</i> consequences of ZFC can be proved in ZF alone.  That implies that the proof of FLT can&#8217;t possibly need the axiom of choice.</p>\n]]>", "author": "Scott", "published": "2015-04-26 23:06:11+00:00", "title": "By: Scott"}]