[{"content": "<![CDATA[<p>I don&#8217;t understand this: <a href=\"https://www.zmescience.com/science/news-science/quantum-entanglement-record-0432/\" rel=\"nofollow\">https://www.zmescience.com/science/news-science/quantum-entanglement-record-0432/</a></p>\n<p>How is 18 qubits entanglement a world record? Doesn&#8217;t IBM already have a working 20 qubit machine?</p>\n]]>", "author": "Craig", "published": "2018-07-05 14:17:43+00:00", "title": "By: Craig"}, {"content": "<![CDATA[<p>Douglas #3<br />\n&#8220;if the noise conspires to prevent quantum computers from factoring, then it also conspires to make chemistry easier, but can we exploit that without knowing what the conspiracy actually is?&#8221;</p>\n<p>it&#8217;s like saying that you can stack three hundred billion pennies to reach the moon (nothing in the laws of physics prevent this, but it&#8217;s a hard engineering feat) because &#8230;. you can also throw the same three hundred billion pennies in a random pile, and that pile would just be as hard to reproduce *exactly* as the neat stack&#8230; so the two are equivalent.</p>\n]]>", "author": "fred", "published": "2018-07-05 21:14:27+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Doug 3 and Scott 7,</p>\n<p>If QM were only true to say 12 decimal places but after the 12th decimal place the rest of the decimals are random, then how would things look? I would think that simulating things on a digital computer would be easy, except for some situations, you might get different answers due to the randomness of the rest of the decimals, right?</p>\n]]>", "author": "Craig", "published": "2018-07-05 23:59:20+00:00", "title": "By: Craig"}, {"content": "<![CDATA[<p>Craig #12: I don’t know.  Can’t you give me a link to the actual paper?  I despise having to decode popular articles that claim an experimental breakthrough without answering the duh-obvious questions about it, and people asking me to do that is one of the commonest and least favorite occurrences of my life (not that this comment will stop anyone).</p>\n<p>FWIW, my guess would be that 18 qubits is indeed some sort of record <i>for photonics</i>.  My guess would also be that larger entangled states have been made with superconducting qubits, trapped ions, optical lattices, and maybe other systems, but on the other hand, there might not have been a measurement of an entanglement witness to directly demonstrate it (was there in this case?).</p>\n]]>", "author": "Scott", "published": "2018-07-08 15:33:43+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Craig #14: The idea that QM is only “accurate to 12 decimal places” has long been (trivially) ruled out by experiment.  If you polarize 1000 photons each at 45 degrees, you’ll get amplitudes of order 2<sup>-500</sup> each, but we know the predictions of QM are correct for such systems—or even for superpositions of several such systems (as shown by e.g. the buckyball double-slit experiment).  You may say “that doesn’t count; because those systems either don’t have entanglement or else have very limited forms of entanglement.”  If you did, though, that would be an after-the-fact objection, not (clearly) something you thought of at the time.  Which brings up a deeper point: these examples already suffice to show that the “Sure/Shor separator,” as I called it way back in 2003, if it exists, can’t possibly be anything as simple as precision in amplitudes.  It would have to be some more complicated criterion related to the “complexity” of the state—something that we don’t have any workable example of, but that nevertheless, the experimentalists will be all too happy to try to rule out in the coming years.</p>\n]]>", "author": "Scott", "published": "2018-07-08 15:45:57+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott 16, </p>\n<p>For the polarization of photons at 45 degrees, it depends on which basis one chooses as to whether the amplitude is exponentially small or not. If one chooses to measure the photons in the diagonal direction, one gets an amplitude of one. I would guess that this is the criterion for the Shore-Sure separator, but I am probably wrong, given that you have thought about this more and did not find a clear answer.</p>\n]]>", "author": "Craig", "published": "2018-07-08 17:48:22+00:00", "title": "By: Craig"}, {"content": "<![CDATA[<p>Craig #17: It’s easy to give examples of many-particle entangled states for which we have excellent experimental evidence—e.g., “cluster states” of the sort that occur in optical lattices and also in condensed-matter systems—for which there’s <i>no</i> local change of basis that avoids exponentially small amplitudes.</p>\n]]>", "author": "Scott", "published": "2018-07-08 17:54:29+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>It&#8217;s not very precise to talk about Quantum Mechanics being precise to x number of decimal places. What is not precise? The <i>linearity</i> is considered <i>almost exactly</i> precise, after many experiments. </p>\n<p>Things that <i>are</i>  considered a possible source of imprecision are; the accuracy of the Born Rule, the possibility of discreteness in time evolution, the possibility of discreteness in space.</p>\n<p>Only the first two of these would impact QC.</p>\n<p>The first one, accuracy of the Born rule is essentially what the Quantum Noise proponents are  suggesting is uncertain.</p>\n<p>The second one, discreteness of time evolution, has no conclusive experimental evidence for or against, but it would also impact on QCs</p>\n<p>The third one, discreteness of space is not really relevant to QC, since quantum mechanics doesn&#8217;t operate in real &#8220;space&#8221;, it operates in a complex-valued Hilbert Space, and whether we have six small dimensions and three large or whatever consistent variants there are, does not matter</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2018-07-08 22:37:17+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>Hi Scott, is it logically possible for P≠NP even if time travel is possible?<br />\nWill you consider doing a book review of Supernormal by Dean Radin which covers parapsychology research including precognition. I figured computational complexity should help make an assessment of the astonishing claims made in it.</p>\n]]>", "author": "Yaqub", "published": "2018-07-09 04:12:13+00:00", "title": "By: Yaqub"}, {"content": "<![CDATA[<p>I looked up cluster states. It seems that all of the basis vectors have amplitudes of the same magnitude, exponentially small, except some are negative and some are positive. But how can anyone be able to know this? If one measures the state many times, one would observe uniform randomness. One would have to apply unitary transforms to these states to tell that some amplitudes are positive and some are negative. Have they done this?</p>\n]]>", "author": "Craig", "published": "2018-07-09 16:25:15+00:00", "title": "By: Craig"}, {"content": "<![CDATA[<p>Yaqub #20: Yes, P&ne;NP is a mathematical conjecture, which could hold regardless of what&#8217;s true about the physical world.  People constantly confuse it with a related but different conjecture, namely that NP-complete problems require superpolynomial resources <i>in the physical world</i>.  The latter is the conjecture that would be seriously threatened by the existence of closed timelike curves: for more, see the time travel section of <a href=\"https://www.scottaaronson.com/papers/philos.pdf\" rel=\"nofollow\">Why Philosophers Should Care About Computational Complexity</a>.</p>\n<p>Sorry, but I don&#8217;t have any great interest in reading books on parapsychology right now.  I liked the take in <a href=\"https://slate.com/health-and-science/2017/06/daryl-bem-proved-esp-is-real-showed-science-is-broken.html\" rel=\"nofollow\">this Slate article</a>: namely, the fact that researchers like Daryl Bem were able to get &#8220;strong evidence for ESP&#8221; while following all the correct statistical procedures of psychology, was actually an early hint of the replication crisis that we now know to infect thousands of even mainstream psychology studies.  I.e., the thing that was broken was not the known laws of physics, but rather the norms for conducting and publishing psychology studies.</p>\n]]>", "author": "Scott", "published": "2018-07-11 13:08:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Craig #21: Yes, <i>of course</i> you don&#8217;t just measure the states in the computational basis; you measure in other bases (i.e. &#8220;apply a unitary transform first&#8221;).  And yes, the relevant experiments have been done, on cluster-state-like condensed matter systems&#8212;so, not systems where one has the amount of control that one hopes to have with a universal QC, but the results (e.g., measurements of magnetic susceptibility) were consistent with the hypothesis of cluster-state-like entanglement, and ruled out various physically reasonable hypotheses where one wouldn&#8217;t have such entanglement.  See for example the <a href=\"https://arxiv.org/ftp/cond-mat/papers/0402/0402456.pdf\" rel=\"nofollow\">2003 Nature paper</a> by Ghosh et al.</p>\n]]>", "author": "Scott", "published": "2018-07-11 13:17:53+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott 23,</p>\n<p>OK, then if (and when) QC fails, perhaps getting a precise answer to the Sure-Shor separator problem will replace unification of gravity and QFT as the most important problem in physics. And all of the failed quantum computers will become the instruments to experiment with this problem.</p>\n]]>", "author": "Craig", "published": "2018-07-11 16:30:10+00:00", "title": "By: Craig"}, {"content": "<![CDATA[<p>Craig #24: That would be great!</p>\n<p>Of course, as I never tire of pointing out, that position doesn&#8217;t yield any argument against moving full speed ahead with QC research, quite the opposite in fact.</p>\n]]>", "author": "Scott", "published": "2018-07-11 18:15:33+00:00", "title": "By: Scott"}]