[{"content": "<![CDATA[<blockquote><p><b>Scott</b> asserts &#8220;If you know the code of the program, you can always just run the program on a different, faster computer to predict it.&#8221;</p></blockquote>\n<p>There is at least one class of algorithms that is an exception to this rule (and it is a commonly encountered class): algorithms that have no explicit termination criterion.</p>\n<p>For example, Chaitin&#8217;s Ω-constant is formally uncomputable, yet Chaitin is happy to supply (in his book <i><a href=\"https://books.google.com/books?id=DZLxBwAAQBA\" rel=\"nofollow\">Exploring Randomness</a></i>) finitely-specified software that is warranted to compute Ω to any desired accuracy.  The &#8216;catch&#8217; is, Chaitin&#8217;s software doesn&#8217;t notify you when it is finished!  Rather, the longer the software runs, the more confident the user can be, that the output value of Ω is accurate within some specified error-bound.</p>\n<p>This example illustrates a general point: races between algorithm-supremacists and quantum-supremacists very commonly hinge upon subtleties involving the rules of the race.  </p>\n<p>As a second example, quantum-supremacists can produce random (algorithmically incompressable) binary sequences, a capability that in no algorithm-supremacist can claim.  Yet in practice, few algorithms are more widely deployed than (quasi-)random number generators.  </p>\n<p>And as a third example, comparably subtle issues of elucidation arise when we contemplate the class of natural answers to the question: What <i>verifiable</i> computational capacities suffice to collapse the Polynomial Hierarchy?  </p>\n<p>Here the stipulation &#8220;verifiable&#8221; makes an enormous practical difference (as Juris Hartmanis was among the first complexity theorists to point out).</p>\n<p><b>Prediction</b>&nbsp; Each fresh proposal by the quantum-supremacists to confound the algorithm-supremacists will perversely help to catalyze fresh algorithm advances, and <i>vice versa</i>; moreover this lively back-and-forth benefits everyone.</p>\n<p><b>Conclusion</b>&nbsp; There&#8217;s plenty of scope for transformational advances to be compatibly achieved by <i>both</i> algorithm-supremacists and quantum-supremacists.  More soberingly, there&#8217;s plenty of scope for (mostly sterile) squabbling regarding the &#8220;official&#8221; rules of the supremacy-competitions.  </p>\n<p>Sterile squabbling, no one needs.  So perhaps it is well for every variety of supremacist to contemplate Dick Lipton&#8217;s and Ken Regan&#8217;s <a href=\"http://img.ifcdn.com/images/6bd9d3176a3e1cc025fb2e5e5920feced3d18af6071d202c053dd55b6954ea89_1.jpg\" rel=\"nofollow\">favorite <i>Far Side</i> cartoon</a>. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "John SIdles", "published": "2016-03-09 16:29:47+00:00", "title": "By: John SIdles"}, {"content": "<![CDATA[<p>Andrew #91: I should clarify that, when I talk about &#8220;Bayesian fundamentalism,&#8221; I&#8217;m thinking of an ideology centered around LessWrong (but also defended by wolfgang and others upthread), which basically says that you should cash your beliefs about every factual question whatsoever into which betting odds you would currently accept (and then hopefully make money&#8230;)  We can distinguish this ideology from Bayesianism considered as a strict mathematical formalism.</p>\n<p>And yes, perhaps the most obvious place where the ideology parts ways with the formalism is on this question of Pr[2+2=5].  In the formalism, obviously that&#8217;s 0, as you point out.  But the adherents of the ideology say that you should never bet infinite odds on anything&#8212;for what if you&#8217;re confused about arithmetic, or a demon messed with your brain, etc. etc.?  I believe Eliezer Yudkowsky expressed this in slogan form as &#8220;0 and 1 are not probabilities.&#8221;</p>\n<p>So on reflection, maybe my only real peeve here is the conflation of the Bayesian formalism with the Bayesian ideology: it&#8217;s always questionable to use the former as a stalking-horse for the latter, but never more so than when the two actually contradict each other!</p>\n]]>", "author": "Scott", "published": "2016-03-09 17:05:34+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #83:</p>\n<p>What about relative to a halting oracle? &#8220;the next prime larger than 2^74,207,281-1 ?&#8221; intuitively feels &#8220;known&#8221; if we have an oracle/hypercomputer.</p>\n<p>Even if we had an ordinary computer, but it was 10^10^100 times faster (so it could print out any particular digit of the prime in a second), I think we&#8217;d still consider it known. So the actual running time does matter, even on the same algorithm. A formalization would need to take that into account.</p>\n<p>Suppose (this is probably already proven impossible, though) that there&#8217;s some unknown algorithm that would find the next prime after any given prime &#8220;fast&#8221;, and that furthermore that we can test any algorithm to see if it does this (with a guaranteed to halt test). Would a program that loops over all programs until it happens on the &#8220;prime-finding&#8221; one, then runs it to generate the next prime after 2^74,207,281-1, count as knowing that prime?</p>\n<p>Weirdly, my intuition says yes, which means there&#8217;s a difference between object level blind guessing and meta-level blind guessing.</p>\n<p>For a formal criterion, I&#8217;d first include all cases where we can generate individual digits quickly, regardless of method.</p>\n<p>Then to deal with my Graham example, maybe we should separate &#8220;platonic&#8221; computations that are costless in calculating how complicated the operation is (like shuffling around digits), and other computations that are costly (like iterating over possible numbers). You want to make sure the platonic group isn&#8217;t Turing complete, but still captures a good chunk of what we consider &#8220;simple&#8221; about function f. I&#8217;m not confident this is doable at all, because Turing completeness is difficult to prevent and we&#8217;re trying to include all &#8220;natural&#8221; functions. (e.g. we want to include exponentiation to allow 2^74,207,281-1 to be &#8220;known&#8221;, but we don&#8217;t want to allow recursion). A proof that this is *not* doable would also help, if we could isolate the assumptions that make it impossible.</p>\n<p>But separating permissible operations seems the right thing to do when you&#8217;re worried about different versions of the same algorithm producing different outcomes.</p>\n<p>What about the Graham derived number above, except we replace the last half of Graham&#8217;s number with the first prime exceeding it first? Some part of me insists this is still simpler than &#8220;first prime above 2^74,207,281-1&#8221;, but for this one I expect others&#8217; intuition to differ.</p>\n]]>", "author": "Avi", "published": "2016-03-09 17:15:13+00:00", "title": "By: Avi"}, {"content": "<![CDATA[<p>(To clarify, different outcomes means whether we&#8217;d consider it known or not, not that the algorithm produces different results)</p>\n]]>", "author": "Avi", "published": "2016-03-09 17:18:43+00:00", "title": "By: Avi"}, {"content": "<![CDATA[<p>Scott Says #85:</p>\n<p>&#8221; The fundamental problem with pointing to the difficulty of predicting computer programs is that you DON’T just need to wait and see! Rather, if you know the code of the program, you can always just run the program on a different, faster computer to predict it.&#8221;</p>\n<p>But if you run your superfast computer to find a numerical counterexample to prove that a mathematical proposition is untrue you will never find it if it is in fact true. And if you run the superfast computer to find a proof of it your will never find it if the proposition is true but has no finite proof. Turing tells us there is no way in general to put statements into the categories provable, false, or true but not provable; so maybe working on the Goldbach problem is a waste of time and maybe it isn&#8217;t.  And even if Goldbach isn&#8217;t there are a infinite number of similar problems that are. So even if your superfast computer has been working on Goldbach for a trillion years it might stop in the next 10 seconds or it might never stop. All you can do is watch it and see.</p>\n<p> John K Clark</p>\n]]>", "author": "John K Clark", "published": "2016-03-09 17:53:21+00:00", "title": "By: John K Clark"}, {"content": "<![CDATA[<p>Avi Says: in Comment #94 </p>\n<p>&#8220;What about relative to a halting oracle? “the next prime larger than 2^74,207,281-1 ?” intuitively feels “known” if we have an oracle/hypercomputer.&#8221;</p>\n<p>If it exceeds the computational power of the entire physical universe to calculate (as seems likely) does the 423rd prime number greater than 10^100^100 really exist or only sorta exist? </p>\n<p> John K Clark</p>\n]]>", "author": "John K Clark", "published": "2016-03-09 18:27:38+00:00", "title": "By: John K Clark"}, {"content": "<![CDATA[<p>John Clark #96: The point you&#8217;re both trying to make makes absolutely no sense to me.  I&#8217;m &#8230; <i>familiar</i> with the unsolvability of the halting problem, and with the fact that a program to (say) search for counterexamples to Fermat&#8217;s Last Theorem still won&#8217;t find any counterexamples if you run it twice as fast.</p>\n<p>But human actions are always chosen after only a finite amount of deliberation.  This means that, if</p>\n<p>(a) you possessed an exact description of the physical state of someone&#8217;s brain, as well as of their environment, and<br />\n(b) the laws of physics are computable,</p>\n<p>then in principle, you could calculate the probabilities for everything the person might do at a given future time&#8212;if you liked, until the end of the person&#8217;s natural life.  (And that&#8217;s what we&#8217;re trying to talk about, the predictability of the sorts of people who have already lived, not of hypothetical future immortals.)</p>\n<p>Moreover, you could generate this information (say) 100 times as quickly as the person him- or herself generated it, by the simple expedient of running the program on massively-parallel computers that simulated the brain at 100x the natural speed.  (Since neurons are incredibly slow by electronics standards, this would surely be possible, <i>assuming</i> we had such a simulation in the first place.)  The unsolvability of the halting problem is completely irrelevant to this.</p>\n<p>It&#8217;s totally fine if you want to dismiss all this as <i>irrelevant</i> to the aspects of free will that you care about.  But that you&#8217;d have the prediction capability I said, under the assumptions I said, is not debatable.</p>\n]]>", "author": "Scott", "published": "2016-03-09 18:35:14+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Clark #98: given the assumption of an oracle, we would be able to compute any given digit quickly. We couldn&#8217;t *store* it all, and you could advocate something like <a href=\"https://en.wikipedia.org/wiki/Ultrafinitism\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Ultrafinitism</a> and say it doesn&#8217;t *really* exist, but the existence of an oracle would seem to imply that ultrafinitism is false, because the outcome of the calculation depends on larger numbers. If you want to prove something actually is an oracle, you&#8217;d need to assume P!=NP, though, or it could be tricking you.</p>\n]]>", "author": "Avi", "published": "2016-03-09 19:26:38+00:00", "title": "By: Avi"}, {"content": "<![CDATA[<p>Scott says in #98:<br />\n&#8221; But human actions are always chosen after only a finite amount of deliberation. This means that, if (a) you possessed an exact description of the physical state of someone’s brain, as well as of their environment, and (b) the laws of physics are computable, then in principle, you could calculate the probabilities for everything the person might do&#8221;</p>\n<p>I would certainly agree with that, if you can calculate when a person will die then you&#8217;d know if they haven&#8217;t had thought X or performed action Y by then they never will; but I think  that fact just tells us something about the fragile nature of human biology rather than anything profound about the universe as a whole. I was also a little confused when you said in your The Ghost in the Quantum Turing Machine essay:</p>\n<p>“free will” seems to combine two distinct ideas: first, that your choices are “free” from any kind of external constraint&#8221; </p>\n<p>I don&#8217;t see why anybody would even want that sort of freedom, I want to be influenced by outside factors like light bouncing off a wall so I don&#8217;t walk into one.   </p>\n<p>&#8220;and second, that your choices are not arbitrary or capricious, but are “willed by you.”&#8221;</p>\n<p>But if I am rational then there is a reason, a cause, for why I behaved as I did, that&#8217;s why when somebody behaves in a way we don&#8217;t understand we say &#8220;why did you do that?&#8221; and if they can not answer we conclude they are irrational.</p>\n<p>It seems to me that absolutely everything happens because of cause and effect and thus is deterministic (but not necessarily predictable) OR it does not happen because of cause and effect and thus is random. So like it or not we&#8217;re either roulette wheels or we&#8217;re cuckoo clocks.</p>\n<p> John K Clark</p>\n]]>", "author": "John K Clark", "published": "2016-03-09 23:57:05+00:00", "title": "By: John K Clark"}, {"content": "<![CDATA[<p>I think the &#8220;0 and 1 are not probabilities&#8221; is similar to a frequentist sentiment I saw one written time in response to a typo of significance of detection of some effect: &#8220;I&#8217;m not even 900 sigma confident that I&#8217;m awake right now.&#8221; Very small numbers are hard to interpret&#8230;</p>\n]]>", "author": "clayton", "published": "2016-03-10 00:27:50+00:00", "title": "By: clayton"}, {"content": "<![CDATA[<p>0 and 1 are not probabilities &#8211; they&#8217;re Boolean values that can only be  applied at a different level of abstraction than probability theory.  So Yudkowsky is correct there.</p>\n<p>The Less Wrong/Yudkowskian mistake is to think that all of intelligence can be captured by pattern recognition.   What Yudkowsky fails to grasp is that probability theory can really only establish correlations (patterns).  It cannot definitely establish causation.  Causation is not reducible to mere correlations.</p>\n<p>To properly handle causation, we need categorization, which the process of combining some particular set of data into single coherent concepts.  </p>\n<p>To see that this cannot be reduced to probability calculations, we just need to consider happens when we attempt to compare different categories:  this depends on how data is *presented* or *communicated*. </p>\n<p>It&#8217;s important to understand that concepts (categories) are *identical* to explanations.  This is because concepts are *models* about theory.   </p>\n<p>This is where IBE (Inference to the Best Explanation) comes in.  By using explanations for inference, we are actually comparing hypotheses according to how they are symbolically represented or presented (specifically, according how &#8216;coherent&#8217; a given set of data making up a category is).  But this is partially a matter of &#8216;style&#8217; or &#8216;presentation&#8217;.</p>\n<p>But in Bayesian probabiliy theory, the probabilities of a given hypothesis don&#8217;t depend on how the evidence is presented.  Ergo, categorization cannot be captured by probability theory.  </p>\n<p>The conclusion is that probabilities are not the correct measure for handling uncertainty about models.  As mentioned, we need a &#8216;coherence&#8217; measure of some kind.</p>\n]]>", "author": "mjgeddes", "published": "2016-03-10 05:30:12+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>@Scott #93</p>\n<p>I hadn&#8217;t heard the 0 and 1 are not probabilities position before. My first thought is that it&#8217;s nonsense. E.g. P(\\Omega)=1 and tautologies like P(A|A) = 1 are obvious counterexamples. You can literally construct endless more.</p>\n<p>It&#8217;s funny, for hundreds of years people mistrusted (Bayesian) inductive logic and insisted on only deductive reasoning in e.g. science. Now you tell me there are people with the exact opposite position!</p>\n]]>", "author": "andrew", "published": "2016-03-10 13:58:03+00:00", "title": "By: andrew"}, {"content": "<![CDATA[<p>@Scott @andrew</p>\n<p>The debate is not really about Bayesianism imho.<br />\nMy point was that Pr[15 /= 5&#215;3] > 0 just as<br />\nPr[16579 /= 137*121] > 0<br />\nand Pr[n /= q*p] with n = 10^80<br />\nfor the simple reason that every mathematician and quantum computer has a non-zero probability to fail and there is only a finite number of them in the visible universe.<br />\nAvi quantified the probability and I really think if you disagree with it then you disagree with physics as we know it.</p>\n<p>The platonic idea that 15=3&#215;5 is absolutely certain implies that there is a reality beyond physics and you would have to explain how you can be so certain about that.</p>\n]]>", "author": "wolfgang", "published": "2016-03-10 15:39:08+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>wolfgang #104: On the contrary, if you think it&#8217;s <i>conceivable</i> that 15&ne;3&#215;5, then I&#8217;d say that you&#8217;re the one who needs to explain what possible observations of the physical world would lead you to think that&#8212;otherwise, I won&#8217;t even understand what you mean.  As I tried to explain in <a href=\"http://closertotruth.com/series/what-truth#video-49253\" rel=\"nofollow\">this video</a>, even if cavemen found that anytime they put two rocks and two rocks together they got five rocks, it would be bizarre for them to conclude that &#8220;2+2=5.&#8221;  Rather, the cavemen would be deeply confused by what was happening&#8212;confused <i>because they knew that 2+2=4</i>&#8212;and would probably look for explanations to settle the mystery (maybe an animal spirit always comes along and inserts the fifth rock?).</p>\n<p>So, if our certainty that 2+2=4 doesn&#8217;t come from experience, where <i>does</i> it come from?  From the exercise of reason&#8212;the same reason that we need as a prerequisite to any empirical investigation.  That we have the capacity for reason is of course a contingent fact of physics and biology.  But the good news is that once we do have it, we can use it to formulate general statements like Modus Ponens or 2+2=4 that we can see would still be true even if the laws of physics had been different, and that indeed have undergone no change even as physics has been revolutionized multiple times.  (Otherwise, I&#8217;d say that the very words and concepts that we&#8217;re using to have this conversation are meaningless, so we might as well stop.)</p>\n<p>I don&#8217;t call myself a &#8220;Platonist,&#8221; since I don&#8217;t even know what it even means to say that mathematical truths &#8220;exist in a Platonic realm.&#8221;  Indeed, that concrete way of putting things even strikes me as a step backwards&#8212;as if astronomers could one day send probes to Plato&#8217;s realm to find out what&#8217;s in it, or prove that it never existed.  The concepts of &#8220;existence&#8221; and &#8220;reality&#8221; that we use when discussing physical objects are just flat-out irrelevant here.</p>\n<p>I instead call myself an &#8220;anti-anti-Platonist&#8221;: someone who&#8217;s not literally committed to a &#8220;Platonic realm&#8221; of mathematical truth, but who given the choice, would much rather that people believe in such a realm than that they spout the self-evident garbage that goes with denying math&#8217;s intellectual autonomy.</p>\n]]>", "author": "Scott", "published": "2016-03-10 16:48:35+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>>> spout the self-evident garbage<br />\nalright, I get it</p>\n]]>", "author": "wolfgang", "published": "2016-03-10 17:01:48+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Scott Says in Comment #105 </p>\n<p>“ if you think it’s conceivablethat 15≠3×5, then I’d say that you’re the one who needs to explain what possible observations of the physical world would lead you to think that”</p>\n<p>I agree, and for that reason I think that physics is (probably) more fundamental than mathematics. Mathematicians are always saying that mathematics is a language, a language that is especially good at describing how physical things behave but a language nevertheless. If that’s true then like any other  language you can write both fiction and nonfiction. So maybe inner consistency isn’t enough for reality, after all some novels have no plot holes, so maybe some very abstract mathematics like Kenneth Kunen’s Huge Cardinal Numbers or even the 423rd prime number greater than 10^100^100 are fictional stories written in the language of mathematics that are equivalent to fictional Harry Potter stories written in English.</p>\n<p> John K Clark</p>\n]]>", "author": "John K Clark", "published": "2016-03-10 18:57:59+00:00", "title": "By: John K Clark"}, {"content": "<![CDATA[<p>What about simple miscomputation?  Like thinking 12+20=22 because you just added incorrectly.  In this case, I guess, the observation is that whenever you carry out the process you are aware of for adding numbers, with the inputs &#8220;12&#8221; and &#8220;20&#8221;, you get &#8220;22&#8221;.  Except you&#8217;re not actually carrying it out correctly.</p>\n]]>", "author": "Sniffnoy", "published": "2016-03-10 19:02:08+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>John Clark #107: By exactly the same logic, someone else might claim that geology and biology are &#8220;more fundamental than physics,&#8221; because physics is equally happy to describe fictional icy methane worlds orbiting two suns and populated by three-eyed tentacle creatures made of silicon; only geology and biology describe our actual earth with its carbon-based life.</p>\n<p>This would actually be perfectly fine, as an explanation for why someone <i>preferred</i> geology or biology over physics.  To each her own!  But the use of the word &#8220;fundamental&#8221; here is just silly.  Physics and math are intertwined but about different subjects: physics, the laws of our universe; math, the necessary truths that would hold even if our universe were different.  Math supplies the menu of possibilities from which physics chooses.  Both subjects have their own fundamental discoveries and concepts.</p>\n<p>Incidentally, the study of large cardinal axioms, CH, AC, etc. is an example very different in character from the rest of mathematics.  While it&#8217;s still rigorous and important mathematics, that study really <i>might</i> be compared to writing fanfiction, in the sense that one creates whole detailed universes in which all of math can be done, but which differ from each other, and no one of which could clearly be said to be the &#8220;real&#8221; universe.</p>\n<p>But what about Wiles&#8217;s proof of Fermat&#8217;s Last Theorem&#8212;was that <i>also</i> fanfiction?  There&#8217;s no alternative universe where x<sup>n</sup>+y<sup>n</sup>=z<sup>n</sup> has nontrivial integer solutions for n&ge;3.  The same goes for virtually everything in number theory, analysis, topology, algebraic geometry, combinatorics, theoretical computer science, etc., almost none of which has any nontrivial dependence on the axioms of set theory.</p>\n<p>Finally, I don&#8217;t agree that math is a language.  Languages, definitions, and notations are certainly part of it, but another part is <i>discoveries</i>: things that couldn&#8217;t possibly have been otherwise, that follow from the definitions, that humans didn&#8217;t know and then suddenly did know.  Once finite simple groups were defined in the 1800s, the existence of the Monster group then followed as an unavoidable consequence&#8212;though no one knew it until the late 1970s / early 1980s.  In that sense, the Monster is not a convention about how to use language, like &#8220;a bachelor is an unmarried man.&#8221;  Nor is it fanfiction.  Even though it has no physical location or extent, humans discovered it in much the same sense that they discovered Antarctica and Pluto.</p>\n]]>", "author": "Scott", "published": "2016-03-10 19:47:25+00:00", "title": "By: Scott"}]