[{"content": "<![CDATA[<p>A different kind of intuition is helpful in the first-round problem: pecks that occur simultaneously must be independent. (But in real life, nearly-simultaneous events are perceived to be dependent.) So the global problem becomes a local one and no effects can &#8220;propagate&#8221;, and in particular the number of chicks doesn&#8217;t matter.</p>\n<p>There&#8217;s another interesting observation about the setups that you consider. Each of the n-dimensional tori has a symmetry group that acts transitively, so that each chick is equal. Very mathematically intuitive, but what about different kinds of symmetry? Do the 2D cylinder and Mobius strip have the same survival statistics?</p>\n<p>Some generalizations include chicks on regular graphs, or graphs in general, or directed graphs (which connected graph maximizes the survival rate?) as well as the case of nonlethal pecks (what if they&#8217;re only 50% effective?).</p>\n<p>As is typical in discrete mathematics, there&#8217;s a wide range of generalizations for a simple question, and few of them actually correspond to real-world chicken behavior.</p>\n]]>", "author": "unekdoud", "published": "2017-07-06 08:00:45+00:00", "title": "By: unekdoud"}, {"content": "<![CDATA[<p>I think I found a better analytical approximation for your one-round-of-pecking case. It&#8217;s closely related to the Beta distribution:</p>\n<p>\\[p(k) = \\frac{k^{N/2} (N/2-k)^{N/2}N!}{(N/2)^N ((N/2)!)^2} \\]</p>\n<p>This function is still not correct, as it gives zero probability to \\(k = 0\\) and \\(k = N/2\\), but it does not display the asymmetrical error of your binomial solution.</p>\n<p>I guess that working out why this is a plausible limit is the next step!</p>\n]]>", "author": "Ian G", "published": "2017-07-09 18:07:56+00:00", "title": "By: Ian G"}, {"content": "<![CDATA[<p>First: I believe your graphics are wrong in the section on Markov chains; you&#8217;ve got a lot of diagrams with 1 black dot and 3 white dots that you call absorbing, but it&#8217;s actually 3 black dots and 1 white dot that should be absorbing.  (The error is remarkably consistent; by my count you have 4 wrong SVG files and one wrong PNG file (that&#8217;s used twice).  Also, in the first wrong SVG file the unreachable states with 3 &#8220;black&#8221; (gray) dots and 1 white dot should have 3 white dots.)</p>\n<p>Second: I believe I have a better explanation for your one-round results, at least in the case where you have an odd number of chicks.</p>\n<p>Let&#8217;s start by computing the probability of seeing exactly \\(k\\) unpecked chicks out of \\(n\\) total (after the first round).  A particular chick is unpecked if the chick to the left pecks to its left, and the chick to the right pecks to its right; only those two chicks matter.  In particular, the pecking state of the chick under consideration is irrelevant; so let&#8217;s stop thinking about it.  Where it might seem like we should look at neighborhoods of \\(a-1, a, a+1\\), we&#8217;ll instead look at neighborhoods (shifted by one) of \\(a, a+2\\) (ignoring the chick at \\(a+1\\)).  We can combine multiple such neighborhoods into a chain \\(a, a+2, a+4, \\ldots\\), where we wrap around at the end of the list.  If \\(n\\) is even, there are two such chains; for example, \\(n=8\\) has \\((1,3,5,7)\\) and \\((2,4,6,8)\\).  If \\(n\\) is odd, there is only one chain; \\(n=7\\) has \\((1,3,5,7,2,4,6)\\).</p>\n<p>We can represent a chain as a sequence of letters \\(L\\) or \\(R\\).  Then within a chain, there is a sequence \\(LR\\) iff the chick between these two chicks is unpecked.  (Since we consider that chains wrap around, having \\(L\\) at the end of the sequence and \\(R\\) at the beginning also counts as an unpecked chick.)  Now let&#8217;s look at the probability of seeing exactly \\(k\\) sequences \\(LR\\) in a random chain of length \\(m\\).  We can compute this by checking how many of the \\(2^m\\) possible chains have \\(k\\) \\(LR\\) sequences.</p>\n<p>Now, between every two &#8220;adjacent&#8221; \\(LR\\) sequences there is exactly one \\(RL\\) sequence; in other words, every chain has the same number of \\(LR\\) and \\(RL\\) sequences.  If we count both \\(LR\\) and \\(RL\\) changes together, then a chain with \\(k\\) \\(LR\\) sequences will have \\(2k\\) changes.  For any given chain we can define a change-chain.  Start by adding \\(n\\) for &#8220;no change&#8221; or \\(c\\) for &#8220;change&#8221; between every pair of letters; so for the chain \\(LLLRLLR\\) we would end up with \\(LnLnLcRcLnLcRc\\).  (That last \\(c\\) is &#8220;between&#8221; the final \\(R\\) and the initial \\(L\\).)  Then delete the original \\(L\\)s and \\(R\\)s, so our example would end up as \\(nnccncc\\).</p>\n<p>Every chain converts to a single change-chain; every change-chain is the conversion of exactly two chains (one where the first letter is an \\(L\\), one where the first letter is an \\(R\\)).  An \\(m\\)-letter chain will have \\(k\\) \\(LR\\)s iff its change-chain has \\(2k\\) \\(c\\)s.  So we only need to count the number of \\(m\\)-letter change-chains with exactly \\(2k\\) \\(c\\)s, which is simply \\({m \\choose 2k}\\) (and then double that, because each change-chain corresponds to two chains).  Then the probability of having \\(k\\) \\(LR\\) sequences in a random \\(m\\)-letter chain is \\(2{m \\choose 2k}/2^m\\), or \\({m \\choose 2k}/2^{m-1}\\).</p>\n<p>Now if we go back to the original problem with \\(n\\) chicks, there are two cases.  If \\(n\\) is odd, then it has a single chain of length \\(n\\), so the probability of having \\(k\\) unpecked chicks is<br />\n\\[<br />\n{{n \\choose 2k} \\over 2^{n-1}}.<br />\n\\]<br />\nIf \\(n\\) is even, then it has two chains, each of length \\(n/2\\).  Then the probability of having \\(k\\) unpecked chicks is<br />\n\\[<br />\n\\sum_{0 \\leq a \\leq k} {{n/2 \\choose 2a}{n/2 \\choose 2(k-a)} \\over 2^{n-2}}.<br />\n\\]</p>\n<p>The probability in the even case is very messy (and I don&#8217;t know how to simplify it); also, I haven&#8217;t double-checked it, so there might be minor errors in the formula.  So from now on I&#8217;ll concentrate on the odd case.</p>\n<p>If we look at the formula for the odd case, it&#8217;s not a standard binomial distribution; but it&#8217;s close.  If we started with the standard distribution \\({n \\choose k} / 2^n\\), we can turn it into our distribution by discarding the values for odd \\(k\\) (and pushing the surviving values to the left, to keep them adjacent), and then doubling each probability (so that the probabilities sum to 1 after we discard half of them).  We can use this to see how to approximate our distribution with a normal distribution.  A standard binomial distribution \\({n \\choose k} / 2^n\\) can be approximated by a normal distribution with mean \\(n/2\\) and standard deviation \\(\\sqrt{n}/2\\).  Since our \\(n\\)-chick distribution has half the mean and is half as wide as the standard binomial distribution, its approximating normal distribution will also have half the mean and half the standard deviation.  So our \\(n\\)-chick distribution can be approximated by a normal distribution with mean \\(n/4\\) and standard deviation \\(\\sqrt{n}/4\\) (at least when \\(n\\) is odd).</p>\n<p>Since normal and binomial distributions are good approximations of each other, this \\(n\\)-chick normal distribution can in turn be approximated by a binomial distribution, which it turns out has parameters \\(N&#8217;=n/3\\) and probability \\(p&#8217;=3/4\\); but this is just an approximation of an approximation of the correct distribution, and I don&#8217;t believe that these \\(N&#8217;\\) and \\(p&#8217;\\) have any combinatorial meaning.</p>\n<p>Third: I had a plan for how to approach the iterated problem.  The plan didn&#8217;t work out, but I gathered some intriguing (and potentially useful) data on the way that I&#8217;d like to share.</p>\n<p>My plan was to take the one-round results and record the number of singleton chicks and pairs of chicks separately.  Then I would approximate them with separate normal distributions, multiply the mean and standard deviation of the pairs-of-chicks distribution by 1/3, and add the result back to the singleton-chicks distribution.  (Using (incorrectly, as it turns out) the result that you can add normal distributions by adding their means and variances.)  I hoped that this would give the correct mean and standard deviation of the experimental iterated distribution.</p>\n<p>I decided to start with exact results, looking at all possible results of a small number of chicks; for \\(n\\) from 3 to 17, I computed the exact mean and variance of the distributions for all surviving chicks, all singleton surviving chicks, and all chicks surviving in pairs (which is always an even number).  My first surprise was that the variance of the latter two distributions was actually higher than the variance of the former, even though the former distribution should be the sum of the latter two.  Upon reflection, this makes sense; the result about adding normal distributions requires that the samples from the source distributions be independent, and our singleton-chick and paired-chick samples are evidently strongly anti-correlated (which seems obvious in retrospect).</p>\n<p>The second surprise is that all of these means and variances turned out to be exact numbers of a particularly simple form.  For \\(n\\) from 4 up, the all-chicks mean is \\(n/4\\), and the singleton-chicks and paired-chicks means are both \\(n/8\\).  (Not too surprising&#8230; those are the asymptotically correct numbers, but I am a little surprised that they are exactly correct.)  And for \\(n\\) from 7 up, the all-chicks variance is \\(n/16\\), the singleton-chicks variance is \\(5n/64\\), and the all-chicks variance is \\(9n/64\\).  (Results are tested up to \\(n=17\\), which is where I got bored of waiting for my slow test code.)</p>\n<p>I don&#8217;t know enough about statistics or probability to take this any further, so I&#8217;m giving up here (at least for now).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/w/Witty:Carl.html\">Carl Witty</a>", "published": "2017-07-09 20:36:36+00:00", "title": "By: Carl Witty"}]