[{"content": "<![CDATA[<p>Jen #398</p>\n<p>Your evidence from China and India is probably correct, but I don&#8217;t believe your conclusions.  We do not suffer in the West with the degree of male domination found in either of those countries.  India appears to have a genuine rape culture; China has such a preference for men over women that it has a grave problem with gender-selective abortion.  Do these countries really have a more tolerant attitude towards female education in STEM?</p>\n<p>In fact, the differences between wealthy and poorer countries relate to the greater level of choice and freedom that we in wealthier countries enjoy.  In a poorer country, one takes whatever opportunities one can find.  In a wealthier country, one has greater freedom to choose the work that gives job satisfaction and personal fulfilment.</p>\n<p>The paradox was examined in this Norwegian TV documentary which asked why, when Norway was found to be the most gender-equal society in the world, nurses were nearly always women, while engineers were nearly always men.</p>\n<p><a href=\"https://www.youtube.com/watch?v=p5LRdW8xw70\" rel=\"nofollow\">https://www.youtube.com/watch?v=p5LRdW8xw70</a></p>\n<p>Raven on the Hill #407</p>\n<p>I would be surprised if Joanna Russ had <i>not</i> faced the pressure you describe, because after all she lived in the &#8220;Mad Men&#8221; era.  I hope and believe that we have moved on since then.</p>\n<p>Honours for successful women scientists are a separate topic.  Vera Rubin most certainly deserves the Nobel Prize for her work on galactic rotation, which is fundamental to our ideas about dark matter.  She is now 86, and I sincerely hope that she will win the prize before it is too late.</p>\n<p>Feminist writers tend to overlook women like Rubin, because what seems to motivate them is not cases where a first-class woman scientist has been overlooked, but those where they can argue that her honour was stolen by a man.  Thus they are much more interested in believing that Jocelyn Bell was robbed by Hewish and Ryle, or that Einstein stole his ideas from Mileva Marić.</p>\n]]>", "author": "Bill", "published": "2015-01-05 03:08:55+00:00", "title": "By: Bill"}, {"content": "<![CDATA[<p>@Kev Comment #402 </p>\n<blockquote><p>Instead of demanding we vilify her, how about you do the work and show where she is wrong.\n</p></blockquote>\n<p>Where do we even begin. </p>\n<blockquote><p>[Aaronson] starts on the assumption that women do not suffer things like social anxiety or rejection.\n</p></blockquote>\n<p>I really like Alexander&#8217;s bear analogy. </p>\n<p>So imagine I&#8217;m Bill Gates. All the privileges. I get mauled by a bear. I complain to my friends and later explain how my luminous skin made me more conspicuous at night while hiding in a bush, and I might have evaded mama bear had I been more tan. &#8220;Wait, are you assuming black people don&#8217;t get mauled by bears? Black people get mauled by bears &#8211; PLUS, they&#8217;re discriminated against in the work place!&#8221; Um, ethnicity sounds like a problem only tangentially related to my unfortunate conspicuousness, and I even have this neat foundation where I- &#8220;You sir, need to check. your. privilege.&#8221;</p>\n<blockquote><p>it was just a yalp of entitlement combined with an aggressive unwillingness to accept that women are human beings just like men.\n</p></blockquote>\n<p>&#8220;So entitled he requested medicinal castration &#8211; the NERVE!&#8221;</p>\n<blockquote><blockquote>If that’s been your experience, then I understand how it could reasonably have led you to your views. Of course, other women may have had different experiences.</p>\n</blockquote>\n<p>Translation: I think  you’re lying,\n</p></blockquote>\n<p>1. &#8220;People have contradictory experiences.&#8221;<br />\n2. BULLSHIT DETECTED.<br />\n&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;-<br />\n3. You must be lying. </p>\n<p>A tour de force of logic. </p>\n<blockquote><p>Never mind that the movie epitomizing the nerd/jock dichotomy I lean heavily on features a nerd raping a woman in an act of revenge,\n</p></blockquote>\n<p>I will grant you this one, Kev. </p>\n<blockquote><p>will find that the only feminist whose name he appears to remember is Andrea Dworkin’s\n</p></blockquote>\n<p>Okay&#8230; So we realize we&#8217;re describing the impressions of a naive, autodidacting, highschool runt. Right? </p>\n<p><a href=\"http://thecodelesscode.com/case/144\" rel=\"nofollow\"><br />\n&#8220;In Perl, underline is understood!<br />\nIn Perl, underline is understood!&#8221;<br />\n</a></p>\n<blockquote><blockquote>(sigh)</p>\n</blockquote>\n<p>Translation: Having to explain my suffering to women when they should already be there, mopping my brow and offering me beers and blow jobs, is so tiresome.\n</p></blockquote>\n<p>Meta translation: I&#8217;m too busy generating clickbait to notice the wrath of the tempest Aaronson was emotionally bracing himself for.</p>\n<blockquote><blockquote>Here’s the thing: I spent my formative years—basically, from the age of 12 until my mid-20s—feeling not “entitled,” not “privileged,” but terrified. I was terrified that one of my female classmates would somehow find out that I sexually desired her, and that the instant she did, I would be scorned, laughed at, called a creep and a weirdo, maybe even expelled from school or sent to prison.</p>\n</blockquote>\n<p>This is a critical passage, because it really lays out his thesis: That fear of rejection is a male-only experience</p></blockquote>\n<p>Hello. I run Microsoft. You know what makes me feel wealthy? Money. Bear injuries, on the other hand, do not make me feel rich. Actually, they kinda hurt when I put pressure on- &#8220;Pain is not a rich-only experience!&#8221;</p>\n<blockquote><blockquote>My recurring fantasy, through this period, was to have been born a woman, or a gay man, or best of all, completely asexual,</p>\n</blockquote>\n<p>Translation: I believe that women and gay men do not experience either sexual desire or fear of rejection,\n</p></blockquote>\n<p>It&#8217;s me again, Bill- &#8220;<b>PRIVILEGE.</b>&#8221; </p>\n<p>So Kev. I&#8217;m only like half way through the article. But I feel at the third Bill, this is starting to get redundant. Are we done yet? Or do you still remain uncovinced that Marcotte, is in fact, a Vorgon spy.</p>\n]]>", "author": "anon", "published": "2015-01-05 03:32:21+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>Scott #414 (good to hear your voice again in this) &#8212; yes, divorce law/court is horribly screwed up. It gets worse only in Russian lit. On the other hand, it&#8217;s once again the difficulty you run into at a governmental/policy level when you&#8217;re trying to deal with extremely complex, personal, and urgent questions (particularly when almost everyone going through the process is a complete noob. I came to the conclusion that most of a divorce lawyer&#8217;s fee is for shepherding disoriented and substantially crazy people). If you look at the caseloads, they&#8217;re tremendous. You can&#8217;t say &#8220;screw it, this isn&#8217;t something for the state to deal with&#8221;, because then you wind up with property disputes, even worse mother/child poverty, and serious trouble over kids. We also make marriage a legal state, which means you have to be able to undo it legally. So divorce law is a morass of convention, precedent, politics, sociology, psychology, criminal justice, property law, home economics, and judges&#8217; individual lunacies, and it changes all the time in every state&#8230;the only blessing is that most divorces leave the courts for good when the children turn 22. Compounding the problem is that most statehouses are nuthouses, and they make divorce laws in each state, with the American Bar Assoc and judges&#8217; organizations shouting &#8220;whoa, nelly&#8221; all the time. (The state reps, some of whom have the IQs of carrots, like to make impracticable divorce laws.) Anyway &#8211; when you deal with law, you deal with a machine, and the more socially ordinary the kind of case, the bigger and less forgiving the machine. It takes people inside the machine a long time to understand they&#8217;re in one. </p>\n<p>Welcome to social sciences! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_biggrin.gif\" alt=\":D\" class=\"wp-smiley\" /> And look, there&#8217;s nothing physical sciences would recognize as a control.</p>\n<p>Incidentally, I&#8217;m not saying that broad social forces are more important than individual ones. They both exist and both matter. I&#8217;m saying it depends on the scale and context you&#8217;re looking at. If you want to understand those structural forces directing the high-stakes decisions of the individual, you&#8217;re going to come away from cris de coeur for a little bit. (If you want this in its original revolutionary horror, reread Hobbes, the father of modern government.) If you want to understand what those structures mean as part of lived experience, you want to be up close to the people&#8217;s voices and minds. They aren&#8217;t wholly independent, but some people build the structure and some have no influence on it at all, and this is why power and influence and position matter. Your young woman with the lovelorn older man, in the last thread, has influence in one relationship. The state legislator has influence in millions. A professor at MIT is not without influence, either. (I&#8217;m thinking of one guy in particular, an EE&#8230;what was his name? Bush, Vannevar. Not bad with the social-structure-building, Prof. Bush.) Which is part of what I&#8217;ve been saying throughout, though maybe not straightforwardly enough: your views on this matter (more) because of your position. That&#8217;s not a suggestion that you get out the hex paper, but a suggestion that you are not actually free, in that position, to regard yourself reasonably as an entirely private person. You will help shape important structures and your views, as you do so, will matter. Which is why they have to be smart and broad and nuanced and well-informed, and part of why this is a good conversation.</p>\n<p>About the other books &#8212; next post, I guess, this is long.</p>\n]]>", "author": "Amy", "published": "2015-01-05 03:55:51+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Scott #415 &#8211; you&#8217;re right, Paglia and CSH certainly aren&#8217;t regarded as feminists, and for good reasons. (I don&#8217;t know Patai.) But it&#8217;s a long reach back for me for both of them, and Paglia&#8217;s hardly been heard from in over a decade. I haven&#8217;t checked out the link above, the Autism/Feminism/Nerds one, but I have a feeling that &#8212; in a practical sense, at least &#8212; this direction is where some of the amelioration will come from. The problem is it probably won&#8217;t be very smart. </p>\n<p>I keep thinking about the combination of literalness, lack of the lived experience that makes context, and concentrated theory.</p>\n]]>", "author": "Amy", "published": "2015-01-05 04:31:48+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>A digression on feminist ideas of patriarchy and power seems like it might be worthwhile. </p>\n<p>Patriarchy is an anthropological term which refers to societies dominated by men. Feminist theorists have argued that, in most male-dominated societies, a male-dominated vertical hierarchy, very likely derived from ape instinct, is the social order. Sociology and current politics give this idea at least some weight.</p>\n<p>A long time ago, I remember reading some feminist theorist suggesting that we replace the idea of &#8220;above&#8221; with the idea of &#8220;more central&#8221; in our thinking. At the time it did not make sense to me—mathematically they are not very different—, but watching the behavior of people, especially white men when they feel they are on the bottom of heap, or even might be on the moving there, I think she had a point. The idea that white men are no longer better than (gasp!) blacks and women is persuading people to actual violence as well as support of idiotic policies.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hill:Raven_on_the.html\">Raven on the Hill</a>", "published": "2015-01-05 05:14:18+00:00", "title": "By: Raven on the Hill"}, {"content": "<![CDATA[<p>Bill, #437: &#8220;I would be surprised if Joanna Russ had not faced the pressure you describe, because after all she lived in the “Mad Men” era. I hope and believe that we have moved on since then.&#8221;</p>\n<p>We have moved on, but not, I think, far enough, and the advances we have made still might be reversed.</p>\n<p>&#8220;Feminist writers tend to overlook women like Rubin&#8221;</p>\n<p>I entered &#8220;Vera Rubin feminist&#8221; into my favorite search engine and found several entries from feminists. Rubin even made <i>Cosmos</i>, thanks to the good offices of executive producer Ann Druyan, who regards Rubin as a personal hero. Ironically, the <i>Time</i> article I got that information from names Druyan&#8217;s husband immediately after her name and then describes her as &#8220;a writer, producer and director&#8221; instead of giving her actual and senior title of executive producer—a very fine example of microaggression.</p>\n<p>Amy, #439: I will be interested in your comments on the books. I have written two cranky posts on them, like neither post, and want to see what you have to say.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hill:Raven_on_the.html\">Raven on the Hill</a>", "published": "2015-01-05 05:19:21+00:00", "title": "By: Raven on the Hill"}, {"content": "<![CDATA[<p>I think it is a worthy endeavor for anyone to spend some time trying to formulate a reasonable, consistent, etc., set of beliefs about important issues of society, such as those addressed recently in SO, and many others.</p>\n<p>However, given that these topics are very complex, slippery, multi-dimensional, highly charged, etc., one is unlikely to come up with a satisfactory set.</p>\n<p>Furthermore, many or most other people will have a different take. Many of these opinions are reasonable, some are extreme, some are batshit crazy, some are incoherent, and what not. So, if you publish your opinion, you are attracting a lot of attention, some of it rabid.</p>\n<p>Attempting to defend your positions from everyone firing away from all directions might be kind of fun (in an extreme sports kind of way, like BASE jumping), but there is zero chance you will ever reach an agreement with most of the critics.</p>\n<p>Thus, Scott, I admire your energy, gumption, and fearlessness in the face of the din, and hope you do not take it personally. I don&#8217;t know how you get any work done.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2015-01-05 05:48:15+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>It would be a good thing if the recent threads on SO attract the attention of under represented groups to the STEM world.</p>\n<p>For any minority or female high school students reading this, be assured that most university STEM departments not only will not discriminate against you, but probably have office trying to recruit you right now.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2015-01-05 05:58:20+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Ariel #428, that&#8217;s about right, except that I don&#8217;t know that any aspect of human doings is unconstrained by a larger social structure. Suppose you&#8217;ve had it with society and you go off to live in the woods. To begin with, the fact that &#8220;woods&#8221; is somehow in opposition to &#8220;society&#8221; in your mind comes from somewhere, as does your loopy, Rousseau-derived notion of an idyll (you&#8217;ll get there and find that the rest of nature has things to say about where you go and what you do). But anyway off you go. Where you go, what woods remain, is decided for you already by social definitions of not-woods and property laws (NO TRESPASSING, also rules about camping in national parks) as will your notions of how you&#8217;d better organize yourself once you get there. </p>\n<p>If you&#8217;re a professor in STEM, your actions are unbelievably constrained by larger structures. You might be very happy to live within those constraints, but that doesn&#8217;t mean they don&#8217;t exist. Not only have you already accepted disciplinary definitions and in some measure defined yourself by them, for decades you have lived by academia&#8217;s rules and procedures (note that Scott wrote #171 in 2014, not 2009) &#8212; and a large part of your life is given over to satisfying the rules of your funding agencies, as is the bent and scope of your work. </p>\n<p>If you talk to women in the professoriate, you&#8217;ll hear many appalling stories of attempting to have children and get tenure simultaneously. In the last thread, Lou suggested women sort of try to hide childbirth in the 5-year-grants, a little like sneaking veggies into cake batter for reluctant children. There&#8217;s some serious human craziness that goes on that&#8217;s driven by the way science and academia are organized.</p>\n<p>Anyway. My larger point is that I doubt you can get away from the structural forces, and the question is whether they&#8217;re benign in various people&#8217;s lives or not.</p>\n]]>", "author": "Amy", "published": "2015-01-05 06:04:45+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Interested Reader, #435, nutshells Other Scott.</p>\n<blockquote><p>– Laurie Penny is coming very very close to saying “We had it worse, so yours doesn’t count”</p></blockquote>\n<p>No, she really doesn&#8217;t. In fact, she says that both count. She says over and over, explicitly, that men&#8217;s pain is real, that it matters, that it counts. (&#8220;Hi there, shy, nerdy boys. Your suffering was and is real. I really fucking hope that it got better, or at least is getting better,&#8221;) </p>\n<p>So this argument is simply dishonest. She didn&#8217;t say what you&#8217;re criticizing her for saying.</p>\n<blockquote><p>– I really shouldn’t say “nuh uh” but I want to so here’s some stats indicating that no, really, statistically speaking men have romantic frustration way worse</p></blockquote>\n<p>Yes, I agree, this is what OtherScott said. But his stats were not actually relevant, in several ways. Just because a researcher (presumably chosen because she doesn&#8217;t mind walking up to strangers and talking to them) is able to do something doesn&#8217;t mean that Penny was in any way wrong when she said she couldn&#8217;t do the same thing.</p>\n<blockquote><p>– Even assuming that the people talking about this are really unattractive and so are much less likely to get “yes” to “wanna go out?”, the chances are still high enough that just asking people out would rather quickly resolve the issue</p></blockquote>\n<p>This was based on a 10% number that OtherScott literally just made  up.  There&#8217;s no reason to assume that this number means anything. It takes very little experimentation for me to determine that my number is in fact much, much lower than 10%, for example. </p>\n<p>OtherScott is an extremely attractive person who has trouble understanding the problems of unattractive people. That&#8217;s okay, but I wish he&#8217;d stop thinking that he&#8217;s an expert on my problems, and the problems of people like me (he wrote an entire post about me once).</p>\n]]>", "author": "Ampersand", "published": "2015-01-05 06:23:43+00:00", "title": "By: Ampersand"}, {"content": "<![CDATA[<p>Scott:</p>\n<p>Thank you, for both Comment 171 and for this follow-up post.</p>\n<p>I&#8217;m an unattractive, shy, very nerdy guy. I think it&#8217;s fair to say I&#8217;ve had MUCH less romantic success in my life than either you or OtherScott. </p>\n<p>But I&#8217;m also a feminist. Growing up, I was entirely, pathetically unable to perform the &#8220;boy&#8221; role adequately, which led to my being bullied, etc. The worst of it was that I learned to hate myself. I remember standing in front of a mirror, screaming &#8220;what is WRONG with you?&#8221; and punching myself as hard as I could, again and again (fortunately I was a wimp and couldn&#8217;t hit hard!).</p>\n<p>For me, encountering feminism was transformative; for the first time, I was being told that just because I couldn&#8217;t act the way boys were supposed to didn&#8217;t mean I was subhuman garbage. Instead, feminism told me, the idea that boys had to act in certain ways was garbage. Feminism rescued this shy nerd boy.</p>\n<p>But not completely &#8211; the scars ran too deep to be healed so easily. I stopped loathing myself so dramatically, but at some level I still thought of myself as fundamentally undeserving of love or affection, especially romantic affection.  Put another way, I thought I was gross. Being fat made matters worse, since our culture is full of messages to fat people telling us that we&#8217;re too disgusting to love.</p>\n<p>Regarding comment 171 and &#8220;male privilege,&#8221; to me it doesn&#8217;t matter much if you think you had &#8220;male privilege&#8221; or not. I think that&#8217;s largely an argument about terminology, and I&#8217;m more interested in arguments about policy. You obviously do agree that sexism (including sexism against women) exists and is a real problem, and (from what I&#8217;ve read, which is of course not comprehensive) it seems to me that you support policies that would tend to reduce sexism. To me, that matters more than the vocabulary.</p>\n<p>I care a lot about the problems and pain of shy male nerds. (Obviously, some of that caring is self-interest, for me.) But if people tell me that to care about shy nerdy men I have to become an anti-feminist, or to hate feminists and bash them the way OtherScott does, then that&#8217;s where I get off the train.</p>\n]]>", "author": "Ampersand", "published": "2015-01-05 06:38:59+00:00", "title": "By: Ampersand"}, {"content": "<![CDATA[<p>Ampersand #447: Thank you for sharing that.  Again, though, I simply didn&#8217;t see OtherScott as &#8220;bashing feminism&#8221;&#8212;only one particular cancerous strain within feminism, which the rest of the movement ought to stand up to for feminism&#8217;s own sake.  I believe OtherScott, like me, would strongly identify as a feminist.  (And FWIW, his girlfriend, Ozy, is a prominent feminist blogger.)</p>\n<p>Regarding your problems: have you tried online dating?  Losing weight?  What do you regard as your best qualities: empathy?  Some sort of professional skill?</p>\n]]>", "author": "Scott", "published": "2015-01-05 07:03:37+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Jake #429, stories like this are really important, thank you for telling that one. Because these things are invisible. So my question for you: How can someone like me put you at ease in conversation, in an actual room, so that you&#8217;re not worried that I&#8217;m afraid you&#8217;re going to attack me or some such? Is there any way? </p>\n<p>The problem in your thinking, btw, is here:<br />\n<blockquote>And it’s hard to escape! It really is! Because although I can recognize that I’m extremely atypical, and that ‘normal people’ don’t have this problem at all, I also know as a fact that ‘normal behaviour’ is not anything I would like to emulate. Today’s normal is the reason that misogyny is still a problem and Schrodinger’s rapist is still a concern! So obviously the solution is not for me to just overcome my anxiety and be normal.</p></blockquote>\n<p>While you&#8217;re right that most people don&#8217;t have this problem, most people also don&#8217;t assault women. Schrödinger&#8217;s rapist is a problem because of rapists. But you seem to believe that unless you&#8217;re practically nonexistent you&#8217;re going to damage women, and that there&#8217;s nothing inbetween self-effacement and misogyny. This isn&#8217;t true. </p>\n<p>Take for instance walking someone to a destination. It&#8217;s true that if you did this in a way that seemed to put Samaritan-weight virtue on it, rather than &#8220;oh I&#8217;m headed that way anyway, I&#8217;ll walk you over if you like&#8221; (and the answer of course might be no) many people would wonder what you were up to. The usual kind thing to do in the circumstance is to give good directions, smile, and be off. That&#8217;s already a donation of time and people appreciate it. But the key there is to know what the usual well-regarded thing is to do. Note that giving directions, smiling, and being off is not a microaggression, and you don&#8217;t have to expiate sins you haven&#8217;t committed. </p>\n<p>You also say you worry that you might have done damage or that others might have seen you in a certain way. Rather than assume the worst, I&#8217;d suggest asking. I&#8217;m guessing that your friends will be shocked that you&#8217;ve been worrying about this, and that it&#8217;s not something they&#8217;d even thought of. </p>\n<p>If you need to be thorough about these things, you can catalogue what people who are at ease and seem kind do; it changes from place to place, but you can take a look then at that catalogue, ask, are these all things I really want to do or do some of them seem, on inspection, rather thoughtlessly sexist; and adjust. Understand, though, that nobody&#8217;s requiring this of you. It&#8217;s an ethical way to behave if &#8220;just knowing what to do&#8221; doesn&#8217;t come naturally. </p>\n<p>I don&#8217;t think you should worry about working out. Being a decent guy doesn&#8217;t mean harming your health. </p>\n<p>As someone who once read Bonhoeffer for clues as to when and how breaking up with someone might be all right, I can&#8217;t claim zero knowledge of this impulse. But the response boils down to &#8220;you don&#8217;t have to be crazy about this&#8221;. You don&#8217;t have to stay up all night scrubbing the bathroom tiles to get every last speck out of the grout.</p>\n]]>", "author": "Amy", "published": "2015-01-05 07:13:54+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>FWIW, Scott Alexander does not identify as a feminist. I don&#8217;t think his position is very different from yours, though, just choice of labels. The variance of his expected future position is very large, which may justify rejecting labels.</p>\n]]>", "author": "anomynous", "published": "2015-01-05 07:32:07+00:00", "title": "By: anomynous"}, {"content": "<![CDATA[<p>Scott:</p>\n<p>OtherScott&#8217;s post wasn&#8217;t about criticizing radical feminists, or the worst excesses of Tumblr/Twitter feminism. He was very clearly talking about fairly mainstream feminists. Most of the post was dedicated to attacking Laurie Penny, who is super nice and very mainstream, who he characterized as being so awful that the nicest thing to say is that she is &#8220;probably not the literal worse.&#8221; </p>\n<p>He compares feminists to ravenous sharks who have shown up in massive numbers to explicitly tell him to die (&#8220;A feeding frenzy of feminists showed up to tell me I was a terrible person and deserved to die&#8221;). </p>\n<p>He says that nerds are &#8220;bitter about all the women who told us we were disgusting rapists when we opened up about our near-suicidal depression.&#8221; (I know he said &#8220;women,&#8221; but in context it&#8217;s fair to say he&#8217;s talking about feminists.)</p>\n<p>Then there&#8217;s the hundreds and hundreds of words likening feminists to the worst anti-Semites.</p>\n<p>If feminists are the people OtherScott describes, then we are subhuman scum who frankly deserve to die, because we are pure evil and have no worth at all. If the typical feminist response to someone saying &#8220;I&#8217;m so depressed I&#8217;m thinking of suicide&#8221; is to say &#8220;you&#8217;re a rapist!,&#8221; as OtherScott suggests, then feminism is an ideology of pure evil.</p>\n<p>And OtherScott didn&#8217;t say &#8220;some&#8221; feminists in the quotes above &#8211; he means feminists, not &#8220;one particular cancerous strain within feminism.&#8221; </p>\n<p>So I&#8217;ll stand by my characterization of OtherScott&#8217;s post. If I can&#8217;t stand feminists who have a &#8220;nerds evil, feminists good&#8221; ideology. And I can&#8217;t stand OtherScott&#8217;s &#8220;feminists evil, nerds good&#8221; ideology. I&#8217;m a feminist, AND I&#8217;m a nerd, and both those ideologies are poison to me.</p>\n<p>I&#8217;m aware of Ozy, and I&#8217;m a fan of their blogging. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n<p><i>Regarding your problems: have you tried online dating? Losing weight? What do you regard as your best qualities: empathy? Some sort of professional skill?</i></p>\n<p>I appreciate the place of compassion this is coming from, Scott. But, I&#8217;m not sure that advice from romantically successful, conventionally attractive nerds like you, is really what nerds like me require. I think the solutions that worked for you, probably won&#8217;t be applicable for me, because we&#8217;re not identical. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /></p>\n<p>I have tried all the conventional things, and I&#8217;m not asking for help. (Although, again, I thank you for you kindness, which is always appreciated).</p>\n<p>No one&#8217;s life is perfectly fulfilled in all areas. I have a lot of friends, a very busy social life, a very fulfilling career (exactly the career I dreamed of as a kid), a house I co-own with friends. I&#8217;m not lonely. I think I&#8217;m at a point where it makes more sense for me to focus on what makes my life wonderful, rather than focusing on what I lack. </p>\n<p>I do make some efforts regarding dating, and if something great comes along there I&#8217;ll welcome it. But if it never happens for me, I&#8217;ll still have a great life.</p>\n]]>", "author": "Ampersand", "published": "2015-01-05 08:06:34+00:00", "title": "By: Ampersand"}, {"content": "<![CDATA[<p>@bill #389, You write: &#8220;It is simply untrue that women who choose to study literature in place of chemical engineering are suffering from a lack of encouragement, institutional sexism, or some other vice of the “patriarchy”.</p>\n<p>I appreciate your certainty but you&#8217;re almost certainly wrong. And I&#8217;m not sure how the personality test results buttress your argument unless your implication is that culture couldn&#8217;t affect the outcome of that test. Do you honestly believe the most parsimonious explanation for the gender imbalance in STEM is nature? </p>\n<p>First, an overly long aside to preemptively rebut the charge that this isn&#8217;t motivated by some sort of blinding political correctness: if in a couple decades, if we&#8217;ve located some really important SNPs or even epigenetic mechanisms that dictate personality and intellectual capabilities and they happen to vary in important ways across population groups or the sexes, then so be it: we don&#8217;t get to tailor nature to our aesthetic ideals. (My best guess is that&#8217;s pretty darn unlikely to be the case. And that even if it is,  it probably won&#8217;t in a way that&#8217;s going to satisfy any self-contented contrarian desperate to say, &#8220;I told you so!&#8221;) </p>\n<p>And in the meantime, it&#8217;s just really, really easy to construct plausible, testable explanations that do hinge on culture. And it&#8217;s really, really hard to construct plausible explanations that hinge on nature that pass any sort of &#8220;smell test&#8221;. Unless, of course you&#8217;re a bigot who cherry picks data to match your cognitive bias. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /></p>\n<p>Moreover, it is &#8220;simply true&#8221; that culture is a key variable. Take for example, the good characteristics of certain (small-p) patriarchal immigrant cultures in the US because those cultures are wildly overrepresented in STEM relative to the population as a whole. </p>\n<p>Much to my chagrin, personal stories fare well here so I&#8217;m going to jump into the fray, albeit tepidly. I suspect many of you have similar experiences so I&#8217;ll console myself with the argument that this is a &#8220;universal&#8221; anecdote: </p>\n<p>My classmates in the high-school and junior high magnet programs I attended were, almost without exception, first-generation Jews, Indians, and East Asians. Now two decades later, I find myself in an almost identical cultural milieu working in a technical field. And I&#8217;m pretty sure the reason I ended up in that program and ultimately my job there was because of the push of mom and dad.</p>\n<p>And I&#8217;m pretty sure my second-generation Jewish classmates who were largely absent from that program weren&#8217;t on average less intelligent. Their parents weren&#8217;t just as single-mindedly consumed by the academic performance of their children. And of course, two generations prior, all of us &#8212; no matter how talented &#8212; would have been denied entry to a top university.</p>\n<p>More to the point: if your response to STEM gender imbalance is to wave your hands and deny the premise altogether, I&#8217;d ask that respect the &#8220;simply true&#8221; reality that the burden of proof for doing so is rightfully, very, very high.</p>\n]]>", "author": "Dan", "published": "2015-01-05 08:09:12+00:00", "title": "By: Dan"}, {"content": "<![CDATA[<p>Aaargh.</p>\n<p>I wrote &#8220;I’m a feminist, AND I’m a nerd, and both those ideologies are poison to me.&#8221;</p>\n<p>That came out not as I intended it. To clarify:</p>\n<p>Neither feminism or being nerdy are poison to me. But &#8220;feminists evil, nerds good&#8221; and &#8220;feminists good, nerds evil&#8221; are both poisonous to me. I won&#8217;t be part of any movement that believes either of those things.</p>\n]]>", "author": "Ampersand", "published": "2015-01-05 08:13:41+00:00", "title": "By: Ampersand"}, {"content": "<![CDATA[<p>Scott hello. I wanted to say that you are one of the most decent and sane persons I e-know. I was shocked by the disgusting campaign of poisonous vilification launched against you by some self-designated feminists. I virtually fully agree with Scott Alexander&#8217;s post so I dont have much new to add to the discussion. Mostly I just couldnt keep quiet in the face of this debacle. </p>\n<p>One place where I disagree with your current post is that your suffering was not caused by feminism: yes it was. And if you enjoy &#8220;male privilege&#8221; then other people enjoy &#8220;not being a shy nerd privilege&#8221;. IMO social justice newspeak is just a trick for constructing sophisms instead of having meanigful discussion (motte and bailey).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kosoy:Vadim.html\">Vadim Kosoy</a>", "published": "2015-01-05 09:06:37+00:00", "title": "By: Vadim Kosoy"}, {"content": "<![CDATA[<p>Listen to Dr. Robert Hare, well known expert on psychopaths: </p>\n<p>&#8220;Millions of men, women and children daily suffer terror, anxiety, pain, and humiliation at the hands of the psychopaths in their lives. Tragically, these victims often cannot get other people to understand what they are going through. Psychopaths are very good at putting on a good impression when it suits them, and they often paint their victims as the real culprits.&#8221;</p>\n<p>This is a massively gigantic problem, that anyone that cares about the suffering of innocent victims should be deeply concerned about. </p>\n<p>It should be understood that psychopaths are intrinsically evil as individuals; they are totally lacking in empathy, conscience and remorse. The suffering they inflict on their innocent victims comes from these psychopathic individuals, and not from society&#8217;s structures. </p>\n<p>Presumably those who have been making a distinction between &#8220;structural&#8221; and &#8220;personal&#8221; would dismiss the horrific suffering of the millions of innocent victims of psychopaths as being merely &#8220;personal&#8221; rather than &#8220;structural&#8221;, and therefore not worth a moment&#8217;s thought. </p>\n<p>This distinction between &#8220;structural&#8221; and &#8220;personal&#8221; is horrifically cruel and morally bankrupt, and it needs to totally stop immediately.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/psychopath:Victim_of.html\">Victim of psychopath</a>", "published": "2015-01-05 07:34:50+00:00", "title": "By: Victim of psychopath"}, {"content": "<![CDATA[<p>Dear Jake #429,</p>\n<p>Thanks for taking the time to write such a thoughtful, gentle and personal post. Different people come to recognize themselves for what they are at different stages in life, and when it happens very late, it does cause wonder about why things took so long. I only hope that it wasn&#8217;t traumatic or tumultuous but a gradually increasing awareness over time.</p>\n<p>Have you interacted other people with similar experiences? I am intimately familiar with a person who has experiences similar to yours (and more so than to Scott Aaronson&#8217;s). If you would like to know more or have a conversation with someone with a similar story, please get in touch.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/D'Silva:Vijay.html\">Vijay D'Silva</a>", "published": "2015-01-05 09:59:47+00:00", "title": "By: Vijay D'Silva"}, {"content": "<![CDATA[<p>J #386 &#8211;</p>\n<p>You know, it&#8217;s interesting. I&#8217;m not an academic feminist (despite being a feminist with a job in academia) and in general have little patience for theory; I came to the subject simply by living. Had little interest in it for most of my life. </p>\n<p>What I&#8217;ve read of academic feminism that isn&#8217;t some form of ethnography is very, very heavy on the marxist noodling. Given that at the age of nine my kid was able to see, on her own,  that Marx had clear vision but terrible prescriptions, and given that feminism&#8217;s been, well, a thing for quite a long time now&#8230;well, why in God&#8217;s name, if you&#8217;re a guy who&#8217;s heard about this feminism thing and wants to understand it better, would you go for marxist noodling from happily tenured professors and expensively-educated bloggers rather than thinking, &#8220;I keep hearing about this feminism, and surely it has to be more interesting than this. Where are the interesting (yet sane) parts?&#8221; Because the interesting parts are always from people who have something serious at stake and talk plainly about it. You know this without knowing it, nobody wants to read a story about, I don&#8217;t know, dropped stitches in a sweater that&#8217;s going to sit in a drawer until Christmas and then be given away without incident. </p>\n<p>Women being raped at college (or anywhere else, for that matter) is serious. Women being robbed of big money over the course of a lifetime and being left in near-poverty in old age is serious. Women being expected to bear most or all of the labor of childrearing for free is serious. Obstacles to education, glass ceilings, nickel-and-diming, there&#8217;s a whole list of things just in the US, and this stuff isn&#8217;t a set of conference papers, it&#8217;s very real.  </p>\n<p>I can see going to the academics now and then for help with some kind of framework with the whole thing, interpretation. But I don&#8217;t think you need to be very old to mistrust the frameworks, particularly tidy ones meant to be of a piece with some larger and equally improbably tidy theory about how people do. I can also see going and listening to the young bloggy types to hear what they&#8217;re shouting about these days, what they&#8217;re trying to work out as they finish growing up, but if you have any ears and you&#8217;re over 30 yourself you ought to be able to hear that part of what&#8217;s going on is the process of self-definition; you&#8217;re just eavesdropping.</p>\n<p>That said, I&#8217;ll point out that sometimes the line isn&#8217;t that clear. Not all the bloggers are rich kids for whom this is all Lost-in-Translation games, not all the scholars are safe, many have been victims of physical attacks and discrimination, sometimes they&#8217;re operating without nets, and sometimes the things they&#8217;ve got on the line aren&#8217;t trivial.</p>\n<p>It&#8217;s also not without value, their yelling. I understand some of why less-well-off women don&#8217;t go around like that, and revolutions aren&#8217;t made by the vulnerable and those who expect nothing. But theory and yelling are still not where the story is. So for these guys who feel outraged and betrayed and upset by what they call malignant or toxic feminism &#8212; well, what the hell, guys. Think about why you hear their voices; think about why you aren&#8217;t hearing other women&#8217;s voices. And then when you go and find their stories (rather than being satisfied that you&#8217;ve understood it all by making things up), and you think, &#8220;Well, that&#8217;s stupid, I&#8217;d have done X,&#8221; stop and assume for a moment, just for a moment, that these women aren&#8217;t stupid, and find out why they didn&#8217;t do X. Because that&#8217;s what will teach you, if you&#8217;ll let it.</p>\n]]>", "author": "Amy", "published": "2015-01-05 10:21:03+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Victim #451:<br />\n<blockquote>Presumably those who have been making a distinction between “structural” and “personal” would dismiss the horrific suffering of the millions of innocent victims of psychopaths as being merely “personal” rather than “structural”, and therefore not worth a moment’s thought. </p></blockquote>\n<p>No, you&#8217;ve misunderstood comprehensively.</p>\n]]>", "author": "Amy", "published": "2015-01-05 10:26:05+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Amy #439:</p>\n<ul>your views on this matter (more) because of your position &#8230; you are not actually free, in that position, to regard yourself reasonably as an entirely private person. You will help shape important structures and your views, as you do so, will matter. Which is why they have to be smart and broad and nuanced and well-informed, and part of why this is a good conversation.</ul>\n<p>On reflection, I wonder how much of the disagreement between us could be resolved by my simply reassuring you about how little power I really have, and how much less I aspire to? <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />  I never want to be in any situation where I&#8217;m severely constrained in which opinions I can express or ideas I can explore because of administrative power (rather than by <i>good</i> constraints, like empathy or the desire for truth).  All I want is the freedom to try to get to the bottom of things in conversation with others.</p>\n]]>", "author": "Scott", "published": "2015-01-05 12:58:17+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Amy #381: Again and again you try to bring everything back to economics (and you said you&#8217;re <i>not</i> a Marxist? <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" /> ).  But I&#8217;m not sure whether it has any explanatory power here.  It&#8217;s hard to doubt that are plenty of &#8220;feminists&#8221; of the vicious, Amanda Marcotte variety who have led pampered lives, and plenty of shy nerdy males who have faced economic hardship on top of all their other difficulties.  I have no idea whether Scott Alexander was actually a &#8220;rich kid&#8221; or not, but if he was &#8230; well, what does that have to do with anything?Indeed, I&#8217;d make a stronger statement: my admittedly-limited experience has been that women who&#8217;ve faced real hardships in life tend, <i>on average</i> (and with plenty of exceptions), to be more empathetic to the problem of the shy nerdy male than women who haven&#8217;t.  (Possible explanations are left as exercises for the reader.  Incidentally, another pattern I&#8217;ve observed is that, among all women, lesbians tend to be some of the most empathetic to such problems.)</p>\n]]>", "author": "Scott", "published": "2015-01-05 13:21:28+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>The debate surrounding the validity of vocabulary such as structural vs personal, patriarchy and micro-aggression persists. A meta-allegory, for the skeptics: </p>\n<p>My brother-in-law grew up on a tiny little island smack in the middle of the Pacific Ocean. Many summers ago, my sister and I spent some time on the island. The first night we went stargazing, I was amazed at how the complete lack of light pollution allowed our galaxy to really pop out of the sky. &#8220;Wow! Look at how clear the Milky Way is, here!&#8221; I remarked, pointing to the band across the sky. <i>&#8220;That&#8217;s</i> the Milky Way??&#8221; my now brother-in-law responded. &#8220;I always wondered how a cloud could always be in the exact same spot in the sky!&#8221; </p>\n<p>My brother-in-law easily accepted the introduction of a new term to describe the phenomena he grew up witnessing with clarity. If, unlike my brother-in-law, you grew up in the city, (and for some reason didn&#8217;t either believe or know that our galaxy existed), claiming that there&#8217;s a permanent &#8220;cloud&#8221; to be seen in the sky that&#8217;s called &#8220;the Milky Way&#8221; might seem like a stretch. Before you discount its existence, though, you should do a little research and venture into the darkest area you can find. </p>\n<p>And Jake #429,</p>\n<blockquote><p>  For me, I can see obviously that life remains really hard for women, especially my peers in STEM, and all I can do to mitigate the problem is alter my own behaviour.\n</p></blockquote>\n<p>An individual damping down on their own instances of committing micro-agressions is good, but does far less good than if they raise awareness of them in the population in general. Each instance of a micro-aggression, by its very nature, is not a big deal. What drives people crazy from micro-aggressions is that it&#8217;s so gosh darn hard to convince other people that they a) exist, b) are structural/predictable and therefore send a consistent overall unacceptable message*.  You already sound like a good ally, but you can probably be an even better ally while worrying a lot less about your own actions!</p>\n<p>*Which, on a less allegorical note, is the reason for the vocab words I started with. Personal problems correspond to some reality of your life; they deliver no trends of inaccurate messages. I cried today because I had a fight with a friend, and somebody told me I looked sad, even though I don&#8217;t like it when people tell me I look sad. Structural problems, however, are so predictably off-target a person begins to feel like a prophet. Oh, how unsurprising, you&#8217;re claiming I&#8217;m getting emotional in an online debate in which I continue to disagree with you because you haven&#8217;t logically countered me once, despite me using zero emotional language ever. Each individual data point that sits directly on this inaccurate-for-you line is a microagression. Yes, some individual problems may be confused as microagressions because they will randomly fall on the line, but overall, this isn&#8217;t the case. No, I&#8217;m not claiming white males can&#8217;t have their own lines. One of the lines that starkly runs through the lives of most women (and men too) has a name, that for historical and anthropological reasons is called patriarchy. The word is so catchy and so widely used because it aptly describes so many perfectly overlapping lines.</p>\n]]>", "author": "pb", "published": "2015-01-05 15:45:58+00:00", "title": "By: pb"}, {"content": "<![CDATA[<p>Scott, I would not defend Amanda&#8217;s response to your article, at all. It was vicious, stupid, and wrong.</p>\n<p>But I also wouldn&#8217;t say that Amanda has led a pampered life. You seem to have found the last week of internet abuse very stressful, and rightly so. But Amanda has been getting thousands of viciously abusive messages &#8211; and by abusive, I don&#8217;t mean people disagreeing with her politics, I mean people calling her a c**t and telling her they hope she gets raped to death &#8211; for literally years.  </p>\n<p>I get my share of internet abuse (last week someone told me I should have died in the Holocaust because I drew a cartoon criticizing libertarians) , but I can&#8217;t imagine receiving the kind of abuse Amanda gets, nonstop for years.</p>\n<p>You wrote:</p>\n<blockquote><p>However, I now understand why so many people became so attached to that word: if I won’t use it, they think it means I think that sexism, racism, and homophobia don’t exist, rather than just that I think people fixated on a really bad way to talk about these problems.</p></blockquote>\n<p>I think you&#8217;re exactly right about why people react so badly to claims that &#8220;I&#8217;ve never had [&#8230;] privilege.&#8221; Another example of how focusing on the word &#8220;privilege&#8221; doesn&#8217;t help either feminists or critics of feminism achieve clarity or understanding.</p>\n]]>", "author": "Ampersand", "published": "2015-01-05 15:46:43+00:00", "title": "By: Ampersand"}, {"content": "<![CDATA[<p>Ampersand:</p>\n<blockquote><p>He compares feminists to ravenous sharks who have shown up in massive numbers to explicitly tell him to die (“A feeding frenzy of feminists showed up to tell me I was a terrible person and deserved to die”).</p></blockquote>\n<p>Not sure why you offer this quote. Have you considered the possibility that he was telling the straight truth about this event as he experienced it? It&#8217;s plausible to me that if enough people like the Marcotte-cheerleading commentariat (which is to say, ordinary humans, because <a href=\"http://lesswrong.com/lw/gt/a_fable_of_science_and_politics/\" rel=\"nofollow\">Green vs Blue</a>) got together in meatspace, they&#8217;d be capable of making that large of an own-goal; and it provides an explanation for the otherwise baffling intensity of his antipathy to feminists.</p>\n]]>", "author": "Corey", "published": "2015-01-05 16:11:24+00:00", "title": "By: Corey"}, {"content": "<![CDATA[<p>Chelsey #422: Thanks for responding. I need to clarify because I was not talking specifically about people who are trying actively to listen. I was talking about all people and thinking aloud about the more general problem of: How does one create conditions in which (a) a person may want to know about the experience of other groups of people, and (b) the person receives information in a way that is meaningful to them. </p>\n<p>I read the David Graeber article and it provides further examples of how people use these frameworks. I don&#8217;t have a deep enough understanding of the discipline-specific nuances behind the terms he is using to know if the way I read the article is the way a person from the field would. I liked his point about bureaucracy and stupidity. However, from my first read, I do not agree with some of the theorizing in the article for various reasons: some of the examples seem class or culture specific to me (behaviour towards servants and of policement), some connections seem tenuous to me, I don&#8217;t feel confident about accepting the claims made about empires and regimes, and finally the structural example in the figure was less fleshed out than I would have liked. Now, I&#8217;m aware that he is a respected scholar in the field and I&#8217;m not rejecting anything he is saying outright, but just saying that it would take much more background reading for me to decide if I accept his arguments, and to identify precisely what bothers me. </p>\n<p>Unfortunately, it&#8217;s back-to-work time for me, so I have less time for reading much of this material (or even these comments).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/D'Silva:Vijay.html\">Vijay D'Silva</a>", "published": "2015-01-05 16:15:26+00:00", "title": "By: Vijay D'Silva"}, {"content": "<![CDATA[<p>Maznakoff #411: There are social-equality movements in many many cultures and societies outside the Western world. It is dangerous to assume that methods that worked in one Western country will work everywhere else. Consider for example, how different the path to universal adult suffrage has been (and continues to be) in various countries. </p>\n<p>Please also note that the politically active feminist community does not have the same age and gender distribution in all countries. Why only &#8220;Western (female) feminists&#8221; and their &#8220;less fortunate sisters&#8221;? These are not issues that only concern women. We have mothers, sisters and many other women in our lives. Why should they (or any other segment of the population) be denied *anything* due to certain circumstances of their birth when that same thing is available to some members of the population by default? It does not help to say that things are less unfair today than they were a hundred years ago when the bottom-line is that things are still terribly unfair for various parts of the population for no fault of their own. </p>\n<p>In addition to what NoName #433 said, I hope this quote (from <a href=\"http://www.theindianrepublic.com/tbp/white-feminists-stop-trying-save-indian-woman-india-100046039.html\" rel=\"nofollow\">White feminists: Stop trying to save the Indian women in India</a> provides some perspective) indicates where the kind of thinking in your comment can lead. </p>\n<blockquote><p>\nWe have our problems; we have lots of them. We will solve them, but we must do it our way. The last thing we need is for those who do not understand, cannot understand the dynamics within our country and our culture to show us how. What we do need is for all women to have access to compassionate human rights – it will never be done from a moral high ground that simply does not exist.\n</p></blockquote>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/D'Silva:Vijay.html\">Vijay D'Silva</a>", "published": "2015-01-05 16:53:51+00:00", "title": "By: Vijay D'Silva"}, {"content": "<![CDATA[<p>So, I&#8217;ve been following along for the last week or so.  First of all, I&#8217;m blown away by the fact that in over 1000 comments between this post, and the Lewin post, no one has made mention of the feminist writer bell hooks, who offers some beautiful and highly empathetic insight in her book entitled &#8220;The Will to Change: Men, Masculinity, and Love&#8221; from which an excerpt can be found <a href=\"http://aia.berkeley.edu/strengthening_connections/handouts/1a/Bell%20Hook%20Men%20to%20Masculinity%20%20Tanji%20Donald.pdf\" rel=\"nofollow\">here</a>.  In fact, I haven&#8217;t stumbled across a mention of ANY nonwhite noncis feminist in over 1000 comments, which is&#8230; well, worrisome if you&#8217;re interested in fully understanding the breadth, complexity, and diversity of the feminist movement.</p>\n<p>Another noticeably absent part of this ongoing discussion is anyone mentioning the difference between 1st and 2nd wave feminism and <a href=\"http://en.wikipedia.org/wiki/Third-wave_feminism\" rel=\"nofollow\">3rd wave feminism</a>.  The 1st and 2nd waves excluded anyone who was nonwhite, nonmiddle/upper class, noncis-gendered, and/or nonwomen, something that feminism broadly acknowledges these days is a massive mistake.  The incorporation of queer (and other) theory into feminism, which formally happened in the early 90s, pushed 2nd wave feminists (like Dworkin) into obsolescence.  Are there still 2nd wave feminists around?  Yeah, totally; people like the radfems who don&#8217;t believe in transgendered rights.  But basing your take on the entirety of feminism on people like that is akin to assessing humanity based on YouTube comments.  </p>\n<p>(Both of those things leave you curled in the fetal position wishing for the zombie apocalypse.)</p>\n<p>Finally, I was very taken aback by Alexander&#8217;s excoriation of feminism and why this was what Scott (Aaronson) chose to share, instead of a more inclusive 3rd wave feminist perspective, one that embraces diversity, mutual consent, and autonomy of all involved parties and a dissolution of the gender binary (no patriarchy and also no matriarchy), among other things.  That&#8217;s my kind of feminism, where everyone should be able to explore themselves &#8211; all their wants and needs &#8211; in a shame-free manner, so I&#8217;m going to share a piece directed at all the shy nerd baby feminists in the crowd, all the folks who say, <a href=\"http://www.theawl.com/2014/07/ask-polly-i-want-to-get-laid-but-im-afraid-of-oppressing-women\" rel=\"nofollow\">&#8220;I want to get laid, but I&#8217;m afraid of oppressing women.&#8221;</a>  We need to work through and fully process old traumas (and I strongly suggest therapy for that), so we can stop existing in the past, emotionally reliving them, and be present now.  We can sit here and constantly pick at all the things that were wrong, or we can find things that are right in the present, finding ways to move forward and create the love, inclusivity, and empathy for ourselves and others that we grew up lacking.  Loving the imperfect struggling weirdo we all were/are is the most radical thing anyone can do, and I really hope more of us find ways to make that happen.  It&#8217;s why bell hooks&#8217; take on love and masculinity should be a must-read and is so, so important to this thread, even if you &#8211; like me &#8211; don&#8217;t agree with every single thing she says.</p>\n]]>", "author": "M.", "published": "2015-01-05 17:30:32+00:00", "title": "By: M."}, {"content": "<![CDATA[<p>@Dan #453</p>\n<p>Yes, of course you&#8217;re right.  Certainty is seldom justified.  Trying to be more precise, I suggest that where a woman is nowadays discouraged from studying or working in STEM, this rarely the result of institutional sexism, or patriarchal attitudes (except perhaps from her immediate family).  Any discouragement is likely to be of the same kind that might be experienced by a boy.</p>\n<p>As mentioned by myself (#394) and others there are outreach programmes to encourage girls into STEM.  Teachers have been on-message for decades.  In Britain, college advertising and news stories are nearly always skewed towards the portayal of successful girls &#8211; not just in STEM but in any area of academic achievement.  For years college advertisements would typically show girls and black boys, seldom white boys.  Not surprisingly, we now have a serious problem of underachievement by white boys.  Yet we still have a gender deficit in STEM.</p>\n<p>Yes, I do &#8220;honestly believe the most parsimonious explanation for (most of) the gender imbalance in STEM is nature&#8221;.  Before telling me I&#8217;m wrong, please watch the Norwegian TV documentary (#437).</p>\n<p>I agree that my statement &#8220;simply untrue&#8221; has a burden of proof.  All I can say is, &#8220;encouragement&#8221; of girls into STEM has failed to make a significant difference, and at least one person who has plied that trade for many years privately agrees with me (#394).  How many times can you double the amount of encouragement before realising that your strategy is flawed?</p>\n<p>Let&#8217;s not get into a discussion of ethnic differences, because it would be wrong to hijack the thread into a subject that is both controversial and unrelated to the original post.</p>\n<p>@Many Others</p>\n<p>Though of course the thread has already been hijacked.  An honest, decent guy describes the pain of his adolescence and early adulthood, a type of pain that is rarely acknowledged or discussed; and immediately a horde descends to say &#8220;What about <i>WOMEN&#8217;S</i> pain?&#8221; (which has entire University departments engaged in its study, shelfloads of books written every year, Acts of Congress designed to mitigate it, magazines devoted to covering it, and discussions every week in mainstream newspapers and on TV).</p>\n<p>Who has the power here?  Just for once, wouldn&#8217;t it be polite to listen, discuss the issue at hand, and not try to make it about yourself or your designated victim group?</p>\n]]>", "author": "Bill", "published": "2015-01-05 17:54:37+00:00", "title": "By: Bill"}, {"content": "<![CDATA[<p>I strongly recommend picking up Penny&#8217;s _Unspeakable Things_ which speaks directly to many of the issues in these threads. If you think feminism is hostile to men or unconcerned with men&#8217;s problems, Chapter 2 ought change your mind. In particular, Scott, it speaks of many of the problems which started these discussions. If you don&#8217;t understand why the other Scott&#8217;s rhetoric leaves many angry and unimpressed, or if you don&#8217;t understand why economics is an integral part of feminist deconstruction of power, I suggest reading this book as if it were ethnography: a glimpse into lives of folks who have lived experience very different, even alien to your own. If you are looking for understanding, it puts her short blog response to you in a broader context.  </p>\n<p>One can&#8217;t do justice with a summary or quote, but here&#8217;s a bit anyway: &#8220;One of the saddest things about modern society is that it has made us understand masculinity as something toxic and violent, associated with domination, control and savagery, being hungry for power and money and acquisitive, abusive sex. Part of the project of feminism is to free men as well as women from repressive stereotypes.&#8221;</p>\n]]>", "author": "Ron", "published": "2015-01-05 18:02:16+00:00", "title": "By: Ron"}, {"content": "<![CDATA[<p>It would be nice to escape, yeah.</p>\n<p>(FYI: I&#8217;m going to use &#8220;girl&#8221; to mean &#8220;someone of female gender&#8221; and &#8220;boy&#8221; to mean &#8220;someone of male gender&#8221;)</p>\n<p>I am probably a &#8220;shy nerd girl&#8221; and I used to find solace in math and science. Still do, probably.</p>\n<p>And then I learn about gender, and it actually starts bothering me that every single name I see is a boy&#8217;s. It starts bothering me that the general person is a &#8220;he&#8221;. It starts bothering me when professors tell jokes in class that wouldn&#8217;t be funny if the genders were swapped.</p>\n<p>And the comments section seriously deteriorating into a battle of boys vs. girls. (Rule: Don&#8217;t read the comments, right up there by where it says Don&#8217;t read about feminism.)</p>\n<p>Because reading anything on the internet is several clicks away from wasting hours of my life staring straight into this abyss.</p>\n<p>And another thing&#8230;feminism is such a terrible word. You take everything that&#8217;s wrong with gender in this world and then turn it around that it&#8217;s somehow associated with girls? It&#8217;s as terrible a word as patriarchy.</p>\n<p>Do you really understand why people are angry that you said that your troubles were caused by feminism?</p>\n<p>There&#8217;s a grain of truth to what you said. My problems were &#8220;caused&#8221; by feminism, as well.</p>\n<p>There&#8217;s two sides to this. They&#8217;re both strawpeople.</p>\n<p>0. Wow feminists did something bad therefore feminism is bad<br />\n1. Feminists are actually trying to fix things don&#8217;t criticize them it&#8217;s not their fault</p>\n<p>Okay, this is stereotypical. 0 can basically be incorporated into what you&#8217;d call &#8220;conservative&#8221; and 1 can be incorporated into what you&#8217;d call &#8220;liberal&#8221;. Same pattern, everywhere, anywhere.</p>\n<p>0 is a knee-jerk reaction to anything different and unfamiliar, because we have concrete proof that familiar things already work. And it&#8217;s prudent, after all new things can make things go horribly wrong, there&#8217;s plenty of examples in history to prove this, society is fragile and the things they suggest are new and untested. When we don&#8217;t like this thing we call it prejudice and discrimination.<br />\n1 is an attitude that holds feminists, revolutionaries above any wrong-doing, and a lot of it has to do with anticipating the 0 that is always there. And I believe we all believe changing society for the better is a good thing.</p>\n<p>The 1 attitude frustrates those who are sympathetic to the 1, but see some things wrong with the 1 that needs to be changed. And the obstinacy of the 1 skirts those people closer to the 0. But 1 exists because they fear 0 in the first place. And so on. Vast portions of history can be interpreted as this tension between 0 and 1. History repeats itself. The only losers in this are people who really wish for gender equality.</p>\n<p>How do we get out of this? What we can say is that if we knew the answer to this we wouldn&#8217;t be here.</p>\n<p>The question is this: am I going to accept this trial by fire as the price to pay for society to accept anything new, am I going to accept the fact that shy nerds are put on the sacrificial altar for its sake.</p>\n<p>[And perhaps you have said that being a shy nerd girl is easier. Considering I don&#8217;t know what it&#8217;s like to be a shy nerd boy I&#8217;m not going to commit myself to saying whether that&#8217;s true or not, but making an unsupported statement like that that&#8217;s not that obvious (especially in light of the lack of visibility of shy nerd girls, and that most people haven&#8217;t gone through the experience of being both a shy nerd boy and a shy nerd girl to compare, actually that&#8217;s probably even harder) is going to draw fire, yeah. But suppose I accepted for a moment that it is easier to be a shy nerd girl than a shy nerd boy. Even then, it still seems to me that shy nerd girls have the ability to change reality much less.]</p>\n<p>Feminist is an overly-broad term indicating anyone who believes in gender equality. That means that I am a feminist. That means that half the commenters up there criticizing feminism are feminist. That means that vast swathes of the MRA are probably feminist, although they definitely wouldn&#8217;t identify as such.<br />\nIt turned out this way as a side-effect of the fact that the very first women who spoke out for gender equality were appropriated the term “feminist”, against their will, and is still derogatory today. (No one can make you feel inferior without your consent? Well, they can always engage in various degrees of trying.) It&#8217;s a way to reclaim that word.</p>\n<p>And well, on the flip side&#8230;there is patriarchy. Like feminism patriarchy also evolved into the kind of word that is broad, everything that encompasses how the genders are not equal. There is no feminism without patriarchy, and there is no patriarchy without feminism. It&#8217;s kinda like how if we lived in an alternate universe were everyone was a girl or where everyone was a boy we&#8217;re not going to have a word for boys and girls. Crazy, huh.</p>\n<p>Feminism is everything. Patriarchy is also everything. They&#8217;re terrible words. And being a feminist does not preclude one from being compromised by and being complicit in helping to propagate the patriarchy.</p>\n<p>So again, I ask: why were people scared when you said that your problems were caused by feminism? Because it&#8217;s a half-truth. When you say feminist, it&#8217;s a way to talk about the people who are trying to change the world without talking about the conditions of the world that motivated them to change it in the first place. Likewise, patriarchy is a way to talk about everything that is wrong as a force that is separate and that can be acted against by the people who are trying to change the world. What you really need is a word to describe the way this whole system interacts. Not just focus on the people who are trying to change things.<br />\nHalf-truths are a lot scarier than falsehoods, because people believe them.<br />\nLook at those commenters, people adulating you like you&#8217;re their messiah, yep, I&#8217;m scared because they&#8217;re probably my classmates.</p>\n<p>Seriously, people like us who really want absolute truth should stay out of the social sciences.</p>\n]]>", "author": "Student", "published": "2015-01-05 18:08:42+00:00", "title": "By: Student"}, {"content": "<![CDATA[<p>there is no such things as reasonable or good feminists. those should rather label themselves humanists.<br />\npresent day mainstream feminists are harping endlessly on bogus statistics such as the gender pay gap or 1 in 5 college women being raped. many of the same mainstream feminists are advocating for a reversal of the burden of proof in rape trials or to lower the standards for conviction.<br />\nif the aforementioned reasonable/good feminists were really interested in the good reputation of their movement they would actively address and distantiate themselves from the constant stream of outlandish claims of modern feminists but so far their silence is quite deafening.<br />\nif you look for &#8220;good&#8221; feminists check out Christina Hoff Sommers or Cathy Young but they are labelled heretics by the rest of the movement.</p>\n]]>", "author": "alex", "published": "2015-01-05 18:43:38+00:00", "title": "By: alex"}, {"content": "<![CDATA[<p>Two things:</p>\n<p>1) I&#8217;ve never felt bad about wanting women to have sex with me, because I always knew I&#8217;d be good to them in lots of other ways if they did.</p>\n<p>2) If I&#8217;ve felt guilty at all, it&#8217;s because I don&#8217;t want to sleep with ugly women.  Not because I want to sleep with the good looking ones.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/q/Q:Dave.html\">Dave Q</a>", "published": "2015-01-05 19:06:42+00:00", "title": "By: Dave Q"}, {"content": "<![CDATA[<p>pb @ #332: Speaking as a guy, I will happily acknowledge that typical women put up with a <i>horrifying</i> amount of shit, much of it invisible to most men. I know smart, capable women whose ideas are ignored until a guy repeats them 3 minutes later. I&#8217;ve read tales of conference harassment that make me shudder with horror. I&#8217;ve heard way too many stories of on-campus rape from friends. And perhaps worst of all, the gropers, the stalkers and the rapists seem to unpunished for years or decades, at least if they have any kind of power or connections. Honestly, just hearing about a small fraction of what women live with makes me twitchy.</p>\n<p>Chelsey @ #355:</p>\n<blockquote><p>As for asking feminists to condemn other people claiming to be feminists… I think the reticence to do so comes from a pretty understandable place.</p></blockquote>\n<p>Yeah, I agree that a lot of people have been absolutely brutalized by life, and they won&#8217;t be heard unless they shout. But at the same time, fighting against oppression can&#8217;t be a moral blank check that justifies absolutely anything, either. For example, I would never think poorly of somebody who said, &#8220;You know, I can see where Malcolm X is coming from.&#8221; But I would be deeply worried by any leftist who couldn&#8217;t argue convincingly against Stalin. I get nervous when I hear things that sound like <a href=\"http://en.wikipedia.org/wiki/Alexander_Kerensky\" rel=\"nofollow\">&#8220;No enemies to the left&#8221;</a>.</p>\n<p>I&#8217;ve certainly seen online social justice communities—interesting, well-intentioned ones—which believed something like &#8220;No enemies among the oppressed.&#8221; This worked just fine until they ran into a charismatic sociopath who knew how use the language of oppression, and who proceeded to tear those communities to shreds in a brutal manner. Sometimes, it really is necessary to criticize people who are supposedly &#8220;on your side.&#8221;</p>\n<p>…</p>\n<p>Anyway, when I started writing this comment, I wanted to share another &#8220;geek coming-of-age&#8221; story.</p>\n<p>I went to high-school in the early 90s. I was a geek, subject to the usual abuse geeks received in those days: harassment, bullying, physical assault. I had been taught that fighting back was wrong, and that I should ignore people who made fun of me. But relative to some geeks, I had a decent amount of social privilege: I wasn&#8217;t &#8220;weird&#8221;, I had average looks, and I could defend myself physically against the bullies if I needed to.</p>\n<p>I certainly noticed a few weird things about romantic relationships. For example, there was a bully whose two favorite slurs were &#8220;f*g&#8221; and &#8220;c*nt,&#8221; and he was fond of physically assaulting guys with low social status. He never seemed to have much trouble with relationships. In fact, I once saw him followed around by a group of three(!) adoring students from out of town, and they were hanging on his every word. For maybe two minutes, I felt, &#8220;Hey, that&#8217;s really weird.&#8221; But it didn&#8217;t take me long to decide, &#8220;You know, I actually wouldn&#8217;t want to date somebody who&#8217;s totally into a guy like that.&#8221; Just to make things even more confusing, I once briefly thought a different upper-class jock was hot, although he wasn&#8217;t a massive bully.</p>\n<p>I had no actual romantic relationships until college—though I think I once accidentally turned down a good friend whom I adored (ouch), and I once got very publicly kissed by a student from out of town, which made me happy for about six months. So high school was bad, but not totally depressing.</p>\n<p>When I got to college in the early/mid 90s, Dworkin was still very much in the air, although mostly because anti-feminists were constantly using her as a stick to beat feminists with, and because feminists defended her, claiming she was being misinterpreted and taken out of context. I don&#8217;t think I ever heard anybody on the feminist side actually argue against her.</p>\n<p>But again, circumstances worked to my favor: I did feel shame at being attracted to women, but I also had female friends who were bi, or who liked porn, or who were happy to talk about BDSM and consent. And I was still occasionally attracted to a guy here or there. So I couldn&#8217;t stay very guilty for very long, because it was just sort of logically untenable to believe that &#8220;Male desire is inherently oppressive, but it&#8217;s totally cool that women can tie each other up and have fun with floggers as long as everybody&#8217;s really into it.&#8221;</p>\n<p>So yeah. Looking back, I can easily imagine how high school and could have been worse. Reading both Scott&#8217;s story and Ampersand&#8217;s story, I find myself saying, &#8220;Well, if I never met X, or if I were a bit less Y, I could have wound up in a very similar place.&#8221;</p>\n<p>…</p>\n<p>And finally, some romantic advice for young, straight(ish) geek guys.</p>\n<p>1. You can&#8217;t make people fall in love with you. If they adore you, or if they want to get into your pants, you don&#8217;t need amazing social skills or &#8220;game.&#8221; (Ugh.) You mostly just need to notice, and not drop the ball too badly. These are both social skills, but they&#8217;re learnable.</p>\n<p>2. People like all sorts of different things. If you use what you have to your best advantage, there&#8217;s probably at least a few people out there who could be into that, especially if you seem to be happy in your own skin. In fact, other people place a surprising amount of weight on your own self-assessment. I&#8217;ve seen guys who <i>rock</i> short, heavyset and hairy, but only because they own it.</p>\n<p>3. As Dan Savage occasionally suggests, don&#8217;t worry about about getting &#8220;15-year-old you&#8221; laid. Worry about making &#8220;19-year-old you&#8221; an interesting and attractive partner. If your body permits, lift some weights and get into cardiovascular shape. Dress with a bit of personal style. Try to see things from the other person&#8217;s perspective. If you&#8217;re not entirely straight, pay attention to what makes some likable guys hot. Practice having fun conversations without steamrollering your conversational partner.</p>\n<p>4. Get out, have fun, and meet a lot of people. Don&#8217;t spend all your time searching for a romantic partner. Rather, try to live the sort of life that would be fun to share.</p>\n<p>There&#8217;s something really broken about the other dating model, the one which says, &#8220;My life is a horrible, pathetic mess, and I need a woman to fix it.&#8221; Basically, even people who would otherwise be into you usually won&#8217;t sign up to fix your life.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Guy:Anon_Geek.html\">Anon Geek Guy</a>", "published": "2015-01-05 19:40:14+00:00", "title": "By: Anon Geek Guy"}, {"content": "<![CDATA[<p>This is sort of a random thought, but I think it&#8217;s important. I keep seeing statements here, and elsewhere, about how one or the other of the people involved in this discussion/controversy is really nice, and therefore it&#8217;s wrong to be so mean to them.</p>\n<p>The problem is that most of us don&#8217;t know each other personally. All we have is words on a screen. The words have to speak for themselves. I shouldn&#8217;t need to know that The Other Scott&#8217;s partner is a feminist blogger in order to be able to interpret his argument properly. Conversely, even if Scott, or Laurie Penny, or any of the other people who have been declared to be &#8220;nice&#8221; were an irascible, cranky SOB in person, it still wouldn&#8217;t make it all right to misinterpret and caricature and twist their words. </p>\n<p>A few years ago I was arguing about some misogyny coming from somewhere (I don&#8217;t even remember the context any more), and somebody chimed in and said &#8220;Oh, but he&#8217;s really a very good guy, he has an extremely egalitarian relationship with his wife,&#8221; etc. I was glad to hear it, but it didn&#8217;t change my opinion of what he had written.</p>\n<p>We are at the confusing and fraught intersection of the political with the deeply personal, and so the line between what is a fair criticism and what is an unfairly personal attack can be hard to draw. Some things, such as name-calling, obviously fall on one side of the line; but everybody is going to draw that line in a different place. For example, I think giving Laurie Penny the &#8220;Not The Worst Person award&#8221; crosses the line, but obviously a lot of people here think it&#8217;s perfectly okay.</p>\n<p>All I can say is that we should all remind ourselves that we can&#8217;t read each other&#8217;s minds. All we have is words on a screen. Do your best to make sure that your words say what you mean them to say.</p>\n]]>", "author": "Janet", "published": "2015-01-05 20:14:45+00:00", "title": "By: Janet"}]