[{"content": "Fine Grained Complexity", "author": "Anonymous", "published": "2018-11-06 15:58:44.472000-08:00", "title": "Fine Grained Complexity"}, {"content": "I&#39;m thinking of adding it to the course I teach on computational complexity but would hesitate to try to promote it to the general public. (am I lacking ambition?)", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Goldberg:Paul.html\">Paul Goldberg</a>", "published": "2018-11-06 16:12:23.698000-08:00", "title": ""}, {"content": "Differential privacy", "author": "Anonymous", "published": "2018-11-06 22:01:28.820000-08:00", "title": "Differential privacy"}, {"content": "Agreed, I reckon DP deserves to be better known.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Goldberg:Paul.html\">Paul Goldberg</a>", "published": "2018-11-07 01:08:31.742000-08:00", "title": "Agreed, I reckon DP deserves to be better known."}, {"content": "I was amused by your phrasing &quot;TCS community, i.e. among computer scientists who have good taste.&quot; <br /><br />Does that already not betray a bit of bias?", "author": "Anonymous", "published": "2018-11-07 01:51:41.009000-08:00", "title": ""}, {"content": "As long as everyone agrees that &quot;good taste&quot; means &quot;taste that aligns with the person using the phrase&quot; I think it&#39;s OK.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Goldberg:Paul.html\">Paul Goldberg</a>", "published": "2018-11-07 06:10:24.581000-08:00", "title": ""}, {"content": "I guess some of the concepts I learned about only recently from <a href=\"https://www.scottaaronson.com/blog/?p=3488#comment-1747458\" rel=\"nofollow\">lectures by Christos Papadimitriou</a> could qualify, but I don&#39;t know for sure since I am as far from an expert in those subjects as one can be:<br />* second-price sealed-bid auction<br />* reverse game theory<br />* multiplicative update algorithm<br /><br />I would like to ask an expert about his opinion on Christos Papadimitriou&#39;s work concerning the multiplicative update algorithm and mixability to explain the role of sex for evolution.<br /><br />If I am not working on or even thinking about evolutionary biology, then we do I want to have such a discussion? I read Papadimitrious&#39;s Logicomix, and then watched other presentations by him, just because it is him, and he is great. But his presentation exactly spelled out my own doubts about the claim that we do understand evolution in practice:<br /><br />How do you find a 3-billion long string in 3 billion years?<br />L. G.Valiant<br /><br />The Mystery of Sex Deepens<br />* Simulated annealing (asexual reproduction) works fine<br />* Genetic algorithms (sexual reproduction) don’t work<br />* In Nature, the opposite happens: Sex is successful and ubiquitous<br /><br />I do use both simulated annealing and genetic algorithms in my daily work, and have made exactly the same observations. In addition, I am fully aware of the change in perspective provided by the multiplicative weights update algorithm. It doesn&#39;t care whether badly performing species get extinct or not. (Or whether individuals of badly performing species are more likely to die prematurely.) Instead, it focuses on proliferating well performing species in a balanced way. (It doesn&#39;t even try to specify a mechanism by which well performing species arise, it just focuses on balanced distribution of resources among the existing well performing species.)", "author": "Jakito", "published": "2018-11-08 01:57:52.478000-08:00", "title": ""}, {"content": "@Jakito - thanks! You are speaking to the point - which does indeed deserve to be better-known - that CS is interdisciplinary and has much to say about many other topics. (Also that it brings in insights that have been developed in the TCS community in particular.) I recall that I have occasionally been asked, when I tell someone I&#39;m in CS &quot;Hardware or software?&quot; which shows a misconception of what CS is about. (Fortunately that has not happened recently, so I think there is some improvement in public understanding of CS.)", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Goldberg:Paul.html\">Paul Goldberg</a>", "published": "2018-11-08 03:50:20.084000-08:00", "title": ""}]