[{"content": "<![CDATA[<p>Ron #104: spot on. That area where theory and practice overlap is where real world innovation comes from.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Burgan:Darrell.html\">Darrell Burgan</a>", "published": "2014-09-05 00:04:25+00:00", "title": "By: Darrell Burgan"}, {"content": "<![CDATA[<p>@Rahul</p>\n<p>Instead of forcing theoreticians to work with practitioners, we&#8217;ve found that gentle persuasion works well.  Many theoreticians are eager to work with practitioners, but they just don&#8217;t know where the opportunities are.  Plus, persuasion is certainly much more palatable than forcing!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/f/Fagin:Ron.html\">Ron Fagin</a>", "published": "2014-09-05 01:41:05+00:00", "title": "By: Ron Fagin"}, {"content": "<![CDATA[<p>theory & application are like the yin & yang of science. it advances through their adroit fusion. on the other hand scientists are human, and humans can have blind spots.</p>\n<p>what a great coincidence that PShor is posting on this thread, to me he is one of the inspiring historical leaders in balancing/ working in and advocating uniting theoretical & applied CS aspects & worthy of study/ emulation by anyone interested in that balance.</p>\n<p>also re theory vs applied, there are many jokes on this sujbect & old dichotomy/ juxtaposition. eg</p>\n<blockquote><p>\nAn engineer thinks that his equations are an approximation to reality. A physicist thinks reality is an approximation to his equations. A mathematician doesn’t care. <i>—anonymous</i>\n</p></blockquote>\n]]>", "author": "vzn", "published": "2014-09-05 15:01:49+00:00", "title": "By: vzn"}, {"content": "<![CDATA[<p>Anybody willing to venture a guess at what kind of chip Martinis will design for Google?  Based on his past work I naturally assumed Gate QC, but the <a href=\"http://www.technologyreview.com/news/530516/google-launches-effort-to-build-its-own-quantum-computer/\" rel=\"nofollow\">Technology Review</a> quotes him like this:</p>\n<blockquote><p>“We would like to rethink the design and make the qubits in a different way,” says Martinis of his effort to improve on D-Wave’s hardware. “We think there’s an opportunity in the way we build our qubits to improve the machine.”\n</p></blockquote>\n<p>This may be just horribly out of context, but it makes it sound as if this is going to be quantum annealing with error correction.</p>\n]]>", "author": "quax", "published": "2014-09-06 04:51:20+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Scott I do not think you would never have worked as a software engineer at the industry. Imagine putting yourselves on H1B shoes/mid age american worker shoes and slave working 12hours a day 6 days a week with no over time pay with no career improvement and getting an equivalent $22.22/hour. I do not just see you doing that. I see you as someone who saw an opportunity where you can use your gifts and moved there.</p>\n]]>", "author": "J", "published": "2014-09-06 09:39:58+00:00", "title": "By: J"}, {"content": "<![CDATA[<p>quax, my guess is that Martinis is NOT going to help continue developing the D-wave machine. He is just going to continue developing his machine, as he would have before, except faster due to the increase in funds. </p>\n<p>I think that if Martinis had agreed to work on D-wave&#8217;s machine, Vern Brownell would have made a statement to the press trumpeting this news. That&#8217;s sort of his job. Instead, D-wave has been very mum about the Google/Martinis news. </p>\n<p>Besides, I think that the D-wave engineers are quite competent and don&#8217;t need any help from Martinis in developing their machine. They know their machine much better than Martinis ever will.</p>\n]]>", "author": "rrtucci", "published": "2014-09-06 13:36:58+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>I am an average programmer with no math or CS theory background. I had a short discussion with my friend who said computer systems research like Networks or Operating Systems or databases is not real research they are nothing but engineering prototypes or an engineering approach. His opinion is one doesn&#8217;t have to be bright or talented to do CS systems research(common sense is enough) but on the contrary for CS theory one has to be talented and bright because it requires lot of advanced math knowledge. He said this is one of the reasons why CS theory people doesn&#8217;t want to approach systems research but do not disdain or look system research as mediocre area. I have to accept his opinion as valid and true. Even if CS theory scientists ignore system research there is nothing to be offended because it is difficult to do  theory research. Sometimes  I have seen I can understand few systems publication but not theory publications. It doesn&#8217;t mean research has to be hard and complicated. We can see very few thriving  cstheory departments at the universities whereas Isee many people doing many cs systems research at the universities and most of the research are repetitive. Personally I will not be offended if  cs theory people ignore Systems research or consider systems research as a low activity. Great post and hats off for being an exceptional researcher</p>\n]]>", "author": "krishna", "published": "2014-09-06 13:48:41+00:00", "title": "By: krishna"}, {"content": "<![CDATA[<p>rrtucci #111, don&#8217;t mean to suggest that he&#8217;d been working on the D-Wave chip, rather I am wondering if Google may have asked for an improved annealing chip with error correction of their own making.</p>\n<p>Clearly for Martinis, based on his prior talks, that&#8217;ll be just a stepping stone to true gate QC, I am just not exactly clear at this point on what Google will pursue.  The press releases are just too vaguely worded.</p>\n]]>", "author": "quax", "published": "2014-09-06 17:08:46+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>I work in the area of superconducting qubits an have interacted with John Martinis and his group members on multiple occasions.  John has been a strong advocate of digital quantum logic. D-wave machine though is a technological tour de force, most of the academic superconducting community, including UCSB team desires more transparency in DWave results. The kind of platform DWabe has developed is usefulut my guess is that the workhorses qubits will be quite different from what D wave uses. Also in all probability the architecture may be revised to accommodate a completely different way of reading out quantum registers, unlike Dwave&#8217;s to make it more QND.</p>\n]]>", "author": "physpostdoc", "published": "2014-09-07 06:13:15+00:00", "title": "By: physpostdoc"}, {"content": "<![CDATA[<p>While on the whole, I think theorists and practitioners in computer science respect each other, there really is not enough communication between them. </p>\n<p>If theorists understood practitioners, they would put pseudocode in any paper containing an algorithm they think might be practical.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Shor:Peter.html\">Peter Shor</a>", "published": "2014-09-07 17:16:11+00:00", "title": "By: Peter Shor"}, {"content": "<![CDATA[<p>physpostdoc #114, thanks for this comment, sheds some light.</p>\n<p>Yet, what does the acronym QND stand for?</p>\n]]>", "author": "quax", "published": "2014-09-08 15:51:42+00:00", "title": "By: quax"}]