[{"content": "<![CDATA[<p>They list the license plate, unambiguous enough.</p>\n]]>", "author": "Patrick", "published": "2017-10-21 21:48:36+00:00", "title": "By: Patrick"}, {"content": "<![CDATA[<p>Not when the street is double-parked, bumper to bumper, as it is in the big cities.<br />\nN any case, I’m the damn d customer.  Why do I have to do all the work and dodge the traffic when the service can solve most of this very easily.  </p>\n<p>NP problem?  Ov3thinking this a bit, I’d say.</p>\n]]>", "author": "NYDenizen", "published": "2017-10-21 22:43:56+00:00", "title": "By: NYDenizen"}, {"content": "<![CDATA[<p>And if this is how Uber gathers its bug reports, why are we not all rolling in the aisles?</p>\n]]>", "author": "NYDenizen", "published": "2017-10-21 22:45:17+00:00", "title": "By: NYDenizen"}, {"content": "<![CDATA[<p>@NYDenizen #40:</p>\n<p>I was only kidding about the Uber problem being NP complete:-)  I have better NP complete jokes than that. </p>\n<p> &#8220;Why is being the sign language person at a Noam Chomsky lecture the hardest job in the world? Because translating a Chomsky lecture into sign language is an NP complete problem&#8221; ( the depth and breadth of Chomsky&#8217;s ideas are so wonderous that they can never be rendered comprehensible by any finite set of hand gestures 🙂</p>\n]]>", "author": "William Hird", "published": "2017-10-22 06:20:51+00:00", "title": "By: William Hird"}, {"content": "<![CDATA[<p>0k #42. Thanks for the correction. But I wasn’t aware there even was a ‘NP joke’ genre.<br />\nHelp!  Am I in the wrong thread?</p>\n]]>", "author": "NYDenizen", "published": "2017-10-22 16:52:47+00:00", "title": "By: NYDenizen"}, {"content": "<![CDATA[<p>If it&#8217;s further than I can cycle and there&#8217;s no train/plane/boat then I ain&#8217;t going there. The exception being, of course, LA. But that is something of a pathological counterexample.</p>\n]]>", "author": "Chris", "published": "2017-10-22 19:02:33+00:00", "title": "By: Chris"}, {"content": "<![CDATA[<p>Super accurate GPS (few centimeters resolution compared to few meters!) coming to cell phones next year to move this problem into history.<br />\n<a href=\"https://spectrum.ieee.org/tech-talk/semiconductors/design/superaccurate-gps-chips-coming-to-smartphones-in-2018.amp.html\" rel=\"nofollow\">https://spectrum.ieee.org/tech-talk/semiconductors/design/superaccurate-gps-chips-coming-to-smartphones-in-2018.amp.html</a></p>\n]]>", "author": "AR", "published": "2017-10-22 20:35:02+00:00", "title": "By: AR"}, {"content": "<![CDATA[<p>The problem with Uber is that they are a bunch of sociopathic law-flauting assholes whose drivers are uninsured, oblivious, exploited and unskilled and uniformly present a MAJOR safety hazard to other road users.</p>\n<p>In particular, the GPS jockey drivers &#8212; with little to no knowledge of local urban streets &#8212; who work (oh, sorry <b>independently contract</b> for) the try-to-sue-us-and-we&#8217;ll-just-buy-off-your-representatives company are VERY HAPPY INDEED to instantly pull over to find you, the passenger, the most important person in the world, without the slightest attention to cyclists, pedestrians, turn signals, other vehicles, double-yellow lines, anything.</p>\n<p>They&#8217;re happy to stop in the middle of the road, disruptively GPS guided, blocking traffic lanes, blocking bike lanes, throwing doors and passengers into traffic, slamming and veering, so that YOU, the so-trangressive, singularity warrior, rationalist-skeptical uber-mensch, can hop on in in front of any geo-coded address and be whisked to your next assignment.</p>\n<p>And when they injure somebody?  Not Uber&#8217;s problem!  Go after the not-commerically-licenced not-comercially-insured app-controlled nobody all you like.  Hah hah hah!</p>\n<p>They&#8217;re a fucking nightmare.  And not because iPhone GPS isn&#8217;t centimeter-accurate.</p>\n]]>", "author": "Richard", "published": "2017-10-22 20:54:53+00:00", "title": "By: Richard"}, {"content": "<![CDATA[<p>Richard brings up a good point in $46.</p>\n<p>Uber is the poster child example a new technology company that is making billions by screwing everyone over. They would probably still be profitable if they followed the same rules as the traditional competition does, but that is not the plan.</p>\n<p>There is likely a long history of why most placed require taxi drivers to have background checks, take safety courses, and follow rules, and the companies to have plenty of insurance.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-10-23 00:14:46+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>I personally agree with Raoul about the loathsomeness of Uber and I will try never to give a cent to make them richer, but everyone has different views and priorities and lines to draw. But most of us need to get transport or baby formula or palm oil derivatives or fish from wherever&#8230;and this is all getting so complicated.</p>\n<p>So why not have a JustNotGiving.com? Someone can then declare:</p>\n<p>&#8220;I never eat Non FairTrade chocolate&#8221;: 3 credits*<br />\n&#8220;I never eat non-sustainable Atlantic Hake&#8221;: 2 credits*<br />\n&#8220;I use Uber&#8221;: -5 credits*</p>\n<p>and then all square, they can blog or comment without having to justify their use of Uber.</p>\n<p>*I hear that economists already have an algorithm to determine what the credits should be for each item</p>\n]]>", "author": "terebinth", "published": "2017-10-23 23:01:02+00:00", "title": "By: terebinth"}]