[{"content": "<![CDATA[<p>@Sniffnoy #58</p>\n<p>>> a statement or an object<br />\nLet me just warn you that the implicit assumption here that there can be things (&#8220;statements&#8221;) which are not (physical) objects is a big step towards dualism already 😎</p>\n<p>But let us assume you can convince me that I = B, in other words I am my brain.<br />\nNow let me point to that futuristic supercomputer S over there, which is capable of simulating human brains and is right now simulating my brain B.<br />\nWill you also try to convince me that I = S , although it is clear that B is not S ?</p>\n]]>", "author": "wolfgang", "published": "2015-06-27 19:41:21+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p><a href=\"http://www.scottaaronson.com/blog/?p=2343#comment-685929\" rel=\"nofollow\">Sniffnoy</a>, consider not referring to comments by number, but instead using permalinks, like I did.</p>\n]]>", "author": "Douglas Knight", "published": "2015-06-27 19:56:40+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>In the comments to your <a href=\"http://www.scottaaronson.com/blog/?p=1318\" rel=\"nofollow\">So you think Quantum Computing is Bunk?</a> post a couple of years ago I tried to argue that a very simple &#8220;interpretation&#8221; (I prefer &#8220;model&#8221;) could weaken QC &#8211; a discrete time randomly seeded evolution of the entire universe state-vector/wave-function. Such a model would allow all current quantum mechanical experiments to work (including quantum zeno experiments) because the mathematical structure is almost precisely equivalent to the standard postulates of quantum mechanics, .</p>\n<p>But I was not very clear as to how this would impact Quantum Computing, such as Shor&#8217;s method.</p>\n<p>I now realise that it is the discrete time evolution that is the crucial thing. If nature &#8220;jumps&#8221; fundamentally randomly with half-life approx 10^-43 secs and then rotates the entire universe state-vector we would have a quantum mechanical universe like we currently observe. But the non-continuous time evolution will impact quantum computing algorithms which are based on an assumed continuous time evolution.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2015-06-28 02:35:58+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>@wolfgang #59</p>\n<p>David (#5 and #22) made a point that you missed, so I&#8217;ll try to make it clearer. You wrote:</p>\n<blockquote><p>2) from D(I) =/= D(B) it follows that I =/= B</p>\n<p>[&#8230;]</p>\n<p>But you cannot really attack 2) imho, because it is basic math / logic.</p></blockquote>\n<p>That&#8217;s not true, as Frege[1] noted. A simple example that refutes your statement is to take</p>\n<p><b>D(<i>x</i>) = Alice doubts <i>x</i> wrote <i>The Adventures of Tom Sawyer</i></b></p>\n<p>If Alice doesn&#8217;t know that Mark Twain is Samuel Clemens, then <b>D(Mark Twain) != D(Samuel Clemens)</b> even though <b>Mark Twain = Samuel Clemens</b> (as we know).</p>\n<p>The same thing can be done to the argument in your comment #2.</p>\n<p>[1] <a href=\"https://en.wikipedia.org/wiki/Sense_and_reference\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Sense_and_reference</a></p>\n]]>", "author": "Not a Philosopher", "published": "2015-06-28 02:38:03+00:00", "title": "By: Not a Philosopher"}, {"content": "<![CDATA[<p>Wolfgang #59:</p>\n<p><i>Let me just warn you that the implicit assumption here that there can be things (“statements”) which are not (physical) objects is a big step towards dualism already</i></p>\n<p>I&#8217;m not talking about &#8220;objects&#8221; in some physical sense.  I mean &#8220;objects&#8221; as in the thing that variables (or more generally, terms) in a theory refer to.  I don&#8217;t see the relevance of your reply.</p>\n<p><i>But let us assume you can convince me that I = B, in other words I am my brain.<br />\nNow let me point to that futuristic supercomputer S over there, which is capable of simulating human brains and is right now simulating my brain B.<br />\nWill you also try to convince me that I = S , although it is clear that B is not S ?</i></p>\n<p>Answer: I don&#8217;t care, because I&#8217;m not arguing about that.  I&#8217;m just yet another person explaining why your initial argument is wrong.  It would be nice to know if you are still claiming that argument.</p>\n]]>", "author": "Sniffnoy", "published": "2015-06-28 04:21:09+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>@Not a Philosopher #62  and @Sniffnoy #63</p>\n<p>You are making the very valid point that in general my doubts about things can change. So if I learn that S.C really is M.T my doubts will change and the identity of S.C. with M.T. can be established to some degree.<br />\nFair point.</p>\n<p>But Descartes&#8217; argument is that such a change in doubt is not possible for I and B.  I *cannot* doubt that I am, but there will *always* be some doubt about B.</p>\n<p> &#8212; </p>\n<p>>> I don’t care, because I’m not arguing about that.<br />\nBut you should consider it, for this reason:</p>\n<p>The hypothetical supercomputer S (in the imagination) is such that every argument b1, b2, &#8230;  in favor of I = B has an equivalent argument s1, s2, &#8230; in favor of I = S.<br />\nThe only way to avoid a contradiction (I=B and I=S but B is not S) is to argue that S does not really exist, it is only imagined.<br />\nBut this means you argue with Descartes: You reject I = S because you have doubts that S can exist.</p>\n]]>", "author": "wolfgang", "published": "2015-06-28 15:13:14+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Scott #47: Similarly, if you can raise the seat a bit and teach your dog to drive, then it’s extremely hard understand how you couldn’t make the dog your chauffeur. And I don’t think the burden you refer to is enormous, because I’ve already done it. In that link from #12, I construct a relatively simple model that exhibits ordinary unitary evolution in a certain regime, outside of which non-linearities create an endogenous decoherence that squashes massive parallelism. The effective maximal coherent qubit number is controlled by a new constant, whose zero-limit corresponds to the pure unitary case.</p>\n<p>You argue that because QC doesn’t yield all the fruits of “naive parallelism,” we shouldn’t be too concerned that the exponential storage blowup is actually an aspect of nature, in the same way that no superluminal signalling means we shouldn’t be too worried about quantum non-locality. I hadn’t thought about it before, but I agree these two arguments are connected&#8212;and neither makes sense to me. Why in the world would our ability to harness a demonstrable phenomenon&#8212;non-locality or massive parallelism&#8212;to achieve a certain human purpose&#8212;signalling or solving NP-complete problems&#8212;have any bearing on the reality and physical significance of that phenomenon itself? Certainly the onus is on you to carefully demonstrate why the non-harnessability of a given physical fact makes that fact any less real, any less calling-out-for-explanation. It stinks of the glib positivism on the part of Bohr and his apologists that Bell took apart many decades ago.</p>\n]]>", "author": "Eric Dennis", "published": "2015-06-28 16:35:03+00:00", "title": "By: Eric Dennis"}, {"content": "<![CDATA[<p>Scott #41: Thanks, I see now that I&#8217;ve misunderstood the vector subspace problem, despite that your description was correct.  The reference you gave to the articles helped.  Still, this is an interesting problem and I&#8217;m glad you brought it up.</p>\n]]>", "author": "jonas", "published": "2015-06-28 19:32:35+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>Wolfgang #64:</p>\n<p>No, I&#8217;m afraid you&#8217;ve still missed the point.  It has nothing to do with change.  That the things designated by particular descriptions may change does help <i>demonstrate</i> the distinction between descriptions of objects and the objects themselves, but:<br />\nA. This is in no way essential to the distinction; it is not the distinction itself;<br />\nB. From a mathematical point of view, this isn&#8217;t even true &#8212; descriptions whose referent can change over time are just incomplete descriptions in the first place, and you should have specified a time to have a complete description!</p>\n<p>The &#8220;millionth digit of pi&#8221; example serves to demonstrate the distinction in the absence of any element of time or change.  The millionth digit of pi <i>is</i> 5, not in a present-tense sense but in a timeless and absolute sense.  And yet it is still possible for me to doubt that the millionth digit of pi is bigger than 4, while not doubting that 5 is bigger than 4.</p>\n<p>The description is not the object; the map is not the territory.  That you have made two distinct marks on your map does not mean there are two distinct objects in the territory.  (Conversely, one might try to define an object by a property that doesn&#8217;t actually uniquely characterize it; making only one mark on your map doesn&#8217;t mean there&#8217;s only one object in the territory.)  Your argument still fails to go through, because you&#8217;re still trying to argue that we can deduce that two objects are distinct because our <i>representations</i> of them have different properties.</p>\n]]>", "author": "Sniffnoy", "published": "2015-06-28 23:04:40+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>correction to my post #61 above</p>\n<p>Apparently many Quantum Computing algorithms <a href=\"http://dspace.mit.edu/handle/1721.1/16663\" rel=\"nofollow\">do not rely on continuous time evolution</a> (of the Hamiltonian)</p>\n<p>Ok, then I need to concede that (large-scale) QC is viable, and almost certainly useful, even in a simplistic &#8220;discrete time&#8221; model (&#8230; and maybe STFU. 😉 )</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2015-06-28 23:41:44+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>Scott, do you have a more detailed explanation of the Afshar experiment?  The Wikipedia article lists countless explanations from all different points of view, and I don&#8217;t grasp it enough to understand how much is genuine confusion in the field and how much is just different ways of proving the same theorem. Your brief comment about how if you just do the calculations with wavefunctions there is nothing to be confused about makes sense to me, but then why are all these physicists writing different responses and rebuttals to his conclusions?</p>\n]]>", "author": "Jeremy", "published": "2015-06-30 03:20:04+00:00", "title": "By: Jeremy"}, {"content": "<![CDATA[<p>Jeremy #69: I&#8217;m very far from an expert on this, so you should probably ask someone else!</p>\n<p>The main thing I can assure you, from long experience, is: <i>never, ever conclude, from the mere fact that there&#8217;s a large number of responses and rebuttals written about something, then it must be deep and important.</i></p>\n<p>Here&#8217;s an analogy: suppose some clever individual named Aarchaf puts out a paper purporting to prove that the Pythagorean theorem doesn&#8217;t follow from Euclid&#8217;s axioms.  As such things do, the piece gets widespread media attention, so that motivates mainstream mathematicians to write rebuttal papers.  But the rebuttals don&#8217;t <i>exactly</i> agree about where the problem lies, so then that motivates a secondary literature analyzing the rebuttals.  Some papers point out that, well, OK, yes, Euclid wasn&#8217;t fully precise (by today&#8217;s standards) in stating his axioms, and there&#8217;s a weird (mis)interpretation of them that does lead to something other than what today we would call &#8220;Euclidean geometry,&#8221; and under that misinterpretation, the Pythagorean theorem (along with most facts of elementary geometry) doesn&#8217;t hold.  Some people pounce on this and say, &#8220;aha, so Aarchaf was RIGHT!  no backsies!&#8221;  But other people say the whole discussion is kind of pedantic and silly, since clearly the misreading <i>isn&#8217;t</i> how anyone has understood Euclid&#8217;s axioms for the past 2300 years of mathematics, or how Euclid himself would have understood them if asked.  Math is a lot more robust than the pouncing laypeople (laysayers?) give it credit for; it doesn&#8217;t crumble because of what might have been, or might as well have been, a papyrus transcription error somewhere in ancient Greece.</p>\n<p>Academics will probably continue to write papers about this &#8220;controversy&#8221; for years, until they get tired of it, because that&#8217;s what academics do: they write papers!  Indeed, the mere fact that so many papers have <i>already</i> been written is all the justification they need to write further papers, either buttressing or attacking the previous ones.</p>\n<p>So, if you cared, you could spend years of life delving into this literature.  As an outsider, however, probably the highest-order bit to take away is that, gee whiz, the Pythagorean theorem <i>does</i> follow from the axioms of Euclidean geometry (as anyone understands them today), and does so by any of the proofs you learned in high school.  And to whatever extent this whole big literature made anyone think that was in doubt, it&#8217;s been a negative contribution to human knowledge.</p>\n]]>", "author": "Scott", "published": "2015-06-30 11:42:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>@wolfgang</p>\n<p>You can doubt that your mother&#8217;s husband is your father. But you cannot doubt that your father is your father. Therefore, with perfect generality, all people everywhere everywhere know they were conceived out of wedlock <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "prasad", "published": "2015-06-30 13:11:29+00:00", "title": "By: prasad"}, {"content": "<![CDATA[<p>@prasad</p>\n<p>Nice joke.</p>\n<p>But notice that Descartes&#8217; doubt is not about if I am I  (or if my father is my father).</p>\n<p>As for your example, if you have reasonable doubt that your mother&#8217;s husband exists, then I would say there is equal suspicion that you were born out of wedlock.</p>\n]]>", "author": "wolfgang", "published": "2015-06-30 15:54:37+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>@wolfgang: Ah, maybe I see your problem: Doubting that two things are equal is not the same as denying that they are equal. Descartes&#8217; argument justifies the former, but not the latter.</p>\n]]>", "author": "Ben Standeven", "published": "2015-06-30 18:40:12+00:00", "title": "By: Ben Standeven"}, {"content": "<![CDATA[<p>@Ben et al.</p>\n<p>Let me explain it one more time, using your biological father F and the husband H of your mother as example.</p>\n<p>D(F) > 0 but to the extent we trust biology your doubt will be quite small, let&#8217;s say D(F) = e > 0.<br />\nD(H) may be much larger initially, perhaps you have never met H yet. In other words, initially it is unclear if F = H, but<br />\nof course we cannot rule it out.</p>\n<p>We cannot rule it out, because, as mentioned above, D is time dependent; so if this is an important issue to me and if F = H it should be possible, at least in principle, to reduce D(H) down to D = e, perhaps by visiting H etc.<br />\nso that D(F) = D(H).</p>\n<p>In general, if A = B, then there should be a way to get to<br />\nD(A) = D(B) at least in principle.</p>\n<p>Even more, in science it should be possible to provide direct evidence that F = H, e.g. with a genetic test, if F is indeed identical with H.</p>\n<p>&#8212;</p>\n<p>But D(I) = 0 and D(B) = e > 0 and I can *never* get the two to be equal.<br />\nIn addition I provided at least one good argument why I = B leads to contradictions (read the argument above about the supercomputer) *unless* we accept Descartes&#8217; argument in the first place.</p>\n<p>In other words I cannot be B in the same sense F can be H.</p>\n<p>ps: This was really my last comment on this topic.</p>\n]]>", "author": "wolfgang", "published": "2015-06-30 19:06:28+00:00", "title": "By: wolfgang"}]