[{"content": "<![CDATA[<p>I have an off-topic question: Back when you posted <a href=\"http://www.scottaaronson.com/blog/?p=1902\">The Power of the Digi-Comp II: My First Conscious Paperlet</a>, I wrote in the comments a proof that DIGICOMP_EXP⊆CC·#L, and you responded saying you didn&#8217;t understand my proof. I believe my mathematical writing skills have improved since then and I would like to make another attempt to write the proof. The comments on that post are closed. Are you interested in seeing another write-up, and if so where do you want me to write it?</p>\n]]>", "author": "Itai Bar-Natan", "published": "2017-07-07 12:33:17+00:00", "title": "By: Itai Bar-Natan"}, {"content": "<![CDATA[<p>Hi Scott<br />\nCant help, but make a couple of suggestions to the ITCS folks, which are based on my personal inexperience with the conference.<br />\nWhen ITCS was first announced (as ICS)<br />\nI was thrilled. Being a not very talented and shallow researcher a conference that stresses conceptual work seemed perfect. My first submission was a conceptual gem. There were three reviewers. One really loved the paper, the second didnt seem to have an opinion either way and the third essentially wrote that it is unpublishable junk. This brings me to my first suggestion. If you want to have some really innovative and wildly new ideas, leave some room for papers that only one of the reviewers really loved, or papers with huge variance in their scores, otherwise you will never explore outliers.<br />\nMy second suggestion is to invite me as a keynote speaker next time. I have some very original and innovative work which shows interesting connections between very different fields. I will not be able to get it accepted, I tried earlier (badly written) versions the last two times and wasnt even close, but I am certain that people in the community will find it fascinating</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bachmat:Eitan.html\">Eitan Bachmat</a>", "published": "2017-07-07 21:32:29+00:00", "title": "By: Eitan Bachmat"}, {"content": "<![CDATA[<p>Itai #1: Sure, post a link to your proof here, or just email it to me.</p>\n]]>", "author": "Scott", "published": "2017-07-08 05:42:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Eitan #2: I&#8217;m not on the ITCS PC, so it&#8217;s not my choice to make.  I can say that I&#8217;m always happy to hear your wacky talks. 🙂</p>\n]]>", "author": "Scott", "published": "2017-07-08 17:40:08+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Alright, I wrote the proof and posted it on my blog. <a href=\"https://itaibn.wordpress.com/2017/07/08/proof-that-digicomp_exp-is-in-cc%c2%b7l/\" rel=\"nofollow\">Here it is</a>.</p>\n]]>", "author": "Itai Bar-Natan", "published": "2017-07-08 20:42:45+00:00", "title": "By: Itai Bar-Natan"}]