[{"content": "<![CDATA[<p>Wow, had no idea that 3/4 of the “<em>billion web sites have no content and no audience (they are ‘parked’ domain names)</em>” — that’s a more stunning figure than I imagined.<br />\nAnyway, I don’t think there’s much doubt that the Web has a long-term future, even if its evolution means today’s internet is almost unrecognizable 25 years from now.</p>\n<p>One thing you didn’t much touch upon is “privacy” — I (and you) am from a generation that very much valued privacy rights. I believe upcoming generations barely care a twit about personal privacy, and think nothing of giving it away in exchange for free or cheap content. THAT (disappearance of privacy) I think will be a big, inevitable change coming once baby boomers are out of the picture. The very word (“privacy”) will be antiquated at some point in the future.</p>\n]]>", "author": "Shecky R", "published": "2017-12-16 22:03:14+00:00", "title": "By: Shecky R"}, {"content": "<![CDATA[<p>I appreciate your informative post. However when you speak about opinion suppression you are quite &#8220;mainstream&#8221;.</p>\n<p>I will try to give some examples of political suppression of opinion by &#8220;Nations that we like to think of as enlightened&#8221;, and which do not fall in the categories you mentioned.  </p>\n<p>First example is Twitter ban on RT and Sputnik publicity, on the basis, I suppose, that these are &#8220;fake news&#8221;. As far as I know, the &#8220;fake news&#8221; term itself was invented not by Trump but by the &#8220;liberal&#8221; establishment - liberal when it is about their own opinions, not so liberal about dissenting  opinions. I am speaking about real dissent here, not a disagreement on &#8220;transgender&#8221; bathrooms.</p>\n<p>Another example is the curious fact that searching on google for information on current political dissent in the west returns so little information.  I remember, in the height of the Greek crisis, searching on google for Greek anti EU/ECB/IMF blogs/opinions getting only a small set of results, while getting amply presented in every search the sites supporting the &#8220;mainstream media&#8221; version of events. The same about what happens in Donbass and now Catalonia.</p>\n<p>I don&#8217;t think that the domination of English language, skewing the version of events to that wanted by the US government, is the only reason, since Greece, Catalonia and Donbass are places where people should be interested in communicating their version of events to the western public and are able to do so.</p>\n<p>One may argue that Google is a private company, not the US government. But see the following<br />\n<a href=\"https://theintercept.com/2016/04/22/googles-remarkably-close-relationship-with-the-obama-white-house-in-two-charts/\" rel=\"nofollow\">https://theintercept.com/2016/04/22/googles-remarkably-close-relationship-with-the-obama-white-house-in-two-charts/</a></p>\n<p>And regarding both RT, Sputnik and Google, here is yet another example:<br />\n<a href=\"http://www.countercurrents.org/2017/11/21/google-announces-moves-to-censor-rt-and-sputnik/\" rel=\"nofollow\">http://www.countercurrents.org/2017/11/21/google-announces-moves-to-censor-rt-and-sputnik/</a></p>\n]]>", "author": "anonymous", "published": "2017-12-18 08:31:52+00:00", "title": "By: anonymous"}]