[{"content": "<![CDATA[<p>The website looks kind of sketchy.  It would be much better if they gave it a bit of a human touch, and gave numbers for how many votes have been traded.  It seems like a scam.</p>\n]]>", "author": "Joe", "published": "2016-11-02 00:04:19+00:00", "title": "By: Joe"}, {"content": "<![CDATA[<p>anon #29.</p>\n<p>There are two questions regarding vote trading:</p>\n<p>1) Is it legal?<br />\n2) Is it ethical?</p>\n<p>The courts have weighed on this issue and decided that it is legal, so the argument that it &#8220;subverts the law&#8221; does not hold water.<br />\nScott gave convincing arguments why he thinks it is ethical.<br />\nI don&#8217;t see any argument for it being unethical on  your end. </p>\n<p>To me the principle of vote trading seems not identical but quite similar to the National Popular Vote Interstate Compact, which has been joined by 10 states and D.C.  </p>\n<p>But, for full disclosure, since I mentioned this in a comment above, perhaps I should say that I ultimately decided not to personally go through with trading but my wife and I contributed a little more to Hillary instead. I hope I don&#8217;t curse myself next Tuesday.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barak:Boaz.html\">Boaz Barak</a>", "published": "2016-11-02 03:19:27+00:00", "title": "By: Boaz Barak"}, {"content": "<![CDATA[<p>p.s. btw if you think vote trading is illegal or unethical, let me ask you the following question: </p>\n<p>Suppose that (very hypothetically speaking)  I have a friend who is a trump supporter and we make an agreement that we both don&#8217;t vote so we cancel each other and skip the lines.  Is that illegal? unethical?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barak:Boaz.html\">Boaz Barak</a>", "published": "2016-11-02 03:24:49+00:00", "title": "By: Boaz Barak"}, {"content": "<![CDATA[<p>Scott #30: Your reply made me chuckle. When I moved from France to the UK many years ago, I noticed that I could say almost anything without upsetting anyone as long as I prefaced it with &#8220;In my opinion&#8221;. In France that was considered unnecessary: everything you say is by definition your opinion unless otherwise specified. In the UK the default value may be more like &#8220;consensus opinion&#8221;.</p>\n]]>", "author": "luca turin", "published": "2016-11-02 06:23:04+00:00", "title": "By: luca turin"}, {"content": "<![CDATA[<p>Re #22: sigh.  I wonder if Scott could make some sort of FAQ page about vote swapping, since people keep asking the same things in every thread.  The top ones are why it would be bad if Trump became the president; what happens to vote swapping if the predictions for your state change; and what Gary Jones supporters can gain from more votes even if Gary won&#8217;t become the president.</p>\n]]>", "author": "jonas", "published": "2016-11-02 12:56:40+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>[&#8230;] points out that this distinction creates the opportunity for gains from trade, and has been promoting the idea of vote-swapping in order to reconcile these interests. The idea is that one or more [&#8230;]</p>\n]]>", "author": "Vote-trading and personal honor | Compass Rose", "published": "2016-11-02 17:50:26+00:00", "title": "By: Vote-trading and personal honor | Compass Rose"}, {"content": "<![CDATA[<p>#34 I like that thought, Boaz.  Isn’t nature always looking for ways to minimize the work it has to do?  Or maybe you’d like to draw comparisons to matter and antimatter cancelling each other out?  (Obviously, the Trump vote would be the &#8220;antimatter&#8221; in this analogy.) Or what about letting people vote over and over for their favorite candidate and then canceling votes out based on cardinality?  I would actually sympathize with the feeling that the “whole thing is rigged” if elections were founded on theories of the infinite.</p>\n]]>", "author": "Jon K.", "published": "2016-11-02 18:41:18+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>The 1st thing TrumpTraders.org asked was my Facebook public profile and my email address. I&#8217;d rather not broadcast that in the context of political choice. Is it possible to participate in TrumpTraders w/out making one&#8217;s profile exposed to political trolling?</p>\n]]>", "author": "Michael P", "published": "2016-11-02 18:46:58+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>#39: Similar boat: I don&#8217;t even have a Facebook profile! Is there a way to participate in this without Facebook &#8211; only using an email address?</p>\n]]>", "author": "lewikee", "published": "2016-11-02 19:17:34+00:00", "title": "By: lewikee"}, {"content": "<![CDATA[<p>I didn&#8217;t get a confirmed match from either makeminecount or trumptraders so I just <a href=\"https://www.facebook.com/dreev/posts/10107287808115933\" rel=\"nofollow\">posted on Facebook</a>. Looks like that is working!</p>\n]]>", "author": "Daniel Reeves", "published": "2016-11-02 20:02:19+00:00", "title": "By: Daniel Reeves"}, {"content": "<![CDATA[<p>#32: I definitely want to see more transparency in vote-trading sites. It would be nice for the system to register when 2 people have agreed to swap, and to display the number of votes swapped in all states, especially since this is the first time in the US this is being done on a large scale &#8211; and we can really use the data on how much this changes the election. We also just need to know this isn&#8217;t a scam from a third-party or Trump voter to fool people into not voting for Clinton!</p>\n<p>When I registered as a Clinton supporter I was immediately matched up. I find this fishy given that I would expect there to be a surplus of Clinton supporters and a shortage of third-party supporters in swing states. What were other people&#8217;s experiences with the wait time, esp. from the other side?</p>\n<p>One downside to vote trading in terms of optimizing Clinton&#8217;s chances of winning is that it might encourage people who are wavering between a third-party candidate and Clinton to not have to make the decision (by trading off their third-party vote). This means that with respect to this objective, convincing people to vote for Clinton > trading votes, but trading votes is still better than not doing anything.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lee:Holden.html\">Holden Lee</a>", "published": "2016-11-03 11:36:45+00:00", "title": "By: Holden Lee"}, {"content": "<![CDATA[<p>Also, the TrumpTraders site says &#8220;2x 3rd-party votes in a safe state for 1x clinton vote in a swing state&#8221;. Is it really being matched 2-1? Do 3rd party supporters get matched with 2 people?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lee:Holden.html\">Holden Lee</a>", "published": "2016-11-03 11:46:47+00:00", "title": "By: Holden Lee"}]