[{"content": "<![CDATA[<p>Joshua #52: You ask some excellent questions.</p>\n<p>I don&#8217;t know how to prove that any unlikely complexity-theoretic consequence would follow, if BosonSampling were universal for BQP.  I agree that such a result would be great.</p>\n<p>My strongest evidence that BosonSampling is <i>not</i> universal for BQP, just comes from considering the sizes of the respective Lie groups: the group of unitary transformations acting on n qubits is ~2<sup>2n</sup>-dimensional, whereas the group of unitary transformations acting on n optical modes is merely ~n<sup>2</sup>-dimensional (it then gets lifted, via homomorphism, to a tiny subgroup of the group of unitary transformations on an exponentially-larger Hilbert space).  By the usual standards of complexity theory, this sort of argument doesn&#8217;t count for much.  But it does show that there can&#8217;t be any &#8220;faithful mapping&#8221; from the gates in a qubit-based quantum circuit to the linear-optical gates, and it seems pretty convincing intuitively.</p>\n<p>Ironically, I <i>do</i> know an unlikely-seeming complexity consequence that would follow if the converse held, and BosonSampling were reducible to BQP!  How is that possible, you ask, since clearly a BosonSampling machine can be efficiently simulated by a universal quantum computer?  Well, it simply has to do with the fact that BosonSampling is a sampling problem, whereas BQP is defined as a class of decision problems.  In my and Alex&#8217;s paper, we note the following strange corollary of our results: if exact BosonSampling could be performed by a probabilistic polynomial-time algorithm with an oracle for BQP decision problems, then P<sup>#P</sup> would be contained in BPP<sup>NP^PromiseBQP</sup>.  We added a remark like, &#8220;this seems unlikely, though we admit to lacking a strong intuition here.&#8221;</p>\n]]>", "author": "Scott", "published": "2013-11-13 13:46:56+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>jim #53: Thanks for the link. The same talk held at ETH is available online <a href=\"http://www.multimedia.ethz.ch/speakers/zurich_physics_colloquium/?doi=10.3930/ETHZ/AV-28cb1594-2f3c-4bf2-bbf2-b17bc308507a&autostart=false\" rel=\"nofollow\">here</a> (smaller file size, one file).<br />\nDirect link for the ~300 MB file: <a href=\"http://replay-progressive.ethz.ch/h264-medium.http/10.3930/ETHZ/AV-28cb1594-2f3c-4bf2-bbf2-b17bc308507a/20131030_HPVG4_Physik_Kolloquium_grabber-dm.m4v\" rel=\"nofollow\">Link</a></p>\n]]>", "author": "lars", "published": "2013-11-14 09:59:35+00:00", "title": "By: lars"}, {"content": "<![CDATA[<blockquote><p><b>Gil Kalai</b> posts (#28) &#8220;Success of having logical qubits substantially more robust than “raw” physical qubits that John’s and various other experimental groups are attempting now will smash my conjectures to pieces.&#8221;</p></blockquote>\n<p>It won&#8217;t be easy to devise active/error-correcting qubit protection methods that better the extraordinarily long many-minute phase-decoherence times that are reported in this week&#8217;s <i>Science</i> by Saeedi <i>et al.</i> in  &#8220;Room-Temperature Quantum Bit Storage Exceeding 39 Minutes Using Ionized Donors in Silicon-28.&#8221;</p>\n<p>These authors apply protection means&nbsp;&mdash;  chiefly high Debye temperatures, isotopic purification, and decoupling pulses&nbsp;&mdash;  that are entirely passive, and thus would serve to protect the phase coherence of classical Bloch spins equally well  as quantum spins.</p>\n<p>It would be wonderful (obviously) if we could induce high-order quantum coherences among individual spins, protect these coherences by means both passive and active, interact them by tunable Hamiltonians, and read them out with high fidelity.  After all, individually these capabilities have been demonstrated  convincingly; now the great quest is to demonstrate them simultaneously and scalably.</p>\n<p>One indication that Gil Kalai&#8217;s conjectures may be correct is that optimizing any one of these capabilities degrades the rest.  It would be terrific if we had a deeper understanding of why this coupling is ubiquitous.  Hundreds of instances are available for study; why is a unified appreciation so elusive?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2013-11-15 23:53:30+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>rrtucci #25: May be misreading your comment somewhat.  But it seem to me you almost position Scott as a kind of spokesperson for Matthias Troyer.  Don&#8217;t think that&#8217;s fair.</p>\n<p>Before moving on to Harvard he came to Waterloo, and we arranged to meet over lunch.  He is great to talk to, and of course very knowledgable. To me it seems he approaches D-Wave with unbiased academic curiosity.  For instance he originally was sceptical of their chip truly performing quantum annealing, but backed this conclusion in a later paper when the data strongly suggested it.</p>\n<p>Mathias won&#8217;t partake in any blog discussion until his latest paper is published, so to me it makes sense to wait with revisiting the benchmark discussion until then.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/Dekant:Henning.html\">Henning Dekant</a>", "published": "2013-11-17 07:15:42+00:00", "title": "By: Henning Dekant"}, {"content": "<![CDATA[<p>Henning #58: For the record, I was also skeptical of the presence of quantum annealing behavior in the device, back when they hadn&#8217;t published anything to show it&#8212;and then I changed my mind immediately when they <i>did</i> publish something!  Which is, y&#8217;know, how science is supposed to work.  <a href=\"http://www.scottaaronson.com/blog/?p=639\" rel=\"nofollow\">Here&#8217;s</a> the relevant blog post from 2.5 years ago.</p>\n<p>On the other hand, I agree with you that it was inaccurate for rrtucci to call me a &#8220;collaborator&#8221; of Matthias.  At most, I&#8217;m Paul to his Jesus. <img src='http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif' alt=':-)' class='wp-smiley' /> </p>\n<p>I share your admiration for Matthias&#8217;s objectivity.  That&#8217;s why I&#8217;ve happily reported on his blog everything that he and his collaborators have found: both the evidence for quantum annealing behavior in the device, and the evidence for no scaling advantage whatsoever in any of the datasets that they tried.</p>\n]]>", "author": "Scott", "published": "2013-11-17 13:13:42+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;it was inaccurate for rrtucci to call me a “collaborator” of Matthias&#8221; </p>\n<p>Sorry, with hindsight, I should have been more clear. I meant that Scott and Matthias could collaborate in doing a blog post, or Matthias could do a guest post in Scott&#8217;s blog. I didn&#8217;t mean to imply that they had collaborated in writing a paper in the past.</p>\n<p> I like Rahul&#8217;s idea of Jan 1 and July 4, two fireworks days. It could be the state of the union speech by the King Kong party versus the rebuttal by the Godzilla party. By making this a bit more scheduled, more people will begin to see it as just healthy, necessary debate.</p>\n]]>", "author": "rrtucci", "published": "2013-11-17 15:18:54+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>Hi &#8211; Just came across a five year old segment of your site re arguments about quantum computing. I think an interesting way to look at this issue is via what&#8217;s often called the de Broglie/Bohm perspective: i.e., if QM is interpreted to be deterministic, as it can be, how does a quantum computer work? Leads to some interesting considerations&#8230;</p>\n]]>", "author": "Ted", "published": "2013-11-17 15:51:33+00:00", "title": "By: Ted"}, {"content": "<![CDATA[<p>Scott #59, didn&#8217;t mean to imply that you differ from Mathias on the ability to change your mind when presented with new facts <img src='http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif' alt=':-)' class='wp-smiley' /> </p>\n<p>As I wrote I don&#8217;t want to rekindle the benchmarking discussion before Mathias can freely chime in, but just for clarification when you mention scaling, do you mean scaling with the number of qubits on the chip?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/Dekant:Henning.html\">Henning Dekant</a>", "published": "2013-11-17 19:54:35+00:00", "title": "By: Henning Dekant"}, {"content": "<![CDATA[<p>Henning #62: Yes.</p>\n]]>", "author": "Scott", "published": "2013-11-18 00:52:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Ted #61: dBB makes the same predictions as standard QM for what a quantum computer would do, but unfortunately, it doesn&#8217;t really provide new or different insight.  For more see my <a href=\"http://physics.stackexchange.com/questions/59346/does-quantum-computing-rely-on-particular-interpretations-of-quantum-mechanics/59435#59435\" rel=\"nofollow\">Physics StackExchange</a> answer on the subject.</p>\n]]>", "author": "Scott", "published": "2013-11-18 00:57:28+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Off topic, sorry. But is Eliezer Yudkowski&#8217;s talk available online?</p>\n]]>", "author": "nathan", "published": "2013-11-18 20:05:36+00:00", "title": "By: nathan"}, {"content": "<![CDATA[<p>nathan #65: Sorry, no.  Read the update on my <a href=\"http://www.scottaaronson.com/blog/?p=1558\" rel=\"nofollow\">last post</a>.</p>\n]]>", "author": "Scott", "published": "2013-11-19 01:08:08+00:00", "title": "By: Scott"}]