[{"content": "<![CDATA[<p>@Scott#176- I&#8217;m not sure if I buy Keillor&#8217;s story that he was fired for touching a woman&#8217;s bare back. He wrote an entire column defending Al Franken without mentioning that he was under investigation for sexual harassment, which arguably raises questions about his honesty. MPR said that that there were multiple allegations:<br />\n<a href=\"http://www.startribune.com/ceo-mctaggart-multiple-allegations-were-made-over-long-time-period-against-garrison-keillor/462449813/\" rel=\"nofollow\">http://www.startribune.com/ceo-mctaggart-multiple-allegations-were-made-over-long-time-period-against-garrison-keillor/462449813/</a><br />\nYes, I know, in the absence of real information to the contrary, we should be charitable.</p>\n]]>", "author": "Michael", "published": "2018-01-06 14:36:38+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>@Scott#179- I think that he&#8217;s referring to the tens of thousands of suspected Nazis held in internment camps after the war, some of whom were housed in Dachau and Neungamme:<br />\n<a href=\"https://history.army.mil/books/wwii/Occ-GY/ch21.htm\" rel=\"nofollow\">https://history.army.mil/books/wwii/Occ-GY/ch21.htm</a><br />\n<a href=\"http://www.kz-gedenkstaette-neuengamme.de/en/history/the-site-after-the-war/\" rel=\"nofollow\">http://www.kz-gedenkstaette-neuengamme.de/en/history/the-site-after-the-war/</a></p>\n]]>", "author": "Michael", "published": "2018-01-06 14:45:25+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Everyone: OK, so my decision is not to join Heterodox Academy for now, but to wish them well and try to support them in the many areas where we agree.  The decision might change in the future, for example if the problems they&#8217;re addressing get worse, or they do something really important that I want to be part of, or they address some of the issues that have been raised in this thread with their pledge.</p>\n<p>There was no single argument that was decisive for me&#8212;mostly, just the combined weight of all the arguments here, together with the absence of a counterargument from HA members or others that successfully answered my concerns.  Amy <i>did</i> almost convince me to join, just to signal the depth of my disagreement with her about Alan Sokal. 😉</p>\n<p>I&#8217;ll be closing down this thread today.  Thanks to everyone who offered advice or otherwise participated, and please get in any final comments now.</p>\n]]>", "author": "Scott", "published": "2018-01-06 14:46:06+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Michael #180: In that case, it comes back to a principle that I enunciated in the Walter Lewin post, and that I still stand by: if a public figure is going to be &#8216;erased&#8217;&#8212;doesn&#8217;t matter whether for sexual harassment or for anything else&#8212;then the exact nature of their offense should be made public, so that all can join in the just condemnation, and everyone who admired the figure can make a clean break.</p>\n]]>", "author": "Scott", "published": "2018-01-06 14:55:40+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>@Scott #179. Ok, I see, sorry for the misunderstanding. But the sentence &#8216;But it’s clear that you couldn’t have killed, or imprisoned for life, every German who’d enthusiastically supported or aided the Nazis, whatever some abstract concept of justice would seem to call for.&#8217; had the flavor of &#8216;that would&#8217;ve been the best way, though, if logistically/etc. possible&#8217;. But I think it&#8217;s a complex topic  and possibly no single sentence can express an opinion about it comprehensibly. </p>\n<p>I don&#8217;t know what kind of reference you are looking for.  Buchenwald, for example, was continued by the Soviets and the US soldiers, like many other camps, imprisoning NSDAP people but also juveniles, denunciated persons and whomever they deemed a threat to themselves. And the methods did not change much, starvation and torture were common.  So let&#8217;s say only people &#8216;who’d enthusiastically supported or aided the Nazis&#8217; were held there (which unfortunately is not true), would you say this is justice or  the right kind of punishment?</p>\n]]>", "author": "josh", "published": "2018-01-06 15:45:40+00:00", "title": "By: josh"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>The reason your concern about the viewpoint diversity pledge is unwarranted is that we know that viewpoint diversity is what is causing a great deal of problems on campuses right now. Your concern that we do not need viewpoint diversity on some issues, like creationism, is easily nullified. </p>\n<p>First, who gets to decide which issues do not require further debate? Some say that viewpoint diversity on matters such as understanding transgenderism is unnecessary because there is nothing to talk about and any inquiry into understanding the science behind it is transphobia. Second, you seem like someone who might be a fan of John Stuart Mill. Well, what is his view on this matter? Clash ideas against one another. Even if you know you are correct your position becomes stronger and more clear by encountering resistance. In addition, some views can become merely dogma and not living truths if they are not contested.</p>\n<p>Finally, given these points, it seems like your priorities might be misplaced. We have a real and demonstrable threat to institutional disconfirmation that is having a strong negative impact on the validity of the university, so I do not think that your concern about a hypothetical problem that may arise is warranted. In addition, those ideas can easily be contested and shown to be false by the same process.</p>\n]]>", "author": "Jack", "published": "2018-01-06 17:41:40+00:00", "title": "By: Jack"}, {"content": "<![CDATA[<p>@josh- I think it&#8217;s a mistake to compare the American camps to the Soviet camps. In the Soviet camps 42,889 people died of mistreatment by the Soviets&#8217; own figures and 756 were executed. Moreover, the Soviet camps contained political prisoners as well as actual Nazis. They were basically an attempt to recreate the gulag on German soil.<br />\nOTOH, the US camps didn&#8217;t have anywhere near as high a death rate. I&#8217;m sure some prisoners were mistreated- there was a lot of anger at the Germans- but there weren&#8217;t systematic deaths of large numbers of prisoners.</p>\n]]>", "author": "Michael", "published": "2018-01-06 17:56:51+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Scott #160:</p>\n<blockquote><p>\nCome on, the reason to join would be if I wanted to lend my name, or my time, to help advance their ideals.</p>\n<p>Even supposing I had a “new social science theory” (which I don’t), how would joining would help me publish it?\n</p></blockquote>\n<p>Of course, you don&#8217;t have a “new social science theory”, but remember that you have an old and neglected problem for social sciences &#8211; “the problem of the shy male nerd.” You said that:</p>\n<blockquote><p>\nThese problems are (thankfully) no longer the slightest bit relevant to my life, but they affect so many young people in math and science—and the stigma against mentioning them in “respectable” circles is so immense—that using my tenured freedom to talk about these things does seem like one of my best hopes to do some lasting good for humanity.\n</p></blockquote>\n<p>The psychologists don&#8217;t have a &#8220;Psychology Overflow&#8221; &#8211; but maybe Heterodox Academy would have been an opportunity&#8230;</p>\n]]>", "author": "a reader", "published": "2018-01-06 18:33:54+00:00", "title": "By: a reader"}, {"content": "<![CDATA[<p>josh #184: If Germans, including children, who&#8217;d had nothing to do with supporting Nazi atrocities were starved or tortured, then absolutely, that was a great injustice.  (As, in some sense, every innocent German killed by Allied bombs was the victim of injustice, and deserves to be remembered.)  At the same time, I find it difficult to condemn those fighting on the &#8220;right&#8221; side of a horrific long-ago war, <i>except</i> in cases that were jaw-droppingly horrible even by the usual standards of wartime atrocities prevailing then.  While I like to think that I would never have been a Nazi (to whatever extent I was still &#8220;me&#8221;), I&#8217;m not sure how much better you or I would have acquitted ourselves in place of (say) General Eisenhower in 1945-46.</p>\n]]>", "author": "Scott", "published": "2018-01-07 02:04:29+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>OK everyone, closing the thread.  Thanks for participating!</p>\n]]>", "author": "Scott", "published": "2018-01-07 02:06:05+00:00", "title": "By: Scott"}]