[{"content": "Your three points seem, to me, unassailable. Of course be honest with undergrads about grad school success chances. Of course be honest in feedback to grad students. And of course, of course, encourage breadth! A good student can acquire depth on personal steam at any point. But breadth, if missed during grad school, is incredibly hard to acquire later on. And it is *extremely useful* later on as well. If believing this is being biased,  I&#39;m glad to join you there! <br />", "author": "Meena", "published": "2014-01-05 21:51:17.322000-05:00", "title": ""}, {"content": "<br />At least in CS/CE, I think there might be advantages to <i>increasing</i> the role of the post-doc and hopefully <i>decreasing</i> the time to PhD.<br /><br />It will always feel uncomfortable to cut things out of a program, but if the PhD isn&#39;t the &quot;last chance&quot; to prepare students for professorship, it may  be easier to focus on technical research and communication skills, as well as to increase breadth. (I would cut the formal monograph thesis; it&#39;s just not a useful form of technical communication.)<br /><br />A shorter PhD would allow students who continue in industry, government, or entrepreneurship to enter their careers earlier in life with great R&amp;D skills: this might even make the PhD more attractive.  <br /><br />At the same time, a more coherent model for post-doc would let a limited subset of students to go on to prepare for academic position, with little loss of total time and greater (statistical) probability of success.  This would also be a good opportunity for students to evaluate (and be evaluated for) that option.<br /><br />Also, I think that more separation between PhD-training and post-doc training would help students to learn whether they like/have aptitude for academic profession itself. Better to discover hatred of grant-smithing, student-wrangling, and administrivia during a post-doc...<br /><br />Obviously, the community would need to show some discipline to emphasize aspect of post-doc as academic training position and also not to develop the habit of extended post-dockery (as in some fields). <br /><br />That may not be reasonable expectation...<br /><br />", "author": "Laura", "published": "2014-01-06 16:05:02.059000-05:00", "title": ""}, {"content": "&quot;encourage breadth for your students&quot;<br /><br />For students interested in teaching at liberal arts colleges, I would say this is especially important.  Most liberal arts CS departments will only have a few faculty, so you&#39;ll need to teach a huge range of classes.  We seem to be getting lots of applicants who only have expertise in their exact research areas. ", "author": "Scott", "published": "2014-01-07 12:15:46.858000-05:00", "title": ""}]