[{"content": "<![CDATA[<p>Michale #123: Yes, the current German communist part, the DKP, is not banned, unlike its predecessor, the KPD. The reasoning was that the danger has passed so it&#8217;s not worth prosecuting them. Exactly the same reasoning has been applied to the current Nazi party, the NPD. Both the NPD and the DKP are abysmal failures, electorally speaking. And that&#8217;s anyway not about the Volksverhetzung law, but the article 21 of the German constitution.</p>\n<p>Regarding #108, that&#8217;s exactly the kind of answer I was expecting from Scott: that of course we can&#8217;t blame Jewish veterans for beating up Nazis, but we can&#8217;t have vigilantes making up their own laws and beating up whoever they want. In the case of preventing genocide, though, I think letting the vigilantes do the dirty work is a risk worth taking. That Scott was conflating a ban on hate speech with a ban on giving advice on how to pick up woman just shows how traumatized he is from his interactions with SJWs and how ignorant he is about hate speech laws.</p>\n<p>About the British case: I&#8217;m not really familiar with Britain. I live in Germany, so I know what&#8217;s going here and have some passing familiarity with its laws. But I read your article anyway. The guy was convicted for &#8220;grossly offensive comments&#8221; under the Communications Act 2003. This is not a hate speech law, and I never defended criminalising &#8220;grossly offensive comments&#8221;.</p>\n]]>", "author": "Mateus Arajo", "published": "2018-06-20 21:46:39+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>TPWG #124: You haven&#8217;t pointed out a single problem with the German Volksverhetzung law.</p>\n<p>With the sentence &#8220;One&#8217;s person&#8217;s hate speech is another person&#8217;s core belief system, no matter how repugnant it might seem to most people.&#8221; you seem, however, to be making the mistake of thinking that banning hate speech is banning speech you don&#8217;t like. It&#8217;s not. It&#8217;s a well defined law, is banning inciting hatred against national, ethnic or religious groups.</p>\n<p>And the reasoning behind it is quite simple: time and time again we have seen that hate speech leads to lynchings, pogroms, terrorism, and genocide. It&#8217;s not funny.</p>\n]]>", "author": "Mateus Arajo", "published": "2018-06-20 21:57:05+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>anonymous #126: My position is simple.  In any official forum where it’s possible to lodge accusations against someone and hurt their career, reputation, and life, it must also be possible for the accused to defend themselves and to call witnesses.  If we’re (understandably) uncomfortable with anonymous defenses, we should also move away from anonymous accusations, and have everything be open and public.  No one’s rights are a-priori more important than anyone else’s: indeed, the entire point of a systematized judicial process, whether public or private, should be to try to give equal procedural rights to everyone and let the truth win.</p>\n]]>", "author": "Scott", "published": "2018-06-20 23:43:42+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Mateus Araújo #128</p>\n<p>Let me be as clear as I possibly can. I believe that the Germany&#8217;s Volksverhetzung law (as described here <a href=\"https://en.wikipedia.org/wiki/Volksverhetzung\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Volksverhetzung</a> ) and similar laws that exist in other European countries are wrong and would not survive a constitutional challenge in the United States. I say that based on this <a href=\"https://en.wikipedia.org/wiki/National_Socialist_Party_of_America_v._Village_of_Skokie\" rel=\"nofollow\">https://en.wikipedia.org/wiki/National_Socialist_Party_of_America_v._Village_of_Skokie</a> .</p>\n<p>With respect to &#8220;time and time again we have seen that hate speech leads to lynchings, pogroms, terrorism, and genocide&#8221;, a basic principle underlying US Supreme Court decisions on free speech is that so called &#8220;prior restrain&#8221; is a form of censorship (more info here <a href=\"https://en.wikipedia.org/wiki/Near_v._Minnesota\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Near_v._Minnesota</a> ). In essence, US jurisprudence is such that judges can only act on actual damages not &#8220;hypothetical/Minority Report&#8221; type of situations. Something I also agree with and one of the reasons I find the whole NSA/Google/Facebook spying coupled with &#8220;predictive analytics that try to predict behavior&#8221; particularly nefarious . Again, I know that Europeans as a whole feel generally differently about this, but this has been one of the big American/European divides throughout history. </p>\n<p>At the risk of simplifying things, somebody told me once that together with its imperfections -such as legalized slavery and racism- American culture grew out of those Europeans -and their descendants- who ran way from the Feudal lord seeking freedom and who settled in the Americas whereas current Europeans are the descendants of those Europeans who were happy putting up with abuses of the feudal lord so long as they had the protection said lord in exchange. In the XXI-st century, governments play the role of feudal lords for most Europeans, but a similar rationale still applies. How each side treats so called &#8220;hate speech&#8221; is a prime example of this difference in mindset.</p>\n]]>", "author": "The problem with gatekeepers", "published": "2018-06-20 23:53:21+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Mateus Araújo #128 </p>\n<p>And to continue with the discussion. The mantra in the US by those of us who are in favor of  free speech has always been that the answer to speech you don&#8217;t like is &#8220;more speech&#8221; not &#8220;suppression&#8221; of said speech. The issue of preemptively &#8220;suppressing&#8221; speech is a statist position that is generally accepted as valid in Europe and by some hard left people around here but it is not the majority view among Americans of either political persuasion.</p>\n<p>Many years back there was a case that highlighted the difference in approach of European courts vs American courts on this issue <a href=\"https://en.wikipedia.org/wiki/LICRA_v._Yahoo\" rel=\"nofollow\">https://en.wikipedia.org/wiki/LICRA_v._Yahoo</a>! . Note that while the US Supreme Court refused to hear Yahoo!&#8217;s appeal, and therefore the decision by the Circuit/District courts did not create nationwide precedent, the district court said that the French court ruling violated US free speech protections. The circuit court reversed the district court opinion on standing grounds (ie, that the district court did not have jurisdiction to rule on a foreign matter) but not on the substance of the issue.  </p>\n<p>I am of the opinion that the right response to hateful speech is indeed more speech. For a variety of reasons. First, criminalizing speech only makes said speech go underground (it doesn&#8217;t make it go away). Second, and more importantly, confronting hateful ideas in the open is the best way to nullify them in the hearts of those who are watching and who might not have a strong opinion one way or another. One of the reasons regular Germans could claim &#8220;ignorance&#8221; when the atrocities committed by the Nazi government came to light was that said government controlled the flow of information to regular German citizens. The extreme Nazi censorship made it very difficult to said citizens to know the extent of the abuses (I would imagine that some version of what was going on reached many of them though).</p>\n]]>", "author": "The problem with gatekeepers", "published": "2018-06-21 01:56:45+00:00", "title": "By: The problem with gatekeepers"}, {"content": "<![CDATA[<p>Comment #129: </p>\n<p>Scott, &#8220;In any official forum where it’s possible to lodge accusations against someone and hurt their career, reputation, and life, it must also be possible for the accused to defend themselves and to call witnesses . . .&#8221;</p>\n<p>Tenured faculty (in my field, almost all men), rarely if ever even perceive that they are hurting the careers, reputations and life of the women they refuse to mentor, refuse to equitably teach, and refuse to equitably interact with.  And that doesn&#8217;t even get to active gender based harassment, which according to the recent NAS study, is very common in academia.</p>\n<p>Least one of these women even mention that they are being treated differently, or are being marginalized, or even harassed, do you think that they get equal time and consideration to talk about what they are experiencing?  Is there any empathy for this experience of being marginalized and treated as less than a fully thinking, cognitively capable human being?</p>\n<p>In my experience working in EECS for the last thirty years, there is no empathy, no hearing and no consideration for the experience of women in EECS.</p>\n<p>Women, least they ask for equal time in the airing of their experiences, are written of as man hating b*ches out to damage the careers of the ever holier than thou tenured faculty member.</p>\n<p>Overwhelmingly, women do not report their experiences, and when they do, it is very, very difficult to be heard.  The reporting comes at a very high personal cost to women, which usually damages their careers.</p>\n<p>So, while I do empathize with people who are fearful of being accused of harassment, and do recognize that there are cases where people are wrongfully accused, statistics do bear out that, for the most part, established male faculty are not suffering for the calling of witnesses or a fair hearing.</p>\n<p>Overwhelmingly, male faculty have tended to use their stealth insider networks to defend themselves, and are perfectly happy to try women in absentia.</p>\n<p>I do not see the justice in this.</p>\n<p>So again, I ask you, Scott:</p>\n<p>Why are anonymously communicated “character defenses” among tenured faculty permissible against students who attempt to report misconduct?</p>\n<p>Why is the employment protection of tenured faculty members more important than employment protection of students and other non-tenured people?</p>\n<p>Because I don&#8217;t think your previous response answered these questions.</p>\n]]>", "author": "anonymous", "published": "2018-06-21 03:09:16+00:00", "title": "By: anonymous"}, {"content": "<![CDATA[<p>@Mateus#127- Regarding a &#8220;ban on giving advice on how to pick up women&#8221;, I think Scott was thinking of Roosh V, who does sound rapey and was banned from the United Kingdom. There&#8217;s an article about attempts to criminalize his speech here:<br />\n<a href=\"https://reason.com/blog/2016/02/03/pickup-artist-roosh-v-causes-moral-panic\" rel=\"nofollow\">https://reason.com/blog/2016/02/03/pickup-artist-roosh-v-causes-moral-panic</a></p>\n]]>", "author": "Michael", "published": "2018-06-21 04:24:49+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>anonymous #132: It&#8217;s extremely important that reports of sexual harassment be investigated swiftly, and that anyone who&#8217;s found guilty be severely punished as an example to others.  There&#8217;s not the slightest disagreement there; the only disagreement is about the details of procedure.  I can understand the arguments for keeping the whole proceedings confidential.  I can also understand the arguments for getting everything out in the open.  What I <i>don&#8217;t</i> understand is how you can do a half-open, half-closed hybrid, where (e.g.) accusations can be lodged in secret, but then any attempt to defend against the accusations is outed and publicly shamed.  In your comment, you&#8217;re very explicit that the goal, in your mind, is to tilt the procedure to help one side win and the other lose.  That sounds to me like a prescription for Soviet-style justice: &#8220;the proletariat has gotten the short end of the stick for most of human history, so any time a proletarian takes a kulak to trial, why even suffer the kulak to mount a defense?&#8221;  More than that, it&#8217;s a prescription that could easily be turned <i>against</i> your favored side, depending on the vicissitudes of power&#8212;and history suggests that it would.  Please think carefully about whether you want this!</p>\n<p>If, as your comments strongly suggest, there&#8217;s nothing whatsoever that you&#8217;d count as &#8220;answering your questions&#8221; other than agreeing with you, then I regret that I don&#8217;t have the energy to continue the conversation.</p>\n<p>Everyone: I&#8217;m closing down the thread soon, so get in any final comments now.  Thanks to everyone for participating!</p>\n]]>", "author": "Scott", "published": "2018-06-21 04:51:58+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Well, I don&#8217;t have time to properly write the replies I wanted, so here&#8217;s some abbreviated replies, sorry for having to omit stuff:</p>\n<p>Mateus #128: I&#8217;d be careful with your terminology here.  The phrase &#8220;hate speech&#8221; gets used in a lot of ways and I don&#8217;t think you can generally assume that if you use it meaning the particular things banned in German law that people will know you mean that rather than something more expansive.  &#8220;Grossly offensive comments&#8221; is indeed frequently referred to as &#8220;hate speech&#8221;.</p>\n<p>Mateus #122: This really merits a much better response, because you do have a good point here, but I would like to point out that we here in the US did, you know, just elect a censorious totalitarian asshole and our constitution seems to be doing a fairly good job holding him at bay so far.  The Republican party may not be properly &#8220;fascists&#8221; in your sense but it is good to be robust against lesser forms of authoritarianism, you know?  Of course it is still possible this whole episode may end with the constitution effectively going down the toilet (to a much greater degree than it is already, that is 😛 ), but it&#8217;s not going to happen without some sort of confrontation first.</p>\n<p>Actually, now that I think about it some more, I&#8217;m a bit confused about your assertion &#8212; if the fascists are going to shred the constitution anyway, why bother winning an election first?  Like, they care enough about the appearance of rule of law to do one but not the other?</p>\n<p>Or to put it another way, if you want to ignore the constitution, you&#8217;re going to have to deal with the courts.  Like, if you just keep ignoring it, eventually the judges are going to send people to arrest you for contempt of court when you ignore their rulings against you.  You can prevent that through violence, I guess, but if you&#8217;re willing to intimidate judges through violence, why did you wait until winning an election to do so?</p>\n<p>I&#8217;m wondering to what extent this is a problem of parliamentary governments that American division of powers (which comes from, you know, the constitution) defends against.  But even those have an independent judiciary, don&#8217;t they?  I&#8217;m confused.</p>\n<p>The problem with gatekeepers #39: I think this comment is conflating several distinct issues.  In particular, you don&#8217;t distinguish between preparation aimed at &#8220;gaming&#8221; the SAT and similar tests, and preparation that actually makes one a better thinker.</p>\n]]>", "author": "Sniffnoy", "published": "2018-06-21 06:28:47+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>TPWG #130: I don&#8217;t understand your argument. Are you saying that the problem with the German law is that it is incompatible with the constitution of the US? How could that possible be relevant? With problem I mean things like slippery slopes and unintended consequences, like other people in this thread have been bringing up.</p>\n<p>About &#8220;prior restraint&#8221;, the German law does not provide for censorhip. It doesn&#8217;t bar the publication of anything. It punishes the author after publication if a court decides that it was hate speech.</p>\n<p>You have a misconception about the history of Germany. The problem with hate speech in the 30s is not that it was underground. On the contrary, the government was proudly spreading anti-semitic propaganda everywhere. And the Kristallnacht was no secret; even those that didn&#8217;t see it happening with their own eyes read about it in all newspapers.</p>\n<p>To prevent it from happening again is one of the main reasons the current Volksverhetzung law was introduced in the 50s.</p>\n]]>", "author": "Mateus Arajo", "published": "2018-06-21 08:06:18+00:00", "title": "By: Mateus Araújo"}]