[{"content": "So far I haven&#39;t seen any complexity classes named after Jim Simons&#39; children, nor effusive dedications to his brilliance in the introductions of papers written by Simons postdocs. I don&#39;t think its time to worry just yet. ", "author": "Anonymous", "published": "2013-11-19 16:21:54.187000-06:00", "title": ""}, {"content": "We put our dedications to patrons at the end.  They can easily shape research paths.  I am sure there are faculty who chase patrons and shape their research to fit the interests of those patrons (I&#39;m looking at you NSF).", "author": "Anonymous", "published": "2013-11-19 20:38:31.427000-06:00", "title": ""}, {"content": "There are more influential patrons in the field: Google Research, MSR, etc.<br />I view Jim&#39;s support for more fundamental research as a counterbalance for them.", "author": "Anonymous", "published": "2013-11-21 01:38:36.156000-06:00", "title": ""}, {"content": "The universe of &quot;one-percenters&quot; is sufficiently small that paths of inquiry return to the same wealth-nodes again-and-again.  One such path begins on <i>Wired</i>, where arch-1%er <b><a href=\"http://www.wired.com/business/2013/11/bill-gates-wired-essay/all/\" rel=\"nofollow\">Bill Gates lays out his public-private investment strategy</a>,</b> which amounts to &quot;Capitalism generates wealth efficiently, philanthropy deploys wealth effectively, technology creates new forms of wealth and paths to it.&quot;  <br /><br />Gates&#39; worldview is much-discussed on <i>Slashdot</i>, both explicitly in <b><a href=\"http://news.slashdot.org/story/13/11/12/2143244/bill-gatess-plan-to-improve-our-world\" rel=\"nofollow\">Bill Gates&#39;s Plan To Improve Our World</a></b> and (less obviously) the same-day <i>Slashdot</i> story <b><a href=\"http://tech.slashdot.org/story/13/11/13/1754225/121-petaflops-rpeak-supercomputer-created-with-ec2\" rel=\"nofollow\">1.21 PetaFLOPS (RPeak) Supercomputer Created With EC2</a>,</b> which draws upon an <i>Ars Technica</i> story <b><a href=\"http://arstechnica.com/information-technology/2013/11/18-hours-33k-and-156314-cores-amazon-cloud-hpc-hits-a-petaflop/\" rel=\"nofollow\">18 hours, $33K, and 156,314 cores: Amazon cloud HPC hits a “petaflop”</a>.</b><br /><br />The natural question &quot;What mission do these computations serve?&quot; directs our attention to a lucid summary of the strategic thought of one-percenters: the survey in <i>International Journal of Quantum Chemistry</i> by Bochevarov <i>et al.</i> that is titled (boringly) <b><a href=\"http://www.schrodinger.com/downloads/Jaguar_Quantum_Chemistry_2013.pdf\" rel=\"nofollow\">Jaguar: A high-performance quantum chemistry software program with strengths in life and materials sciences</a>.</b>  <br /><br />Jaguar is the flagship quantum simulation program of the corporation Schrödinger LLC, and the Schrödinger/Jaguar techno-narrative reflects Bill Gates&#39;s worldview because the <b><a href=\"http://www.prweb.com/releases/2012/12/prweb10229213.htm\" rel=\"nofollow\">largest single investor in Schrödinger LLC</a></b> is Bill Gates … and because a founding investor in Schrödinger is Gates&#39;s fellow techno-1%er and fan-of-simulation <b><a href=\"http://www.schrodinger.com/newsletter/4/\" rel=\"nofollow\">David E. Shaw</a>.</b>  Thus ends our inquiry-cycle.  <br /><br />Uhhh … but what&#39;s the role of academic research organizations (AROs)?  Are AROs supplanted by contract research organizations (<b><a href=\"http://www.fiercecro.com/\" rel=\"nofollow\">CROs</a></b>)?<br /><br />Soothing answers are provided by Goldenberg <i>et al.</i>, who foresee a future of plain-and-simple ARO/CRO partnerships in their editorial <b><a href=\"http://www.ncbi.nlm.nih.gov/pubmed/21068436\" rel=\"nofollow\">Improving academic leadership and oversight in large industry-sponsored clinical trials: the ARO-CRO model</a></b>, whose concluding conflict-of-interest disclosure is astoundingly long and intricate.  Academics can aspire to become 1%ers too! <br /><br />A deeper-and-broader view of ARO/CRO dynamics is set forth in Mirowski and van Horn&#39;s <b><a href=\"http://www.ncbi.nlm.nih.gov/pubmed/16304738\" rel=\"nofollow\">The contract research organization and the commercialization of scientific research</a>:</b><br /><br />------<br />&quot;Universities have managed to invoke the ideal of open science while proving unable to maintain it in practice.&quot;<br /><br />&quot;Another source for the bias in results is the rarely acknowledged &#39;sweat shop&#39; character of work in CROs.&quot;<br /><br />&quot;The whole question of the role of conflicts of interest in science is fascinating due to its labyrinthine complexity.&quot;<br />------<br /><br /><b>Conclusions</b>  Have fun, read deeply, and think for yourself.  Ongoing accelerating changes offer abundant new opportunities. hopes, and dreams to STEM professionals of all ages … young ones especially.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2013-11-21 08:36:33.538000-06:00", "title": ""}, {"content": "definitely mixed feelings about this! think its tied to <a href=\"http://en.wikipedia.org/wiki/Wealth_inequality_in_the_United_States\" rel=\"nofollow\">wealth inequality</a>... wealth disparity is a measurable statistic and is very high again, at similar levels to era of the old families you name.... a bigger question is, &quot;how should governments fund science&quot;... a question that goes back to its very origins with Babbage, who was funded by the UK govt, and with significant controversy....", "author": "vzn", "published": "2013-11-21 13:01:14.214000-06:00", "title": ""}]