[{"content": "<![CDATA[<p>Very off-topic but I can&#8217;t resist posting it here, regarding recent events in Turkey:</p>\n<p><a href=\"https://twitter.com/kragen/status/754244653621321729\" rel=\"nofollow\">https://twitter.com/kragen/status/754244653621321729</a></p>\n<p>&#8220;as @mmeijeri obliqued, this failed coup is probably the first time in our lives we see a consensus problem among actual Byzantine generals&#8221;.</p>\n]]>", "author": "asdf", "published": "2016-07-18 16:06:58+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>asdf #1: LOL!</p>\n<p>As it happens, I was scheduled to visit Turkey (specifically Istanbul) for the first time this December.  The failed coup happened just a few days after I reassured my mom, with great exasperation in my voice, that Turkey is <i>totally safe</i> to visit (even for someone whose passport is full of Israeli stamps), and she&#8217;s just being paranoid about nothing like usual. 🙂  I guess I should check the state of the Byzantine consensus in a few months before deciding whether to go&#8230;</p>\n]]>", "author": "Scott", "published": "2016-07-18 16:39:23+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Extremely interesting thanks!</p>\n<p>On black holes and computation, two questions:</p>\n<p>1) Is there any work from complexity theory that could shade light on Cauchy horizon?</p>\n<p>2) one harder to state so please forgive the multiple lines question:</p>\n<p>-small enough black holes are conjectured to radiate a lot. Assuming there exists a maximal temperature, then some black holes are just too luminous and nothing can get in. Call m1 the mass of the largest microscopic black hole that nothing can enter in. </p>\n<p>-Given time exponential in the size of a black hole, HH argument don&#8217;t apply. Assuming cosmological horizons limit the computation time to some large but fixed size, then some black holes are too large to escape HH argument. Call m2 the mass the smalest macroscopic black hole that escape HH argument. </p>\n<p>Would you be tempted to bet that m1=m2?</p>\n]]>", "author": "Jay", "published": "2016-07-18 17:07:05+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Prof. Aaronson #2: Are you still undecided? If so you must be quite brave!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Seita:Daniel.html\">Daniel Seita</a>", "published": "2016-07-18 18:01:26+00:00", "title": "By: Daniel Seita"}, {"content": "<![CDATA[<p>Daniel #4: I went to Israel at the height of the Second Intifada, and also as the Iraq War was starting in 2003 and most people assumed (wrongly, as it turned out) that Saddam would attack Israel.  Both visits were great.</p>\n<p>Obviously going to Turkey is very different, but Turkey is also one of the only Middle Eastern countries besides Israel that would even <i>let me in</i>, thereby increasing my desire to visit it.  It does seem likely that political conditions in Turkey will remain such as to make visiting a bad idea, but I still hold out hope&#8230;</p>\n]]>", "author": "Scott", "published": "2016-07-18 19:01:00+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Barbados in February?<br />\nThat&#8217;s where the Quantum money is going!</p>\n]]>", "author": "fred", "published": "2016-07-18 20:14:18+00:00", "title": "By: fred"}]