[{"content": "<![CDATA[<p>&#8230;.one needs to change to the system to make the output more equitable. Other than that US educational system is fine. The admission process is varied depending on the school in many countries where one or two tests decide your fate. I think this variety is good for the nation as a whole. I doubt if academics was the only</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/student:ordinary_University_old.html\">ordinary University old student</a>", "published": "2014-09-16 07:37:10+00:00", "title": "By: ordinary University old student"}, {"content": "<![CDATA[<p>&#8230;.criteria, you would be seeing the potential of humans to capitalize on fundamental research done at various institutions possible. Even the best IITians come to the US and then succeed because there is something that is ingrained in US society that follows through to colleges and flows back to society.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/student:ordinary_University_old.html\">ordinary University old student</a>", "published": "2014-09-16 07:40:50+00:00", "title": "By: ordinary University old student"}, {"content": "<![CDATA[<p>@Scott 130:</p>\n<p>I have never heard of a Krabappel situation occurring in an American school system. If anything, the opposite has been true for some time in which teachers have been forced into impossible situations where they&#8217;ve felt they had to cheat for their students to get the necessary money, e.g. in the Atlanta cheating scandal: <a href=\"http://www.newyorker.com/magazine/2014/07/21/wrong-answer\" rel=\"nofollow\">http://www.newyorker.com/magazine/2014/07/21/wrong-answer</a></p>\n<p>Also, if you were curious about whether the tests (or rather the models associated with the tests) were bad or not, wonder no further: <a href=\"http://mathbabe.org/2012/03/06/the-value-added-teacher-model-sucks/\" rel=\"nofollow\">http://mathbabe.org/2012/03/06/the-value-added-teacher-model-sucks/</a></p>\n]]>", "author": "Jim", "published": "2014-09-16 13:01:40+00:00", "title": "By: Jim"}, {"content": "<![CDATA[<p>Scott wrote<br />\n&#8221; (Having said that, going abroad is certainly another option, and I’ve heard that this Cambridge University is a real up-and-comer on the academic scene. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" /> )&#8221;</p>\n<p>Funny you should say that &#8211; here in  the UK we have some similar problems with Oxford and Cambridge (a disproportionate number of those accepted seem to come from elite private schools) and the remedy often proposed is to apply to an American University.<br />\nThere was a well publicised case a few years ago of a very well qualified (on paper) student who did not get in to Oxford and instead was accepted by&#8230;.. Harvard!</p>\n]]>", "author": "Richard", "published": "2014-09-16 13:12:53+00:00", "title": "By: Richard"}, {"content": "<![CDATA[<p>Question: If a kid is a USAMO participant but otherwise doesn&#8217;t have much going for them (apart from being educated), which are the top institutions that will admit this type of kid, and which ones won&#8217;t?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/w/whiz:Parent_of_young_math.html\">Parent of young math whiz</a>", "published": "2014-09-16 14:26:09+00:00", "title": "By: Parent of young math whiz"}, {"content": "<![CDATA[<p>Ed Witten and I have little in common, but we <i>do</i> have in common an affinity for algebraic dynamics, and spouses who have served on urban school boards</p>\n<p>Over lunch (many years ago), Witten opined that, in his experience, the difficulties of the latter had proved to be considerably greater than the difficulties of the former.   </p>\n<p>The facile-yet-inchoate educational fixes offered by Prof.&nbsp; Pinker (and here on <i>Shtetl Optimized</i> too) are a testimony to this modern-day complexity hierarchy.</p>\n<p>Rather than say more, I&#8217;ll attempt to distill my opinions into an integrated set of essays that plausibly will elicit banishment a few more times from <i>Shtetl Optimized</i> (<b><a href=\"http://blog.computationalcomplexity.org/2013/09/tldr.html?showComment=1379722470142#c3065001714111933253\" rel=\"nofollow\">as has been foretold</a>)</b>.<br />\n<blockquote>Now that is the way to write&nbsp;&mdash; peppery and to the point. Mush-and-milk journalism gives me the fan-tods.</p>\n<p>&nbsp;&nbsp;&mdash; Mark Twain<br />\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp<i>Journalism in Tennessee</i> (1871)</p></blockquote>\n<p>&#8212;&#8212;-</p>\n<p><b>Self-Teaching Exercise for STEM Students</b></p>\n<p>(1)&nbsp;Go to the lobby of any STEM department on your campus.</p>\n<p>(2)&nbsp;Find a plaque documenting year-by-year awards to &#8220;The&nbsp;students most promising of an outstanding career in academic research&#8221; (or any other anticipated outcome)</p>\n<p>(3)&nbsp;Research the subsequent publication history of those students.</p>\n<p>(4)&nbsp;Assess the predictive capacity of University Admissions-and-Awards committees.</p>\n<p>(5)&nbsp;Discuss Ed Witten&#8217;s career trajectory in light of these findings.</p>\n<p><b>Note</b>&nbsp; This exercise can be illuminating for  STEM faculty too.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-09-16 15:44:01+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<blockquote><p><b>Noah</b> asks &#8220;I don’t really understand why none of the elite colleges took the opportunity to grow as the number of applicants grew enormously.&#8221;</p></blockquote>\n<p>It is a pleasure to suggest a student assignment that answers to your question, Noah.</p>\n<p><b>Exercise</b>&nbsp; Verify that there is a sharp &#8220;knee&#8221; in the curve of reputation-versus-endowment that is located (approximately) at $250,000 per student.</p>\n<p><b>Example</b>&nbsp; Cornell University, for example, is located precisely at this knee; hence struggles to be recognized as a top-rank school).</p>\n<p><b>Assignment</b>&nbsp; Critique the following assessment:</p>\n<p>• It&#8217;s economically difficult for low-ranking universities to <i>approach</i> the endowment-knee; hence elite universities are not born.</p>\n<p>• Universities above-the-knee are governed as corporations&nbsp;&mdash; literally, the Harvard Corporation, the Princeton Corporation, the Stanford Corporation, the MIT corporation, <i>etc.</i>s&nbsp;&mdash; these corporate boards elect not to grow for the same reason that MicroSoft Corporation elects to sit quiescently upon nearly one hundred billion dollars in cash.</p>\n<p>Thank your for your fine question, Noah!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-09-16 16:30:05+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>ordinary University old student #132-134:</p>\n<p>1. America is not &#8220;doing good&#8221;. Compare measurable math and science ratings of American students with students of other countries, compare crime and incarceration rates, etc. Here is a glimpse into what Times Magazine editors think of average Americans&#8217; abilities to discuss serious issues, as compared to the rest of the World:</p>\n<p><a href=\"https://www.google.com/search?q=time+magazine+covers+different+in+us&#038;biw=1295&#038;bih=549&#038;tbm=isch&#038;tbo=u&#038;source=univ&#038;sa=X&#038;ei=QF4YVJ7lFMijyATN1oDoBQ&#038;sqi=2&#038;ved=0CB0QsAQ\" rel=\"nofollow\">https://www.google.com/search?q=time+magazine+covers+different+in+us&#038;biw=1295&#038;bih=549&#038;tbm=isch&#038;tbo=u&#038;source=univ&#038;sa=X&#038;ei=QF4YVJ7lFMijyATN1oDoBQ&#038;sqi=2&#038;ved=0CB0QsAQ</a></p>\n<p>2. Educational system if very far from fine, at least on high school level, as compared to other developped countries. IMHO a big part of the problem is precisely the desire to have the impression of equality by setting academics bar very low to erase the distinction between mediocre and exceptional. Here&#8217;s an example of such practices outside academia:</p>\n<p><a href=\"http://usnews.nbcnews.com/_news/2012/02/09/10362607-white-firefighters-awarded-25-million-in-discrimination-case\" rel=\"nofollow\">http://usnews.nbcnews.com/_news/2012/02/09/10362607-white-firefighters-awarded-25-million-in-discrimination-case</a></p>\n<p>3. Criteria for choosing university students based on things unrelated to their academic abilities is like choosing football players based on criteria unrelated to their physical abilities in my post above. Dismissing the candidates&#8217; ability to do what they are going to be expected to do as the measure of their expected success is silly at best.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/P:Michael.html\">Michael P</a>", "published": "2014-09-16 16:36:18+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>Dear &#8220;ordinary University old student&#8221;, several Indian PhDs (and others) do quite well in the industrial/academic system in the US and elsewhere, whether they are from the IITs or not. (I speak as a US professor of (theoretical) computer science, who got my undergrad degree at an IIT.) I can understand your feeling of isolation, but the ground truth is that motivation counts at least as much as one&#8217;s undergrad background &#8212; and you likely have significant motivation, depending on the choices you have made. I wish you the best; please email me if you want to discuss further.</p>\n]]>", "author": "aravind", "published": "2014-09-16 19:13:26+00:00", "title": "By: aravind"}, {"content": "<![CDATA[<p>I&#8217;m really shocked by the story of Jon&#8217;s kid (and also Scott&#8217;s personal experience). I had thought that schools like Berkeley and (especially!) Caltech were still open to high achievers who had not necessarily bothered to check-off all the &#8220;well-roundedness&#8221; boxes.</p>\n<p>Here at UCSB we do have an option for these kids: the College of Creative Studies (CCS), which runs high-level undergrad programs in Art, Biology, Chemistry, Computer Science, Literature, Math, Music, and Physics. I&#8217;m familiar with how the Physics program works, and I know that admissions are handled by physics faculty who are thrilled to find prodigies! Furthermore, in CCS, students construct their own programs of study (in close consultation with faculty advisors) and have no specific general-education requirements. </p>\n<p>I guess I had always just assumed that every high-level college had an equivalent mechanism. Very sad to learn that it&#8217;s not so.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Srednicki:Mark.html\">Mark Srednicki</a>", "published": "2014-09-16 19:15:03+00:00", "title": "By: Mark Srednicki"}, {"content": "<![CDATA[<p>I think we are creating a false dichotomy in the analysis. SAT versus current admissions committees.</p>\n<p>I think the key problem in the current process is the Admissions Office. I can live with a system that has a low emphasis on standardized tests but instead gives the relevant Professors more discretion. </p>\n<p>e.g. Let the Physics Prof select the Physics majors. They can always select a  student with a crappy SAT score just because he  shows some other promise (maybe he helped rebuild his college physics lab!) A stellar community volunteering experience might count for Psych admissions but hardly relevant to math. </p>\n<p>Conversely someone may have fantastic SAT scores but show just so much abject lack of horse sense that an Engineering Professor might think of him as not a good candidate.</p>\n<p>My point is that the current admissions committee is selecting on attributes that don&#8217;t matter much. They don&#8217;t have much of a clue as to what works and what doesn&#8217;t. </p>\n<p>OTOH, the big practical problem is that American admissions aren&#8217;t tied to a major at the time they enter. That makes my prescription impossible to implement. Maybe this itself is a fatal error. To think that you can admit a &#8220;good&#8221; student and reject a &#8220;bad&#8221; one with no reference at all to what he intends to major in. There&#8217;s no such thing as a generically good or bad admit; it all depends on for what major.</p>\n]]>", "author": "Rahul", "published": "2014-09-17 06:05:33+00:00", "title": "By: Rahul"}]