[{"content": "<![CDATA[<p>Scott, </p>\n<p>you deserve a ton of credit for warning us all to not be complacent and trying to make a practical difference prior to the election with your vote-swapping initiative.</p>\n<p>I hope that you will soon be able to focus your mind again on your brilliant research while trying to deal (or not) with all this mess.</p>\n<p>As Prince said:</p>\n<p>Whatever you play, it&#8217;s okay to lose<br />\nOoh sometimes (sometimes&#8230;)<br />\nAs long as you learn from every game you choose<br />\nIf one thing is sure, you&#8217;ll always endure<br />\nIf you try your best at everything you do<br />\nSay what you mean and mean what you say<br />\nThe price for a broken heart&#8217;s too much to pay<br />\nAnd nothing is worth it, if you don&#8217;t have to try<br />\nThe higher the stakes, the higher the sky.</p>\n]]>", "author": "fred", "published": "2016-11-15 20:03:03+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Michael P.,  obviously I strongly disagree with all your seven points,  which consist of a familiar combination of  flawed logic, untruths, and nonsense.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2016-11-15 20:32:52+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Gil Kalai, I am especially delighted that you strongly disagreed with my 7th point as well. 🙂</p>\n<p>Would it be possible for you to address explicitly, oh, I don&#8217;t even know where to start, any of her alleged transgressions that were broadcast during and before the campaign, any of them, of your choosing?</p>\n]]>", "author": "Michael P", "published": "2016-11-15 22:21:50+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>Michael P. &#8211; I can&#8217;t speak for Gil, but I&#8217;d say something like:<br />\n1. I give her major honesty points for this comment, actually. Everyone acts slightly different in public and private, and she was just admitting to that. She doesn&#8217;t seem less honest than other politicians (or non-politicians) in general &#8211; the reverse, actually, if you look at her positions and actions.<br />\n2. Her &#8220;mistakes&#8221; are departing from theoretical protocol in the same way everyone else does, but then getting attacked over it by Fox News until it starts looking abnormal.<br />\n3. Harder to speak on this one &#8211; she seemed tactically competent and on the ball in the state department, but you may very reasonably disagree with her strategic decisions.<br />\n4. She was offering to continue the progress we&#8217;ve been making, which is pretty damn good &#8211; for example, 2015 had an unprecedented growth in income for the lower income percentiles.<br />\n5. She did not &#8220;cheat&#8221;. She won three million votes more than her opponent. That people who had personally worked with them both almost unanimously preferred her is a point in her favour, not the opposite.<br />\n6. Don&#8217;t know as much about the details of this, but considering how many accusations at her (e.g. Benghazi, the emails, the Clinton foundation&#8230;) turned out to be unfounded on investigation, I&#8217;m inclined not too take this too seriously.<br />\n7. etc&#8230; most of the things you don&#8217;t mention are points in her favour. From the inside view, she has a long history of working with people and getting good things done. From the outside view, note that the people who approve of her most are the people who&#8217;ve actually worked with her.</p>\n]]>", "author": "pku", "published": "2016-11-15 22:54:58+00:00", "title": "By: pku"}, {"content": "<![CDATA[<p>Raoul Ohio #175 and #178:</p>\n<blockquote><p>\nAppointing White Power nut Steve Bannon to a position of power appears to be too much for the fraction of Conservatives who are actually conservatives as opposed to wind bag hypocrites. This raises the possibility of Progressive + Conservative resistance to Trump.</p>\n<p>In considering doomsday aspects of Trump winning the other day, I could not see any way for democracy to survive. I had not realized that lots of Conservatives are also appalled at Trump.</p></blockquote>\n<p>One must be careful here.  Lots of conservatives are appalled at Trump, of course &#8212; but the Republicans in actual government positions have basically just rolled over for him (largely, it seems, for fear of being voted out).  Absolutely such a coalition must be put together &#8212; but don&#8217;t imagine that Republicans in Congress will be leaping to join it unless said coalition can put substantial pressure on them first.</p>\n<blockquote><p>You are not the first to observe problems with democracy. But, what are the alternatives?</p></blockquote>\n<p>Well, there&#8217;s futarchy, for one&#8230; 🙂</p>\n<blockquote><p>A famous quote goes something like “The only good thing about democracy is that it is better than everything else”. Who wrote that? What is the correct wording? If John Sidles is not hiding on an island in the middle of nowhere, surely he knows.</p></blockquote>\n<p>You&#8217;re thinking of <a href=\"https://en.wikiquote.org/wiki/Winston_Churchill#Post-war_years_.281945.E2.80.931955.29\" rel=\"nofollow\">Winston Churchill</a>.</p>\n]]>", "author": "Sniffnoy", "published": "2016-11-15 23:13:02+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>@Gil >> Hillary Clinton was a remarkable candidate</p>\n<p>Yes, quite remarkable how she got from being &#8220;flat out broke&#8221; to 300 million$ by helping the poor.   (You can read wikileaks to get an idea how they did it.)</p>\n]]>", "author": "wolfgang", "published": "2016-11-16 00:08:03+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Futarchy &#8211; is that rule by anime hermaphrodites?</p>\n<p>Sorry. Sometimes you have to laugh, to keep from crying.</p>\n<p>The actual idea of futarchy seems like it would break down just as soon as a prediction market is obviously wrong, where &#8220;wrong&#8221; means either &#8220;predicting something that doesn&#8217;t happen&#8221; or &#8220;going against what the elected officials would much rather do.&#8221;</p>\n]]>", "author": "BBA", "published": "2016-11-16 00:31:33+00:00", "title": "By: BBA"}, {"content": "<![CDATA[<p>&#8220;Never, never, never normalize this&#8221; sounds like what so many people were saying for so many years about same-sex relationships, doesn&#8217;t it.</p>\n]]>", "author": "Sam", "published": "2016-11-16 01:11:42+00:00", "title": "By: Sam"}, {"content": "<![CDATA[<p>Sam #215: And they were wrong to say that, because unlike President Trump, gay people doing their thing don&#8217;t bother anyone else (as even much of the Right now seems to agree&#8230;)</p>\n]]>", "author": "Scott", "published": "2016-11-16 01:25:58+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott# 156- I don&#8217;t think anyone&#8217;s disputing that Sabrina Erdley and Amanda Marcotte did everything in their power to set the discussion of the relevant issues back a century. But IF Mattress Girl was telling the truth about what happened to her, weren&#8217;t her actions more or less justified?</p>\n]]>", "author": "Michael", "published": "2016-11-16 02:22:22+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Maybe this is how it happened:</p>\n<p><a href=\"https://www.wired.com/2016/11/facebook-won-trump-election-not-just-fake-news/\" rel=\"nofollow\">https://www.wired.com/2016/11/facebook-won-trump-election-not-just-fake-news/</a></p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-16 05:27:19+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Follow up to previous remark:</p>\n<p>All the online aspects of Trumps win are unprecedented. </p>\n<p>And, the next election will probably have some even more bizarre turning points that have not even been guessed at yet. </p>\n<p>Not looking so good for democracy and civilization.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-11-16 05:30:09+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>I agree he&#8217;ll be a bad president (worse than W, *especially* in foreign policy) but last president seems&#8230;a bit much? </p>\n<p>There&#8217;s a non-trivial chance that that happens now yes and the guy is petty and vengeful but as far as I can tell, he has no plan or desire to even govern much, let alone, try and plan for a permanent takeover&#8230;Maybe a future, more cunning and ambitious demagogue will succeed in doing that now that so many of the norms have been exposed as powerless but at least with Trump, imo, America got lucky in that he&#8217;s not such a person (ofc he prolly has a higher chance of accidentally trigger nuclear war so there&#8217;s that too).</p>\n]]>", "author": "dhaus", "published": "2016-11-16 06:25:55+00:00", "title": "By: dhaus"}, {"content": "<![CDATA[<p>Esso #200,</p>\n<p>Actually many people in developed countries would be better off with more immigration from poorer countries, and most economists would assert that the gains exceed the losses for the country as a whole. </p>\n<p>If there is cheap labor in the restaurant industry for example, Americans who were planning on a career as a waitress or chef will lose out, but restaurant owners and consumers can all benefit from higher profits or lower prices.  Really, it is no different from the invention of some labor-saving device in the restaurant industry. Would we be richer if we banned restaurants from using modern kitchen equipment?</p>\n<p>There is the cultural effect of immigration, of course, which economists are not very good at modelling. But America has traditionally been good at assimilating immigrants. Basically, they keep their religion, which makes them feel like they have preserved their identity, but in all other ways previous waves of immigrants have assimilated.</p>\n]]>", "author": "Jr", "published": "2016-11-16 10:03:15+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p><a href=\"https://warisboring.com/hillary-clinton-was-a-war-policy-menace-donald-trump-could-be-a-disaster-66aeb4e7fea5?source=rss----2ce4bbcf83bb---4&#038;gi=7a2fd12b1962\" rel=\"nofollow\">https://warisboring.com/hillary-clinton-was-a-war-policy-menace-donald-trump-could-be-a-disaster-66aeb4e7fea5?source=rss&#8212;-2ce4bbcf83bb&#8212;4&#038;gi=7a2fd12b1962</a></p>\n]]>", "author": "fred", "published": "2016-11-16 13:55:49+00:00", "title": "By: fred"}]