[{"content": "<![CDATA[<p>Great post. I too find these technological disaster analyses fascinating. I am a big fan of those airplane disaster tv shows. My wife doesn&#8217;t get it and can&#8217;t watch as it reminds her of vulnerabilities while flying. Instead, I find them mildly reassuring in that they end with a mention of how they&#8217;ve fixed things so the particular accident won&#8217;t happen again.  However, the real attraction of these shows is the real-life detective stories. Perhaps they should start another series to expand beyond just airplane crashes. There have been a few special shows to treat one-off disasters but I&#8217;m sure there are more accidents they could cover, such as the recent one you mention here.</p>\n]]>", "author": "Paul Topping", "published": "2018-10-20 16:47:56+00:00", "title": "By: Paul Topping"}, {"content": "<![CDATA[<p>Fantastic post… when that story originally broke I couldn’t understand why it wasn’t getting more widespread coverage, and went days with only vague explanation. I imagined that either press outlets had agreed to keep it a tad hush-hush so as not to panic millions of people on natural gas, or else it was a case of some distracting Trumpism focus at the time (I don’t remember) sucking all the news oxygen out of the air for other stories!<br />\n“Hubris” is a good word, though the word that quickly came to my mind, that scientists dread, was simply “Ooops.” And as far as driverless cars go, I think we’ll eventually get there… but the road to success will be littered with tragedies and interruptions&#8230; and a lot of &#8220;ooops.&#8221;</p>\n]]>", "author": "Shecky R", "published": "2018-10-20 18:21:59+00:00", "title": "By: Shecky R"}, {"content": "<![CDATA[<p>The Chemical Safety Board produces some pretty fascinating videos that reconstruct the chains of events that led to large industrial accidents in chemical plants. The videos normally conclude with recommendations for voluntary actions industry can take to prevent similar incidents in future. They basically summarize the results of detailed investigations by CSB agents. The videos are well produced and, apart from those accidents that involve injury or death, they are quite entertaining if you happen to be in a forensic frame of mind. Here’s an example of one of their videos: <a href=\"https://youtu.be/_icf-5uoZbc\" rel=\"nofollow\">https://youtu.be/_icf-5uoZbc</a></p>\n]]>", "author": "Taliesin Beynon", "published": "2018-10-20 22:29:49+00:00", "title": "By: Taliesin Beynon"}, {"content": "<![CDATA[<p>The reason contractors, rather than regular employees, were upgrading the lines is that Columbia Gas and parent National Grid have locked out 1,250 union workers after negotiations failed. It cannot be proved that experienced workers would have been able to avoid either this disaster or a <em>similar issue in Woburn, MA a week later</em>, but it is rather suggestive that both repairs were done by temporary workers hired during the dispute. See <a href=\"https://www.bostonglobe.com/business/2018/09/18/gas-explosions-put-spotlight-national-grid-lockout-safety/IKss8xvPcB6Rgfkxg0z4AN/story.html\" rel=\"nofollow\"> Boston Globe</a>  and <a href=\"https://www.usnews.com/news/best-states/massachusetts/articles/2018-10-08/natural-gas-utility-makes-headway-pipeline-replacement-plan\" rel=\"nofollow\">US News </a>. That said, the basic design of the system is flawed. There are breakers, fuses and overvoltage protectors on electrical distribution system and at the entrance panel; there should be similar protection for gas distribution.</p>\n]]>", "author": "DrMPippik", "published": "2018-10-21 02:21:14+00:00", "title": "By: DrMPippik"}, {"content": "<![CDATA[<p>Super interesting read, thank you for this!</p>\n]]>", "author": "Andrew Koines", "published": "2018-10-21 06:06:44+00:00", "title": "By: Andrew Koines"}, {"content": "<![CDATA[<p>Please correct me if I&#8217;m wrong, but I don&#8217;t believe that Columbia Gas is owned by National Grid; it is listed as a subsidiary of NiSource, which as far as I know has no ownership connection with NG. (National Grid <em>does</em> supply electricity in Lawrence and the Andovers, but not gas.) Columbia was formerly the Bay State Gas Company. See <a href=\"http://www.fundinguniverse.com/company-histories/bay-state-gas-company-history/\" rel=\"nofollow\">history</a> and <a href=\"https://www.nisource.com/customers/where-we-serve\" rel=\"nofollow\">map</a> of service areas. </p>\n<p>The locked out NG employees have just been cleared by their unions and others to do temporary work restoring service in the Merrimack Valley. (See <a href=\"https://www.masslive.com/news/boston/index.ssf/2018/10/locked_out_national_grid_worke.html\" rel=\"nofollow\">MassLive story</a>.)</p>\n<p>The situation in Woburn is different: That is indeed NG territory, and at the time of the incident the work was being done by nonunion replacements and management employees.</p>\n<p>I don&#8217;t know whether the use of contractors might have contributed to the problems in South Lawrence, nor do I know whether there are any labor-management disputes going on there. Maybe the full NTSB report will address the question.</p>\n<p>As for the differences between electrical and gas systems, I agree. One reason for those differences is that the electrical grid operates on a millisecond time scale; when there&#8217;s a fault, there&#8217;s just no time to call a supervisor. The protective systems are automated by necessity. Gas moves much slower, which seems to have led to the belief that you could afford to wait for human intervention. Recent events suggest otherwise.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2018-10-21 12:11:04+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>I note that there is further lively discussion of all this on <a href=\"https://news.ycombinator.com/item?id=18265591\" rel=\"nofollow\">Hacker News</a>.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2018-10-21 14:58:28+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>I’m interested to know I’m not the only person who reads NTSB reports. I have a file drawer full of old paper reports as well as a trove of PDFs. This disaster was preventable like all disasters.  We need to learn these lessons that we keep forgetting.</p>\n]]>", "author": "Nick", "published": "2018-10-21 15:25:19+00:00", "title": "By: Nick"}, {"content": "<![CDATA[<p>People like to call this &#8220;a technological disaster&#8221;, like they like to call hurricane Katrina &#8220;a natural disaster&#8221;. But especially in the US, infrastructure is often at shocking maintenance levels, warnings are ignored for half a century, and then when disaster strikes, you need to blame the actual cause - not technology or nature, but governance. </p>\n<p>(I&#8217;m from a country where pretty much all energy is gas based, most of the country is below sea level and strong storms regularly happen, and guess what? The choice was made to put governance and money towards the problem and nothing bad happens).</p>\n]]>", "author": "Case", "published": "2018-10-21 19:29:42+00:00", "title": "By: Case"}, {"content": "<![CDATA[<p>Thanks! This was really well written.</p>\n<p>Your anecdotes remind me of the Russian officer Petrov who ignored the missle alarm and effectively avoided a nuclear war with US. I think Hannah Fry talks about it in her book.</p>\n]]>", "author": "Sid", "published": "2018-10-22 02:44:50+00:00", "title": "By: Sid"}, {"content": "<![CDATA[<p>I would caution against this hubris. I was at one of the two projects on which a flaw in the design and construction of a type of structural steel connection (the “moment frame”) was discovered as a consequence of the 1995 Northridge earthquake. The structural engineering firm that had designed the structure gave a tour of the damaged connections to a group of Japanese structural engineers, who walked and looked and said (quite literally and obviously) “tsk tsk tsk.” They said that such a problem could never happen in Japan where design standards are superior and construction and inspection are at a much higher standard. Almost precisely one year later, the Kobe earthquake, of the same magnitude as the Northridge temblor, provided a tragic demonstration that the Japanese design and construction methods were not so superior after all.</p>\n]]>", "author": "Rob Ryan", "published": "2018-10-22 03:12:30+00:00", "title": "By: Rob Ryan"}, {"content": "<![CDATA[<p>Correction: that should be the 1994 Northridge earthquake.</p>\n]]>", "author": "Rob Ryan", "published": "2018-10-22 03:17:08+00:00", "title": "By: Rob Ryan"}, {"content": "<![CDATA[<p>&#8220;Control theory and control engineering are now embarking on their greatest adventure ever: the design of self-driving cars and trucks. Next year we may see the first models without a steering wheel or a brake pedal—there goes the option of asking the driver (passenger?) to take over. I am rooting for this bold undertaking to succeed. I am also reminded of a term that turns up frequently in discussions of Athenian tragedy: hubris.&#8221;</p>\n<p>But there is one difference. We are quite used to the cynical fact that human driven cars kill thousands of people every year without complaining too much about it. While no one is used to a similar fact in any other industrial infrastructure. Thus, computer drivers have to compete on that level. If automated cars will kill LESS people than human driven ones, it will already regarded as a success, even if some mayhem surely is bound to happen with automated cars, too. It seems that this is a very special case of risk assessment, possibly tracing back even to pre-car times, since horses were not that safe all the time either and there was historically always a risk of fatal accident associated with travelling.</p>\n]]>", "author": "Wolfgang", "published": "2018-10-23 11:38:16+00:00", "title": "By: Wolfgang"}, {"content": "<![CDATA[<p>Regarding TMI&#8230;a couple clarifications. It is a Pressurized Water Reactor, meaning the core is always supposed to be covered with water. There is a device called the pressurizer which has a steam bubble in it that maintains the pressure in the system. (Upwards of 2000psi). The problem was the level transmitter in the pressurizer, operators turned off the safety injection system as they thought the pressurizer was going to become full which could result in over pressurizing the reactor coolant system. The opposite happened&#8230;pressurizer emptied, transferring the steam bubble to the reactor. Operators then realized the pressurizer went low and turned on the safety injection system. Unfortunately as the reactor got uncovered due to steam decay heat created more steam forcing more water out of the reactor. Pressurizer level rose (due to water displaced from reactor being forced into it) operators turned off safety injection again thinking they had recovered not realizing the reactor core was uncovered.</p>\n]]>", "author": "born01930", "published": "2018-10-23 12:51:46+00:00", "title": "By: born01930"}]