[{"content": "<![CDATA[<p>My reader (igHome.com) doesn&#8217;t get the RSS feed anymore. I&#8217;ve tried to set it up again, but no use, it displays nothing. This made me suspicious enough to visit the site, but who knows how many people see no new feed with other readers and will never ever visit this site again for losing the feed!</p>\n]]>", "author": "Domotor Palvolgyi", "published": "2017-12-14 05:08:54+00:00", "title": "By: Domotor Palvolgyi"}, {"content": "<![CDATA[<p>Domotor #8: I see; thanks for bringing the problem to my attention.  I confess that I haven&#8217;t even <i>thought about</i> this blog&#8217;s RSS feed for a decade.  So, quick followup questions, for you and anyone else who mainly uses RSS:</p>\n<p>&#8211; Anyone else having this problem?</p>\n<p>&#8211; What URL do you use to access the RSS feed?  I just tried <a href=\"https://www.scottaaronson.com/blog/?feed=rss2\">https://www.scottaaronson.com/blog/?feed=rss2</a>, and it seemed to work fine.</p>\n<p>&#8211; Anyone have any ideas how to start to begin troubleshooting this?  (Is the issue essentially that, after the blog was down for a day, some RSS readers just decide that the blog is gone for good, and refuse to reconnect even after it&#8217;s back up?)</p>\n]]>", "author": "Scott", "published": "2017-12-14 06:28:36+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>rss works for me.</p>\n]]>", "author": "Douglas Knight", "published": "2017-12-14 07:03:18+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Hey Scott, so off topic, but what do you think of the quantum computing work being done at IBM and some of the latest articles that have been written about it?</p>\n]]>", "author": "Chris", "published": "2017-12-14 14:11:24+00:00", "title": "By: Chris"}, {"content": "<![CDATA[<p>Chris #11: It&#8217;s already come up in the comments of recent posts.  I think IBM and Google are the two leaders right now in integrating large numbers of high-quality superconducting qubits.  I&#8217;ve had the opportunity to visit IBM&#8217;s Yorktown Heights QC folks many times, most recently this summer&#8212;it&#8217;s a fantastic group.  IBM seems poised to demonstrate quantum supremacy with about 50 qubits in the near future, and I wish them success in that endeavor.</p>\n<p>Having said all that, I wasn&#8217;t thrilled that IBM appears to have rushed out an announcement about having a 50-qubit device with no accompanying paper or technical details&#8212;seemingly in a bid to upstage Google.  In this business, everything comes down to details: what can you demonstrate about the fidelity of your qubits?  What can you do with the qubits, and what evidence do you have that it&#8217;s hard to simulate classically?  Expecting scientists to react to a press release, and popular articles based off the press release, is the way of D-Wave.  IBM is better than that.</p>\n<p>From what I can gather, there seems to be a superb QC research effort that continues apace at IBM, but then <i>also</i> a premature push from above to monetize and hype-ify that effort.  So, here&#8217;s hoping that the scientists and engineers at IBM get the time they need to do their work.</p>\n]]>", "author": "Scott", "published": "2017-12-14 15:03:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Thanks Scott, appreciate the response, and sorry if I missed that it was mentioned somewhere else. Yeah, I think many engineers at IBM feel that exact same way.</p>\n<p>On a side question in regards to research, I was wondering if you&#8217;ve ever looked into Quantum Information Retrieval, and what&#8217;s been done in applying Quantum Theory to Information Retrieval? If you have, I&#8217;m wondering if you have any specific recommendations for areas of study or investigation? I currently work in industry in Information Retrieval, but preparing to go back to grad studies in a phd program and hoping to focus on Theoretical Information Retrieval and thinking a lot about what specific topic of research I&#8217;d like to focus on. I&#8217;ve been reading a number of the early papers and books to get an introduction to Quantum Information Retrieval and find it fascinating how well it seems to work as a theoretical model for understanding IR.</p>\n<p>Sorry, I&#8217;m sure you get comments/questions like this all the time so no worries if you don&#8217;t have time to respond&#8230; thanks&#8230;</p>\n]]>", "author": "Chris", "published": "2017-12-14 15:21:33+00:00", "title": "By: Chris"}, {"content": "<![CDATA[<p>FWIW, <a href=\"https://www.scottaaronson.com/blog/?feed=rss2\" rel=\"nofollow\">https://www.scottaaronson.com/blog/?feed=rss2</a> doesn&#8217;t work on my ighome.com, either. Shows a blank tile. Must be some ighome peculiarity.</p>\n]]>", "author": "Shmi", "published": "2017-12-15 05:18:08+00:00", "title": "By: Shmi"}, {"content": "<![CDATA[<p>Yeah, I also use <a href=\"https://www.scottaaronson.com/blog/?feed=rss2\" rel=\"nofollow\">https://www.scottaaronson.com/blog/?feed=rss2</a> on ighome.com. I wonder why they are not compatible, all other feeds work fine.</p>\n]]>", "author": "Domotor Palvolgyi", "published": "2017-12-15 08:55:44+00:00", "title": "By: Domotor Palvolgyi"}, {"content": "<![CDATA[<p>Chris #13: There are many lines of research that could plausibly be described as &#8220;quantum information retrieval.&#8221;  Maybe the first thing that springs to mind is the work on <a href=\"https://arxiv.org/abs/0708.2992\" rel=\"nofollow\">quantum private queries</a> by Giovannetti, Lloyd, and Maccone.  If you pointed me to a specific problem or direction that interested you, I might be able to help you more.</p>\n]]>", "author": "Scott", "published": "2017-12-16 06:36:36+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>An alternative to RSS feeds is to use MailChimp, which is what we use at the Berkeley AI Research blog. People sign up with their email and get emails when we get new posts.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Seita:Daniel.html\">Daniel Seita</a>", "published": "2017-12-16 22:13:13+00:00", "title": "By: Daniel Seita"}]