[{"content": "<![CDATA[<p>I must be missing something, because the problem seems simpler.  Isn&#8217;t the falsification claim a form of question begging? </p>\n<p>Aren&#8217;t they doing something a little like:</p>\n<p>Simulation Hypothesis: the perceived laws of physics might be part of a simulation, governing virtual objects and without necessary causal relationships to real physics.</p>\n<p>Skepticism-skeptic: but the simulation&#8217;s laws of physics would never allow that!</p>\n]]>", "author": "Yan", "published": "2017-10-05 18:55:27+00:00", "title": "By: Yan"}, {"content": "<![CDATA[<p>This particular simulation hypothesis should be called &#8216;accurate simulation hypothesis&#8217;. </p>\n<p>I am proposing alternate simulation hypothesis. We may be living in simulated reality R1 that is attempt to simulate underlying fundamental reality R0 but that simulation many not be accurate. Some of our physical laws may be simulation artifacts or even optimization shortcuts.  The question is, can we differentiate between artifacts and  the intended laws of physics and discover true physical laws of R0?</p>\n]]>", "author": "Honest Annie", "published": "2017-10-05 19:00:18+00:00", "title": "By: Honest Annie"}, {"content": "<![CDATA[<p>Scott, thank you for being a true scientist/logician. </p>\n<p>I know you aren&#8217;t a big fan of classically-computed simulation theories, so I appreciate that when misinformed popular press articles try to close the door on these theories, you point out their flawed reasoning.  Your defense seems almost ironic, but since you&#8217;re a man of truth and reason, I guess it makes perfect sense after all.</p>\n<p>Viva la &#8220;Digital Physics&#8221; (the movie and the theories) ! 🙂</p>\n<p>Questions: Do you think any continuous or infinite processes are observable in our universe? Do you think any continuous or infinite processes exist in our universe? Do you think the amount of information needed to describe the history of our universe is finite? Is it important to consider historical quantum entanglement if it has already &#8220;collapsed&#8221;? Thoughts on retro-causality? Thoughts on a block universe?</p>\n]]>", "author": "Jon K.", "published": "2017-10-05 19:23:31+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>Craig #36: Yes, of course I&#8217;ve seen it, and I believe we&#8217;ve even discussed it previously on this blog.  It&#8217;s a really nice result, and I&#8217;m thrilled they did it.</p>\n<p>But it&#8217;s important to understand that, far from overturning standard wisdom about BosonSampling or whatever, it <i>confirms a conjecture</i> that Alex Arkhipov and I made since 2013 or so: namely, that the complexity of BosonSampling should increase exponentially, but &#8220;only&#8221; with the number n of photons, and not also with the number m of optical modes.  We knew that that was true, at any rate, in the Haar-random case under probabilistic assumptions (because of rejection sampling), so that any counterexample would have to be really weird.  The new work shows that it&#8217;s true in the general case under no assumptions.</p>\n<p>Many of our experimental friends kept optimistically thinking that they could get more computational hardness merely by upping the number of modes, without having to deal with more photons simultaneously.  So in conversations with them, we kept having to push back on that, and saying, &#8220;no, we have no evidence whatsoever that that&#8217;s true, even though we lack a rigorous proof that it&#8217;s <i>not</i> true.  So please continue to concentrate on getting more photons!&#8221;</p>\n<p>It&#8217;s nice to now have a rigorous proof to back us up. 🙂</p>\n]]>", "author": "Scott", "published": "2017-10-06 01:17:24+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Honest Annie, when you try to make a simulation hypothesis scientific, you will inadvertently have to invent a plausible multiverse hypothesis of the type where our universe is a kind of a subspace of a larger space though that&#8217;s still a speculative concept. IOW, the complexity would be decreased to exclude a Boltzmann-brain like posit. In its place, we would have to posit an evolutionary mechanism, which we might call &#8220;multiversal evolution&#8221;. I liken that scenario to a Virtual Machine. Virtual Machines are likely to evolve in an open-ended physical system with rich dynamics, because they will have self-consistent rules that preserve their bubbles, it turns out that is not a hypothesis that assumes itself, the general hypothesis is called &#8220;self organization&#8221; by some authors, though there are many names for it in the literature across several fields. Note that there is no generally agreed theory of multiverse in physics, some physicists would point to MWI, some others would talk about each universe having its own set of laws, and some would say they exist in a different temporal direction, and/or distant region of cosmos. Interestingly, this theory was pondered in the great science fiction classic Star Maker (which had an unnecessary theological bent), but the basic idea was that our universe evolved from lower dimensional manifolds. A hypothesis to ponder? Surely, computability was inherent to the very first manifold whatever it was, but it is entirely plausible that there are regions of the cosmos with different physical regimes. What&#8217;s more important is that any such scenario is much more plausible than an intelligent designer, which is shaven by Occam&#8217;s razor. Could it still be true? Sure, but you&#8217;d have to show some strong evidence for it, such evidence doesn&#8217;t exist, though I&#8217;d say that we have almost strong evidence for a (quantum) computable universe. That would be computational physics, not theology.</p>\n<p>I have an answer to your question, though, I think that with enough data we would be able to ascertain the laws of the root manifold (the very first quantum vacuum, or whatever that is).  That question is equivalent to asking whether a theory of everything is possible. &#8220;I can&#8217;t see strings, can I still find the correct theory of strings, or disprove them?&#8221;. It&#8217;s the very same question. There is nothing fundamental in the science of epistemology (AI) that tells us we cannot infer the hardest and most complete theory in science. No foundational barrier. We should be able to find it.</p>\n]]>", "author": "Eray zkural", "published": "2017-10-06 01:28:25+00:00", "title": "By: Eray Özkural"}, {"content": "<![CDATA[<p>Eray #40, and Annie: Apologies, but this is getting too close to &#8220;general philosophizing about the simulation hypothesis, which could&#8217;ve just as well gone in <i>any</i> post on the topic rather than this one.&#8221;  So if you want to continue in this vein, please do so elsewhere (I&#8217;m fine for you to post a link).</p>\n]]>", "author": "Scott", "published": "2017-10-06 01:38:08+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Just for the record, I did no philosophizing in my unpublished post.  I gave a compliment, made a little movie plug, and asked a few interesting questions. Oh well&#8230;</p>\n]]>", "author": "Jon K.", "published": "2017-10-06 03:49:14+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>Jon K.: Sorry, your comment got caught in my spam filter for some reason.  It&#8217;s now published.</p>\n<ul>Do you think any continuous or infinite processes are observable in our universe? Do you think any continuous or infinite processes exist in our universe?</ul>\n<p>That depends entirely on what you mean by terms like &#8220;exist&#8221; and &#8220;are observable.&#8221;  My best guess is that the history of the observable universe is well-described by quantum mechanics in a finite-dimensional Hilbert space (specifically, about exp(10<sup>122</sup>) dimensions).  If so, then the outcome of any measurement would be discrete; you&#8217;d never directly observe any quantity that was fundamentally continuous.  But the amplitudes, which you&#8217;d need to calculate the probabilities of one measurement outcome versus another one, would be complex numbers with nothing to discretize them.</p>\n<ul>Do you think the amount of information needed to describe the history of our universe is finite?</ul>\n<p>Again, on the view above, the amount of information needed to describe <i>any given observer&#8217;s experience</i> is finite (at most ~10<sup>122</sup> bits).  And the amount of quantum information contained in the state of the universe (i.e., the number of qubits) is also finite.  But the amount of classical information needed to describe the quantum state of the universe (something that no one directly observes) could well be infinite.</p>\n<ul>Is it important to consider historical quantum entanglement if it has already “collapsed”?</ul>\n<p>Is that question any different from just asking whether someone believes the Many-Worlds Interpretation?  If not, then see my previous posts on the subject.</p>\n<ul>Thoughts on retro-causality? Thoughts on a block universe?</ul>\n<p>A lot of my thoughts about such matters are in my <a href=\"http://www.scottaaronson.com/papers/giqtm3.pdf\" rel=\"nofollow\">Ghost in the Quantum Turing Machine</a> essay.  I guess some people might call the freebit picture &#8220;retrocausal,&#8221; in a certain sense, although it denies the possibility of cycles in the causal graph of the world.</p>\n<p>In any case, the usual motivations for retrocausality&#8212;namely, to get rid of the need for quantum entanglement, and to restore the &#8220;time symmetry&#8221; that&#8217;s broken by the special initial state at the Big Bang&#8212;I regard as complete, total red herrings.  Retrocausality doesn&#8217;t help anyway in explaining quantum phenomena (what&#8217;s a &#8220;retrocausal explanation&#8221; for how Shor&#8217;s algorithm works, that adds the tiniest sliver of insight to the usual explanation, and that wouldn&#8217;t if true imply that quantum computers can do much <i>more</i> than they actually can?).  And I&#8217;ve never seen any reason why our universe <i>shouldn&#8217;t</i> have a special initial state but no special final state.  Life is all about broken symmetries; a maximally symmetric world is also a maximally boring one.</p>\n]]>", "author": "Scott", "published": "2017-10-06 04:53:45+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott&#8217;s Point #4 (or perhaps an extra point beyond #4) goes much further and does not really require any reference to computation. If the laws of physics, and the laws of computer science and mathematics are not really the governing rules of the universe but just the rules of the computer simulation (or dream or whatever) that we live in then we cannot apply scientific reasoning to refute living in simulation like other older supernatural claims.</p>\n<p>A point that I find interesting (related to Scott&#8217;s #3)  regarding a matrix-type simulations of humans (even a single human) is that it requires quantum fault-tolerance. The same applies to even more &#8220;mundane&#8221; tasks regarding predictability of humans and teleportation of humans. All these tasks seem to require quantum fault-tolerance. </p>\n<p>(Three more points: the need for quantum fault tolerance to emulate complex quantum systems does not require that these systems demonstrate superior (beyond P) computation. The task of matrix-type simulations of individuals, as well as predicting and teleporting them would be extremely difficult even with quantum fault-tolerance. And, finally, there is nothing special here about &#8220;humans&#8221; and the same applies to sufficiently interesting small quantum systems based on non-interacting bosons or qubits.)</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2017-10-06 05:57:02+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Gil #45: Yes, I tried to order the points from &#8220;specific to this paper,&#8221; to &#8220;specific to our current state of knowledge where we can&#8217;t prove P&ne;PSPACE,&#8221; all the way down to &#8220;general-purpose refutation that logically applies forever to any purported disproof of the simulation hypothesis.&#8221;</p>\n]]>", "author": "Scott", "published": "2017-10-06 06:29:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>[&#8230;] Segundo Scott Aaronson, um cientista da computação que trabalha com computação quântica, o que os cientistas descobriram não tem relação com a hipótese do universo como uma simulação &#8230;. Em conclusão, a hipótese da simulação não foi falseada e permanece [&#8230;]</p>\n]]>", "author": "Fsicos mostram que no estamos vivendo em uma simulao de computador  Mundo Cetico", "published": "2017-10-07 15:02:35+00:00", "title": "By: Físicos mostram que não estamos vivendo em uma simulação de computador – Mundo Cetico"}]