[{"content": "<![CDATA[<p>Scott, since you asked us for opinions/views:</p>\n<p>&#8212; I first advise you spend a lot less on your-self-described guilt as some kind of Jewish nerd/schlemiel/ teen/ horny non-operative/ unsuited person.</p>\n<p>&#8212; second, were I you, I would drop whole nerd/geek/dwork/schemiel/geek personna. Attempting to &#8220;reclaim&#8221; insults words is just like the negro or homosexual attempting to reclaim the words that once insulted them.</p>\n<p>&#8212; I graduated from high school in 1970. No special SAT studies, no summer cram schools. I was accepted at Stanford, MIT, and Berkeley. Nobody in high school, that I recall, ever called me a dwork, a dweeb, a nerd, a tool, or any similar insult terms. </p>\n<p>&#8220;Werent&#8217; you that nerd who was in my chemistry class? &#8221; is an intended insult. </p>\n<p>&#8212; to &#8220;valorize,&#8221; as the lit-crit, cli-lit, leftist, feminista, queer community now calls it, such terms of denigration is to accept the inital term. &#8220;We are reclaming these terms.&#8221; As &#8220;Nizzaz Wiy </p>\n<p>&#8212; I am now wealthy, have some achievements can Google under my real name, and was never anyone&#8217;s dweeb, dork, geek, tool, or nerd.</p>\n<p>Scott, you are a brilliant addition to the human race. But you really need to stop with these every-few-months rants about how much of a dork or dweeb you are. </p>\n<p>Enjoy the ride and stop playing the self-deprecating schlemiel stereotypical  role that the (apparently) self-hating Jew Wood Allen apparently has lived in Real Life.</p>\n<p>P.S . Ask Dana if having a very successful career, a pretty wife, a couple of young kids is AT ALL consistent your self-trashing yourself as a nerd unsuited to the modern world.</p>\n<p>It&#8217;s not realistic, It&#8217;s self-insulting, narcisissitic, and it&#8217;s very probably borderline neurotic.</p>\n<p>&#8211;Tim May, my real,  Intel 1974-8, crypto, Cypherpunk since then</p>\n]]>", "author": "Tim May", "published": "2018-08-26 07:06:27+00:00", "title": "By: Tim May"}, {"content": "<![CDATA[<p>Dan T. #115</p>\n<p>“It wasn’t merely her jaywalking that gave rise to Corvello’s outrage. It was her failure to do as he commanded, a cardinal sin.”</p>\n<p>This pretty much sums it up for me. I am afraid that I will find myself unable to do something required by someone who is capable of frequent and spontaneous outrage and tends to act on it. I don’t think it’s super likely though. And there are a lot of people out there who are far more at risk than me.</p>\n]]>", "author": "Pete W", "published": "2018-08-26 07:40:58+00:00", "title": "By: Pete W"}, {"content": "<![CDATA[<p>Tim May #120: I had to remove an offensive word from your comment.</p>\n<p>The tricky part is, I&#8217;ve found that being open and vulnerable and nerdy and radically honest works very well in real life&#8212;well, not for dating, but for everything else (and dating is fortunately no longer relevant for me).  As I mentioned in an earlier comment, it means that everywhere you go, you accumulate friends and fans with whom you can let your guard down, because they know what you&#8217;re really like and like you anyway.</p>\n<p>And this way of being even worked very well on the Internet until ~5 years ago.  It works <i>until and unless</i> there are outrage factories willing to devote a lot of time to weaponizing your openness and vulnerability against you for ideological reasons.</p>\n<p>None of the above would&#8217;ve been obvious to me a-priori (&#8220;<i>outrage factories?</i> who&#8217;d want to start one of <i>those?</i>&#8221; 🙂 ).  It represents hard-earned wisdom that I can now share, free of charge.</p>\n]]>", "author": "Scott", "published": "2018-08-26 09:13:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Tim May #120</p>\n<p>Is this you <a href=\"http://groups.csail.mit.edu/mac/classes/6.805/articles/crypto/cypherpunks/may-crypto-manifesto.html\" rel=\"nofollow\">http://groups.csail.mit.edu/mac/classes/6.805/articles/crypto/cypherpunks/may-crypto-manifesto.html</a> ? From online sources, it seems it was written in 1992. It was at least 15 years ahead of its time since the massive adoption of online for everything started in 2007 (the year of twitter, the iphone, Hadoop, the spread of facebook outside its niche, etc). I am particularly impressed that you already saw that &#8220;The State will of course try to slow or halt the spread of this technology, citing national security concerns, use of the technology by drug dealers and tax evaders, and fears of societal disintegration&#8221;.</p>\n<p>Dude, that was awesome!</p>\n]]>", "author": "The problem with the gatekeepers", "published": "2018-08-26 23:17:37+00:00", "title": "By: The problem with the gatekeepers"}, {"content": "<![CDATA[<p>To Tim May: I have some thoughts that I&#8217;d be happy to share privately, but I couldn&#8217;t find an email address for you that worked.  If you&#8217;re interested, feel free to shoot me an email.</p>\n]]>", "author": "Scott", "published": "2018-08-27 12:54:22+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;Every week or so I get emails from people wanting to share their spiritual theories with me&#8230;.&#8221;</p>\n<p>Seems roughly equivalent to:</p>\n<p>&#8220;Every week or so I get seeds from people wanting me to plant them here in the Atacama&#8230;.&#8221;</p>\n<p>Weird.  Maybe they can&#8217;t wait to send their Good News to everyone?  Or perhaps you present a challenge.</p>\n<p>Oh, about the folks who dislike you for being yourself: I doubt it&#8217;s because you threaten their worldview.  I think it&#8217;s because they dislike and distrust nearly everyone, with the possible exception of former New York real estate con men on the one hand, or Noam Chomsky on the other (but he&#8217;s a guy so I could be wrong).</p>\n]]>", "author": "Jud", "published": "2018-08-27 15:13:07+00:00", "title": "By: Jud"}, {"content": "<![CDATA[<p>Scott #122</p>\n<p>&#8220;And this way of being even worked very well on the Internet until ~5 years ago. It works until and unless there are outrage factories willing to devote a lot of time to weaponizing your openness and vulnerability against you for ideological reasons.&#8221;</p>\n<p>Do like everyone else who has a online presence:<br />\nif you&#8217;ve given up on changing the mind of your detractors, open a Patreon channel so that only devoted followers/donators would get your non-QC posts.</p>\n]]>", "author": "fred", "published": "2018-08-28 15:19:01+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #126,</p>\n<p>No, not &#8220;everyone else.&#8221;</p>\n<p>I am barely aware of this begging channel called &#8220;Patreon.&#8221; I almost never contribute to beggars. And very rarely even to subscriptions of magazines or newspapers.</p>\n<p>I certainly don&#8217;t anticipate contributing to someone&#8217;s &#8220;Patreon channel&#8221; to read their words of shit, er, wit.</p>\n<p>&#8211;Tim May, who remembers when mailing lists were essentially censorship-free and yet  had hundreds of people conversing with hundreds of other people, all without &#8220;Patreon,&#8221; moderation, or central blog owners. (Extropians, Hackers-list, Cypherpunks, all circa the early 1990s to late 1990s.)</p>\n]]>", "author": "Tim May", "published": "2018-08-29 11:17:28+00:00", "title": "By: Tim May"}, {"content": "<![CDATA[<p>Tim May #127</p>\n<p>no, no, not beggars.<br />\nYou see, a pay wall, even tiny, is enough to filter out 99% of the trolls.<br />\nAnd Scott would re-invest the proceeds in your &#8220;Make the Internet Great Again&#8221; movement&#8230;</p>\n]]>", "author": "fred", "published": "2018-08-29 13:12:22+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>I&#8217;m curious, given that it was the best mexican of your life. Which places did you go to in Mexico City?</p>\n]]>", "author": "J.F.", "published": "2018-08-30 00:18:11+00:00", "title": "By: J.F."}]