[{"content": "<![CDATA[<p>Itai #3: I don&#8217;t actually know how the experts who testify before Congressional subcommittees get chosen (does anyone here?).  Those who currently control Congress lying awake at night, bothered by pangs of intellectual consistency, doesn&#8217;t rank high on my list of hypotheses.  All the same, yes, the very fact that Alex was called to testify is a hopeful sign that there&#8217;s still some unextinguished spark of rationality somewhere in the bowels of the system.</p>\n]]>", "author": "Scott", "published": "2017-06-22 02:13:54+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>This is an excellent idea that could potentially instill some trust into our democratic institutions. Provided, of course, that it can be implemented in a non-partisan way.</p>\n]]>", "author": "Dan", "published": "2017-06-22 22:05:40+00:00", "title": "By: Dan"}, {"content": "<![CDATA[<p>But why is it so difficult to design and build a hack-proof system of EVMs? </p>\n<p>I have no interest in this matter, but even just 10 minutes of pondering produced this solution:</p>\n<p>A machine having a special processor of very very severly limited functionality; a very tiny OS which is so tiny that its entire functionality can be machine-verified 100%; input access to the OS (including for the task of preparing a machine for an election, candidates&#8217; names, etc.) only via a single mechanical means which has independent non-electronic existence after programming&#8212;viz. special-purpose punch cards, output access only via one mechanical means (punching machine). </p>\n<p>At least the booth EVM can this way be made fully secure. That&#8217;s what I believe. (Correct me if I am wrong.)</p>\n<p>Hacking can now occur only at the stage of collection of results&#8212;say from the different booths to a county or from many counties to a state election seat, etc. However, if we adopt the principle that the only communication with any electronic machine (or from one machine to another machine) can only be made via only mechanical and persistent means (such as paper tapes), the system _can_ be made safe.</p>\n<p>Systems become susceptible to attack only when they acquire a complexity of composition beyond a certain level. Purely mechanical production systems (before the age of robots and FMS)  had been producing machines and cars for decades, without ever getting hacked. And, what is necessary for elections is a task less complex than that of a car assembly line.</p>\n<p>Anyway, the solution that would work is so obvious that the only question which strikes me is this: what forces lead the responsible people from not adopting them&#8212;and, from computer engineers from advocating these simplest electro-mechanical sort of solutions.</p>\n<p>Just 2 cents. As I said, the matter does not interest me. But as an ordinary citizen of a democratic country (India), I do appreciate the fact that engineers and scientists are highlighting these issues. That is important.</p>\n<p>Best,</p>\n<p>&#8211;Ajit</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2017-06-23 06:20:56+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Hi Scott,<br />\nGiven the current dire political predicament in the U.S., and the chasm within the electorate that has been (re?)discovered, what do you conjecture a post-Trump America (assuming one still exists, of course) will look like? Do you think it&#8217;s likely that the U.S. will continue its downward spiral until democracy no longer exists? Do you see any plausible road to recovery? Or do you think the country will eventually fall apart in some sense, as a result of the dramatic &#8220;cultural&#8221; divide within the populace?</p>\n<p>P.S.: Long time lurker, first time commenter. The blog is awesome, you&#8217;re awesome, and I look forward to many more blog posts! 🙂</p>\n]]>", "author": "What is this commenter's name?", "published": "2017-06-23 10:06:59+00:00", "title": "By: What is this commenter's name?"}, {"content": "<![CDATA[<p>Ajit #8: My guess is that, if you spent more than 10 minutes thinking about it&#8212;as a bunch of smart people actually did&#8212;in order to make your minimalist EVM as truly hack-proof as possible, you&#8217;d end up reinventing the concept of the EVM printing out a paper receipt that&#8217;s then dropped into a box, which is exactly what&#8217;s being advocated here.</p>\n<p>Note that even a special-purpose chip can be hacked in many ways, including by someone surreptitiously opening the voting machine and swapping it out for another chip (something Alex and his students demonstrated the ability to do in about 10 seconds with real voting machines).  And in practice, the functionality that people want here&#8212;graphical user interfaces, ability to program the same machine with different races, etc.&#8212;is always pushing them toward Turing-universality.  That leads us to the principle that the voter simply <i>shouldn&#8217;t have to trust</i> whatever&#8217;s in the machine: the machine can help them vote, but the security of the vote needs to be guaranteed by something visible and external to it.</p>\n]]>", "author": "Scott", "published": "2017-06-23 14:07:17+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>WITCN #9: I&#8217;d rather not have to speculate about such matters.  Even if one agrees that the dissolution of the US, a second Civil War, the replacement of our system by an explicit autocracy, etc. are still rather wild and remote possibilities for the foreseeable future, I think a reasonable person would have to say that the probabilities for all these events <i>shot way up</i> in the last two years&#8212;more sharply than the same reasonable person could likely have predicted beforehand.  If you know Asimov&#8217;s <i>Foundation</i> series, Trump is the Mule.  Unfortunately, the whole point of that series was to illustrate the futility of &#8220;scientifically&#8221; predicting the future!  So it&#8217;s fortunate that, unless we&#8217;re completely pure utilitarians (which no one is or has ever been, in practice), we don&#8217;t need to know the future of civilization in order to know our own moral obligations right now.</p>\n]]>", "author": "Scott", "published": "2017-06-23 14:21:53+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #10:</p>\n<p>Thanks for responding.</p>\n<p>Ummm&#8230; No. What you say in your reply #10 is not what I had in mind; it is not something I would advocate. For instance, I did indicate that no matter what the specifics of the design, at each stage, the input and output must exclusively be only mechanical, and that each stage should independently produce a persistent record (such as a punched card) of both its inputs and outputs for later verification (whether 100% or statistically sampled). </p>\n<p>I seem to already have spent more than 10 minutes on it, haven&#8217;t I?&#8230; So, OK. Here&#8217;s my proposal.</p>\n<p>Let me think more about it, and come up with a concrete design or two, and send some documentation about it by email directly to Alex, with a cc to you. I would do that if and only if Alex would take my suggestions seriously enough to go through the (brief) documentation, and try to think of all possible attacks it is susceptible to, and let me know. I will then revise it, and send the revision, though I will keep the revisions down to only a few iterations (say fewer than five, to get the proposal going). If that&#8217;s OK by you two, let me know, say by reply at this blog, and I will soon begin work on it (though can&#8217;t commit time-frames&#8212;am too busy, and this is not one of my primary fields of interest). </p>\n<p>Speaking of right this moment, I am looking forward to having a delicious dinner, and so must drop this conversation right where it is, but before I sign off for the time being, here are a few further notings.</p>\n<p>If a chip can be surreptitiously replaced within 10 seconds, why not dump the electronic circuit part of it into a block of cold-setting resin at the time of manufacture? say with a couple of sprinklings of that dust of RFID into the resin (circuit-wise completely independent) such that each block can be non-destructively proded for its identity any time you desire? &#8230; If the public wants a simple visual interface, why must it be a GUI (on a computer)? Why can&#8217;t it be a color printout stuck in a non-replaceable way (and with procedural checks thrown in to ensure that it was not replaced) on to the very voting module of the EV System itself? In India, since a lot of our population is illiterate, we manage to pull through our elections using even graphical symbols for parties/independent candidates. These are simply B&W printed lists that are stuck next to the EVM buttons. They work. And, coming to the American public, even if it insists on only a HD GUI on an electronic monitor/computer display, OK, fine. Give them that. Just make sure to physically isolate it completely (right from their immediate power-sources) from the EVM&#8217;s voting module proper. By EVM&#8217;s voting module, I mean a counter, really speaking. The punching machine to specify the vote on to a punching card would be mechanically and physically separate. </p>\n<p>As to the electronic parts, my design would rely on the idea that whatever I program in C++, it can, in principle, be produced in pure hardware, without a single software component to it. </p>\n<p>&#8230; Anyway, I realize I&#8217;ve begun getting into more details than can make sense to you (or anyone else). So let me stop here, and await Alex&#8217;s and your nod. If both of you&#8212;and particularly, Alex&#8212;agrees, I will write a documentation on a proposed system or two that is practical enough, and, of course, safe enough.</p>\n<p>Thanks for highlighting this issue itself though. </p>\n<p>Bye for now, and take care,</p>\n<p>&#8211;Ajit<br />\nPS: I will check back tomorrow (say 24 hours later) or later. But, yes, I am willing to take this as a challenge&#8212;I mean, in a positive spirit. And I think as a good engineer (that&#8217;s what I imagine myself to be) I should be able to meet it&#8212;even if the first version or two may not be all that safe, in the sense, you know, it always helps to have another pair of eyes. And it would be beyond wonderful if those happen to come from groups like Alex&#8217;s (not to mention the general public at large). OK. Enough is enough. Bye, really, for now.</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2017-06-23 15:27:08+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Ajit #12: I think you&#8217;re trying to solve a political problem with a technical solution.  This sometimes works, but only if you realize that the problem you have is a political one.  I&#8217;m not very well informed about this stuff, but I think the problem is NOT coming up with a perfect design.  The problem is that the current laws don&#8217;t mandate even the most basic precautions.  There is no paper trail.  The source code is secret.  You have things like this this:</p>\n<p><a href=\"https://www.schneier.com/blog/archives/2015/04/an_incredibly_i.html\" rel=\"nofollow\">https://www.schneier.com/blog/archives/2015/04/an_incredibly_i.html</a></p>\n<p>This was used in 3 presidential elections!</p>\n]]>", "author": "Marvy", "published": "2017-06-24 02:49:55+00:00", "title": "By: Marvy"}, {"content": "<![CDATA[<p>Thanks Scott for posting about this. Paper trail is necessary, and Alex&#8217;s testimony is very important. </p>\n<p>Here is <a href=\"https://sites.google.com/site/evotingisrael/\" rel=\"nofollow\">  an Israeli take on the electronic voting/paper trail issue</a>, dating back to 2008. Eventually, the Israeli government ended up not switching to electronic voting, though of course for all the wrong reasons.</p>\n<p>From the technical side, it should be mentioned that Cryptographers have been working on developing &#8220;End-to-End Verifiable&#8221; electronic voting systems for 3.5 decades now, combining paper trail with electronic means in order to achieve the &#8220;best of both worlds&#8221;. Here <a href=\"https://wombat.factcenter.org/\" rel=\"nofollow\"> is an example of such a system </a> that I have been involved in, together with Amnon Ta-Shma and others.</p>\n<p>People tend to dismiss such systems due to their relative complexity, claiming that it makes the inner workings of the system too hard to comprehend by the public. However, for the system to be auditable it should arguably be sufficient that it is comprehensible to experts (which we can choose to trust, just as we entrust doctors with our health). Plus, it is not like the technology underlying current electronic commerce (and finance) is actually understood by laypeople. Just look at Bitcoin, which is gaining wide adoption by the public, while being significantly more complex than most proposed End-to-End verifiable voting systems (I am aware to the fact that the stakes of elections are of a different nature than those of monetary systems).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Rosen:Alon.html\">Alon Rosen</a>", "published": "2017-06-24 06:14:43+00:00", "title": "By: Alon Rosen"}, {"content": "<![CDATA[<p>WITCN #9, Scott #11: I think the big picture is very clear. In one corner are the Republicans, who are remaking America into a plutocracy. In the other corner are a disorganized gaggle of Democrats, Independents, etc., who are trying to push things back toward the norm. </p>\n<p>How did things come to this pass? Lot of things: </p>\n<p>(1) Huge money invested in developing Rush Limbaugh types who are somewhat entertaining and keep up a group of lies and distortions for decades, and actually convince a large cohort that voting against their self interest is a good idea. </p>\n<p>(2) Standard issue fear mongering, &#8220;us versus them&#8221; that has worked for right wing nuts since forever.</p>\n<p>(3) Abortion. A single issue that has caused huge numbers to vote for the party that is screwing them.</p>\n<p>(4) Racism. </p>\n<p>There are also plenty of issues that are nuanced, and the Republicans did a good job of convincing people that they could help, when in reality they will screw everyone. Obamacare, for example.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-06-24 19:28:33+00:00", "title": "By: Raoul Ohio"}]