[{"content": "<![CDATA[<p><em>&#8220;Pre-shrinking the URL has no effect on the character count. It also obscures the true destination from the reader, interposes two layers of redirection, with two delays, two potential points of failure, and two opportunities to collect saleable data. Yet I still see lots of bit.ly and goo.gl links in tweets. Am I missing or misunderstanding something?&#8221;</em></p>\n<p>I fear it&#8217;s just the last &#8216;drawback&#8217; you mentioned. People posting on Twitter often have a marketing agenda, and want to collect analytics on their readers to be able to show how &#8216;effective&#8217; they are at tweeting. Not for advertisers this time but employers.</p>\n]]>", "author": "Kartik Agaram", "published": "2016-08-27 22:49:15+00:00", "title": "By: Kartik Agaram"}, {"content": "<![CDATA[<p>I am probably just expanding on what Mr. Hayes and Mr. Agaram have already said, but I think URL shorteners  represent more than a single point of failure: they represent a centralization of links, hence a centralization of the internet. Much as the dominance of google search has done, whereby an &#8220;upgrade&#8221; to the algorithm can put companies out of business, imagine what could happen to the internet if every link were shortened using one or few services: the centralization of linking. Not only it&#8217;s a single point of failure, but it&#8217;s also a vantage point to snoop on people&#8217;s browsing (what if that URL were personalized for you &#8212; they are in marketing email) and a point of control (show competitors down 10% of the time). If your browser called home to report every click you would change browser, wouldn&#8217;t you? Shortened links &#8220;call home&#8221; before redirecting. Which brings to the next point, why use alternate, redundant shorteners? By negating the exclusiveness of the analytics information that twitter is gathering under the pretenses of shortening (shortening was necessary only because of the equally arbitrary 140 character limit, but links don&#8217;t count towards it any longer), using, say, bit.ly or goog.gl, users are in part boycotting this unhealthy business model. It&#8217;s a bit like ad-blocking: some users are just trying to clean up  their screens and save bandwidth, others want to kill a business model predicated on creating user addiction and then selling out their attention, that is their system of beliefs, to the highest bidder.</p>\n]]>", "author": "AP", "published": "2016-08-29 17:21:16+00:00", "title": "By: AP"}, {"content": "<![CDATA[<p>The connection between the 140-character tweet limit and SMS is more symbolic than real.  SMS uses a 7-bit character set and doesn&#8217;t waste the high-order bit, so it packs up to 160 characters into 140 bytes.  The lower 32 characters, corresponding to the ASCII controls, represent a small selection of additional letters, enough to support French, German, Italian, Danish, Swedish, Norwegian, Finnish, Spanish (without accent marks, or with the wrong ones) and Greek (capitals only).  For languages other than these, SMS sends a maximum of 70 Unicode characters represented with 16 bits each (only Plane 0).</p>\n<p>Twitter, on the other hand, has always supported up to 140 Unicode characters, so you can get twice as much Chinese text (say) in a tweet as you can in an SMS.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cowan:John.html\">John Cowan</a>", "published": "2016-08-29 17:58:49+00:00", "title": "By: John Cowan"}, {"content": "<![CDATA[<p>Agreed about the iniquity of centralization.</p>\n<p>As for using bit.ly or the like to disrupt Twitter&#8217;s business model, it may well be a motive for some users. But is it effective? Through t.co Twitter still gets its own call home, and they can learn the ultimate destination simply by issuing a GET or HEAD request to the embedded bit.ly address. Could bit.ly block bulk requests from Twitter? I suppose they could, but would they risk alienating a service that&#8217;s probably responsible for a big chunk of their traffic?</p>\n<p>Also, as far as I can tell, links <em>do</em> still count as 23 characters. The Twitter announcement of the change does not mention them at all, one way or the other. A simple experiment shows the character count decremented by 23 for every link pasted into a tweet. </p>\n<p>It&#8217;s an interesting question why Twitter chose to keep the count penalty on links while dropping it for images, although the answer probably has nothing to do with the issue under discussion here. They may just want to discourage the use of Twitter as a link farm.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2016-08-30 10:59:16+00:00", "title": "By: Brian Hayes"}]