[{"content": "I think that both theory and practical algorithms should be encouraged, for different reasons. The main problem is in the middle: a new algorithm that is simpler that all already-published algorithms but not at the level of being implementable faces several problems when trying to publish it.", "author": "Anonymous", "published": "2014-05-22 01:11:10.884000-04:00", "title": ""}, {"content": "Thanks for the link to the Knuth Q&amp;A - some very interesting material there. The topic of the missing implementations of published algorithms has been discussed before (on this blog I think). <br /><br />It seems to me that this is the theoretical CS version of the non-reproducibility crisis currently occurring in disciplines such as psychology. <br /><br />Have you seen any progress over the last 5 years?<br /><br />Maybe <a href=\"http://mozillascience.github.io/code-research-object/\" rel=\"nofollow\">giving DOIs for code</a> will allow people to get citation credit and go some way to improving the situation. It seems that the reward system of scholarship is badly broken, when obscure &quot;improvements&quot; of algorithms  that could never be implemented get points, but careful comparison of actual running times of useful implementations of more important algorithms does not. Math envy is a major problem in many disciplines!", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/w/Wilson:Mark.html\">Mark Wilson</a>", "published": "2014-05-22 14:57:10.911000-04:00", "title": ""}, {"content": "this is a great high voted question on that <a href=\"http://cstheory.stackexchange.com/questions/4491/powerful-algorithms-too-complex-to-implement\" rel=\"nofollow\">&quot;powerful algorithms too complex to implement&quot;</a> &amp; rjlipton has a great blog on the subject also re &quot;galactic algorithms&quot;. gotta blog on this sometime &amp; include your blog!", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/nuri:vz.html\">vz nuri</a>", "published": "2014-05-22 19:19:02.791000-04:00", "title": ""}, {"content": "It&#39;s important to tell that  &#39;Algoirthms&#39; is incorrect.", "author": "Anonymous", "published": "2014-05-24 20:36:39.357000-04:00", "title": ""}]