[{"content": "<![CDATA[<p>Gil #42, output anyway has 6 modes and dimension 6! = 720. It is bigger than dimension for 9 qubits. I am not sure that input is so crucial &#8211; it is similar to complain, why we are using state |0000&#8230;0> a input of many quantum algorithms.<br />\nAnd finally, due to noise the initial space may spread in bigger dimension confirming my doubts about overcoming ECT using noise.</p>\n]]>", "author": "Alexander Vlasov", "published": "2015-08-24 11:27:41+00:00", "title": "By: Alexander Vlasov"}, {"content": "<![CDATA[<p><b>PS</b>&nbsp; The conclusion of comment #43 should have noted that Gil Kalai too deserves great credit, for demonstrating that the quantum-skeptical literature can aspire to comparable mathematical and scientific quality to the quantum-optimistic literature&nbsp;&hellip; and also for unfaltering good humor.</p>\n]]>", "author": "John Sidles", "published": "2015-08-24 11:54:45+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<blockquote><p><b>Alexander Vlasov</b> argues &#8220;due to noise the initial [state-]space may spread in bigger dimension confirming doubts about overcoming ECT using noise.&#8221;</p></blockquote>\n<p>And yet, a key tenet of the Church of the Larger Hilbert Space&nbsp;&mdash; specifically, Nielsen and Chang&#8217;s <b>&#8220;<a href=\"https://books.google.com/books?id=aai-P4V9GJ8C&pg=PA372&lpg=PA372\" rel=\"nofollow\">Theorem 8.2: Unitary freedom in the operator-sum representation</a>&#8220;</b>&nbsp;&mdash; affirms concretely that Lindblad processes realized as dimension-spreading noise can indistinguishably be realized as dimension-shrinking measurement processes.</p>\n<p>In other words, the Quantum Scriptures ingeniously accommodate Mephistophelean Duality, by spurring optimistic racehorses and skeptical racehorses with equal efficacy.  </p>\n<p><b>Conclusion</b>&nbsp;  Quantum heaven intrinsically resembles the paradise of Mark Twain&#8217;s <b><a href=\"http://www.gutenberg.org/files/1044/1044-h/1044-h.htm\" rel=\"nofollow\"><i>Extract from Captain Stormfield&#8217;s visit to Heaven</i></a></b> (1907): it&#8217;s a paradise that is divinely, even hilariously, arranged so as to finely balance the strivings of quantum optimists and quantum skeptics.</p>\n<p>Which is (semi-obviously) the very <i>best</i> kind of quantum paradise to which we mortals can reasonably aspire.</p>\n]]>", "author": "John Sidles", "published": "2015-08-24 14:58:12+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>@asdf</p>\n<p>Amusingly, back in 2013 Dwave was claiming X3600. Now they claim X600, with two times more &#8220;qbits&#8221; and two times less noise. Not clear if they should further decrease the number of qbits or further increase the noise to improve performance. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "Jay", "published": "2015-08-24 16:40:45+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>I&#8217;m not clear why ppl who think that noise/error levels are gonna be the limiting factor can&#8217;t just write a simulation to demonstrate this (with various models of noise/error).</p>\n]]>", "author": "fred", "published": "2015-08-24 18:56:17+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #48,</p>\n<p>Well, if one thinks that the level of noise is going to skyrocket very near to the point where classical simulations become impractical, simulations of smaller instances aren&#8217;t going to necessarily tell you that much.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2015-08-24 22:12:26+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>The problem with quantum computers is that you must build a significantly more powerful machine each time you increase the size of your input data by one unit. The power complexity of the quantum model is perhaps linear, but with a proportionality constant of the order of the speed of light squared, due to the mass-energy equivalence. In this, quantum computers are reminiscent of particle colliders. Like those, they&#8217;re unlikely to leave the laboratory anytime soon. The polynomial-time behavior of quantum factoring is surely a theoretical marvel, but it&#8217;s also practical rip-off. The nice time behavior is obtained at the expense of a prohibitive energy model.</p>\n]]>", "author": "Serge", "published": "2015-08-24 23:11:51+00:00", "title": "By: Serge"}, {"content": "<![CDATA[<p>@fred #48</p>\n<p>I think they don&#8217;t know the exact hamiltonian governing the evolution of the BosonSampling system &#8211; you can assume an ideal QED model or similar, but even that would be ridiculously complicated to simulate to sufficient accuracy and even that probably isn&#8217;t exactly how Nature works. </p>\n<p>So adding a random noise element isn&#8217;t even close to being possible in a useful manner for a simulation of this type of physics.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2015-08-25 00:21:50+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>Serge #50: I&#8217;m not going to change your mind, but maybe I should say for the benefit of others reading that the idea that QCs have a &#8220;power requirement of order the speed of light squared&#8221; is complete nonsense.  Firstly, the units aren&#8217;t right!  And secondly, a QC is not a nuclear reactor!  It&#8217;s not converting mass to energy or vice versa in any relevant way.  The energy requirements come from much more prosaic sources&#8212;it&#8217;s just whatever amount of energy you need to cool the qubits down, manipulate them, etc.  (In practice, I believe the refrigeration costs typically dominate.)</p>\n]]>", "author": "Scott", "published": "2015-08-25 01:06:40+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> reminds readers &#8220;The energy requirements [in BosonSampling] come from much more prosaic sources [&hellip;] In practice, I believe the refrigeration costs typically dominate.&#8221;</p></blockquote>\n<p>And yet on the other hand, it&#8217;s true too that not every energy/entropy cost associated to BosonSampling is scientifically prosaic.  </p>\n<p>In standard photonic practice, the photon-emitter current fluctuations are decoupled from the photon-absorber current fluctuations by either (or even both of two methods), the first method being thermodynamically wasteful and the second method being thermodynamically subtle.</p>\n<p><b>The wasteful isolation method</b>&nbsp; Make the photon-source bright, and dump most of the photons.  In the original Hanbury-Brown and Twiss experiment, the photon-emitter current was the entire output of the star Sirius, while the photon-absorber current was a few picoamperes (at an estimate) of photoelectrons. </p>\n<p><b>The subtle isolation method</b>&nbsp; interpose a <b><a href=\"http://www.innophoton.com/PIC/4-port-Polarization-Insensitive-Optical-Circulator-443S.gif\" rel=\"nofollow\">non-reciprocal optical isolator</a></b> between the photon-source and the photon-sink.  This provides two more tunable/designable BosonSampling elements, namely, the (optionally quantum-squeezed) vacuum state injected at the isolator ports.</p>\n<p>MRFM experiments commonly use <i>both</i> wasteful <i>and</i> subtle isolation methods simultaneously, and ultra-advanced experiments like LIGO are beginning to experiment with sophisticated vacuum-squeezing isolation.</p>\n<p>The associated <b><a href=\"https://en.wikipedia.org/wiki/Optical_isolator#Optical_isolators_and_thermodynamics\" rel=\"nofollow\">quantum thermodynamics of optical isolators and decouplers</a></b> is a tricky subject&nbsp;&hellip; as attested by a marvelous first-person account &#8220;Realizing squeezing: an interview with Carlton Caves&#8221; (2013), which appeared in <i>LIGO Magazine</i> (as an interview conducted by Michael Landry).</p>\n<p>If these isolation/decoupling physics-challenges aren&#8217;t easy for a highly experienced (and outstandingly talented) researcher like Carlton Caves, then how difficult are these challenges for less-experienced mortals?</p>\n<p>That&#8217;s why its far from clear&nbsp;&mdash; far from clear to me at least, and perhaps far from clear to <i>anyone</i>&nbsp;&mdash; whether the extra modes associated to optical decouplers will turn out to be a blessing or a curse in regard to scalable BosonSampling; the principle of Mephistophelean duality affirms <i>both</i> eventualities with equal weight.</p>\n<p><b>Conclusion</b>&nbsp; Realistic models of over-simplified BosonSampling experiments aren&#8217;t easy; over-simplified models of realistic BosonSampling experiments aren&#8217;t easy either, and realistic models of realistic BosonSampling experiments are a mighty challenging proposition indeed.</p>\n<p>So very challenging&nbsp;&mdash; and yet so very revealing&nbsp;&mdash; are realistic simulations of realistic BosonSampling experiments, that further progress would be heartily welcomed by researchers of <i>all</i> persuasions and temperaments.</p>\n]]>", "author": "John Sidles", "published": "2015-08-25 02:56:52+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Is there a reason not to believe brain cannot do bosonsampling?</p>\n]]>", "author": "a", "published": "2015-08-25 06:16:52+00:00", "title": "By: a"}, {"content": "<![CDATA[<p>a #54: Too many negatives there, but no, there&#8217;s no reason not to believe the brain can&#8217;t do BosonSampling, and there&#8217;s every reason to believe it can&#8217;t.  I mean, can <i>you</i> sample probability distributions defined in terms of permanents?  I can&#8217;t even sample ones defined in terms of determinants&#8212;and it gives me a lot of trouble to do 2-digit multiplication.  Why would anyone even imagine BosonSampling was the kind of thing people would be good at?</p>\n]]>", "author": "Scott", "published": "2015-08-25 07:48:59+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>John #46, In my comment I just response on idea that the dimension is not enough. In fact, in previous paper of the same group (also mentioned in the post) they directly mentioned about dimension of Hilbert space > 50000.<br />\nYour &#8220;Mephistophelean Duality&#8221; sounds like yet another manifestation of &#8220;observer solipsism&#8221; &#8211; <em>if some system violates ECT, but we may not measure that (due to noise or other reasons), the system does not violate ECT</em>. But I just complained about that particular interpretation.</p>\n]]>", "author": "Alexander Vlasov", "published": "2015-08-25 08:50:45+00:00", "title": "By: Alexander Vlasov"}, {"content": "<![CDATA[<p>Alexander: &#8220;Your “Mephistophelean Duality” sounds like yet another manifestation of “observer solipsism” – if some system violates ECT, but we may not measure that (due to noise or other reasons), the system does not violate ECT. But I just complained about that particular interpretation.&#8221;</p>\n<p>Dear Alexander, this I think this is an important issue and we discussed it in the past. </p>\n<p>One aspect of it is this: if you have a noisy state that is easy to be prepared (so on its own does not violate ECT), but which is a mixture of pure states each of which demonstrates quantum supremacy (or violate ECT). Should we regard it as a violation of ECT? </p>\n<p>Another aspect of it related to BosonSampling is the following: Suppose you can prove that BosonSampling with n Bosons with the property that every boson vanishes with probability (1/log n),  say, violates the ECT.  (And suppose that 1/log n is technologically achievable for large n&#8217;s ) Does this mean that noisy BosonSampling in such a regime would violate ECT?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2015-08-25 10:20:43+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Dear Gil #57, I am not sure, that is the model with vanishing bosons you mentioned. Is it something about more difficult case without conservation of photon number?</p>\n]]>", "author": "Alexander Vlasov", "published": "2015-08-25 12:12:53+00:00", "title": "By: Alexander Vlasov"}, {"content": "<![CDATA[<p>Scott #52: my units aren&#8217;t right only because I was equating power and energy due to the tiny data thus far processed. Indeed, who cares how much longer it takes to factor 21 than 15? I came up with a comparison of Feynman diagrams with flowcharts after reading John Baez&#8217;s intriguing paper “Physics, Topology, Logic and Computation: a Rosetta Stone”. I admit the absence of energy-to-mass conversion during quantum processes, but wouldn&#8217;t it be beautiful if a new information-energy equivalence were discovered? There isn&#8217;t such a thing as a prosaic source of energy. Refrigeration costs dominate in the QCs based on supra-conductivity, but I suppose other types of energy costs dominate in the silicon-based QCs for example&#8230;</p>\n]]>", "author": "Serge", "published": "2015-08-25 12:43:54+00:00", "title": "By: Serge"}, {"content": "<![CDATA[<p>Alexander, I was referring to a model that Scott is often talks about (I hope I get it right) : you start with an n by m matrix (representing n bosons) then you delete  t rows (so the error rate is t/n), and you average the bosonic distributions for all possible ways to delete t rows of the matrix. Of course, for my question, you can take instead one of the noise models Guy and I were studying where the number of bosons remain fixed. </p>\n<p>Fred (#48): &#8220;I’m not clear why ppl who think that noise/error levels are gonna be the limiting factor can’t just write a simulation to demonstrate this (with various models of noise/error).&#8221;</p>\n<p>Fred, we do talk about simulation in the paper linked above and after it was arxived we made some simulation in subsequent work with Maya Leshkowitz. There are intensive efforts by quite a few people  for simulations of BosonSampling (and noise) on various levels. The most simplified models can be studied analytically, slightly more general models need simulations, and for simulating the realistic experimental process towards BosonSamling you need much harder and more detailed simulation. (Often FermionSampling behaves like BosonSampling and you can push simulation further for FermionSampling.)  Of course, there is no difference in this respect between people who think that noise/error levels are gonna be the limiting factor and those who don&#8217;t.</p>\n<p>Fred (#26) : The debater who has fully understood and integrated the other side’s arguments in its own reasoning is automatically more likely to be right?</p>\n<p>Not at all, of course. My disposition is to try to understand other people&#8217;s view as much as I can. (And then often discuss and argue with them, if they wish, or occasionally tease them a little).It is not even something I recommend for others. Many times it is better to go on with your program and ideas and not to overly be distracted by others. But I really like to understand the line of thought and reasoning of other people and especially to identify the interesting ideas and stronger arguments.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2015-08-25 13:32:03+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Gil #60<br />\nThank you!</p>\n]]>", "author": "fred", "published": "2015-08-25 16:50:58+00:00", "title": "By: fred"}, {"content": "<![CDATA[<blockquote><p><b>Gil Kalai</b> [in comment #60] includes &#8220;My disposition is to try to understand other people’s view as much as I can&nbsp;[&hellip;]&#8221;</p></blockquote>\n<p>Please let me say that Gil Kalai&#8217;s comment #60, in its entirety, is among the very best passages (as it seems to me) that has ever been posted here on <i>Shtetl Optimized</i>.</p>\n<p><b>Graceful consonance</b>&nbsp; Note in particular, the graceful consonance between Gil&#8217;s remarks regarding the feasibility (or not) of large-n BosonSampling, and Carlton Caves&#8217; remarks regarding the feasibility (or not) of astronomical gravity-wave detection, that appeared in Caves&#8217; interview <b>&#8220;<a href=\"http://www.ligo.org/magazine/\" rel=\"nofollow\">Realizing Squeezing</a>&#8220;</b> (in <i>LIGO Magazine</i>, issue 3 (2013), as cited in comment #53)<br />\n<blockquote>&#8220;The [squeezed-light interferometry formalism] is a good example of why physicists are really obliged to give every explanation they can think of.  The particle perspective, though intuitive and right, is sterile. The less intuitive wave perspective is the royal road [to better designs]&#8221;</p></blockquote>\n<p>For a synoptic view of <i>technical</i> aspects of gravity-wave detection, the recent status report &#8220;Advanced LIGO&#8221; (arXiv:1411.4547 [gr-qc], 2014) is commended (by me and many).  </p>\n<p>For a synoptic view of <i>sociological</i> aspects of gravity-wave detection, Harry Collins&#8217; book-length survey <i>Gravity&#8217;s Shadow: the Search for Gravitational Waves</i> is <i>also</i> commended (by me, and by pretty much everyone who was not offended by Collins&#8217; sociological candor).</p>\n<p><b>Triumphs</b>&nbsp; The point is that gravity-wave detection, if and when it occurs&nbsp;&mdash; soon we hope per arXiv:1411.4547&nbsp;&mdash;  will be every bit as much a sociological triumph as a technical triumph; a triumph of Kalai-style/Caves-style <i>collegial</i> values, every bit as much as Kalai-style/Caves-style technical competence.</p>\n<p><b>Plausible eventualities</b>&nbsp; [merging Carlton Caves&#8217; remarks with Gil Kalai&#8217;s remark #12]:<br />\n<blockquote>&#8220;The [large-n BosonSampling formalism] is a good example of why physicists are really obliged to give every explanation they can think of.  The Hilbert-space perspective, though intuitive and right, is sterile. The less intuitive low-dimension polynomial perspective has turned out to be the royal road [to viable BosonSampling designs]&#8221;</p></blockquote>\n<p><b>Conclusion</b>&nbsp; Large-n BosonSampling demonstrations are proving to be every bit as fundamentally important, difficult, uncertain, contentious, and thrilling, as astronomical gravity-wave detection.</p>\n]]>", "author": "John Sidles", "published": "2015-08-25 16:53:37+00:00", "title": "By: John Sidles"}]