[{"content": "<![CDATA[<p>Philip #173: LOL!</p>\n<p>(The answer to your question is yes: coincidence.)</p>\n]]>", "author": "Scott", "published": "2014-06-23 14:11:58+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Jr #172: Your suspicion that the details haven&#8217;t really been thought through yet is <i>entirely</i> correct.  Indeed, you could see this post largely as an invitation for <i>you</i> to start thinking about the details!</p>\n<p>(Rest assured that if I ever make progress on the problem, or have an eigendemocracy trial system to try, I&#8217;ll write a followup post about it&#8230;)</p>\n]]>", "author": "Scott", "published": "2014-06-23 14:14:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott in update,</p>\n<blockquote><p>&#8220;It follows that this system can only improve on ordinary democracy if the trust network has some other purpose, so that the participants have an actual incentive to reveal the truth about who they trust.</p></blockquote>\n<p>Actually, I don&#8217;t think this is true at all.  No doubt, such a trust network would be more vulnerable to gaming the system than a revealed trust network.  However, it does not automatically follow that this gaming would be terribly effective.  Certainly it doesn&#8217;t follow that it would be any more effective gaming than the current *myriad* ways that our democratic system is *already* being gamed.</p>\n<p>I wouldn&#8217;t concentrate on trying to build a &#8216;revealed preferences&#8217; eigendemocracy at first nor try to repurpose facebook.  This strikes me as pre-optimization.  Why not go with setting up a network and see how robust it is to various forms of gaming first?</p>\n<p>To be clear, I will admit that it is possible that eigendemocracy through a non-revealed network might be subject to gaming, but it is not at all clear to me that this would be more subject to gaming than our current electoral democracies.</p>\n]]>", "author": "AdamT", "published": "2014-06-23 15:17:44+00:00", "title": "By: AdamT"}, {"content": "<![CDATA[<p>Scott #165:</p>\n<blockquote><p>In retrospect, the incredible speed of the StackExchange sites (and MathOverflow) not only at converging on truth, but also on converging on consensus that truth has been reached, was probably one of the factors that inspired me to revive this old idea.</p></blockquote>\n<p>I heard murmurs lately that all&#8217;s not well at StackExchange. There seem to be a lot of Meta threads discussing how the system has been driving away many good commentators etc. </p>\n<p>Not sure if all of it is true but there might be lessons to be learnt. Not all short term optimism about these things might be lasting.</p>\n]]>", "author": "Rahul", "published": "2014-06-23 17:30:48+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Scott writes:</p>\n<blockquote><p>It might be objected that the players didn’t “know” they were going to be graded on morality: as far as they knew, they were just trying to maximize their individual utilities.  The trouble with that objection is that the players didn’t “know” they were trying to maximize their utilities either!  The players are bots, which do whatever their code tells them to do. </p></blockquote>\n<p>I&#8217;m not sure I get this argument. Yes, the players were bots. </p>\n<p>But the humans who coded the bots did know that the bots were going to be graded on total scores. So maximizing utility was natural and preintended. </p>\n<p>OTOH, no one was imagining the bots to be graded for morality when the strategies were being coded in. </p>\n<p>On those grounds morality is different from utility, at least in this specific context.</p>\n]]>", "author": "Rahul", "published": "2014-06-23 17:40:35+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul #179: Yeah, I thought about that too; it&#8217;s a fair objection.  In our <i>particular</i> case, however, at least half of the bots we were testing (ALL_COOPERATE, ALL_DEFECT, RANDOM, almost anything dissimilar from TIT_FOR_TAT) weren&#8217;t particularly designed to maximize their scores either! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />   So then it seems to make just as make sense to ask about the morality of those bots, as to ask how they score.</p>\n]]>", "author": "Scott", "published": "2014-06-23 17:57:05+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I&#8217;m just trying to understand the eigendemocracy idea a bit better: So to strip down the concept to a bare minimum, say there were only three voters in a nation. On some issue two vote Yes and one No. </p>\n<p>So in a conventional democracy the outcome is a &#8220;Yes&#8221; decision. The interesting situations are only those where an eigentrust system will lead to a different result than  the conventional system.</p>\n<p><a href=\"https://chart.googleapis.com/chart?chl=+digraph+ethane+%7B%0D%0A%0D%0A1-%3E3%0D%0A2-%3E3%0D%0A%0D%0A1%5Bcolor%3Dgreen%5D%0D%0A2%5Bcolor%3Dgreen%5D%0D%0A3%5Bcolor%3Dred%5D%0D%0A+%7D%0D%0A++++++++&cht=gv\" rel=\"nofollow\"> Now imagine a situation where both Voter-1 and Voter-2 vote yes but point to Voter-3 in terms of trust. And voter-3 votes No.</a> Might this be the analog where the eigentrust  system concludes &#8220;No&#8221; even when the majority vote was an &#8220;Yes&#8221;?</p>\n<p>But if so, then adopting an eigentrust system is a conscious decision by the voter to intentionally dilute some of his own voting equity. Would voters do that?</p>\n<p>Further, why / how is this different than if we just allowed voters to transfer fractional parts of their voting rights to different people? Wouldn&#8217;t that be an identical system but without the complication of having to solve an eigenvalue problem?</p>\n]]>", "author": "Rahul", "published": "2014-06-23 19:02:33+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Whether PageRank is still useful&#8212;and by &#8220;still useful&#8221; I mean &#8220;continuing to be useful for ranking to this day&#8221;, not &#8220;useful despite not being ground truth&#8221;&#8212;may be an open question.  It&#8217;s only one of hundreds (maybe thousands) of features Google uses in its ranking algorithm, after all.  A number of IR people I talk to seem to suspect that it may not be used at all anymore, and that its main use these days is for public relations.  If that&#8217;s the case, before applying the idea to anything else we should ask when and why it stopped being useful.</p>\n]]>", "author": "lylebot", "published": "2014-06-23 19:24:36+00:00", "title": "By: lylebot"}, {"content": "<![CDATA[<p>First, I really enjoyed this! You earned a new follower for your blog. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n<p>But mathematically, I&#8217;m not quite satisfied. In your update on 6/20, you changed the definition of a moral person to include both time and knowledge. I think that&#8217;s a strong improvement, but it also seems to make the problem much more difficult computationally. Your claim that &#8220;linear algebra is used to unravel the definition’s apparent circularity&#8221; seems to gloss over some important problems.</p>\n<p>For one thing, we won&#8217;t have just a single matrix to describe each person&#8217;s interactions with every other person. Instead, we&#8217;ll have a separate matrix for every participant at every time step, describing what they know at that point in time about each of these interactions.</p>\n<p>Each participant can use linear algebra to compute their own belief at any given time about how moral each other person is. But is there really a simple way to compute the global solution describing how moral each person actually is? I haven&#8217;t tried working it out for myself on paper yet, but I don&#8217;t quite see it.</p>\n<p>The conditions for PageRank are that our matrix is connected and aperiodic. But it seems like we would need to have these conditions on each participant&#8217;s matrix as well. And then, what if they meet someone new and know absolutely nothing about them? It seems like any action could be justified by some prior belief.</p>\n<p>Or maybe we could add a new condition that you should always assume someone is moral until proven otherwise. Is that enough to fix the problem?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/j/Johnson:Timothy.html\">Timothy Johnson</a>", "published": "2014-06-23 22:51:01+00:00", "title": "By: Timothy Johnson"}, {"content": "<![CDATA[<p>I haven&#8217;t had time to sit down and carefully think this through, but I&#8217;d be interested to hear which criteria of Arrow&#8217;s Theorem eigendemocracy satisfies and which fail. Have you thought about this at all Scott and/or Tyler?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kagan:David.html\">David Kagan</a>", "published": "2014-06-23 23:19:20+00:00", "title": "By: David Kagan"}, {"content": "<![CDATA[<p>I was under the impression that mathematicians use a similar algorithm for judging whether something &#8220;is mathematics&#8221; (or the mathematical value of a problem); namely, its implications to and interconnection with other branches of mathematics.</p>\n<p>Which naturally leads to the question: is P != NP mathematics in the above sense?</p>\n]]>", "author": "GLGR", "published": "2014-06-24 01:47:30+00:00", "title": "By: GLGR"}, {"content": "<![CDATA[<p>As a workaday university mathematician, I usually think of applications of pagerank whenever the dean comes round: to citation metrics (good papers are those that are cited by other good papers) and to weightings of GPA (hard classes are the ones that only students who do well in other hard classes can do well in). </p>\n<p>Compared to eigenmorality, or for that matter links on the worldwide web, this stuff should be peanuts. All the data is already collected. Someone should do it! I&#8217;d do it myself, but I haven&#8217;t written a computer program since 1994, and anyway the machine I have now doesn&#8217;t run Borland C++.</p>\n<p>Of course, some might be afraid of a fred-like dystopia: once non-laughable citation metrics exist, evil and simple-minded deans will care only about metrics, ultimately to the detriment of mathematical progress.</p>\n]]>", "author": "Jim", "published": "2014-06-24 12:34:49+00:00", "title": "By: Jim"}, {"content": "<![CDATA[<p>An incentive scheme which could &#8220;suss out the truth&#8221; is TruthCoin, a bitcoin-like incentive scheme that rewards coins to those whose &#8220;votes&#8221; align with the &#8220;truth&#8221;/consensus. TruthCoin is an ongoing project: <a href=\"https://github.com/psztorc/Truthcoin\" rel=\"nofollow\">https://github.com/psztorc/Truthcoin</a></p>\n<p>The coin is probably the most important incentive scheme in history. The State itself shares its origin with the invention of coins. The problem in organizing a state was, how do you supply your army with food and weapons, without conscripting an additional military arm of farmers and craftsmen? The solution was to stamp coins and require subjects to pay taxes in those coins. Then by distributing the coins to the army, the citizens were incentivized to supply the army with goods (clothes, armor, weapons) and food, in exchange for coins.</p>\n<p>If history is a precedent, perhaps a p2p incentive scheme like &#8220;DemocracyCoin&#8221; or &#8220;FutarchyCoin&#8221; would be a stepping-stone to Hansonian utopia.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/d/Detrio:Casey.html\">Casey Detrio</a>", "published": "2014-06-24 16:07:08+00:00", "title": "By: Casey Detrio"}, {"content": "<![CDATA[<p>Is the implication that the incidence matrix for the entire internet is singular?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cook:Joshua.html\">Joshua Cook</a>", "published": "2014-06-24 20:12:04+00:00", "title": "By: Joshua Cook"}, {"content": "<![CDATA[<p>Jim  #186</p>\n<p>you might find this interesting, it&#8217;s close to<br />\nwhat you suggested:</p>\n<p><a href=\"http://en.wikipedia.org/wiki/Eigenfactor\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Eigenfactor</a></p>\n]]>", "author": "sf", "published": "2014-06-24 22:08:56+00:00", "title": "By: sf"}]