[{"content": "<![CDATA[<p>R.e. #1 &#8211; there&#8217;s really no substitute for doing homework and learning some of the math.</p>\n<p>I&#8217;m a biologist by training with a strong interest in information / complexity. Between high school and college, I received a solid math education that primarily taught me *how* to learn. I wasn&#8217;t an especially motivated math student, but I have used those foundations in calculus, set theory, geometry, and (especially) linear algebra throughout the rest of my career.</p>\n<p>I personally discovered that I love programming &#8211; i much prefer concrete problems in discrete math over theoretical math with pencils 🙂 So, the second recommendation is to find some sort of practice that you really enjoy, and seek out puzzles or problems to solve there.</p>\n<p>Finally, if you want to be a badass at something, do it every day for 6 months. Don&#8217;t feel too guilty if you miss a few days, but aim for 20+ minutes,  6 days a week. At the end of 6 months, you should have some sense of your own talent & continuing level of interest.</p>\n]]>", "author": "helingstay", "published": "2016-09-03 00:30:19+00:00", "title": "By: helingstay"}, {"content": "<![CDATA[<p>R.e. #2 &#8211; My purely partisan opinions 🙂</p>\n<p>&#8221; Should physicists avoid “Platonic” math ideas?&#8221;<br />\nDisagree.</p>\n<p>&#8220;Is [emergence] just a “word of the gaps” used by incomplete theories of complex systems? Or is it a scientifically justifiable term to use?&#8221;</p>\n<p>Very probably both.<br />\n* Like &#8220;sustainable&#8221;, &#8220;emergence&#8221; is used ambiguously, as is frequently given whatever meaning suits the individual using it.<br />\n* Nonetheless, a range of physical processes exhibit fundamentally different behaviors at different scales. I would argue that &#8220;emergence&#8221; is real, but we&#8217;re still not sure exactly what it is. </p>\n<p>A great reference on this topic is PW Anderson&#8217;s classic 1972 paper &#8220;More is Different&#8221;.<br />\n<a href=\"http://www.worldscientific.com/doi/pdf/10.1142/9789812385123_others01\" rel=\"nofollow\">http://www.worldscientific.com/doi/pdf/10.1142/9789812385123_others01</a></p>\n]]>", "author": "helingstay", "published": "2016-09-03 00:36:59+00:00", "title": "By: helingstay"}, {"content": "<![CDATA[<p>R.e. #3<br />\nI take issue with the assertion that &#8220;[consciousness is] only thing we can be absolutely certain exists&#8221;.  If you admit &#8220;absolute certainty&#8221; that consciousness exists, don&#8217;t you have to also admit certainty of all the observed constructs of consciousness? </p>\n<p>If not, what is it that you&#8217;re absolutely certain of?  If so, then prime numbers are just as &#8220;real&#8221; as consciousness, and basic properties of primes, like their spacing, seem about as difficult to explain as the origins of consciousness.  </p>\n<p>In short, I would argue the admittedly parsimonious position that:<br />\n* the world is big and complicated and, with very high probability, real;<br />\n* consciousness is one of many complex and difficult-to-explain real-world phenomena;<br />\n* consciousness is especially interesting to us because we&#8217;re conscious.</p>\n]]>", "author": "helingstay", "published": "2016-09-03 00:52:15+00:00", "title": "By: helingstay"}, {"content": "<![CDATA[<p>Avi #5: No, I don&#8217;t know of any computability analysis that grapples with the full intricacies of the Standard Model.  I think that would be great for someone to do.  (There&#8217;s a reason why I phrased my response as, &#8220;do you agree&#8230;?&#8221; rather than &#8220;the following paper shows&#8230;&#8221; 🙂 )</p>\n<p>There&#8217;s been recent progress on that issue: see in particular the paper of <a href=\"http://arxiv.org/abs/1111.3633\" rel=\"nofollow\">Jordan, Lee, and Preskill</a>, which shows how to simulate the &phi;<sup>4</sup> quantum field theory not only computably but in quantum polynomial time, as well as their <a href=\"http://arxiv.org/abs/1404.7115\" rel=\"nofollow\">extension to the fermionic case</a>.</p>\n<p>I think the overwhelming feeling is that the difficulties in getting from what&#8217;s been done to the full SM are technical rather than fundamental&#8212;having to do with the complexities of even defining the SM outside of perturbation theory and other limiting cases, rather than with any fundamental uncomputability in Nature itself.  Or to put it another way: if someone claimed tomorrow to have a proof that the SM lets you build a Zeno computer that solves the halting problem in finite time, I think any sane physicist&#8217;s first reaction would be to look for where the SM had been pushed beyond its range of validity or an unrealistic modeling assumption was made!</p>\n<p>Finally, even if we imagined for the sake of argument that the SM <i>did</i> have an uncomputable aspect, the parts of the SM that are relevant to everyday physics and chemistry, i.e. the parts that pretty much everyone besides Penrose and Hameroff consider relevant to brain function, would still be computable.</p>\n]]>", "author": "Scott", "published": "2016-09-03 01:08:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Robert #4: The article you link to has nothing to do with D-Wave (or rather, it mentions D-Wave only to contrast it with its real subject).  It&#8217;s about something extremely different, and which excites me personally a lot more: namely, the race to achieve &#8220;quantum supremacy&#8221;&#8212;i.e., a <i>clear, inarguable</i> quantum speedup, for a task <i>not necessarily of any commercial use.</i>  To achieve that milestone, you don&#8217;t want a thousand qubits of debatable quality that you don&#8217;t really understand: 40-50 qubits should be enough, but they need to be of extremely high quality.  As it happens, demonstrating quantum supremacy using a system of 40-50 qubits is exactly what John Martinis&#8217;s group at Google (not to be confused with D-Wave!), and several other groups around the world, are currently in a race to do.  And that&#8217;s what that article was about.</p>\n<p>My and my student&#8217;s paper, about some complexity-theoretic aspects of Martinis-style experiments, should be coming out fairly soon.</p>\n]]>", "author": "Scott", "published": "2016-09-03 01:17:32+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Amir Michail #6:</p>\n<ul>Are successful theoretical computer scientists capable of creating original puzzle games as compelling as Braid by Jonathan Blow? And if so, why don’t they try to do so?</ul>\n<p>Erik Demaine has created some pretty cool puzzle games.  I used to make puzzle games too when I was a kid, though I wouldn&#8217;t put mine up against anything made by professionals.</p>\n<p>But your comment ignored the much more natural and important question: namely, <b>are successful puzzle designers capable of proving theorems in computational complexity, as compelling as Toda&#8217;s Theorem?  if so, why don&#8217;t they try to do that?</b></p>\n]]>", "author": "Scott", "published": "2016-09-03 01:22:07+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Does quantum physics involve the universe keeping track of anything with infinite precision?  If our universe is a computer simulation and quantum physics is accurate and the simulation doesn&#8217;t use any hacks or shortcuts but accurately simulates everything would this computer need either infinite processing speed or memory even if the universe is spatially finite?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Miller:James.html\">James Miller</a>", "published": "2016-09-03 02:16:07+00:00", "title": "By: James Miller"}, {"content": "<![CDATA[<p>So here is what I think:</p>\n<p>Consciousness is eternal and is not created from the brain or from matter.</p>\n<p>There is no real thing as time, we just made it up.  The present moment is eternal. </p>\n<p>AND to top it all off, the present moment IS consciousness &#8211; they are the same thing.</p>\n<p>I&#8217;m not going to prove this because I don&#8217;t know how, but it is what I sincerely believe from intuition, and also science hasn&#8217;t proved it false.  Further it seems to make a lot of sense once you believe it.</p>\n<p>Scientists haven&#8217;t even really been able to define consciousness or the present moment in any widely accepted way because most scientists are looking at it backwards &#8211; matter doesn&#8217;t create consciousness.  Consciousness observes the universe in the eternal present moment.</p>\n<p>It&#8217;s not mystical or anything like that, it just makes sense.  Or at least it is just as reasonable as saying the big bang happened out of nothingness.</p>\n]]>", "author": "Mike", "published": "2016-09-03 03:11:05+00:00", "title": "By: Mike"}, {"content": "<![CDATA[<p>Is there any way to formalize the notion, implicit in complexity theory (and, perhaps less pervasively, in other areas of mathematics), that certain conjectures can have different probabilities of being true? Much of complexity theory revolves around conjectures that we <em>think</em> are true with various degrees of confidence, but are still conjectures (P != NP, P = BPP, UGC, etc.) Oftentimes, a result is important primarily because it is evidence in favor of another result being true (for example, proving that P=BPP if E requires exponential circuits). Statements of the form &#8220;The polynomial hierarchy probably doesn&#8217;t collapse to the second level&#8221; seem to make some intuitive sense. But what does &#8220;probably&#8221; really mean in this context?</p>\n<p>I guess it means something like &#8220;Mathematicians have explored enough of the platonic realm to have the expectation it is more likely we will discover (through further processing of the theorem-proving heuristic known as the mathematical community) that PH doesn&#8217;t collapse to the second level than that it does, given our current knowledge state and associated uncertainty.&#8221; But that wasn&#8217;t a very rigorous answer.</p>\n]]>", "author": "Ben", "published": "2016-09-03 04:03:15+00:00", "title": "By: Ben"}, {"content": "<![CDATA[<p>In the area of physics and information with practical effects that sometimes comes up here, does anyone have a hot take on Unruh radiation powering EmDrives?</p>\n]]>", "author": "keith", "published": "2016-09-03 04:05:05+00:00", "title": "By: keith"}, {"content": "<![CDATA[<p><a href=\"#comment-1312805\" rel=\"nofollow\">Scott 16</a>, this seems confused. The question of whether the standard model is computable depends on a prior question of whether it exists. Jordan-Lee-Preskill address the complexity of the perturbation coefficients. They are obviously computable, even for the full standard model. But if you try to use them to compute the φ⁴ theory, the sum diverges. So, if that’s your definition of φ⁴ theory, I can compute it in constant time. My understanding is that φ⁴ theory doesn’t actually exist. In fact, perturbation series blow up for every quantum theory. But some theories do exist. I’m not sure about QED, but QCD is widely believed to exist. Presumably lattice gauge theory converges and so the question just becomes whether the rate of convergence is computable. Physicists almost certainly know the rate, although maybe only empirically.</p>\n<p>Conceivably, a theory could be known to exist without its computability being known. Maybe this is the case with GR, although I am skeptical. Certainly, there are models of Newtonian mechanics which exist but are not computable. And maybe if you accept physics proofs, this is the state of QCD, but probably it is known by that standard to be computable.</p>\n]]>", "author": "Douglas Knight", "published": "2016-09-03 06:08:16+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>What if the universe is a mind with free will?  </p>\n<p>Physicists are like somebody trying to determine the assembly language instruction set for a computer without a manual by running small software experiments and carefully determining the instruction set, which for a computer will eventually succeed.</p>\n<p>But if the universe is a mind with libertarian free will the physicist will not succeed, the bigger mind of the universe can throw a wild curve ball the smaller mind of the physicist aided with all his computers could never predict.</p>\n<p>I think if the universe were a computer it would it be freezing, crashing and resetting and the universe could have never grown so big.</p>\n<p>I think the universe has to be a mind to understand what is happening and to take action to solve problems and ensure its continuing expansion.</p>\n<p>Atheists will say there is no evidence that the universe is controlled by a mind, but we have no theory of mind and therefore there is no theoretical evidence that indicates a mind couldn&#8217;t control a universe.</p>\n<p>Atheism or naturalism may be holding back the theory of mind and physics which incorporates mind theory.</p>\n<p>Is naturalism holding back physics, mind theory, and angering the universe because it&#8217;s objectifying her?</p>\n]]>", "author": "Anonymous Mind", "published": "2016-09-03 07:47:57+00:00", "title": "By: Anonymous Mind"}, {"content": "<![CDATA[<p>Matt #1: I second Vim #12&#8217;s opinion. Write a simulator. Explaining things to a computer is a way to force yourself to understand, and a great way to catch mistakes you didn&#8217;t realize you were making.</p>\n<p>Also, once you have your simulator, you have a useful tool for understanding papers. Instead of just reading the paper, you can ask yourself &#8220;how could I get this same result in my simulator?&#8221;, and the translation effort will give you insights into the paper.</p>\n<p>For example, last year there was that &#8220;Quantum Pigeonhole&#8221; paper. Pop-science articles said some ridiculous things about it. The *authors* said some ridiculous things about it. So I tried to translate the paper into a quantum circuit in my toy simulator Quirk (here&#8217;s the circuit in Quirk: <a href=\"http://bit.ly/2bSNBKf\" rel=\"nofollow\">http://bit.ly/2bSNBKf</a> ). Then I tried to figure out what the circuit was doing. Turns out it&#8217;s just a kind of Bell test based on the fact that a parity measurement will entangle two qubits, that your task is to reverse that parity despite not knowing which two qubits had become entangled, that rotating both qubits by 90 degrees would do the trick, and that qubits that weren&#8217;t entangled would be unaffected by that rotation so you could just hit every qubit with it.</p>\n]]>", "author": "Craig Gidney", "published": "2016-09-03 09:39:28+00:00", "title": "By: Craig Gidney"}, {"content": "<![CDATA[<p>@Scott #16</p>\n<p>>> defining the SM outside of perturbation theory<br />\nThe SM is actually ill-defined, which becomes clear at high enough energies.</p>\n<p>But the phi^4 model suffers from the triviality problem, .i.e. a non-perturbative treatment shows that it is equivalent to a free, non-interacting theory.</p>\n<p>So it is not clear that Preskil&#8217;s phi^4 result carries over to the SM imho.</p>\n]]>", "author": "wolfgang", "published": "2016-09-03 09:42:14+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>will sha3 be broken in your lifetime?</p>\n]]>", "author": "John the Scott", "published": "2016-09-03 10:41:25+00:00", "title": "By: John the Scott"}, {"content": "<![CDATA[<p>Ben #21: Scott  has tried to construct such an argument in the past, see <a href=\"http://www.scottaaronson.com/blog/?p=1720\">The Scientific Case for P≠NP</a>. That way of using Bayesian reasoning <a href=\"http://philosophy.stackexchange.com/questions/10356/how-is-bayesian-reasoning-related-to-the-scientific-method\" rel=\"nofollow\">felt somewhat dubious to me</a>, and especially less convincing than his previous take on the same subject titled <a href=\"http://www.scottaaronson.com/blog/?p=122\">Reasons to believe</a>.</p>\n<p>I admit that I dislike frameworks which try to reduce our state of knowledge about a given proposition to a single real number, especially Cox&#8217;s theorem, which tries to interpret Bayesian probability as a sort of unique generalization of logic.</p>\n<p>I recently read &#8220;Die Mathematik des Daseins&#8221; by Rudolf Taschner with the subtitle &#8220;Eine kurze Geschichte der Spieltheorie&#8221;. I realized that probability theory was invented in the context of playing games, that game theory itself depends crucially on probability to represent facts like that my opponent can&#8217;t read my mind. And game semantics in logic can simplify understanding some apparent paradoxes. I wonder whether it would be a good idea to teach the basics of game theory and probability theory together, because it could help to redirect interpretation questions to fruitful questions about modeling assumptions and reasonable idealizations. And it would allow to put Bayesian reasoning into a context where its assumptions can still be reasonably judged, without forcing it into a too narrow framework (like frequentism).</p>\n]]>", "author": "gentzen", "published": "2016-09-03 12:49:19+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p><strong>The Simulation Agument</strong></p>\n<p>A lot of people accept that the simulation argument entails we are likely living in a simulation, including many physicists. However, many such people aren&#8217;t knowledgeable in computational complexity theory, which I think entails that we <a href=\"https://www.reddit.com/r/philosophy/comments/4yy9gi/why_it_is_logically_impossible_to_prove_that_we/d6s4nlj\" rel=\"nofollow\">cannot be living in a simulation</a>, and that in fact, that humanity will never reach this &#8220;posthuman&#8221; stage.</p>\n<p>Does you think computational complexity determine which outcome is most likely in <a href=\"http://www.simulation-argument.com/simulation.html\" rel=\"nofollow\">Nick Bostrom&#8217;s simulation argument</a>? Bostrom has to basically argue for new physics that would seem to violate much of what we know in order to avoid complexity bounds that quickly grow out of control.</p>\n<p><strong>Quantum Foundations</strong></p>\n<p>Scott, no local hidden variable theories? Not even &#8220;serious&#8221; ones like &#8216;t Hooft&#8217;s work on QM via cellular automata? 😉</p>\n<p>Kidding aside, I was also going to ask what people consider the most promising or interesting approaches to quantum foundations since I like reading unique and unorthodox conceptualizations of our world. Theories that are obviously already ruled out by experiment don&#8217;t apply.</p>\n<p>For instance, the work on deriving QM from information theoretic principles looks very promising, and might yield some interesting insights. I think &#8216;t Hooft&#8217;s work is interesting for similar reasons, as the first serious look at superdeterminism and what is the precise character of the &#8220;global conspiracy&#8221;.</p>\n<p>Some more fringe examples might be retrocausal-like theories, such as <a href=\"https://www.reddit.com/r/Physics/comments/1gjekn/the_logic_of_quantum_mechanics_derived_from/\" rel=\"nofollow\">The Logic of Quantum Mechanics Derived from Classical General Relativity</a>.</p>\n<p>Another fringe example would be something like <a href=\"http://link.springer.com/article/10.1007%2Fs11467-009-0080-0\" rel=\"nofollow\">Stochastic Electrodynamics with Spin (SEDS)</a>. Their stance on Bell&#8217;s theorem and similar experiments isn&#8217;t clear, but their paper provides a firm prediction that differs from orthodox QED, so at least it&#8217;s real, falsifiable science.</p>\n<p>There are also <a href=\"https://arxiv.org/ftp/arxiv/papers/1108/1108.1674.pdf\" rel=\"nofollow\">some</a> interesting <a href=\"http://arxiv.org/abs/0903.2211\" rel=\"nofollow\">variations</a> on <a href=\"https://arxiv.org/pdf/1410.5653.pdf\" rel=\"nofollow\">many worlds</a> that allegedly address some shortcomings of existing approaches.</p>\n<p>One aspect that I always look for in an interpretation is whether it can naturally explain the source of the speedup in quantum computation, so bonus points for those!</p>\n<p>So, anyone know of any new ideas?</p>\n]]>", "author": "Sandro", "published": "2016-09-03 14:06:08+00:00", "title": "By: Sandro"}, {"content": "<![CDATA[<p>Weird question: are there any instances in computer science where we have an algorithm that solves some class of problems efficiently iff such problems can be solved efficiently at all, but where we can&#8217;t prove that the class of problems can be solved efficiently?</p>\n<p>If not, is there a reason such a scenario is impossible?</p>\n]]>", "author": "James B.", "published": "2016-09-03 14:08:08+00:00", "title": "By: James B."}, {"content": "<![CDATA[<p>Sandro #29: My own version of the so-called simulation argument goes like this:</p>\n<p>&#8220;If there was much more simulated habitable space than real habitable space, then it would be much more likely that we are living in a simulation than in a real world.&#8221;</p>\n<p>However, the presumption that we should more simulated habitable space than real habitable space, is highly speculative. At this moment, we have no idea at all about the amount of resources that would be required to simulate a habitable space of a certain size. If simulations are prohibitively expensive, the whole presumption might turn out to be wrong.</p>\n]]>", "author": "Robert Mller", "published": "2016-09-03 15:50:28+00:00", "title": "By: Robert Müller"}, {"content": "<![CDATA[<p>James #30: yes! There is even such an algorithm (by Levin) that solves any NP problem in polynomial time iff P=NP.</p>\n]]>", "author": "Adam S", "published": "2016-09-03 16:00:06+00:00", "title": "By: Adam S"}, {"content": "<![CDATA[<p>Scott &#8211; not exactly on topic, but I&#8217;d love to know your thoughts on living in Austin (and even more what your thoughts are after doing it for six months or so, when that rolls around.)</p>\n<p>How are the mechanics of living there?  Is getting around terrible? Do you spend a lot of time in traffic (I&#8217;ve heard a few horror stories)? Are locals nice?</p>\n]]>", "author": "Andrew", "published": "2016-09-03 16:09:48+00:00", "title": "By: Andrew"}, {"content": "<![CDATA[<p>Re; Jon K @ #2, &#8220;what are people’s thoughts about digital/finite/discrete theories of physics?&#8221;</p>\n<p>My opinion, worth what you paid for it of course, is that calculus is a very useful approximation to discrete systems which have very small increments, but whether any part of this universe actually has infinite continuity is unproven. Meanwhile, every actual calculation we make in engineering or science uses discrete arithmetic, since  every digital computer has a minimum floating-point value from which all other floating-point values are composed, and every analog computer, such as my old slide rule, also only uses a finite number of digits due to measurement uncertainty.</p>\n<p>Also, we know that in discrete systems differential equations become finite-difference equations, with similar methods and types of solutions.</p>\n<p>In engineering for example we can make calculations of girders using the differential equations of the theory of elasticity and get realistic answers, despite the fact that girders are not infinitely continuous (nor homogeneous), being composed of grains which are composed of atoms.</p>\n<p>Finally, I think Zeno&#8217;s Paradox remains unanswered, except by discrete rather than continuous motion. I read a book whose premise was that the development of calculus answered Zeno, but it did not convince me. In calculus, the limit process is used to evaluate infinite series and infinitesimals divided by infinitesimals, so it is not necessary to physically complete the process (e.g., physically add up an infinite number of terms). That is a fine way to proceed mathematically, but I am not convinced that nature is a mathematician, and does not have to physically process all the terms.</p>\n]]>", "author": "JimV", "published": "2016-09-03 16:35:24+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>@Douglas #23</p>\n<p>>> I’m not sure about QED</p>\n<p>QED suffers from the Landau pole at very high energies.</p>\n<p>QCD is the only part of the S.M. which seems to exist, due to asymptotic freedom, but I don&#8217;t know if the Preskill et al. result applies there &#8230;</p>\n]]>", "author": "wolfgang", "published": "2016-09-03 17:03:26+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>James #30: Adam #32 already beat me to it, but yes, there&#8217;s an extremely famous example of <i>exactly</i> that.  Namely, Levin&#8217;s algorithm that attempts to find solutions to an NP-complete problem by dovetailing over all possible algorithms, halting when and only when one of them outputs a solution that checks out.  This algorithm, which you could code up today, finds satisfying assignments in polynomial time iff P=NP (though with a rather impractical constant factor, to put it mildly).</p>\n<p>Indeed, what&#8217;s surprising to me is that someone could have the thought you had abstractly, <i>without</i> knowing about Levin&#8217;s example!</p>\n]]>", "author": "Scott", "published": "2016-09-03 17:15:52+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>James Miller #19:</p>\n<ul>Does quantum physics involve the universe keeping track of anything with infinite precision? If our universe is a computer simulation and quantum physics is accurate and the simulation doesn’t use any hacks or shortcuts but accurately simulates everything would this computer need either infinite processing speed or memory even if the universe is spatially finite?</ul>\n<p>These are profound questions that interest me greatly&#8212;but I fear that your innocent-looking phrase &#8220;doesn&#8217;t use any hacks or shortcuts&#8221; does more work than you bargained for!  E.g., what if there were an algorithm that calculated quantum transition amplitudes perfectly, but just happened to be faster and/or more space-efficient than the obvious algorithm?  (Hint: depending on exactly what you mean, there are. 🙂 )  Would that count as a &#8220;hack or shortcut&#8221;?</p>\n<p>Or more to the point: what if the algorithm promised to calculate all the amplitudes to within a precision &epsilon;>0, which can easily be made as small as desired (for example, if you could get precision &epsilon; with log(1/&epsilon;)<sup>O(1)</sup> overhead)?  By your lights, is that a &#8220;hack or shortcut&#8221;?  In modern theoretical computer science, we&#8217;d more often define it as just &#8220;solving the problem.&#8221;</p>\n<p>FWIW, my own perspective is that, if you don&#8217;t think that a classical probabilistic computer &#8220;requires infinitely many bits to simulate&#8221; (because probabilities are real numbers), then you shouldn&#8217;t think that about a quantum computer either.  In both cases, the key point is that the probabilities or amplitudes evolve in a norm-preserving linear way&#8212;and for that reason, no one could possibly tell the difference if they were off by some tiny &epsilon;.  And even if they&#8217;re <i>not</i> off by some tiny &epsilon;, the mere fact that we couldn&#8217;t know even in principle if they were, makes it not too useful to think of probabilities or amplitudes as &#8220;storing an infinite number of bits.&#8221;</p>\n]]>", "author": "Scott", "published": "2016-09-03 17:31:37+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>How much of professional math is easy?  Famously, according to Barbi, Math is Hard (I couldn&#8217;t resist).  And of course, CPA work, acxtuarial science, and much engineering calculation qualifies as easy.  But according to Goedel, some math is not only difficult, but impossible. Recently Hamkins and Miasnikov have shown that most (but not all) Turing computable math is easy, in a well defined sense.<br />\nI think I once learned that proving even the most complicated theorem can be broken down to (many) simple steps.  (Is this true?)   There is also Harvey Friedman&#8217;s grand conjecture that suggests that much of Math is easy in another well defined sense. If we had an AI math reader which would read professional math journals and translate them sentence by sentence from an English like language to a fully formal language, what percentage of sentences would be easy in either the Friedman sense or the  Hamkins-Miasnikov sense? What percentage of the sentences would the reader be able to translate?<br />\nIs  a math logic system as good as current computer algebra systems possible?  Would anyone use it?<br />\nTIA Jim Graber</p>\n]]>", "author": "James Graber", "published": "2016-09-03 17:15:30+00:00", "title": "By: James Graber"}, {"content": "<![CDATA[<p>hi SA congrats on your dramatic move & it will be very interesting to hear about your new adventures/ exploits in this entirely new environment. was a bit stunned to hear of your move from MIT given how long youve been there, thought you might stay a long time & couldnt quite follow all your reasoning for leaving, but it was interesting to read.</p>\n<p>this new paper by tenev/ horstemeyer caught my eye, thought it was a very cool approach & near to one have been grasping at for a long time, seems groundbreaking to me. wondering what anyone else thinks. would be interested to discuss it at length in stackexchange chat room for any takers.</p>\n<p><a href=\"https://arxiv.org/abs/1603.07655\" rel=\"nofollow\">https://arxiv.org/abs/1603.07655</a><br />\nThe Mechanics of Spacetime &#8211; A Solid Mechanics Perspective on the Theory of General Relativity</p>\n<p>SE chat room hangout/ transcripts<br />\n<a href=\"http://chat.stackexchange.com/rooms/9446/theory-salon\" rel=\"nofollow\">http://chat.stackexchange.com/rooms/9446/theory-salon</a></p>\n<p>G #28: physics and math have dramatically different concepts of probability in some ways. share your initial dubiousness/skepticism on analysis of the &#8220;probability&#8221; of math problems such as P vs NP. an interesting case study is collatz which has been proven for seeds up to ~2^60 but in some ways, & strikingly, this cannot really be regarded as evidence of anything.</p>\n]]>", "author": "vzn", "published": "2016-09-03 17:17:50+00:00", "title": "By: vzn"}, {"content": "<![CDATA[<p>@Calcott #3.  Reminds me of the old saw, &#8220;If the brain were any simpler, we wouldn&#8217;t understand it; if the brain were any more complex we wouldn&#8217;t understand it.&#8221;</p>\n<p>Understanding requires a complex brain as subject; but a complex brain as object thwarts our understanding it.  We live in the sweet spot between those two extremes, I think.</p>\n<p>The discoverability of the universe is one of those gifts that to me only makes sense because G-d created us imago dei.</p>\n]]>", "author": "Gene Chase", "published": "2016-09-03 17:29:18+00:00", "title": "By: Gene Chase"}, {"content": "<![CDATA[<p>Adam #32: thanks, good to know things are just as strange as they could be.</p>\n<p>Scott #36: I&#8217;m a physicist with a maths background; weird edge cases come naturally.</p>\n]]>", "author": "James B.", "published": "2016-09-03 17:31:48+00:00", "title": "By: James B."}, {"content": "<![CDATA[<p>Scott, OK, I guess you mentioned said everything I said, but it seems to me that the question of whether QED exists, whether there is some number you are trying to compute, is a fundamental problem, not &#8220;technical.&#8221;</p>\n<p><a href=\"#comment-1313293\" rel=\"nofollow\">Wolfgang 35</a>, my understanding is that the pole goes away when QED is coupled to QCD. Nor is there a pole when you add in the weak force, but it returns with the Higgs field.</p>\n<p>Though I don&#8217;t know how much not having a pole buys you. Is it just removing an obstacle, or does it yield certainty that the model exists? Is there an actual algorithm? Does the coupled theory have asymptotic freedom?</p>\n<p>Nor do I know how bad is a pole. My memory is that it&#8217;s not as bad as the problem with φ⁴ theory. A lot of people insist that QED really does exist. But other people agree that the pole is fatal. I&#8217;m pretty sure that no one has a method of calculation.</p>\n]]>", "author": "Douglas Knight", "published": "2016-09-03 18:28:18+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<blockquote><p>Is there any way to formalize the notion, implicit in complexity theory (and, perhaps less pervasively, in other areas of mathematics), that certain conjectures can have different probabilities of being true?</p></blockquote>\n<p>This idea is known as &#8220;logical probability&#8221;, and I don&#8217;t believe anyone&#8217;s come up with a way of truly making sense of the notion.  It&#8217;s something the people at MIRI have been doing a lot of work on, though.</p>\n<p>Also, <a href=\"https://windowsontheory.org/2015/10/01/a-different-type-of-pseudo/\" rel=\"nofollow\">here&#8217;s</a> an old Boaz Barak blog post on the matter.</p>\n]]>", "author": "Sniffnoy", "published": "2016-09-03 18:51:59+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<blockquote><p>How much of professional math is easy?</p></blockquote>\n<p>Related question: How much low-hanging fruit is there out there?  Because I&#8217;ve managed to find more than I would have expected.  Like recently I&#8217;ve been doing some work on various fairly-natural operations on ordinals &#8212; how to do computations on them in Cantor normal form, what identities and inequalities they satisfy &#8212; and there&#8217;s quite a bit of it that has been surprisingly easy, and yet, as best I can tell, just hasn&#8217;t been done before.  And sure, this isn&#8217;t exactly my area, I&#8217;m not a set theorist, but I&#8217;ve done my searching (and one of my papers on this topic has been accepted for publication, so!).  I don&#8217;t really know what to make of it.  I recall one person suggested in response to this, well, there&#8217;s just not really a lot of set theorists.  Possible, I suppose.  But yeah, I don&#8217;t know what to make of it.</p>\n]]>", "author": "Sniffnoy", "published": "2016-09-03 19:38:39+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>@Douglas #42</p>\n<p>>> when QED is coupled to QCD</p>\n<p>I am not sure what you mean by that. There are strongly interacting particles which carry an electric charge as well,<br />\nbut leptons (e.g. electrons) do not interact via QCD.</p>\n]]>", "author": "wolfgang", "published": "2016-09-03 20:32:22+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Sniffnoy #44: In assessing your comment, it might be relevant for other readers to know that you have a PhD in math.  So, yes, there&#8217;s plenty of low-hanging fruit in math that you can do and that&#8217;s never been done before &#8230; <i>especially</i> if you&#8217;re a mathematician. 🙂</p>\n]]>", "author": "Scott", "published": "2016-09-03 20:45:06+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Andrew #33:</p>\n<ul>not exactly on topic, but I’d love to know your thoughts on living in Austin</ul>\n<p>So far, the good:</p>\n<p>&#8211; We have a beautiful house a short walk from campus<br />\n&#8211; Colleagues and students in the CS department are great<br />\n&#8211; Lots of enthusiasm about quantum computing across campus (more than I expected); our first quantum group meetings were packed<br />\n&#8211; Even though there&#8217;s no longer Uber or Lyft in Austin, RideAustin and the other competing services seem to work just fine<br />\n&#8211; Amazing gym and pool near the CS building</p>\n<p>The bad:</p>\n<p>&#8211; The #1 drawback so far has been the bureaucracy of a state university.  I don&#8217;t want to go into details right now, but suffice it to say: UT faculty put up with stuff that wouldn&#8217;t have been tolerated for a nanosecond at MIT.  The good news, though, is that the CS department is filled with smart, sane, competent people, who do what they can to help shield the CS faculty from the university bureaucracy.</p>\n<p>&#8211; Our first week here, it was 103-degree heat.  The second week was torrential downpour.  Now it&#8217;s pretty nice though, &#8220;merely&#8221; getting up into the 90s.  (And of course the winter will be super mild.)</p>\n<p>&#8211; Insects.  Even though our house is brand-new, we share it with numerous cockroaches and other more exotic species.  More a problem for Dana than for me though. 🙂</p>\n]]>", "author": "Scott", "published": "2016-09-03 21:05:08+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>To clarify my question a little bit: Pretty much all of computer complexity theory deals with how hard a problem is and there are many layers of hardness, but I am interested in the easy problems, which in my mind occupy only the bottom most rung or possibly two on the complexity hierarchy. Or also perhaps even below that. That suggests another question: what constitutes the bottom most rung of the complexity hierarchy?<br />\nI am thinking, pretty much linear, not even polynomial.</p>\n]]>", "author": "James Graber", "published": "2016-09-03 20:50:22+00:00", "title": "By: James Graber"}, {"content": "<![CDATA[<p>James Graber #47:</p>\n<ul>what constitutes the bottom most rung of the complexity hierarchy?  I am thinking, pretty much linear, not even polynomial.</ul>\n<p>You&#8217;re not thinking nearly small enough!  You can go way below linear time: for starters, there&#8217;s logarithmic time, and even constant time (though such classes are very model-dependent).  Then there&#8217;s NC<sup>0</sup>, where each bit of the output can depend on at most O(1) bits of the input, as well as the set of linear transformations (which are often used in place of polynomial-time reductions in algebraic complexity theory).</p>\n<p>And if you wanted to go even smaller, well &#8230; the empty set of functions?  The set containing only the identity function? 🙂</p>\n]]>", "author": "Scott", "published": "2016-09-03 21:48:39+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #48: &#8220;Even though there’s no longer Uber or Lyft in Austin, RideAustin and the other competing services seem to work just fine.&#8221;</p>\n<p>An interesting take on Uber and its replacements in Austin: <a href=\"http://www.huffingtonpost.com/dean-baker/will-uber-go-unter_b_11396046.html\" rel=\"nofollow\">http://www.huffingtonpost.com/dean-baker/will-uber-go-unter_b_11396046.html</a></p>\n]]>", "author": "Warren", "published": "2016-09-03 22:38:56+00:00", "title": "By: Warren"}, {"content": "<![CDATA[<p><a href=\"#comment-1314054\" rel=\"nofollow\">Wolfgang</a>, yes, but. I think you know exactly what I mean and just don&#8217;t believe me.</p>\n]]>", "author": "Douglas Knight", "published": "2016-09-03 22:47:24+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Finding the 3D shape of a protein knowing only its amino acid sequence is a NP-complete problem (I think, correct me if I&#8217;m wrong) and yet a cell can figure out the correct shape in about a second. So in principle could a quantum computer do the same thing? Could the 50 qubit quantum computer Google hopes to have by the end of next year do it?</p>\n]]>", "author": "John K Clark", "published": "2016-09-04 00:52:21+00:00", "title": "By: John K Clark"}, {"content": "<![CDATA[<p>John Clark #52: There&#8217;s a lot to unpack in what you asked!</p>\n<p>(1) Yes, reasonable formalizations of protein-folding are NP-complete.</p>\n<p>(2) But that fact seems to have very little to do with why protein-folding is hard for computers.  Rather, it&#8217;s hard because of the large &#8220;constant-factor overhead&#8221; in simulating complicated molecules.</p>\n<p>(3) After all, if finding the globally-optimal folding configuration required a vast combinatorial search, then Nature couldn&#8217;t do it either!  Nature just blindly iterates forward the equations of physics.  So if nothing else, and ignoring the constant-factor overheads, one could predict what folding configuration Nature was going to find (not necessarily the &#8220;optimal&#8221; one) by just putting those same equations onto a computer.  (A quantum computer, but fine.)</p>\n<p>(4) It&#8217;s not thought that quantum computers can solve NP-complete problems in polynomial time.  (See this blog&#8217;s masthead!)  Thus, if the practical difficulty of protein-folding came from its being NP-complete, then we probably couldn&#8217;t expect quantum computers to help much.</p>\n<p>(5) OK, but as I said, the practical difficulty of protein-folding probably <i>doesn&#8217;t</i> come from its being NP-complete.  And indeed, to whatever extent quantum effects are relevant in protein-folding, to that extent, a quantum simulation really might be expected to help.</p>\n<p>(6) As far as I understand, it&#8217;s a matter of some dispute how relevant quantum effects really are to protein-folding dynamics.  And partly because of that, we don&#8217;t really know yet how much a QC would help with the problem.</p>\n<p>(7) In any case, unfortunately, the 40- or 50-qubit devices that the Martinis group is currently trying to build would almost certainly be much too small to do anything with protein-folding.</p>\n<p>(8) Having said that, it&#8217;s not absurd to think about using small, non-universal QCs for chemistry!  A <a href=\"https://arxiv.org/abs/1605.03590\" rel=\"nofollow\">recent analysis</a> by the Microsoft Quarc group concluded that ~100 qubits might already be enough to learn something new about nitrogen fixation in the Haber process, something of great importance to the fertilizer industry.</p>\n<p>Anyway, hope that clarifies things. 🙂</p>\n]]>", "author": "Scott", "published": "2016-09-04 02:29:59+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>R.e. #52 &#8211; some biology</p>\n<p>&#8220;Finding the 3D shape of a protein knowing only its amino acid sequence is a NP-complete problem (I think, correct me if I’m wrong) and yet a cell can figure out the correct shape in about a second.&#8221;</p>\n<p>I worked in a protein NMR structure lab as an undergraduate. So, I&#8217;m not an expert, but have some background in this questions, and find it very interesting.</p>\n<p>The question implies a single canonical answer, presumably based on energy minimization.  This is formalized as Anfinsen&#8217;s dogma: <a href=\"https://en.wikipedia.org/wiki/Anfinsen&#039;s_dogma\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Anfinsen&#039;s_dogma</a></p>\n<p>I see this as the &#8220;algorithmic&#8221; version of the problem, which is the question that Scott presumably answered, and to which I have nothing to add 🙂</p>\n<p>However, from the real-world systems perspective, there are two important facts to keep in mind:</p>\n<p>* First, Anfinsen&#8217;s dogma isn&#8217;t really dogma. Of course, AA sequence is the *main* determinant of structure, but there may well be many locally stable configurations, and biological systems commonly use configurations that are not globally stable.  A great example of this is prions, which are non-functionally folded proteins, where fold configuration itself is infectious: <a href=\"https://en.wikipedia.org/wiki/Prion\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Prion</a></p>\n<p>Cells deal with the folding problem in part by using chaperones. This means the folding problem depends on a network of other complex molecules, each with their own complex structure & dynamics.  Also, the cell conditions can vary, including temperature to solute concentrations &#8211; sodium, chloride, calcium, magnesium, glucose, AMP, ATP, etc., an issue that Anfinsen&#8217;s dogma punts on (&#8220;at the environmental conditions&#8221;).  All of these are regulated by the cell, and have some effect on the energetics of the fold, as well as the chaperone. The extent to which within-cell environmental variation affects fold energetics is an interesting question in and of itself, and could potentially shed light on homeostasic constraints (i.e., how organisms regulate their internal environment).</p>\n<p>* Second, the *functional* structure of a protein in real-world systems is often probabilistic.  The majority of biological proteins are, at least in part, in an aqueous solution at approx room temperature.  In many cases, thermal vibration matters, and is critical to protein function.  Case in point: in the biology literature, protein structures have historically been determined by two predominant methods: x-ray crystallography and nuclear magnetic resonance (NMR).  The hard part of crystallography is growing a crystal.  Once that&#8217;s done, inferring a structure is &#8220;easy&#8221; &#8211; you just x-ray it!  NMR structure determination relies on the signals generated by lots of inter-nuclear interactions, and is a bit like a game of Sudoku.  NMR has a critical advantage, though, in that it provides information about the structure *in solution*, which is more biologically relevant.  Part of NMR&#8217;s unique information is what parts of the protein are more or less mobile, which can determine functionality.</p>\n<p>That said, as a biologist, I&#8217;m very excited about the potential of QC in chemistry, as per Scott&#8217;s comments. Immunology in general, and vaccine design in specific, would greatly benefit from &#8220;structural computability&#8221;, even if imperfect.</p>\n]]>", "author": "helmingstay", "published": "2016-09-04 09:12:39+00:00", "title": "By: helmingstay"}, {"content": "<![CDATA[<p>Are there any completeness proofs (i.e. Problem X is NP-complete) other than Cook&#8217;s Theorem that do not rely on reductions? That is, are there any known NP-complete problems that have proofs that do not rely on reductions other than SAT and 3SAT?</p>\n]]>", "author": "Christopher", "published": "2016-09-04 09:56:24+00:00", "title": "By: Christopher"}, {"content": "<![CDATA[<p>Question(s):<br />\nI&#8217;ve been reading &#8220;Gödel&#8217;s Proof&#8221; by Nagel and Newman, which got me wondering about the formal connection between Gödel&#8217;s incompleteness theorems and Turing&#8217;s stopping problem proof.  I read through your very nice PHYS771 lecture notes (<a href=\"http://www.scottaaronson.com/democritus/lec3.html\" rel=\"nofollow\">http://www.scottaaronson.com/democritus/lec3.html</a>), where you state that &#8220;once you have Turing&#8217;s results, Gödel&#8217;s results fall out for free as a bonus&#8221;.</p>\n<p>As a non-mathematician, the proof method of &#8220;reflective recursion&#8221; (is there a better term?) appear similar between the two.  Is this an over-simplification on my part, or is there, in fact, a formal correspondence between the two?  Has this proof method proven useful since Turing?</p>\n<p>Finally, is it accurate to say that Turing&#8217;s results are a generalization of Gödel&#8217;s results? I get that Turing&#8217;s results prove Gödel&#8217;s gratis, but is it fair to say that there is some sort of &#8220;injective mapping&#8221; from Gödel&#8217;s proofs to Turing&#8217;s proof?</p>\n<p>Thanks!</p>\n]]>", "author": "helmingstay", "published": "2016-09-04 10:05:41+00:00", "title": "By: helmingstay"}, {"content": "<![CDATA[<p>vzn #38: Interesting, the fact that all zeros of the zeta function computed so far had imaginary part 0.5 feels like strong evidence in favor of the Riemann hypothesis to me, which still gets stronger as more zeros get computed and checked.</p>\n<p>But for the Collatz hypothesis, the same effort invested into checking it for specific cases doesn&#8217;t seem to carry a similar weight to me. My intuition could be wrong of course, but maybe it would be possible to identify a property of the problem itself, which explains why the fact that  collatz has been proven for seeds up to ~2^60 cannot really be regarded as evidence of anything.</p>\n<p>Even before Fermat Last Theorem was proven, the fact that it had been proven for so many n&#8217;s individually, and that the lowest n for which it was still unproven was so big, felt like very strong evidence that FLT should be true.</p>\n<p>So if I really belief in my proposal to interpret such “logical probabilities” (as they were called by Sniffnoy #43) by replacing interpretation of probabilities by modeling assumptions and reasonable idealizations in game theory, then I should try to come up with a way to make sense of those differences in the context of that framework.</p>\n<p>I remembered that Scott has actually tried to come with a reasonable proposal to clarify the &#8220;problem of induction&#8221; before, i.e. a way to explain its effectiveness at making correct predictions. It is in section &#8220;7 PAC-Learning and the Problem of Induction&#8221; of his <a href=\"http://www.scottaaronson.com/papers/philos.pdf\" rel=\"nofollow\">Why Philosophers Should Care About Computational Complexity</a> article, about which he also <a href=\"http://www.scottaaronson.com/blog/?p=735\">blogged</a>. I will also have to check whether his proposal allows to make sense of those differences.</p>\n]]>", "author": "gentzen", "published": "2016-09-04 14:50:35+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>Question: How advanced is complexity theory today really?</p>\n<p>In other areas of math it took many decades to find solutions to central problems. And once found, the solutions were often not too hard to understand and teach. In set theory for example it was an open question for many years wether the first inaccessible cardinal could already be measurable. Once the right technique was invented (ultrapowers) the proof that this is not the case (and much more) was almost trivial. Or take the independence of the continuum hypothesis. Once the right technique was invented, such proofs were relatively easy. Today these things are taught in introductory courses in set theory.</p>\n<p>Do you expect that we will see a similar thing with the open questions in complexity theory in the future? CT is still quite a young field. Is CT today where set theory was 1950? What do you think? Do you expect that someday in the future there will be a higher level machinery available, that makes proofs of P!=NP and similar assertions relatively easy such that they may even be taught in regular CS courses? Or do you expect a future proof of P!=NP will be insanely hard to understand (takes years to verify) similarly to the alleged proof of the abc conjecture?</p>\n]]>", "author": "Gerald", "published": "2016-09-04 15:56:43+00:00", "title": "By: Gerald"}, {"content": "<![CDATA[<p>Related to several comments: at what scale (e.g. physical length) do the Navier-Stokes equations cease to be an accurate description on fluid behavior? This is a question which can be answered by experiment.</p>\n<p>Perhaps related: maybe the Clay Millennium prize does not ask the best/most relevant question?</p>\n]]>", "author": "JeanTate", "published": "2016-09-04 16:02:08+00:00", "title": "By: JeanTate"}, {"content": "<![CDATA[<p>@Douglas #51</p>\n<p>Actually I am not sure what you mean, but let me try to be as clear as I can:</p>\n<p>The S.M. consists basically of QED/electroweak , QCD and (semi)classical gravity plus the fermionic matter.</p>\n<p>QCD is probably well-defined due to asymptotic freedom.<br />\nQED/electroweak is known to have a Landau pole.</p>\n<p>The Landau pole could either mean that the S.M. is ill-defined at very high energy or trivial, i.e. non-interacting.<br />\nIn other words, it needs a UV completion, e.g. string theory.<br />\nOf course the main motivation for string theory is that it also provides for a theory of quantum gravity. (But some think gravity may not need string theory and be &#8220;asymptotically safe&#8221;.)</p>\n<p>In case of pure phi^4 there is good evidence that it is actually trivial/non-interacting. (It is known that phi^4 belongs to the same universality class as some well-understood lattice spin models).</p>\n<p>Therefore it is not clear to me what the Preskill et al. result<br />\nmeans for the S.M. &#8230;</p>\n]]>", "author": "wolfgang", "published": "2016-09-04 16:03:37+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Christopher #55:</p>\n<ul>Are there any completeness proofs (i.e. Problem X is NP-complete) other than Cook’s Theorem that do not rely on reductions? That is, are there any known NP-complete problems that have proofs that do not rely on reductions other than SAT and 3SAT?</ul>\n<p>There&#8217;s nothing intrinsically fundamental about SAT or 3SAT.  You <i>could</i> repeat Cook&#8217;s proof strategy, to go directly from the problem of simulating a nondeterministic TM to some other NP-complete problem of your choice.  Certainly, once you know that CircuitSAT is NP-complete, it&#8217;s just as easy to go directly from there to, say, 3-Coloring being NP-complete as it is to reduce 3SAT to 3-Coloring.</p>\n<p>The issue is just that people no longer bother to go &#8220;back to the source&#8221;&#8212;i.e., to the original definition of NP in terms of Turing machines.  For once you know that 3SAT and a bunch of other combinatorial problems are NP-complete, it&#8217;s usually easier (and never harder) to start from those when giving a reduction.</p>\n]]>", "author": "Scott", "published": "2016-09-04 18:06:08+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>JeanTate #59:</p>\n<ul>at what scale (e.g. physical length) do the Navier-Stokes equations cease to be an accurate description on fluid behavior?</ul>\n<p>See a <a href=\"http://www.scottaaronson.com/blog/?p=1697\">previous Shtetl-Optimized thread</a>, large parts of which were about just that.</p>\n]]>", "author": "Scott", "published": "2016-09-04 18:09:29+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Gerald #58: I hope that someday, there&#8217;s a proof of P&ne;NP so simple that it can be taught in an undergrad course.  But really, I&#8217;d settle for any P&ne;NP proof. 🙂</p>\n<p>History renders a mixed verdict here: as you mentioned, there are many results considered hard at the time which were since simplified enormously, as the rest of the field&#8217;s language and concepts caught up with the original prover&#8217;s.  (Maybe my favorite example here is G&ouml;del&#8217;s Theorem.)  Then there are other results, like Fermat&#8217;s Last Theorem, which were super-hard at the time and remain super-hard!  In theoretical computer science, Dinur&#8217;s combinatorial proof of the PCP Theorem is easier than the original proof but still not a cakewalk.</p>\n<p>I&#8217;m reminded of John Conway&#8217;s response to <a href=\"https://www.cs.umd.edu/~gasarch/papers/poll.pdf\" rel=\"nofollow\">Bill Gasarch&#8217;s P?=NP poll</a>: it was something like, &#8220;eventually, P&ne;NP will be merely a footnote in the books.  It&#8217;s that we haven&#8217;t yet invented the techniques for proving computations to be hard.&#8221;  That struck me as one of the most spectacularly useless statements ever made by a mathematician, right up there with &#8220;you&#8217;re lost&#8221; as the answer to &#8220;where am I?&#8221; 🙂</p>\n]]>", "author": "Scott", "published": "2016-09-04 18:20:41+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Vim #12 and Craig #25: Thanks for the simulator idea! That had not occurred to me. Exactly what I am looking for</p>\n]]>", "author": "Matt R.", "published": "2016-09-04 18:17:48+00:00", "title": "By: Matt R."}, {"content": "<![CDATA[<p>A hypothetical question.</p>\n<p>Suppose God comes and says that the answer to P vs NP relies on just (really) few basic facts of algebraic, geometric and graph theory, what would be your reaction?</p>\n<p>a) Trust the God and try to find the answer.<br />\nb) Say to God that you are not God and discard what he said<br />\nc) Decide that God does not know what he is talking about and move on<br />\nd) Ask the God for hints</p>\n]]>", "author": "CinP", "published": "2016-09-04 20:48:41+00:00", "title": "By: CinP"}, {"content": "<![CDATA[<p>I think it would be nuts if it turned out that P=NP because then it would  mean (sort of) that in general writing a book is not more difficult to do than reading a book, and that can&#8217;t be right. But I do wonder why after 4 years studying it world class mathematicians still can&#8217;t decide if Mochizuki&#8217;s proof of the ABC conjecture is correct or not. Suppose I had a proof that P is not equal to NP but it would take you as much brainpower to figure out my proof as it would ignoring it and just proving it yourself from scratch. Would my &#8220;proof&#8221; really be a proof at all?</p>\n]]>", "author": "John K Clark", "published": "2016-09-04 21:20:41+00:00", "title": "By: John K Clark"}, {"content": "<![CDATA[<p>&#8220;No personal attacks or local hidden variable theories, please.&#8221;</p>\n<p>Surely you mean to attack the idea that there already aren&#8217;t physics theories which are even more fundamental than is QM?</p>\n<p>&#8211;Ajit<br />\n[E&OE]</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2016-09-04 21:33:43+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>How are you feeling about the upcoming election these days?</p>\n<p>I wish I were feeling better.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-09-04 23:29:45+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>James #68: At the moment, it looks unlikely that Trump will win, but it&#8217;s super-important not to get complacent&#8212;there were also periods in 2000 when it seemed equally unlikely that Bush could win.  I&#8217;ll probably do another blog post soon, asking whether we should revive the idea of NaderTrading, to arrange vote-swaps between Hillary supporters and supporters of Gary Johnson or Jill Stein.</p>\n]]>", "author": "Scott", "published": "2016-09-05 00:52:26+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>In the 2012 presidential election Nate Silver correctly predicted how every state would go, and as of today he says Trump has a 30.9% chance of taking command of the most powerful nuclear arsenal on the planet  in 137 days. That terrifies me; if I played Russian Roulette I&#8217;d only have a 16.6% chance of losing.</p>\n<p> <a href=\"http://projects.fivethirtyeight.com/2016-election-forecast/?ex_cid=rrpromo#plus\" rel=\"nofollow\">http://projects.fivethirtyeight.com/2016-election-forecast/?ex_cid=rrpromo#plus</a></p>\n]]>", "author": "John K Clark", "published": "2016-09-05 01:32:16+00:00", "title": "By: John K Clark"}, {"content": "<![CDATA[<p><a href=\"#comment-1315256\" rel=\"nofollow\">Wolfgang</a>, I claim that QED coupled to QCD just doesn’t have a Landau pole. I see nothing to elaborate on this and I think you just don’t believe me.</p>\n<p>Also, wikipedia says that some people don’t believe that QED <em>really</em> has a pole and it’s just a one-loop mirage. I don&#8217;t know if the many people who don&#8217;t worry about the pole mean this or have some other reason for not worrying.</p>\n<p>You say that the concern about a pole is that the theory would be ill-defined at high energy, as if it is well-defined at low energy. But is there any reason to believe that it is well-defined at low energy? How can you calculate low energy answers <em>to arbitrary precision</em>?</p>\n<p>But there are some other issues. As a linguistic matter, I don&#8217;t think that the “standard model” includes gravity, even semiclassical gravity.</p>\n<p>When I say that a &#8220;model&#8221; &#8220;exists&#8221; what I mean by a model is a mathematical object that has definite numerical answers. Which is obviously a prerequisite to asking whether those numbers are computable. I don&#8217;t think that semiclassical gravity is such a model. It is a human endeavor, a judgement of when to apply quantum constructions and when to apply classical constructions, and arbitrary decisions to decohere.</p>\n]]>", "author": "Douglas Knight", "published": "2016-09-05 02:10:22+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>James Graber #36:</p>\n<p>The RO theory is that everything is easy once you know it. I tell my students this all the time. It takes a bunch of work to figure out a topic, but once you grok it, it is obvious. Calculus is a good example.</p>\n<p>In most of math and physics, much of the work comes down to working out problems, often classic ones that define the area. In CS, it is sometimes getting programs to work. When you concentrate and wrestle with a problem, sometimes you break through and get it. Often, the breakthrough comes when you take a break. This is why so many people report conceptual breakthroughs while walking to or from (or downloading in), the bathroom. Another good reason for drinking coffee or beer while working: Faster turnaround time for BR breaks  (BTW, when you knock over a coffee or beer into a key board, unplug it, take it apart, wash it, put it in the drying rack for a day, put it back together, and you are ready to go)</p>\n]]>", "author": "Raoul Ohio", "published": "2016-09-05 05:07:34+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>What would be the sub-areas or problems in Artificial Intelligence which would probably lack progress currently due to not enough people working on them? </p>\n<p>(I am asking this because AI looks to me to be an area where there could be a lot of &#8216;vogues&#8217;).</p>\n]]>", "author": "Ashley Lopez", "published": "2016-09-05 09:39:35+00:00", "title": "By: Ashley Lopez"}, {"content": "<![CDATA[<p>#69</p>\n<p>This election has brought out some of the worst elements in American politics and society. Hillary is far from perfect but it is still dismaying to me that the election looks to be as close as it appears at this time. I don&#8217;t think there will be any healing with the Trump supporters if he loses. This looks like a lose-lose situation with the craziness only getting worse no matter what the outcome.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-09-05 12:39:54+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Rahul #72:</p>\n<p>Your conscious mind first tries to find possible alternative solutions (or alternative solution strategies). Your subconscious mind is passive (not active); it works under the direction of your conscious. Finding alternative solutions thus involves loading the subconscious with the task of suggesting any relevant background or context data that carries the features of solutions. </p>\n<p>Failure to obtain answer the straight-forward way, together with your conscious commitment to find a solution, results in the subconscious operating with a greater intensity (greater internal &#8220;tension&#8221; or &#8220;potential difference&#8221;).</p>\n<p>The subconscious is associative. (It becomes integrative only when directed by the conscious.) The subconscious does not care so much for directionality (problem-to-intermediate steps-to solution) as for associations. If there are features that look like carrying the same initial and final states as sought, it simply throws them up all into your conscious. </p>\n<p>If the problem has the cusp manifold topology, one of the solution pathways has a direct jump-like transition. (<a href=\"https://books.google.co.in/books?id=nYRMAQAAQBAJ&#038;pg=PA54\" rel=\"nofollow\">https://books.google.co.in/books?id=nYRMAQAAQBAJ&#038;pg=PA54</a>) </p>\n<p>In your usual thought process, the nature of your conscious directions to the subconscious would be such that it would block the jump-involving solution (mainly because this solution cannot bring up all the intermediate steps). </p>\n<p>However, the initial failure and the continued emotional commitment to solving the problem generates enough subconscious &#8220;tension&#8221; or &#8220;potential difference&#8221; that it now overcomes the usual block, and throws up the jump-involving solution too, to your conscious.</p>\n<p>&#8220;Going away&#8221; from the problem (e.g. walking to and fro etc.) lessens the _conscious_ tension even as the tension already built into the _subconscious_ stays the same. (You have made an &#8220;emotional commitment&#8221; to finding solution.) This combination, too, further helps in overcoming the blockage to the jump-involving &#8220;crazy&#8221; solution.</p>\n<p>When the jump-involving solution is finally gets into the conscious (overcoming the blocking potential), since there is a jump, the conscious is able to trace its route very, very fast&#8212;in a lightening fast manner. As a result, the process of discovery looks magical and also lightning fast (&#8220;Eureka&#8221;), because you are now considering only the last step. </p>\n<p>The assumptions have been: (i) the creative problem solving process and &#8220;getting&#8221; a joke punchlines both involve the cusp manifold, (ii) there are variable levels of blocking in between the conscious and the subconscious.</p>\n<p>&#8211;Ajit<br />\n[E&OE]</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2016-09-05 12:56:11+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>John #66: &#8220;I think it would be nuts if it turned out that P=NP because then it would mean (sort of) that in general writing a book is not more difficult to do than reading a book, and that can’t be right.&#8221;</p>\n<p>I never found this kind of argument very convincing. There are many weird and counterintuitive counterexamples in math. A P-algorithm solving SAT for example could involve solving a ramsey type combinatorial problem leading to a huge constant g (like Grahams number) and then give a running time of n^g. We would have P=NP but the algorithm would be practically unusable.</p>\n<p>I&#8217;m in no way an expert in complexity theory and I might be wrong, but the typical example of NP-completeness-proofs I have seen, didn&#8217;t seem in any way &#8220;deep&#8221; or &#8220;sophisticated&#8221;. Most are of the type &#8220;do the obvious thing&#8221;. It&#8217;s like highschool students who construct real functions by taking out a pen and drawing lines. They would never believe a continous real function that is nowhere differentiable exists, pointing at thousands of concrete examples as &#8220;evidence&#8221;.</p>\n<p>From looking at just the P=NP problem case alone, while P!=NP appears more natural than P=NP, I wouldn&#8217;t arrive at 99% confidence like Scott and others do. However, considering the basic open problems in CT as a whole, I expect them of to be of a similar type: We know for certain that at least some pairs of complexity classes must not be equal (NL<=P<=NP<=PSPACE, NL!=PSPACE). What would really be unexpected is P=NP by a deep nontrivial algorithm _and_ at the same time a deep nontrivial proof of P!=PSPACE (or NL!=P).</p>\n<p>So, my personal gut feeling is that CT is not too cruel and the difficult open questions don&#8217;t come in two or more completely different and unrelated flavours: Only one deep idea should be needed to settle all the open questions (at least for the most practically relevant classes).</p>\n<p>On abc/Mochizuki: This is different from FLT and Poincare that also required years to verify. Today apart from Mochizuki himself and one or two other people the world experts do not have yet the slightes clue how the proof is even supposed to work, not even seeing its overal structure. So, they cannot start to verify the thing and fill in the details. This looks really bad. Don&#8217;t expect a verification in the coming years.</p>\n<p>The proof needs a serious cleanup. It should be rewritten and presented in a mostly self contained paper with all the unused generalities stripped out. Mochizuki however does not seem to want to do that.</p>\n]]>", "author": "Gerald", "published": "2016-09-05 13:28:49+00:00", "title": "By: Gerald"}, {"content": "<![CDATA[<p>@Jon K Comment #2. if you&#8217;re interested in the view of Einstein&#8217;s position on the discontinuum vs field approaches, you might want to look at the article &#8220;The Other Einstein: Einstein Contra Field Theory&#8221; by John Statchel in Science in Context 6, 1(1993), pp. 275-290. if you (or anyone else) can&#8217;t access this article, i can send you a copy.</p>\n]]>", "author": "Richard Gaylord", "published": "2016-09-05 14:40:21+00:00", "title": "By: Richard Gaylord"}, {"content": "<![CDATA[<p>scott: how about listing what you consider to be THE most important papers in physics and computation in the twentieth century. i assume you&#8217;ll have Turing&#8217;s 1936 paper, Einstein&#8217;s 1915 paper and Godel&#8217;s 1931 paper (and of course,  Watson and Crick&#8217;s 1953 paper which is in chemistry but is relevant in many domains). don&#8217;t hesitate to include your own paper(s), if appropriate.</p>\n]]>", "author": "Richard Gaylord", "published": "2016-09-05 15:02:27+00:00", "title": "By: Richard Gaylord"}, {"content": "<![CDATA[<p>More Questions:<br />\nI have just reread Wikipedia on Automatic Theorem Proving and Automatic Proof Checking again.  Things like Mizar, Metamath, Prover9 etc. are similar to what I am asking about, only at a more powerful level.  However, this has prompted me to wonder why these efforts have not been more successful, or if they (and/or other similar efforts) will be noticeably more successful in the reasonably near future?<br />\n  Also, why did QED manifesto not succeed more?<br />\n (I have just discovered the recent QED + 20 special edition of JFR: <a href=\"https://jfr.unibo.it/\" rel=\"nofollow\">https://jfr.unibo.it/</a>   Much good reading ahead)</p>\n<p>My previous question was on the possibility of automatic theorem proving  or proof checking at an easier level which would be more predictable and more practical, but would include fail as one possible outcome.   Problems include precisely defining the easier level, that pesky unreasonably large constant multiplier, and of course the percentage of fails.  The reason I am optimistic is the Hamkins Miasnikov result that shows that the fail percentage can be asymptotically  zero for what appears to be an important class of problems.  The big question is whether this would be useful to anyone.  I think “no” for automatic theorem proving, but perhaps “yes” for automatic proof checking.<br />\nIs it really known that whereas automatic theorem proving (proof finding) is clearly hard,  automatic proof checking is in some sense easy or at least easier?  Or is this equivalent to P=NP? </p>\n<p>Old saw: All of math is trivial or untrue. Modern reformulation  (post Goedel and post Hamkins  and Miasnikov): Most Math is easy but some is hard and some is even impossibly hard.</p>\n<p>But perhaps all the interesting math falls into that infinite asymptotic set of measure zero which is “hard”, or “impossible”.</p>\n]]>", "author": "James Graber", "published": "2016-09-05 15:32:21+00:00", "title": "By: James Graber"}, {"content": "<![CDATA[<p>Hi everyone!</p>\n<p>What if I’m unable to perform arbitraty unitary transformations on qubits, and only can measure qubits form some source using polynomial set of measuring devices, perform postselection and use polynomial number of classical logical gates. Would I still be able to outperform classical computer on some tasks?</p>\n]]>", "author": "Oleg S.", "published": "2016-09-05 16:12:47+00:00", "title": "By: Oleg S."}, {"content": "<![CDATA[<p>Let&#8217;s say that there exist an Oracle that will give you the correct answer for the problem instance.</p>\n<p>What is the largest N such that we can verify the truthfulness of the Oracle?</p>\n<p>  Please provide the problem and the largest N for that problem.</p>\n]]>", "author": "CinP", "published": "2016-09-05 16:47:09+00:00", "title": "By: CinP"}, {"content": "<![CDATA[<p>helmingstay #56: G&ouml;del&#8217;s and Turing&#8217;s theorems are closely related but not the same thing.  Historically, G&ouml;del came first, although it &#8220;could have been&#8221; the other way around.  From Turing&#8217;s theorem, G&ouml;del&#8217;s <i>first</i> incompleteness theorem immediately falls out as a corollary, as explained in QCSD and many other places.  The second incompleteness theorem&#8212;the one that says consistent systems can&#8217;t prove their own consistency&#8212;doesn&#8217;t fall out as easily, but can also be proved using computability arguments (see <a href=\"http://www.ams.org/notices/201011/rtx101101454p.pdf\" rel=\"nofollow\">Kritchman and Raz</a> for example).  Another important strengthening of G&ouml;del, namely Rosser&#8217;s Theorem, can also be proved using computability&#8212;see <a href=\"http://www.scottaaronson.com/blog/?p=710\">my blog post</a> about exactly that.</p>\n<p>Maybe the easiest way to see the connection between the two is to reflect that the &#8220;abstract core&#8221; of G&ouml;del&#8217;s Theorem, the part that&#8217;s independent of the details of formal systems, is that there can&#8217;t be any computer program that enumerates all and only the true statements about computer programs running forever, because if such a program existed, it would solve the halting problem.  The versions of the First Incompleteness Theorem for systems like PA, ZFC, etc. are then just corollaries of that fact (together with the facts that there are computer programs to enumerate the theorems of PA and ZFC, and PA and ZFC are capable of expressing statements about computer programs running forever).</p>\n]]>", "author": "Scott", "published": "2016-09-05 18:46:41+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Oleg #80: You haven&#8217;t specified your model in enough detail for your question to have a clear answer.  But the field of <a href=\"https://arxiv.org/abs/quant-ph/0508124\" rel=\"nofollow\">measurement-based quantum computing</a> (MBQC) is probably relevant to what you&#8217;re asking about.</p>\n]]>", "author": "Scott", "published": "2016-09-05 18:49:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>James #79:</p>\n<ul>But perhaps all the interesting math falls into that infinite asymptotic set of measure zero which is “hard”, or “impossible”.</ul>\n<p>Possibly <i>the</i> most important skill we try to teach graduate students is to find the problems that are hard enough to be interesting, but not so hard that you can&#8217;t make progress.</p>\n<p>(Exception: when you&#8217;re creating a whole new field ex nihilo, you get to be celebrated even for theorems that are &#8220;trivially easy&#8221; in retrospect.  This is relevant if, like Cantor, Turing, or Shannon, you&#8217;re capable of creating a whole new field ex nihilo.)</p>\n]]>", "author": "Scott", "published": "2016-09-05 18:56:01+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>#Helingstay &#8211; comment 15</p>\n<p>I think there really is a fundamental difference between consciousness and its obseved constructs. </p>\n<p>Consider a dream for example. Is everything in the dream real, or rather can the dreamer know that everything in his/her dream is real? Obviously not &#8211; the only thing the dreamer knows for certain is that he/she the dreamer exists &#8211; the rest might just be imaginary. Hence the conscious entity can never be absolutely sure that the &#8220;constructs of consciousness&#8221; he/she is experiencing are real.</p>\n<p>So, yes, I stand by the statement that the only thing we know with 100% certainty is the existence of our consciousness. Our assumption of the reality of the things we observe, while reasonable and 100% neccesary for a sane existence, is not rock solid certain.</p>\n]]>", "author": "Philip Calcott", "published": "2016-09-05 18:46:36+00:00", "title": "By: Philip Calcott"}, {"content": "<![CDATA[<p>#82</p>\n<p>&#8220;Hence the conscious entity can never be absolutely sure that the “constructs of consciousness” he/she is experiencing are real.&#8221;</p>\n<p>I am wanting to agree with you but I am not sure how you draw a distinction between consciousness and the constructs of consciousness. I would think that consciousness is composed of its constructs.</p>\n<p>What you might be saying is we do not know how well the constructs of consciousness accurately represent the reality of some objective world that lies outside of consciousness. I think the answer to that is that it is likely they represent this objective world hardly at all or to only the extent that the representation is useful to us.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-09-05 21:38:43+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Scott, do you sometimes review comments to older posts in the moderation queue?  Just wondering.</p>\n]]>", "author": "jonas", "published": "2016-09-05 23:09:58+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>Scott #64</p>\n<p>&#8221; Then there are other results, like Fermat’s Last Theorem, which were super-hard at the time and remain super-hard!&#8221;</p>\n<p>Is there a science of the &#8220;hardness&#8221; of proofs?<br />\nE.g. can&#8217;t all hard proofs eventually be simplified? Are we missing some intermediate steps/tools? Is this because the techniques don&#8217;t map cleanly to the structures of the human brain?</p>\n]]>", "author": "fred", "published": "2016-09-05 23:23:10+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Scott, thanks for this open thread.</p>\n<p>By coincidence, there is a (rather long) question I wanted to ask you. (I wondered whether I should write you a short email just sketching the question and inquiring whether you would be willing to read a long fleshed out version of the question, and try to answer it. But this open thread feels like an invitation to directly ask the long fleshed out version of the question. Feel free to reply that my question feels too long or incoherent for a reasonable answer.)</p>\n<p>I recently read a <a href=\"https://pressron.wordpress.com/2016/08/30/what-we-talk-about-when-we-talk-about-computation/\" rel=\"nofollow\">summary of a discussion</a> between you (representing a theory of computation=TOC perspective) and people like Neel Krishnaswami (representing a Theory of Programming=TOP perspective) about computation and the (failure of the higher-order) Church-Turing thesis. That summary left me with the impression that the TOC people worry less about higher-order concepts and encoding of input, because they claim that &#8220;computation is down at the rock bottom, along with bits and integers&#8221;. But oracle Turing machines (especially the ones with an oracle for the halting problem) feel suspiciously like higher-order concepts to me. And even the encoding of integer input is non-obvious, especially if we don&#8217;t take the validity or finiteness of the input string for granted, but push the burden to reject invalid input strings including infinite strings to the Turing machine itself.</p>\n<p>My question to you is of a slightly philosophical nature. My <a href=\"http://philosophy.stackexchange.com/questions/14529/which-ontological-commitments-are-embedded-in-a-straightforward-turing-machine-m/15439#15439\" rel=\"nofollow\">answer to my own question about ontological commitments of Turing machines</a> quotes both myself (16. April &#8217;16)</p>\n<blockquote><p>I was recently surprised to find out that one can consistently accept the existence of Turing machines, and reject the existence of Turing machines with access to an oracle for deciding the halting problem of a Turing machine. This is because the oracle can lie (but one cannot prove that it lies) and claim that a non-halting computation would actually halt, and then taking forever while answering with an infinite number, when asked for a bound on the number of steps. (&#8230; justification for the excuse &#8230; I&#8217;m unsure about how to separate finite inputs from infinite inputs, and hence am unsure whether quantification over the inputs is well defined &#8230;)</p></blockquote>\n<p>and an <a href=\"http://www.scottaaronson.com/blog/?p=1948#comment-114954\">explanation from you</a> (Aug 24 &#8217;14)</p>\n<blockquote><p>To answer your question, I claim that statements about Turing machines with halting oracles have definite truth values, just as “clearly” as statements about ordinary TMs do. The argument is simply this: you agree that any given Turing machine, on any given input, either halts or doesn’t halt? Well then, every call to a halting oracle has a definite right answer. Therefore, the operation of a TM with a halting oracle is mathematically well-defined at every point in time. Therefore, by the same intuition you used for ordinary TMs, you should conclude that the oracle TM either halts or doesn’t halt, and that there’s a definite fact of the matter about which it does.</p>\n<p>Continuing recursively in this way gets you to definite truth-values for all Πk sentences, for any value of k—and actually further, &#8230;</p></blockquote>\n<p>Those two quotes seem to contradict each other, or at least use different notions of truth. Mine seems to use game semantics, and yours argues that arithmetic sentences have definite truth-values, i.e. allow Platonic semantics. Question: Would you argue against the conclusions from my quote, i.e. that one can accept the existence of Turing machines (including the fact that every Turing machine either halts or doesn&#8217;t halt on the empty input tape), and still reject the existence of Turing machines with access to an oracle for deciding the halting problem of a Turing machine (and be agnostic about whether every Turing machine either halts for all (finite) inputs or doesn&#8217;t halt for some inputs)?</p>\n<p>What do you think about higher-order concepts? For example, are oracle Turing machines a higher-order concept? What is your opinion on the importance of input encoding? For example, are encodings (notations) of ordinal numbers important for ordinal analysis, or is it just important whether an ordinal is computable or not? Are block codes, bifix codes, prefix codes, and recognizable variable length codes (recognized by unambiguous finite state transducers where the only accepting state is the initial state) concepts one should know?</p>\n<p>P.S.: The background story of my quote was not to deny Platonic truth for arithmetic sentences, but to understand the ontological commitments required for the model existence theorem, see <a href=\"http://philosophy.stackexchange.com/questions/14101/are-there-any-other-things-like-cogito-ergo-sum-that-we-can-be-certain-of/14461#14461\" rel=\"nofollow\">here</a> and <a href=\"http://mathoverflow.net/questions/242604/model-existence-and-consistency-conditions-for-pi-10-oracles\" rel=\"nofollow\">here</a>.<br />\nP.P.S.: I removed a discussion of reasonable input encodings for integers, because this comment is already too long, and the point that Turing machines are unable to reject infinite strings as invalid input is obvious anyway.</p>\n]]>", "author": "gentzen", "published": "2016-09-05 23:28:19+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>@Scott</p>\n<p>&#8220;I’ll probably do another blog post soon, asking whether we should revive the idea of NaderTrading&#8221;</p>\n<p>In a Facebook post Eliezer Yudkowsky suggested that if a NaderTrading-like platform were to be revived, he would want it to acknowledge that Hillary/Trump votes are worth a lot more than third-party votes*, so that each major party vote would be traded for many third-party votes. What do you this suggestion?</p>\n<p>* Actually I don&#8217;t what was the sign of the comparison in his actual posting and don&#8217;t want to login to Facebook to check it again, but I assume he and I share enough common sense to get the same answer.</p>\n]]>", "author": "Itai Bar-Natan", "published": "2016-09-05 23:30:49+00:00", "title": "By: Itai Bar-Natan"}, {"content": "<![CDATA[<p>&#8220;What do you this suggestion?&#8221;</p>\n<p>Typo. I mean &#8220;What do you <i>think of</i> this suggestion?&#8221;</p>\n]]>", "author": "Itai Bar-Natan", "published": "2016-09-05 23:32:13+00:00", "title": "By: Itai Bar-Natan"}, {"content": "<![CDATA[<p>On the topic of trying not to underestimate alien civilizations:</p>\n<p>While participating in the Andromeda Project citizen science opportunity a few years ago, I was inspecting the high-resolution Hubble images of Andromeda for star clusters and also background galaxies when a particular image distracted me.  Some constellations within it inspired a thought: Say a civilization has mapped out its galaxy in great detail and has reached a point where long-term planning on the scale of many thousands (if not millions) of years is possible.  Especially if this civilization were in a spiral galaxy like Andromeda, then the disk would offer a convenient place to scrawl a leisurely message to other galaxies, via using mastery of celestial mechanics to nudge matter around and eventually shape constellations. </p>\n<p>I have tracked down the portion of the Hubble survey containing that small section. Specifically what caught my imagination were constellations near the bottom center (definitely zoom in) of Brick 15, Field 6: <a href=\"https://archive.stsci.edu/pub/hlsp/phat/brick15/hlsp_phat_hst_acs-wfc_12056-m31-b15-f06_f475w-f814w_v1_rgb.jpg\" rel=\"nofollow\">https://archive.stsci.edu/pub/hlsp/phat/brick15/hlsp_phat_hst_acs-wfc_12056-m31-b15-f06_f475w-f814w_v1_rgb.jpg</a></p>\n<p>Now, I make no claims you will find anything of interest or that anything in the view actually is artificial (after all, we have heard at length about the &#8220;Mars face&#8221;), yet I still find this idea of sculpted constellations (perhaps even designed to be subtle) fun to contemplate.</p>\n]]>", "author": "Randy", "published": "2016-09-06 00:00:03+00:00", "title": "By: Randy"}, {"content": "<![CDATA[<p>Fred #88: As G&ouml;del pointed out in 1936, there&#8217;s no computable function f such that every provable statement of length n has a proof of length at most f(n).  I.e., there are inherent reasons to expect that even short statements can sometimes require extremely long proofs.  Of course, this doesn&#8217;t say anything directly about the short statements human mathematicians might care about.  But even intuitively, why would you expect that every proof humans can find, for every statement they care about, can eventually be simplified to at most 5 lines or whatever?  To me, it would be way more surprising if that were always possible than if it sometimes weren&#8217;t!</p>\n<p>(Having said that, one of the biggest determinants of the length of a proof is the level of abstraction you&#8217;re working at.  E.g., I can prove Fermat&#8217;s Last Theorem in just one line if I&#8217;m allowed to cite Ribet&#8217;s theorem and the modularity theorem. 🙂 )</p>\n]]>", "author": "Scott", "published": "2016-09-06 01:34:50+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Jonas #87: I review whatever I see in the queue.  If I missed your comment just shoot me an email.</p>\n]]>", "author": "Scott", "published": "2016-09-06 01:37:13+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #83: I think the reverse direction is also worth mentioning here!  Hemingstay only asked about it being a one-directional thing, but since it goes both ways I think that should also be mentioned.  G&ouml;del implies Turing also because if you had a machine to solve the Halting problem, then you could apply it to a proof-searcher and conclude that everything is decidable.  Unless there&#8217;s some subtlety I&#8217;m missing here.</p>\n]]>", "author": "Sniffnoy", "published": "2016-09-06 01:33:49+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Itai #90: Oh geez that&#8217;s politically awful, in the sense that you&#8217;d never get people to go along with that.</p>\n]]>", "author": "Sniffnoy", "published": "2016-09-06 01:34:58+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>gentzen #89: I don&#8217;t really like that article.  To my mind, computatation is fundamentally about finite strings over a finite alphabet, but that doesn&#8217;t require taking a &#8220;computation is prior to everything&#8221; view like it discusses / attributes to our host.  I do math, I take the usual Platonic view ordinarily, not some formalist one.  But that doesn&#8217;t in any way require admitting these other sorts of computation as &#8220;computation&#8221; in the ordinary sense.</p>\n]]>", "author": "Sniffnoy", "published": "2016-09-06 01:38:08+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Scott #46: Hm, you know, it&#8217;s a funny thing, I guess this could be read two ways.  I was thinking of low-hanging fruit as a <i>bad</i> thing, as an indicator that other mathematicians haven&#8217;t done their job properly, if there&#8217;s this low-hanging fruit for me to grab.  But I guess you could also consider it as a good thing, if you want to find something easy to solve!  (Say, to make a name for yourself.)  Given that I don&#8217;t actually have an academic job at the moment and am hoping to break back in, perhaps I should consider it as the latter. 😛</p>\n<p>&#8230;I was going to go for particular examples here, saying &#8220;I don&#8217;t think you even need a PhD in mathematics for such-and-so, they&#8217;re even lower-hanging than that&#8221;, but that seems like the sort of thing that would lead to unrpoductive arguments, so uh I think I&#8217;ll just skip that&#8230;</p>\n]]>", "author": "Sniffnoy", "published": "2016-09-06 03:14:45+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<blockquote><p><b>gentzen</b> observes (#69) &#8220;Oracle Turing machines (especially the ones with an oracle for the halting problem) feel suspiciously like higher-order concepts to me.&#8221; </p></blockquote>\n<p>Two <i>TCS StackExchange</i> questions that pursue this intuition are &#8220;Are runtime bounds in P decidable? (answer: no)&#8221; and &#8220;Do the undecidable attributes of P pose an obstruction to deciding P versus NP? (answer: maybe)&#8221;; there is also a <i>TCS</i> community wiki associated to the question &#8220;Does P contain languages whose existence is independent of PA or ZFC? &#8221;</p>\n<p>As the <i>StackExchange&#8217;s</i> diverse answers, comments, and literature references show, opinions differ pretty widely in regard to the merits (or lack of merits) of this class of &#8220;higher-order&#8221; complexity-theory questions.  To the extent that there is any consensus at all, it&#8217;s along the lines &#8220;Our present understanding of complexity theory is not adequate to provide illuminating answers to this class of questions.&#8221;</p>\n]]>", "author": "John Sidles", "published": "2016-09-06 03:54:15+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>I happen to think that mathematics is overflowing with &#8216;low-hanging fruit&#8217; in the form of beautiful and relatively easy questions that no one has thought of asking yet.  Some amount of creativity can sometimes go further than the same amount of problem-solving genius.  Of course, if no one else has considered the question it can be more difficult to convince anyone that it&#8217;s worth answering.</p>\n]]>", "author": "Jair", "published": "2016-09-06 04:53:37+00:00", "title": "By: Jair"}, {"content": "<![CDATA[<p>Scott, I&#8217;d be curious to hear your thoughts (if any), on this paper from Mehta and Schwab on deep learning and the renormalization group:</p>\n<p><a href=\"http://arxiv.org/abs/1410.3831\" rel=\"nofollow\">http://arxiv.org/abs/1410.3831</a></p>\n<p>The mathematical correspondence they define is a perhaps trivial and probably doesn&#8217;t hold for many deep learning networks that have saturating nonlinearities, but it still seems that the vast RG literature might contain some insights useful for deep learning theory&#8230;</p>\n]]>", "author": "Phil", "published": "2016-09-06 07:03:56+00:00", "title": "By: Phil"}, {"content": "<![CDATA[<p>@Scott #69</p>\n<p>>> NaderTrader</p>\n<p>Is vote-swapping legal?</p>\n<p>You cannot sell your vote, so how can trading votes be legal?<br />\nObviously you try to undermine/circumvent the electoral system as envisioned by the Founding fathers &#8230;</p>\n]]>", "author": "wolfgang", "published": "2016-09-06 09:00:43+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<blockquote><p><b>Phil</b> (#101) wonders about&nbsp; &#8220;deep learning and the renormalization group&#8221;</p></blockquote>\n<p>Sanjeev Arora, Moritz Hardt, and Nisheeth Vishnoi are the proprietors of a lucid and enjoyable weblog <i>Off the Convex Path</i> (OTCP), whose computational objectives overlap very substantially with the objectives of renormalization group methods:<br />\n<blockquote>Many procedures in statistics, machine learning and nature at large—Bayesian inference, deep learning, protein folding—successfully solve non-convex problems that are NP-hard, i.e., intractable on worst-case instances. Moreover, often nature or humans choose methods that are inefficient in the worst case to solve problems&nbsp;in&nbsp;P.</p>\n<p>Can we develop a theory to resolve this mismatch between reality and the predictions of worst-case analysis?</p></blockquote>\n<p>Such reflections give rise to (the three most recent OTCP posts) &#8220;Markov chains through the lens of dynamical systems: the case of evolution&#8221; (Nisheeth Vishnoi, April&nbsp;4,&nbsp;2016), &#8220;A framework for analysing non-convex optimization&#8221; (Sanjeev Arora and Tengyu Ma, May&nbsp;8,&nbsp;2016), and &#8220;Linear algebraic structure of word meanings&#8221; (Sanjeev&nbsp;Arora, July&nbsp;10,&nbsp;2016).</p>\n<p>As Huckleberry Finn said of John Bunyan&#8217;s <i>The Pilgrim&#8217;s Progress from This World to That Which Is to Come; Delivered under the Similitude of a Dream</i> (1678), &#8220;<a href=\"https://books.google.com/books?id=zuvXAAAAMAAJ&pg=PA137\" rel=\"nofollow\">The statements was interesting,&nbsp;but&nbsp;tough</a>&#8220;. </p>\n<p><i>Shtetl Optimized</i> readers, in particular, can enjoyably precondition their appreciation of these three essays by&nbsp;the&nbsp;replacement </p>\n<p>\\(\\text{Darwinian evolution}\\to\\text{Lindbladian evolution}\\)</p>\n<p>As Vishnoi remarks of the former dynamics, so too of the latter dynamics: these are <i>Nature&#8217;s</i> dynamical algorithms, and hence heuristically are deserving of our particular&nbsp;attention.</p>\n<p>Terry Tao&#8217;s essay &#8220;What is good mathematics?&#8221; (<i>Bull AMS</i> 2007, arXiv:math/0702396) enumerates 21 traits of good mathematics.  </p>\n<p>Tao&#8217;s essay emphasizes that any such listing necessarily is incomplete, and sure enough, the OTCP essays present a 22nd trait of good mathematics: <i>hilarity</i>.  </p>\n<p>As a concrete example of mathematical hilarity, I have in mind the first sentence returned by the algorithm of the OTCP essay &#8220;Linear algebraic structure of word meanings&#8221; in searching for usages of the word <i>ring</i>:<br />\n<blockquote>The spectrum of any commutative ring with the Zariski topology (that is, the set of all prime ideals) is compact.</p></blockquote>\n<p>When we seek to extend the OTCP&#8217;s computational themes to the domain of quantum simulation, such statements are very commonly encountered&nbsp;&mdash; Joe&nbsp;Harris&#8217; and David Eisenbud&#8217;s just-released and much-praised <i>3264 and All&nbsp;That: A Second Course in Algebraic&nbsp;Geometry</i> (2016) is replete with&nbsp;them&nbsp;&mdash; and the hilarious point is that it isn&#8217;t only OTCP&#8217;s deep-learning algorithms that find such statements to be (in&nbsp;Huck&#8217;s phrase)  &#8220;interesting but&nbsp;tough&#8221;.&nbsp;🙂</p>\n<p>Here as in very many STEAM-domains, neither human&nbsp;understanding nor computer&nbsp;algorithms are all that close to achieving &#8220;<a href=\"http://mathoverflow.net/a/7157\" rel=\"nofollow\">a&nbsp;thorough conceptual understanding of what&#8217;s&nbsp;going&nbsp;on</a>.&#8221;  Fortunately, we can see clearly enough to be entirely confident that unifications of our understanding are both possible and natural: unifications that embody all 21 of Terry Tao&#8217;s traits of good mathematics&nbsp;&hellip; and hilarity&nbsp;too.</p>\n]]>", "author": "John Sidles", "published": "2016-09-06 11:48:48+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Sniffnoy #97: Wow, you seem to be an expert on encoding of integers who has worked with people like Jeffrey C. Lagarias and Andreas Blass. You also did some work on various fairly-natural operations on ordinals. I would like to ask you a serious question about encoding of integers:</p>\n<p>What do you think of straight-line program encodings? Here in addition to 1&#8217;s, additions and multiplications (which are used to define the integer complexity), you are also allowed to use variables. (It is basically equivalent to the arithmetic circuit representation.) You probably know Haskell. There you can easily end up with a number temporarily stored in that representation, especially if you produce a space leak by thinking too &#8220;imperative&#8221; and not evaluate in the appropriate order. Some operations like comparison (both equality and greater than) become challenging in that representation, but other operations can be executed much faster.</p>\n<p>Do you think that this is a reasonable encoding of integers? Or is it at least not less reasonable than the unary encoding of integers? How would you rate it compared to the binary encoding of integers?</p>\n]]>", "author": "gentzen", "published": "2016-09-06 14:25:43+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>gentzen #89: I don&#8217;t even understand what it would mean to &#8220;reject the existence of a Turing machine&#8221; (with or without an oracle for HALT).  Since TMs with HALT oracles can be put in 1-1 correspondence with the positive integers, it seems almost exactly like rejecting the existence of some positive integer.  Or do you mean to deny that there&#8217;s a definite fact of the matter about whether a TM with HALT oracle halts or not?  Well then, why not deny that there&#8217;s a definite fact of the matter about whether an ordinary TM halts or not?  After all, the former kind of fact is &#8220;built out of&#8221; the latter kind.</p>\n<p>Regarding input encodings, what theoretical computer scientists really have is a <i>pragmatic</i> attitude: they worry about encoding details when they matter for whatever question they&#8217;re trying to answer, and not when they don&#8217;t.  Most of the time (e.g. unless you&#8217;re worried about constant factors and things like that), it&#8217;s perfectly fine to work at a higher level of abstraction where low-level encoding details don&#8217;t matter.</p>\n<p>Which, yes, theoretical computer scientists are perfectly happy to do, and do all the time, and wouldn&#8217;t get far if they didn&#8217;t do!  But the possibility and usefulness of higher-level abstractions in no way calls into question the validity of the Church-Turing Thesis, or the fact that computation is ultimately defined in terms of strings of 1s and 0s.  These facts are not only consistent but deeply harmonious with each other.  That was my point in the other thread.</p>\n]]>", "author": "Scott", "published": "2016-09-06 17:00:48+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>wolfgang #102: Absolutely not!  You&#8217;re out of date (as indeed I was, until this week).  In 2007, the 9th Circuit Court of Appeals explicitly ruled vote-swapping to be legal, and indeed protected by the First Amendment.  See <a href=\"https://en.wikipedia.org/wiki/Vote_pairing#Legality\" rel=\"nofollow\">here</a> and <a href=\"\nhttp://cdn.ca9.uscourts.gov/datastore/opinions/2007/08/06/0655517.pdf\">here</a>.</p>\n]]>", "author": "Scott", "published": "2016-09-06 17:05:19+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott # 85</p>\n<p>&#8220;Possibly the most important skill we try to teach graduate students is to find the problems that are hard enough to be interesting, but not so hard that you can’t make progress.&#8221;</p>\n<p>How do you but do that? (Not the judging process, which obviously cannot be formulated in a blog&#8217;s comment section, but how do you TEACH to do the judging.)</p>\n]]>", "author": "Ashley Lopez", "published": "2016-09-06 17:34:48+00:00", "title": "By: Ashley Lopez"}, {"content": "<![CDATA[<p>@Scott #106</p>\n<p>I see, well then you can indeed help Trump by encouraging people swap their Gary Johnson votes 😎</p>\n]]>", "author": "wolfgang", "published": "2016-09-06 17:50:36+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>Do you have any opinion on analog-computation and differential equation based SAT-solvers.</p>\n<p>Theory:<a href=\"https://arxiv.org/abs/1208.0526\" rel=\"nofollow\">https://arxiv.org/abs/1208.0526</a></p>\n<p>Recent preprint on experiment &#8216;Efficient Analog Circuits for Boolean Satisfiability&#8217; :<a href=\"http://arxiv.org/pdf/1606.07467.pdf\" rel=\"nofollow\">http://arxiv.org/pdf/1606.07467.pdf</a></p>\n]]>", "author": "Justin", "published": "2016-09-06 22:52:57+00:00", "title": "By: Justin"}, {"content": "<![CDATA[<p>Anybody else here a college drop-out?</p>\n]]>", "author": "Haribo Freak", "published": "2016-09-06 23:26:24+00:00", "title": "By: Haribo Freak"}, {"content": "<![CDATA[<p>Scott #106: Wow! Thanks for the link to the decision &#8212; and it&#8217;s good to know that this has already been through a federal appeals wringer. Though it sure is Napster-flavored, isn&#8217;t it? And I&#8217;m not persuaded that it&#8217;d find the same reception at the Supreme Court level, where I imagine the question will have to have to go at some point.</p>\n]]>", "author": "amy", "published": "2016-09-06 23:40:21+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>gentzen #104:</p>\n<blockquote><p>Sniffnoy #97: Wow, you seem to be an expert on encoding of integers who has worked with people like Jeffrey C. Lagarias and Andreas Blass.</p></blockquote>\n<p>&#8230;OK, please don&#8217;t do this.</p>\n<p>Like, look around you.  (Not literally.)  You&#8217;re commenting on a blog run by Scott Aaronson.  Regular commenters here have included a number of well-known mathematicians and computer scientists.  It&#8217;s really a bit embarrassing to have someone go all &#8220;Wow!&#8221; over me due to other mathematicians I <i>have some association with</i>, when, like, plenty of well-known mathematicians and computer scientists are <i>right here</i>.</p>\n<p>I mean, I&#8217;m not going to knock my work, I think it&#8217;s pretty great, honestly!  (Even if some of it is a bit LHF.)  But like, really man, that&#8217;s just embarrassing.  Like, really&#8230; in a place where mathematicians are hanging around, it&#8217;s not going to be my association with well-known mathematicians that&#8217;s noteworthy.  I mean&#8230; mathematics just doesn&#8217;t seem to be that large a world, you know?  And I went to University of Michigan, so, like, that&#8217;s even less surprising.</p>\n<p>(Also, I have not worked with Andreas Blass to any real extent.  He was second reader on my thesis, and he&#8217;s occasionally pointed me towards useful set theory references.  That&#8217;s mostly it.)</p>\n<p>You want to gush over my work, go ahead, I for one think it deserves it. 🙂  But, like, this is embarrassing, man.</p>\n<p>As for your substantial question&#8230; I&#8217;ll answer that in a separate comment.</p>\n]]>", "author": "Sniffnoy", "published": "2016-09-07 01:08:11+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Hey Scott,<br />\nI read your position on the Chinese Room problem and thought of asking you a related question: if we accept that passing the Turing Test is a good criterion to tell if a test subject has something of a consciousness of the kind humans possess, then how do you propose to pass a Turing Test designed, say, in Pashto, or about topics in which you have little understanding?</p>\n<p>And if you don&#8217;t pass such a Turing Test (which will be passed by a Pashtun villager, e.g.), would it not mean that we need to qualify what we think we understand about what passing the test really means?</p>\n<p>For example, shouldn&#8217;t passing the Turing Test strictly mean that the test subject exhibits a kind of intelligence consistent with the control subject(s)?</p>\n<p>I would like to know your thoughts on this and other related issues that you believe this gives rise to. 🙂</p>\n]]>", "author": "Arko", "published": "2016-09-07 01:51:34+00:00", "title": "By: Arko"}, {"content": "<![CDATA[<blockquote><p>\nWhat do you think of straight-line program encodings? Here in addition to 1’s, additions and multiplications (which are used to define the integer complexity), you are also allowed to use variables. (It is basically equivalent to the arithmetic circuit representation.) You probably know Haskell. There you can easily end up with a number temporarily stored in that representation, especially if you produce a space leak by thinking too “imperative” and not evaluate in the appropriate order. Some operations like comparison (both equality and greater than) become challenging in that representation, but other operations can be executed much faster.</p>\n<p>Do you think that this is a reasonable encoding of integers? Or is it at least not less reasonable than the unary encoding of integers? How would you rate it compared to the binary encoding of integers?</p></blockquote>\n<p>I&#8217;m familiar with straight-line programs.  You&#8217;ll notice I&#8217;ve done some work on addition chains, which are straight-line programs with only addition allowed!  (And I have some speculation about what analogues of my theorems and conjectures might hold when multiplication or subtraction is also allowed, but these are, as I said, speculation.)</p>\n<p>I do not think it makes sense to consider these as &#8220;encodings&#8221; of natural numbers, for a number of reasons.  Our usual encodings of natural numbers are either base-b for some b or slight variations on it (e.g. bijective base-b).  Because, these work really well!  Let&#8217;s just take ordinary binary to be concrete.  What are some good features of binary?</p>\n<p>1. Every number has a unique binary representation (again I am only considering natural numbers here)<br />\n2. It&#8217;s easy to write down algorithms for how to add two binary numbers, for how to multiply them, for how to compare them&#8230; etc.  (I guess testing for 0 and taking predecessors are important ones, too, so you can write recursions.)</p>\n<p>Given this, it&#8217;s unclear why you&#8217;d want to represent natural numbers with something like a straight-line program.</p>\n<p>Say we want to encode the elements of a set A via elements of a set B; let&#8217;s consider this as a map from B to A.  The best possible case is that this is a bijection from the B to A (as we have with binary above).  Failing that, hopefully at least we can get a &#8220;canonical form&#8221; map going the other way, back from A to B, that we can easily compute.  (And then we can say that the <i>real</i> encoding is given by restricting B to the image of the canonical form map.)  And if even that fails, well, hopefully we can at least, given two elements of B, check whether they yield the same element of A.</p>\n<p>Binary does great here, as I&#8217;ve said.  Straight-line programs?  Yikes.  You&#8217;ll have many straight-line programs for one number.  None seems particularly canonical.  And I guess checking equality is quick in that you can compute the actual number (in binary), but that just raises the question of why you aren&#8217;t just using binary.</p>\n<p>As for standard operations&#8230; OK, I guess you can add and multiply &#8212; and if you allow subtraction, subtract and take predecessors &#8212; in a trivial fashion, but&#8230; how do you compare?  How do you compare to 0, in particular?  By resorting to binary, it would seem.  Again: Why bother with this?  Just use binary.</p>\n<p>I really do not understand why you would want to ever consider this as an encoding of natural numbers.  (Although there is apparently <i>some</i> reason that a number of people come to, as for whatever reason a number of people have suggested something like this to me.  Most of those people were not mathematicians, though.)  Binary is good.  I suggest using it.</p>\n]]>", "author": "Sniffnoy", "published": "2016-09-07 02:03:52+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Is there any classical public key crypto system that is unbreakable by the quantum computer? I know there are some lattice based systems but could they remain safe in the future?</p>\n]]>", "author": "Jiayu", "published": "2016-09-07 04:26:43+00:00", "title": "By: Jiayu"}, {"content": "<![CDATA[<blockquote><p><b>helmingstay</b> (#54) observes &#8220;The *functional* structure of a protein in real-world systems is often probabilistic.&#8221;</p></blockquote>\n<p>Unraveling the functional dynamical properties of molecular and condensed matter structures&nbsp;&mdash; classical, quantum, and hybrid&nbsp;&mdash; is the core business of the computational simulation company Schrödinger LLC, and at least some <i>Shtetl Optimized</i> readers may wish to acquaint themselves with <a href=\"https://www.schrodinger.com/suites\" rel=\"nofollow\">Schrödinger&#8217;s simulation suites</a> and peruse the <a href=\"https://www.schrodinger.com/careers\" rel=\"nofollow\">numerous job openings for scientists and engineers</a> that Schrödinger presently is advertising.</p>\n<p>As the dynamicist Vladimir Arnol&#8217;d has said, &#8220;Mathematics is the part of physics where experiments are cheap,&#8221; and nowadays this is no joke, but rather a concrete reality of experimental physics and chemistry.  In particular, it won&#8217;t be easy for Google&#8217;s advances in dynamical simulation with quantum computers to exceed the pace of Schrödinger&#8217;s advances in dynamical simulation with classical computers.  </p>\n<p>Needless to say, our mathematical understanding of computational simulation algorithms benefits greatly from the work of both companies.  Indeed, it is entirely likely (as it seems to me) that sustained advances in simulation capacity by either company will greatly benefit the other company too.</p>\n]]>", "author": "John Sidles", "published": "2016-09-07 10:34:32+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Jiayu #115: Yes, there are the lattice-based systems (and closely-related LWE-based systems, etc).  No one knows if they&#8217;re truly safe against QC, just like no one knows if RSA and Diffie-Hellman are secure against classical computers.  In both cases, though, they haven&#8217;t been broken yet.</p>\n]]>", "author": "Scott", "published": "2016-09-07 13:38:43+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Arko #113: The usual view that&#8217;s defended is that passing the Turing Test is sufficient for us to want to ascribe thinking to something, but not necessary.  There are all sorts of reasons why a thinking being might fail the TT, including not speaking the language (as you said), being asleep or incapacitated, not wanting to participate, being an alien form of intelligence, etc.  But at any rate, it seems extremely unlikely that any non-thinking being would pass a strong TT.  (The adjective &#8220;strong&#8221; is crucial in the previous sentence!  Still, of course, some people dispute this view.)</p>\n]]>", "author": "Scott", "published": "2016-09-07 13:43:08+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>My primary mathematical motivation to “reject the existence of &#8230;&#8221; in the context I quoted was to understand the &#8220;minimal&#8221; ontological commitments required to prove the model existence theorem. The syntactic strings were fine for me, but I was unsure about the equivalence relation on them, which is constructed in (the Henkin style proof of) the theorem. I guessed it would be easiest for me to understand it in terms of (oracle) Turing machines. The first realization is that I have to accept the existence of Turing machines and that there’s a definite fact of the matter about whether a TM halts on the empty input tape or not. Otherwise, I cannot even talk about consistency at all.</p>\n<p>Now comes the surprise: The construction of the equivalence relation requires an oracle TM, and the constructed model can itself be seen as an oracle. However, even if we put in the true oracle for HALT, the resulting oracle (i.e. the constructed model) will not be the true oracle for HALT. But even more surprisingly, the model existence theorem doesn&#8217;t really need the true oracle for HALT, any plausible oracle (see below) will do. For the normal Henkin style proof, that oracle has to think/claim that the given axioms (for which we want to construct a model) are consistent, but Noah Schweber showed that <a href=\"http://mathoverflow.net/questions/242604/model-existence-and-consistency-conditions-for-pi-10-oracles/242679#242679\" rel=\"nofollow\">Rosser&#8217;s trick can be used to modify the proof such that even this is not required, as long as the oracle is plausible </a>(and he rigorously defined that notion too).</p>\n<p>OK, I guess you have heard this &#8220;we neither need it, nor is it preserved under &#8230;, hence we don&#8217;t want to assume that it always exists&#8221; attitude before. Even if you would accept that attitude towards existence, you could cite the Shoenfield&#8217;s absoluteness theorem as evidence that it is preserved in the relevant contexts. But my guess is that you basically reject that attitude to define existence based on such utilitaristic considerations. Still, I hope it became clear what it would mean to “reject the existence of a Turing machine” (with or without an oracle for HALT).</p>\n<p>Now that I hopefully clarified things, let me link to Quine&#8217;s <a href=\"https://tu-dresden.de/gsw/phil/iphil/theor/ressourcen/dateien/braeuer/lehre/metameta/Quine---On-What-There-Is.pdf?lang=de\" rel=\"nofollow\">On What There Is</a> for some good reasons to reject &#8220;being of possibles (and universals)&#8221;, and the slogan &#8220;To be is to be the value of a variable&#8221; to sum up the criterion of ontological commitment. Finally, here are three different passages I wrote, which convey some feeling what it means for me personally to accept or reject the existence of idealized constructs:</p>\n<blockquote><p>That I can&#8217;t decide arbitrary Π1 sentences doesn&#8217;t necessarily mean that my all powerful opponent cannot do it either. Maybe he just guesses the answer (if his enormous computational powers should fail to provide him a certain answer), and is so extremely lucky that he guesses right each time (when he plays against an inferior being like me).</p></blockquote>\n<blockquote><p>I want to assume the existence of Turing machines, not because I really believe in their physical existence, but because I believe that they will provide a useful and wide ranging abstraction. I want to assume that a Π1 sentence is either true or false, because I want falsifiable statements like statements about consistency to be either true or false. I don&#8217;t really know what I want for Π2 sentences. Many statements of practical interest are Π2 sentences, so I might be willing to bite the bullet and admit that even some unpractical Π2 sentences like Goodstein&#8217;s theorem are true, and that in fact every Π2 sentence is either true or false. But if this would mean that I also have to admit that every Π3 sentence is either true or false, than I may prefer to already deny this for Π2 sentences.</p></blockquote>\n<blockquote><p>This is only slightly better than the situation for most types of hypercomputation, where it is unclear to me which idealized situations should be modeled by those (I once replied: <a href=\"http://cs.stackexchange.com/questions/33892/complexity-classes-p-np-vs-language-hierarchies-rec-re#comment68741_33893\" rel=\"nofollow\">So I need some type of all-knowing miracle machine to solve &#8220;RE&#8221;, I didn&#8217;t know that such machines exists.</a>)</p></blockquote>\n]]>", "author": "gentzen", "published": "2016-09-07 14:08:53+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>In thinking on the wonderfully meta #66 I wonder what the implications would be of discovering a proof that P!=NP vs P=NP is undecidable.  I&#8217;ve read accounts of what we&#8217;d learn and all the things that would fall out if we had a proof either way, but what if we had proof that the question can not be decided and can only be decided by putting it in as axiom?</p>\n]]>", "author": "adamt", "published": "2016-09-07 15:09:33+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<p>RE: election</p>\n<p>I&#8217;m generally of the belief that we should make good faith effort to understand those we disagree with and to hear them out.  To try and steel man their arguments and not shy away from facts and arguments that are difficult to reconcile with our own beliefs.</p>\n<p>I&#8217;m highly skeptical of ridiculing the other side as dumb and unintelligent or somehow not possessed of the ability to assess their own self-interest.  This strikes me as patronizing and condescending and often the lazy way of dealing with arguments that make us uncomfortable.</p>\n<p>But DAMN am I having a hard time with this election!  I think I have understood the other side and just find them utterly wanting and mired in base delusions at best and sheer stupidity/ignorance at worst.  And then I look at many ostensibly on my side of the aisle and find all kinds of ill behavior and shoddy thinking.</p>\n<p>Thank goodness this election is almost over one way or another and we&#8217;ll have our answer.  I do confess that my opinion of many people who vote the *wrong* way is likely going to take a hard tumble.</p>\n<p>What do you do when you engage in good faith and steel man their arguments and still find that a too large percentage of your fellow man is just so base wrong?</p>\n]]>", "author": "adamt", "published": "2016-09-07 15:22:56+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<p>Helingstay #14:</p>\n<p>Thanks for the response and that article.  So maybe it is your belief that we need to develop and employ lots of different types of mathematics depending on the level and phenomena we are interested in analyzing?  In your opinion, is there any hope for a “grand unified theory” in physics?</p>\n<p>JimV #34:</p>\n<p>I totally agree with you on Zeno’s paradox, and pretty much everything else you wrote.  So do you think there is any benefit in exploring “digital physics” models where discrete, system phenomena can be approximated using continuous mathematics (or floating point approximations of continuous models)?  Obviously, “digital physics” models would fit in nicely with simulation theories, but do you think looking at the physical world from a discrete and finite perspective might offer any additional insights?</p>\n<p>Richard G #77:</p>\n<p>I was aware of Einstein’s skeptical views towards continuous field theories because I actually used a quote of his to promote my movie “Digital Physics”, but I haven’t read that paper you referenced before.  I was only able to get a slide deck pdf on the topic from a presentation John Stachel gave at the Perimeter Institute, but not the paper itself.  How can I get a copy?  Thanks!</p>\n]]>", "author": "Jon K.", "published": "2016-09-07 16:28:20+00:00", "title": "By: Jon K."}, {"content": "<![CDATA[<p>Scott #69: Democrats+Republican vote swapping in favor of Gary Johnson (Libertarian Party) is available here:<br />\n<a href=\"http://balancedrebellion.com/\" rel=\"nofollow\">http://balancedrebellion.com/</a></p>\n]]>", "author": "Michael P", "published": "2016-09-07 16:28:37+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>Michael #123: No, that&#8217;s completely different from vote-swapping as I understand it.</p>\n<p>Vote-swapping:<br />\nJohnson supporter in swing state votes Clinton<br />\nClinton supporter in safe state votes Johnson</p>\n<p>This thing:<br />\nClinton and Trump supporter in swing state both vote Johnson</p>\n<p>Not surprisingly, this other thing is being advocated by Johnson supporters. 🙂</p>\n]]>", "author": "Scott", "published": "2016-09-07 18:42:16+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<blockquote><p><b>AdamT</b> wonders &#8220;What if we had proof that the question [PvsNP] can not be decided and can only be decided by putting it in as axiom?&#8221;</p></blockquote>\n<p>This question is a subset of a broader <i>MathOverflow</i> question, to&nbsp;which numerous mathematical luminaries have contributed, &#8220;<a href=\"http://mathoverflow.net/questions/108433/for-which-millennium-problems-does-undecidable-true\" rel=\"nofollow\">For which Millennium Problems does undecidable -> true?</a>&#8221;</p>\n<p>The consensus answer for PvsNP is &#8220;not&nbsp;obviously&#8221;.</p>\n<p>Note also that the Clay Institute&#8217;s prize jury reserves the right to amend any and all of the Millennium Prize questions as required to recognize outstanding answers.  Thus it&#8217;s entirely consonant with the intent of the Millennium Prizes, to amend the traditional definitions of the complexity classes P and NP, provided that such amendments are consonant with any or all of the&nbsp;diverse traits that Terry Tao (for&nbsp;one) has identified as as characteristic of good mathematics (<a href=\"https://arxiv.org/abs/math/0702396\" rel=\"nofollow\">see arXiv:math/0702396</a>).</p>\n<p>Don&#8217;t like oracles?  Then show that complexity theory becomes more interesting without oracles than with them.  Sounds goofy, but on the other hand, algebraic geometry was transformed in the latter half of the 21st century by radical redefinitions in the consensus view of &#8220;what algebraic geometry is about.&#8221;  </p>\n<p>Are comparably radical transformations in store for 21st century complexity theory and/or quantum computation theory? <i>Shtetl Optimized</i> surely would be a far less interesting blog if the answers to these questions were obvious!&nbsp;🙂</p>\n<p>Kudos to Scott for his suggestion that good <i>Shtetl Optimized</i> questions commonly make good <i>StackExchange</i> questions.</p>\n]]>", "author": "John Sidles", "published": "2016-09-07 21:37:44+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Phil #101: </p>\n<p>Thx for the intriguing link. In case you didn&#8217;t see it, below two related ones:</p>\n<p><a href=\"https://charlesmartin14.wordpress.com/2015/04/01/why-deep-learning-works-ii-the-renormalization-group/\" rel=\"nofollow\">https://charlesmartin14.wordpress.com/2015/04/01/why-deep-learning-works-ii-the-renormalization-group/</a></p>\n<p><a href=\"http://lesswrong.com/lw/ld4/link_an_exact_mapping_between_the_variational/\" rel=\"nofollow\">http://lesswrong.com/lw/ld4/link_an_exact_mapping_between_the_variational/</a></p>\n]]>", "author": "Jay", "published": "2016-09-07 23:40:33+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>Jon K. #122 (and #2),</p>\n<p>I urge you and those who responded to your comment to give some close attention to the following paper from 2004:</p>\n<p>&#8220;Quantum general relativity and the classification of smooth manifolds&#8221; (Hendryk Pfeiffer)<br />\n<a href=\"http://arxiv.org/abs/gr-qc/0404088\" rel=\"nofollow\">http://arxiv.org/abs/gr-qc/0404088</a></p>\n<p>From the abstract:<br />\n&#8220;In any dimension d<=5+1, the classification results provide us with triangulations of space-time which are not merely approximations nor introduce any physical cut-off, but which rather capture the full information about smooth manifolds up to diffeomorphism.\"</p>\n<p>From the body of the paper:</p>\n<p>\"If quantum general relativity in d = 3+1 is indeed a PL-QFT, the following two statements which sound philosophically completely contrary,</p>\n<p>• Nature is fundamentally smooth.<br />\n• Nature is fundamentally discrete.</p>\n<p>are just two different points of view on the same underlying mathematical structure: equivalence classes of smooth manifolds up to diffeomorphism.\"</p>\n<p>I think this is a very important insight, and may have wide-ranging and profound ramifications for physics, and for sorting out the deep difficulties of quantum gravity in particular. As far as I know the paper has been largely ignored.</p>\n]]>", "author": "Chris W.", "published": "2016-09-07 23:52:03+00:00", "title": "By: Chris W."}, {"content": "<![CDATA[<p>PS:  Hendryk Pfeiffer is currently at the University of British Columbia. See <a href=\"https://ca.linkedin.com/in/hendryk-pfeiffer-65b60854\" rel=\"nofollow\">his LinkedIn profile</a>.</p>\n]]>", "author": "Chris W.", "published": "2016-09-07 23:57:11+00:00", "title": "By: Chris W."}, {"content": "<![CDATA[<p><strong>Another PS:</strong>  Also see the paper <a href=\"http://arxiv.org/abs/hep-th/0307247\" rel=\"nofollow\">hep-th/0307247</a>, submitted to arXiv.org by Pfeiffer&#8217;s co-author in 2003. From the abstract:</p>\n<p>&#8220;.. &#8230; ..  An important lesson beyond string theory is that a fundamental length scale can be implemented into the kinematics of general relativity, whilst preserving both space-time as a smooth manifold and local Lorentz symmetry, contrary to common belief.  .. &#8230;&#8221;</p>\n<p>From the opening paragraph of the paper:</p>\n<p>&#8220;The preservation of Lorentz invariance is crucial, as this is one of the most accurately tested symmetries in physics, with no indication that it is broken or deformed at any observable energy scale.&#8221;</p>\n]]>", "author": "Chris W.", "published": "2016-09-08 00:15:40+00:00", "title": "By: Chris W."}, {"content": "<![CDATA[<p>Sniffnoy #112: Sorry, but <a href=\"http://hpmor.com/chapter/5\" rel=\"nofollow\">going gush is so much fun</a>. After Scott warned that you have a PhD in math, I tried to find out who you are, and mainly communicated the fact that I have done so. But I really was delighted to see &#8230;</p>\n<p>Sniffnoy #114: If I were forced to convert the straight-line program encoding to binary to do equality checking, then it would indeed feel strange to consider this as an encoding of natural numbers. But I can do efficient probabilistic equality checking by drawing some number (in a suitable range) and do the computation modulo that number. Whether the greater than operator can be evaluated efficiently in a suitable sense is less obvious.</p>\n<p>I can do more than just add and multiply with this encoding. I can take the exponent with an integer encoded as addition chain. And the fact that I’ll have many straight-line programs for one number where none seems particularly canonical is precisely the reason why I want this encoding: As a counterexample to the widespread belief that equality checking for integers is trivial independent of the encoding.</p>\n<p>The reason why I came up with this encoding in the first place was NJ Wildbergers style of ultra-finitism, which depends on such complexity theoretic questions. It is less relevant to my question to Scott about higher-order concepts and importance of input encoding. (Maybe I will post my removed discussion of reasonable input encodings for integers later, to clarify the sort of issues I suspect there.)</p>\n]]>", "author": "gentzen", "published": "2016-09-08 00:18:45+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>Re #77 and #122,</p>\n<p>The DOI link for John Stachel&#8217;s &#8220;The Other Einstein: Einstein Contra Field Theory&#8221; is:</p>\n<p><a href=\"http://dx.doi.org/10.1017/S0269889700001381\" rel=\"nofollow\">http://dx.doi.org/10.1017/S0269889700001381</a></p>\n]]>", "author": "Chris W.", "published": "2016-09-08 00:26:01+00:00", "title": "By: Chris W."}, {"content": "<![CDATA[<p>Also, in the citations at <a href=\"http://philpapers.org/rec/STATOE\" rel=\"nofollow\">http://philpapers.org/rec/STATOE</a>, I came across <a href=\"http://philpapers.org/rec/HAGLMT\" rel=\"nofollow\">http://philpapers.org/rec/HAGLMT</a>:</p>\n<blockquote><p>I discuss a rarely mentioned correspondence between Einstein and Swann on the constructive approach to the special theory of relativity, in which Einstein points out that the attempts to construct a dynamical explanation of relativistic kinematical effects require postulating a fundamental length scale in the level of the dynamics. I use this correspondence to shed light on several issues under dispute in current philosophy of spacetime that were highlighted recently in Harvey Brown’s monograph Physical Relativity, namely, Einstein’s view on the distinction between principle and constructive theories, and the consequences of pursuing the constructive approach in the context of spacetime theories.</p></blockquote>\n]]>", "author": "Chris W.", "published": "2016-09-08 00:33:39+00:00", "title": "By: Chris W."}, {"content": "<![CDATA[<p>This seems like a good place to ask this: I&#8217;m going to be teaching an &#8220;Exploration&#8221; class for a short January term on cryptography and its history. The class is aimed at students who have precalculus but not necessarily any other math background. Do people have suggestions for topics to cover or specific reading that might be good? Right now, I&#8217;m planning on starting with ancient systems like substitution ciphers, through later polyalphabetic ciphers, and then looking at Diffie-Hellman, and RSA and related ideas. Along the way I&#8217;m intending to look at the historical and policy questions that arise. What other topics would people recommend I cover?</p>\n]]>", "author": "Joshua Zelinsky", "published": "2016-09-08 02:03:58+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Scott #118: The way you use the adjective &#8220;strong&#8221; sounds as if it should be &#8220;strong&#8221; with respect to the control subject. In which case one has to design the Turing Test with knowledge about the control subject. Does that not kind of defeat the purpose? It appears that the only way one can design a &#8220;strong&#8221; Turing Test is if one has an a priori understanding/knowledge of the test taker.</p>\n<p>E.g., I could design a Turing Test for you in English, but about a set of topics that you are very little aware of. </p>\n<p>Also, I see a bit of circularity in your response: on one hand, we would call a being possessing thinking capabilities if it passes a Turing Test, on the other hand we are saying it would pass a Turing Test if it possesses thinking capabilities.</p>\n]]>", "author": "Arko", "published": "2016-09-08 02:04:18+00:00", "title": "By: Arko"}, {"content": "<![CDATA[<p>gentzen #132: I&#8217;m not hidden.  Using Google is not particularly noteworthy.  And again, there are plenty of mathematicians here.</p>\n<p>As for straight-line programming considered as an encoding&#8230; this all just sounds deliberately perverse.  <i>Probabilistic</i> equality checking?  Yikes!  And your suggestion for exponentiation only works if the exponent is given as an addition chain &#8212; OK, you made a note of that point, but like, that&#8217;s actually a serious deficiency, if certain representations don&#8217;t work as inputs (or first have to be converted to a specific form in a potentially costly manner).  Anyway, the most important thing about the natural numbers is the ability to write recursions.  That&#8217;s kind of the defining property, really.  You have to be able to do predecessor and comparison to zero or it&#8217;s not a good encoding, IMO.</p>\n<p>(By the way, I would dispute the statement that I am an &#8220;expert on encoding of integers&#8221;.  What I have studied is (particular aspects of) the computation of integers in weak computational models.  As I&#8217;m arguing here, I do not think that should be considered &#8220;encoding of integers&#8221;.)</p>\n<p>And I mean, you basically confirm this:</p>\n<blockquote><p>And the fact that I’ll have many straight-line programs for one number where none seems particularly canonical is precisely the reason why I want this encoding: As a counterexample to the widespread belief that equality checking for integers is trivial independent of the encoding.</p></blockquote>\n<p>So you are, in fact, looking for a deliberately perverse encoding.  OK.  Now, that would be something if it were to serve as a counterexaple to some actual mathematical statement, but instead it&#8217;s supposed to serve as a counterexample to &#8220;widespread belief that equality checking for integers is trivial independent of the encoding&#8221;.</p>\n<p>Which&#8230; huh?  I mean, OK, maybe there are people out there who believe this, I don&#8217;t do foundations, but like&#8230; this seems obviously false?  I mean first of all this doesn&#8217;t even seem like a formal mathematical statement.  And like for this to be true &#8212; what properties of the integers could this possibly rely on?  Thing is, this statement is making use of <i>none</i> of the structure of the integers, just considering it as a set, so how could anything special about the integers possibly have any bearing on it?</p>\n<p>But like it should be much easier than you&#8217;ve suggested to come up with perverse encodings that make deciding equality hard.  Here&#8217;s one for you: Encode n as a finite graph with chromatic number n.  I&#8217;m really not clear on in what way there is even supposed to be a problem here, and without an actual mathematical statement you&#8217;re trying to disprove I think you&#8217;re going to have a hard time convincing me there is one.</p>\n]]>", "author": "Sniffnoy", "published": "2016-09-08 06:44:58+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>I could fairly easily write an addon you the reader of this blog could install which would automatically turn text like &#8220;Scott #7&#8221; in existing comments into a link to the comment in question, and add a &#8216;reply&#8217; link to each comment which would give you an inline reply box pre-populated with such a link.</p>\n<p>With a little more effort I could make it such that hovering over such a link would give you a floating box with the comment in question, <a href=\"http://imgur.com/a/6wPY1\" rel=\"nofollow\">4chan-style</a> (link SFW).</p>\n<p>With much more effort I could automatically rearrange comments into a tree based on post times and which comment they are replying to (assuming they either use the proposed link or the local convention of starting with &#8220;Scott #7&#8221; or similar). It&#8217;d make page loads a little slower, especially if they had a lot of comments, but it would make threads much easier to follow. (This wouldn&#8217;t work perfectly, because sometimes people address multiple comments and the graph is therefore a DAG (assuming you don&#8217;t manage to reference comments after yours, in which case it&#8217;s just a graph), which is trickier to represent.)</p>\n<p>Would there be interest in such a thing? I could make it as a browser extension with no support from Scott. It would probably make more sense for Scott to do most of this by changing the WordPress config, of course.</p>\n<p>For reference, I wrote a similar addon script for SSC&#8217;s comment system, which is now just included in the site. (It&#8217;s what marks comments as unread and lets you collapse them and so on.)</p>\n]]>", "author": "Bakkot", "published": "2016-09-08 06:53:23+00:00", "title": "By: Bakkot"}, {"content": "<![CDATA[<p>@#135<br />\n&#8221; The class is aimed at students who have precalculus but not necessarily any other math background. &#8221;</p>\n<p>I helped design and teach an undergraduate, no-prerequisites class titled &#8220;Probability for Scientists&#8221; at the University of New Mexico in 2013.<br />\nWe got a lot of mileage from hands-on exercises designed as games, typically with dice and/or coins, to provide concrete examples of randomness, sample space, etc.</p>\n<p>I imagine that information entropy is a critical topic for you. The classic game of identifying human-generated versus true random numbers provides a great intro to &#8220;what is randomness&#8221; (and why are humans so bad at generating it)?  If you address issues of security and side-channel attacks, you could also refer back to humans&#8217; predictability wrt password generation.</p>\n<p>Here&#8217;s the course website for that exercise:<br />\n<a href=\"http://probforsci.blogspot.com/search/label/Week%201\" rel=\"nofollow\">http://probforsci.blogspot.com/search/label/Week%201</a></p>\n<p>Also, for broad or intro-level courses, I&#8217;ve had good results from including episodes from professionally produced youtube instructional content, things like Crash Course Biology. For cryptography, Art of the Problem has a great series titled &#8220;Gambling with Secrets&#8221; that is really well produced: <a href=\"https://www.youtube.com/watch?v=lICOtR078Gw&#038;index=1&#038;list=PLB4D701646DAF0817\" rel=\"nofollow\">https://www.youtube.com/watch?v=lICOtR078Gw&#038;index=1&#038;list=PLB4D701646DAF0817</a></p>\n<p>-hth</p>\n]]>", "author": "helmingstay", "published": "2016-09-08 10:18:33+00:00", "title": "By: helmingstay"}, {"content": "<![CDATA[<p>Thanks for the great comments!<br />\nQuestion r.e. institution experiences:</p>\n<p>To an outsider, your work appears moderately interdisciplinary.  You teach classes that explicitly address physics, math, and philosophy, while keeping abreast of both theory and empirical work in your own field.  From your Ph.D. to present, do you have any observations about the aspects of an institution that aid interdisciplinary collaboration?  </p>\n<p>For example, in your experience has collaboration been hindered by &#8220;big personalities&#8221; at prestigious institutions, or the political dysfunction at state institutions? Socioeconomics or preparation level of student body? Proximity to other major research institutions?  Transportation? Campus liqour laws?  What makes a *good* interdisciplinary institute, and are there any warning signs to watch for?</p>\n]]>", "author": "helmingstay", "published": "2016-09-08 10:28:33+00:00", "title": "By: helmingstay"}, {"content": "<![CDATA[<p>Arko</p>\n<p>You wrote: &#8220;If we accept that passing the Turing Test is a good criterion to tell if a test subject has something of a consciousness of the kind humans possess.&#8221;</p>\n<p>I don&#8217;t think the TT is about consciousness, rather it about trying to arrive at an operational even somewhat minimal definition of &#8220;thinking&#8221;. It tries to answer the question of at what point would we consider a device/program to be &#8220;thinking&#8221;?</p>\n<p>Wikipedia even quotes Turing on this from the original paper.</p>\n<p>&#8220;I do not wish to give the impression that I think there is no mystery about consciousness. There is, for instance, something of a paradox connected with any attempt to localise it. But I do not think these mysteries necessarily need to be solved before we can answer the question with which we are concerned in this paper.&#8221;</p>\n<p>Searle goes a step more and tries to show that something could pass the TT and have no consciousness of what it is doing.</p>\n<p>The problem is that consciousness is internal and not directly measurable at least at this time. We can surmise other humans and other animals are conscious from their behaviors but we have no way to prove it.</p>\n<p>I am interested in what a strong TT would be like. To me it would need to be able to identify TT responses from devices/programs consistently without false positives. It should not  falsely identify humans as devices/programs.. This would include distinguishing humans pretending to be computers and computers pretending to be human pretending to be computers. A daunting task when you also toss in the wide range of human possible responses, including unintelligent responses, joking and/or uncooperative responses, as well as normal responses of autistic savants who might be able to do lightning calculations or impressive feats of memorization.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-09-08 11:25:11+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>Bakkot #138: Your linking add-on sounds like a great idea!  And I&#8217;d be more than happy to make (easy) changes on my end if it would help.</p>\n<p>With threaded comments (like on SlateStarCodex), my main issue is that it&#8217;s hard for me to tell what&#8217;s new after reading the comments and then coming back to them later.  Maintaining a linear sequence but adding automatic links to it sounds like a great solution.</p>\n]]>", "author": "Scott", "published": "2016-09-08 13:56:05+00:00", "title": "By: Scott"}]