[{"content": "<![CDATA[<p>Cough&#8230; </p>\n<p>This answer can be quoted pretty much verbatim when answering the question: &#8220;Why does the Omnipotent Being, a.k.a. God Almighty, exists?&#8221;</p>\n<p>&#8230; And then we come to the question of why anything exists.  For an interventionist, this translates into: what causal lever could have been pulled in order to make [omnipotent being not exist]?  Well, whatever lever it was, presumably the lever itself was [an omnipotent being] — and so you see the problem right there.</p>\n]]>", "author": "Michael P", "published": "2016-02-09 00:33:47+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>Dreams don&#8217;t have the bandwidth of reality because all sensory input has to to simulated by the sleeping brain and it doesn&#8217;t have the capacity. That&#8217;s why you can&#8217;t read books (except for a few words) and can&#8217;t touch or taste anything. The brain devotes a lot of its capacity to visual input so that&#8217;s what we get in dreams. To dream a complete reality your brain would have to have the local computing capacity of reality, and it doesn&#8217;t. Or so I think.</p>\n]]>", "author": "JimV", "published": "2016-02-09 00:49:35+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> suggests (in the original post) that&nbsp; &#8220;To ask &#8216;Why is <i>X</i> true?&#8217; is simply to ask: &#8216;What could we have changed in order to make <i>X</i> false?'&#8221;</p></blockquote>\n<p>To appreciate the vast STEAM-power that Scott&#8217;s suggestion generates, it is helpful to consider a concrete proposition, namely X&nbsp;=&nbsp;&#8220;The quantum metrology triangles of the <i>Systeme Internationale</i> can be physically realized with exponentially small error, and can be computationally simulated to any physically realizable error with PTIME resources.&#8221;  </p>\n<p>Or to strengthen the proposition, X&nbsp;=&nbsp;&#8220;For any finite laboratory temperature, in the limit of vanishing measurement error, the entropic cost of computationally simulating an SI measurement process is equal to the entropic cost of conducting the measurement.&#8221;</p>\n<p>It&#8217;s fun to see how naturally this &#8220;X-postulate&#8221; generates the great themes of quantum mechanics and geometric mechanics.  Grothendieck&#8217;s celebrated question &#8220;What is a metre?&#8221; inspires us to conceive interferometers; the quest for stable wavelengths inspires us to conceive lasers; stable lasers (and masers) answer the question &#8220;What is a second?&#8221;; with metres and seconds in-hand we observe the trajectories of (conserved) masses and (conserved) charges, so that the questions &#8220;What is a kilogram?&#8221; and &#8220;What is a coulomb?&#8221; receive answers, the coupling of magnetic fields yields answers to &#8220;What is a tesla?&#8221;; with Josephson junctions and the integer quantum Hall effect we close metrology triangles by answering questions like &#8220;What is a volt?&#8221; and &#8220;What is an ohm?&#8221;.</p>\n<p>Finally (and most mysteriously) the practical need to conduct experiments deep in a gravity well in an accelerated frame-of-reference forces us to scrupulously account for general relativistic effects (at the classical level).</p>\n<p>The ability to efficiently <i>simulate</i> these experiments is (at it seems to me) equally miraculous to the ability to accurately <i>conduct</i>, and here Scott&#8217;s question &#8216;What could we have changed in order to make <i>X</i> false?&#8217; receives a natural answer, namely: &#8220;The (strictly restricted) set of Hamiltonian functions that nature provides is naturally matched to the (strictly algebraic) state-spaces that geometric mechanics requires for efficient simulation, such that neither can be altered without falsifying &#8216;Postulate X&#8217;.&#8221;</p>\n<p><b>Conclusion</b>&nbsp; The rising tide of textbooks on this topic&nbsp;&mdash; <i>e.g.</i> Doran and Lasenby&#8217;s  <i>Geometric Algebra for Physicists</i> (2003), and Holm, Schmah and Stoica&#8217;s <i>Geometric Mechanics and Symmetry: from Finite to Infinite Dimensions</i> (2009)&nbsp;&hellip; and there are many more&nbsp;&mdash; helps us to perceive an abundance of practical 21st century STEAM-implications that flower naturally from Grothendieck&#8217;s quasi-philosophical question &#8220;What is a metre?&#8221;</p>\n<p><b>Open questions</b>&nbsp; Is Nature mindful of the Postulate X&#8217;s link of privileged Hamiltonian functions to privileged algebraic geometries?  Or are these computational/experimental associations mere fortuitous accidents, of interest mainly to experimental physicists and engineers?  </p>\n<p>These are the sorts of questions regarding which, in Mark Twain&#8217;s phrase, &#8220;It were not best that we should all think alike.&#8221;</p>\n]]>", "author": "John Sidles", "published": "2016-02-09 01:24:02+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Raoul #67, what you report happens also with me, with the exception that sometimes I actually can read a word or two, but then if I try to re- read it, it has changed, and this always wakes me up.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gogins:Michael.html\">Michael Gogins</a>", "published": "2016-02-09 02:29:16+00:00", "title": "By: Michael Gogins"}, {"content": "<![CDATA[<p>JimV #70</p>\n<p>So where does that leave experiences with hallucinogens like DMT and ayahuasca?</p>\n<p>The brain is capable of generating a complete reality that actually seems more real than normal reality. Researchers have actually found the same neural circuits activated that are used in normal vision.</p>\n<p><a href=\"https://www.newscientist.com/article/dn20978-drug-hallucinations-look-real-in-the-brain\" rel=\"nofollow\">https://www.newscientist.com/article/dn20978-drug-hallucinations-look-real-in-the-brain</a></p>\n<p>Similar experiences in sensory deprivation and near death experiences.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-02-09 11:58:14+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>&#8220;Listen to the noise&nbsp;&hellip;&#8221; is a practical maxim of high-precision engineering.  To measure a resistance, observe its Johnson noise.  To calibrate a micro-cantilever, observe its Brownian motion.</p>\n<p>Fancy instruments aren&#8217;t needed.  When we are sleeping uneasily with the flu, and we cough at night, then if there is a piano in the room, we hear each string excited in sympathy with our coughs; the presence of the piano has altered the acoustic vacuum of the room, and hence our noisy coughs elicit hear all the chords that the piano can play.</p>\n<p>Similarly in advLIGO (which has a major announcement coming this Thursday!) the outgoing photons carry in their spectral fluctuations a complete picture of the dynamics of the suspended test-masses.  &#8220;<a href=\"http://xbeams.chem.yale.edu/~batista/vaa/node56.html\" rel=\"nofollow\">Onsager&#8217;s Regression Hypothesis</a>&#8221; is the fancy name that quantum physicists give to this exceedingly useful dynamical principle.</p>\n<p>So fundamental a principle finds reflections too in psychology and sociology.  In sleep our sympathetic neurons fire like piano strings, each excited by the noise of all the others; we experience the emergent chords as dreams.  Similarly in the silence of unprogrammed worship, Friends are deliberately mindful of random settling thoughts, which provide a LIGO-style portrait of the sympathetic connectome of the spirit.<br />\n<blockquote>&#8220;My soul is a hidden orchestra; I know not what instruments, what fiddlestrings and harps, drums and tamboura I sound and clash inside myself. All I hear is the symphony.&#8221;<br />\n&nbsp;&nbsp;Fernando Pessoa, <i>The Book of Disquiet</i></p></blockquote>\n<p><b>Conclusion</b>&nbsp; One reason to study quantum dynamics (not the only reason, to be sure) is to discern in Lars Onsager&#8217;s mathematical physics a beautifully natural grounding for Pessoa&#8217;s principle, which is Freud&#8217;s principle too, that in unprogrammed dreams and mindful silence, &#8220;our hidden orchestras reveal themselves.&#8221;</p>\n<p><b>An open question</b>&nbsp; Perhaps the &#8220;Big Bang&#8221; might aptly be renamed the &#8220;Big Cough&#8221;?</p>\n]]>", "author": "John Sidles", "published": "2016-02-09 13:26:47+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Raoul #67<br />\nDefinitely happens to me.<br />\nIt&#8217;s often related/triggered by some programming problem I&#8217;m dealing with at work.<br />\nBut, within the dream, the problem appears &#8220;mutated&#8221; or &#8220;dumbed down&#8221;, as some sort of puzzle using symbols.<br />\nWithin the dream it&#8217;s as if I have no medium term memory &#8211; I can only hold on to the last 20-ish seconds (or a couple of minutes at the most), so it&#8217;s very hard to deal with anything that requires time coherence (like reading or puzzle solving).<br />\nIt doesn&#8217;t usually wake me up but makes me very frustrated within the dream, and then I eventually wake up feeling exhausted.</p>\n<p>Once I actually experienced something similar in real life.<br />\nI was in the office, working on some very familiar code base I had written over the last few months.<br />\nSuddenly I felt like waves of &#8220;deja vu&#8221; feelings washing over me, the feeling you get from suddenly remembering some dream you had forgotten, but as a constant stream rather than some fleeting sensation.<br />\nAnd at the same time the code I was working on suddenly felt totally unfamiliar &#8211; no matter how much I stared at it, I couldn&#8217;t recognize the file names, I couldn&#8217;t remember how it all fit together&#8230; It felt like I was in a dream!<br />\nI joked with colleagues that I was probably experiencing some sort of seizure and I headed home, but those strange sensations kept coming on and off. In the subway it felt so overwhelming that I nearly lost consciousness. Later, in the street, I opened my laptop to even check my code, hoping I would now recognize it, but I didn&#8217;t. Once I got home I went to bed and after a few hours the symptoms finally had disappeared.<br />\nI saw a specialist (and had an MRI done) but he wasn&#8217;t sure what happened. He claimed it was a seizure, but I think it must have been more like a brain aneurysm.<br />\nFor a few months concentrating was very difficult (my head often felt like in cotton, with headaches), but eventually things got back to normal.<br />\nUp to that point I&#8217;ve always taken for granted my capacity to solve problems and keep complex models in my head to make a living&#8230; that ordeal was quite terrifying.</p>\n]]>", "author": "fred", "published": "2016-02-09 14:44:43+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>JC @ $73: I have never had a drug-induced hallucination so I don&#8217;t know, but expect they also do not completely simulate reality and lack some bandwidth, such as a sense of touch.</p>\n<p>My only data point is a documentary I saw about a serial killer whose defense was that he was subject to hallucinations. He agreed to relive one of the hallucinations under hypnosis to prove his case and a psychologist who analysed the video tape said the killer was faking because he mimed shaking hands with an illusionary person and in real hallucinations the brain avoids situations which require a sense of touch.</p>\n<p>&#8220;Researchers have actually found the same neural circuits activated that are used in normal vision.&#8221; Of course, this was my conclusion as well in my original post. What other neural circuits would the brain use to simulate sight?</p>\n]]>", "author": "JimV", "published": "2016-02-09 16:01:15+00:00", "title": "By: JimV"}, {"content": "<![CDATA[<p>Whenever I encounter a metaphysical question of this sort, I find it more manageable to imagine humanity creating a simulated universe, and then thinking about how residents of that universe might think about this question. </p>\n<p>In that case, the answer to their question would be that their universe exists because we decided to simulate it. But I think it would be very difficult for them to work this out unless we told them. </p>\n<p>Of course, you can always kick the question up a level and ask why our universe exists, which is the ultimate reason why their universe exists. But that sort of ducks the point of the exercise. The point is that their question ends up being well-defined in the sense that there&#8217;s more to the story. So while the question may not have an &#8220;ultimate&#8221; answer that is completely satisfying, it *does* have an answer that conveys information about their universe. And in fact, it&#8217;s a very reasonable question to ask at our level, e.g. &#8220;Why did you guys create a universe?&#8221; </p>\n<p>One possibility is that, if you went up to higher levels above our universe (if such exist), you would reach a level at which the universe is clearly self-existing in some way. I guess this is the classic theist view.</p>\n]]>", "author": "jonathan", "published": "2016-02-09 22:02:27+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>Fred #75, you might be interested in (Fields Medalist) Vladimir Voevodsky&#8217;s <a href=\"http://baaltii1.livejournal.com/198675.html\" rel=\"nofollow\">personal experience of involuntary altered cognition</a> (here Google Translate is a big help).</p>\n<p>Needless to say, when it comes to understanding and healing in these matters, <a href=\"https://www.youtube.com/watch?v=k7OLCbjuidE\" rel=\"nofollow\">humanity is presently in the dark ages</a>. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/frownie.png\" alt=\":(\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "John Sidles", "published": "2016-02-09 23:45:42+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>I think there&#8217;s a reasonable non-interventionist interpretation of &#8220;why is 5 prime?&#8221;: 5 is prime because &#8220;n is prime&#8221; means &#8220;n has exactly two positive integer factors,&#8221; and this can easily be checked case by case. This (and the related &#8220;why-questions are answered with proofs&#8221; arguments above) is clearly quite different in spirit than the more demanding interventionist standard for answers to why questions.</p>\n<p>But my point is that even with the easier standard of &#8220;proofs as explanations,&#8221; it&#8217;s quite hard to explain why the universe exists. It seems metaphysically possible that nothing would exist and the universe would just be the empty universe. Your experience of such a universe would be very similar to your experience of the first 13.82 billion years of our own universe, just without the interesting bits at the end. Any sort of proof that the empty universe is logically or metaphysically impossible would seem very interesting to me, even if it falls short of an interventionist account.</p>\n]]>", "author": "Andy", "published": "2016-02-10 04:42:25+00:00", "title": "By: Andy"}]