[{"content": "Prof. Mitzenmacher<br /><br />I hope this note finds you well. Here is some additional contextual information about the case from the affected party W http://philosophysmoker.blogspot.com/2014/03/w-speaks-about-her-pfo-fo.html<br /><br />In general, IMHO it is a misreading of signals, due in large part to the paucity of side channel cues in email as opposed to say telephone or personal conversations. This being said, the candidate W should have phrased her requirements more delicately - c&#39;est le ton qui fait la musique. <br /><br />I wish you a nice weekend<br /><br />Daniel Bilar ", "author": "Daniel", "published": "2014-03-14 12:48:49.697000-04:00", "title": ""}, {"content": "Based on your summary of the case I was pretty much with you, but when I followed the link and read more I was very much surprised at your conclusion.<br /><br />Our faculty interviews are 2-3 day events in which we tell candidates what we&#39;re looking for and what we have to offer, and candidates let us know what they&#39;re looking for and what they want. Based on all of this we identify who we think is the best fit and we make an offer that reflects this. <br /><br />If during the interview process a candidate were to express preferences for a later start date, pre-tenure sabbatical, etc., we would take that into account and reflect it in the final offer -- or in the decision to not make an offer.<br /><br />The candidate in this case provided critical information after her selection, and as a result the department needed to recalculate everything. The dilemma is that other candidates may then seem preferable and may be lost if the negotiating process goes on too long (and possibly fails).   <br /><br />More generally, it may be okay for a high-caliber candidate to say that certain conditions need to be satisfied for them to consider an offer from a particular institution. However, if a typical candidate does the same then they can come across as over-estimating themselves, which is a red flag for a potential long-term colleague. ", "author": "Anonymous", "published": "2014-03-14 15:41:12.321000-04:00", "title": ""}, {"content": "Daniel -- thanks for the link.<br /><br />Anon:  you say:  &quot;If during the interview process a candidate were to express preferences for a later start date, pre-tenure sabbatical, etc., we would take that into account and reflect it in the final offer -- or in the decision to not make an offer.&quot;  <br /><br />At least in my experience, start date, ability to take leave pre-tenure (usually tied to some notion of getting research done -- as pointed out if you read the articles, even &quot;teaching schools&quot; generally have research requirements) etc. are the subject of negotiation for tenure-track jobs.  For example, if a school needs someone to start ASAP and cannot wait, I&#39;d expect them to express that need, because it&#39;s unusual.  Or, in this case, if that really was necessary, they simply could have said in response to the candidate that they would have to start immediately.<br /><br />You say:  &quot;The candidate in this case provided critical information after her selection, and as a result the department needed to recalculate everything.&quot;  <br />I simply disagree with this assessment.  The candidate was making a request to see what could be accommodated.  That&#39;s called negotiating, and is entirely to be expected.  If the department couldn&#39;t accommodate these requests -- and the candidate was clearly pointing out that she understood at least some subset of them would not be feasible, they could respond no, and provide a suitable deadline.<br /><br />&quot;More generally, it may be okay for a high-caliber candidate to say that certain conditions need to be satisfied for them to consider an offer from a particular institution.&quot;<br /><br />I would say it is OK for all candidates, not just high-caliber candidates.  Employers are allowed to say no.  And I don&#39;t think you&#39;re describing what happened here -- a candidate was considering an offer, and was attempting what seems to me to be a good faith negotiation to understand the limits on the offer.  <br /><br />&quot;However, if a typical candidate does the same then they can come across as over-estimating themselves, which is a red flag for a potential long-term colleague.&quot;  <br /><br />I can understand the issue of not wanting colleagues that over-estimate themselves.  I don&#39;t see that here.  This stage is really the one time a job candidate has any power in terms of making requests before taking a job.  You&#39;re saying it should be a 1-sided take it or leave it from the employer side?  I don&#39;t think so.  <br /><br />As Area Dean I dealt somewhat with these types of situations.  This doesn&#39;t even come close in magnitude to what I&#39;ve seen in terms of requests by some candidates.  And while it wasn&#39;t generally my decision (it was the Dean up from me), if a candidate was asking for things we couldn&#39;t accommodate, I told the Dean to say no where I thought it appropriate.  But we&#39;d never say, &quot;Hey, you are demanding, we don&#39;t want to hire you any more.&quot;  We demand a lot from our faculty;  why shouldn&#39;t they try to ask for something back?   ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-03-14 16:02:29.899000-04:00", "title": ""}, {"content": "This is a very alarming story and fully support Michael interpretation here.<br /><br />The candidate only raised some optional requests. The behavior of Nazareth College Philosophy department is outright despicable, if not illegal. To rescind an offer made explicitly, immediately after the candidate raises some requests shows that they seek workers who will not make even slight demands. <br /><br />Moreover, it&#39;s completely unethical, as it sends a bullying message to other workers who may fear to ask for their rights to be respected, in case they are fired immediately.<br /><br />Unfortunately, such a behavior happens also in some mildly respected CS departments, and not only at Nazareth College or its likes.", "author": "Goodman", "published": "2014-03-15 05:00:36.336000-04:00", "title": ""}, {"content": "It does seem badly handled, quite possibly on both sides.  Though without a signed contract, it seems unfortunate, rather than evil.<br /><br />The candidate does this process once and the department does it often.  So I think the department has more responsibility to move the hiring process in a successful direction and to be aware of that asymmetry.<br /><br />A department has non-trivial risk with a drawn-out negotiation, especially if they don&#39;t see a good compromise. Maybe the department is already stretching hard to try to get the position open at all - this isn&#39;t unlikely at a smaller less rich school.  Perhaps the department can&#39;t offer much (or any) of what the candidate claims to want.   <br /><br />If s/he takes the job anyhow, it&#39;s not unreasonable to be concerned about mismatch problems going forward. <br /><br />I agree that the actual negotiation takes place after the offer.  But the candidate does have responsibility to get some sense of the financial and logistic context.<br /><br />Or if the candidate doesn&#39;t accept after longer discussion, the department&#39;s 2d/3d choice may have  already accepted positions, and there&#39;s a failed search.<br /><br />In industry, offers are generally more standardized by company policy, so the negotiation is mostly salary, which is simpler.  But it&#39;s also much faster moving and fluid than academic jobs.", "author": "Laura", "published": "2014-03-15 08:30:36.673000-04:00", "title": ""}, {"content": "I disagree with you Laura. It seems that you confuse between an outright ethical breach (which Nazareth College are responsible for) and a naive mistake the candidate did (leading to the unfortunate bullying behavior of Nazareth, which she couldn&#39;t have fully expected). <br />There is a stark difference between a moral misconduct and a mistake. <br /><br />I don&#39;t see anything unethical with what the candidate did. She did it with a good faith.<br /><br />The other arguments are also false in my opinion. The fact that Nazareth is alarmed by someone raising requests (to which they could simply reply no), shows that they lack basic ethical standards: respect employees and candidates, respect your words (in this case the offer they made), avoid bullying and pressuring other employees and candidates negotiating their conditions, do not make haphazard and harsh judgments based on a single solid email, etc.   ", "author": "Goodman", "published": "2014-03-15 10:19:07.229000-04:00", "title": ""}, {"content": "C&#39;mon Michael, my comment was not that bad to justify censoring it.<br /><br />Nazareth did something unethical, and the comments are criticizing the poor female candidate for her naive mistake...<br />", "author": "Goodman", "published": "2014-03-16 04:55:18.170000-04:00", "title": ""}, {"content": "Goodman --<br /><br />I didn&#39;t censor anything.  (Indeed, we appear to generally agree.)  Google did put your comments in the spam folder, I don&#39;t know why.  I&#39;ve unspammed them.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-03-16 08:29:12.956000-04:00", "title": ""}, {"content": "Surely not illegal. That&#39;s why contracts between two parties require the signatures of both before they take effect. Anybody can withdraw a contract offer any time they want, up to the point that the other party signs it. <br /><br />You can&#39;t really even tag it as gender biased since there were a number of requests (not demands) in addition to maternity leave.<br /><br />Bad bad bad to be sure. This case should earn the college a hellish reputation until it acknowledges that it screwed up. Everybody should warn their students against working for this place. Or attending it as a student. No one should want to be associated with a place that is this heartless.<br /><br />For some reason, though this is way outside the norms of the profession, &quot;unethical&quot; doesn&#39;t seem like the right word to me. &quot;Despicable&quot; sounds more like it. It&#39;s more like insulting your future in-laws -- no rule against it, and it&#39;s hard say that it&#39;s an ethical principle that has been violated. But it should destroy any hope you may have for having a happy family for a long long time.<br /><br />So much for leaning in, by the way. Maybe someone can sic Sheryl Sandberg on this place.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lewis:Harry.html\">Harry Lewis</a>", "published": "2014-03-19 22:43:31.296000-04:00", "title": ""}, {"content": "Harry --<br /><br />My wife Stephanie immediately brought up the &quot;Leaning In&quot; connection when I told her the story too.<br /><br />I can live with despicable as a description instead of unethical -- which I know carries weighty overtones.  Or, as you put it, just &quot;bad bad bad&quot;.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-03-20 07:41:55.703000-04:00", "title": ""}]