[{"content": "<![CDATA[<p>With decline of the dominance of MS, we in the CS research community can only hope that other companies like Google and Apple (which have now gained the required size and stability) will start supporting basic computer science research. BTW MSR management has clarified that there will be NO further layoffs.</p>\n]]>", "author": "anon", "published": "2014-09-26 23:40:05+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>#50</p>\n<p>Politics is everywhere in the industry.<br />\nIn fact, it is mostly politics.<br />\nThe executives are callous and careless, probably never more than nowadays.<br />\nThe industry is in Dark Ages, meritocracy is dead for all practical purposes.</p>\n]]>", "author": "Tony", "published": "2014-09-27 05:29:29+00:00", "title": "By: Tony"}, {"content": "<![CDATA[<p>anon #67: At this point, everyone understands that &#8220;MSR management has clarified that there will be NO further layoffs&#8221; means &#8220;no further layoffs within the next 6-12 months&#8221;.</p>\n<p>Folks who have TCS Ph.D.s and are at the level of full-time MSR researcher are grown-ups (mostly). This means that people who have other options will go elsewhere, and MSR will get the people who don&#8217;t have any other option. That is not the kind of organization you want to build, whether it&#8217;s a research lab or a factory floor.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/2/2:anon.html\">anon 2</a>", "published": "2014-09-27 08:05:04+00:00", "title": "By: anon 2"}, {"content": "<![CDATA[<p>Scott #64:</p>\n<p>For the record, I love Red Lobster; and shellfish are awesome. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /></p>\n]]>", "author": "Rahul", "published": "2014-09-27 12:13:32+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> asks &#8220;John Sidles #56: I assume I’m not going to get a comprehensible answer, but </p>\n<p>[<b>Q1</b>]&nbsp; why were the SVC researchers “complicit in obtuse concentration,” whatever that means? </p>\n<p>[<b>Q2</b>]&nbsp; Does it mean: complicit in their own firing? </p>\n<p>[<b>Q3</b>]&nbsp; Do you know anything about them or their research, that would justify such a statement?&#8221;</p></blockquote>\n<p>Scott, please let me offer <b>weak</b> answers to your questions&nbsp;&hellip; weak in that the answers <i>themselves</i> are flawed by &#8220;obtuse concentration.&#8221;</p>\n<p><b>A1</b>&nbsp; &#8220;Obtuse concentration&#8221; is the cognitive trait of concentrating obtusely upon narrow questions that have convenient answers, thereby failing to &#8220;enlarge the space in which you may be strong&#8221;.</p>\n<p>This answer borrows from Margaret Schlegel-Wilcox&#8217;s memorable discourse in Forster&#8217;s <i>Howards End</i> (per comment #22 above); </p>\n<p><b>A2</b>&nbsp; No.</p>\n<p><b>A3</b>&nbsp; Yes, but only in that <i>everyone</i> knows it (or should).</p>\n<p>In particular, <i>Shtetl Optimized</i> readers are invited to verify for themselves that the Microsoft Corporation&#8217;s market capitalization (in constant dollars) peaked in 1998.  The subsequent sixteen years of capital stagnation has been bad news for Microsoft Research Labs, whose employees are young, in which retirements are few, whose vitality depends in part upon ongoing recruitment of talented young researchers.  </p>\n<p>To put it plainly, stagnating businesses cannot sustain vigorous research laboratories, any more than stagnating national and global economies can sustain vigorous research universities.</p>\n<p>In striking contrast, numerous computation-centric enterprises have exhibited exponential growth in this same time-period (see for example the market capitalization of <a><b>NASDAQ: ANSS [Ansys Corporation]</b></a>)</p>\n<p><b>Obtusely concentrated summary</b>&nbsp;  Microsoft SVC researchers and Microsoft executives were jointly complicit&nbsp;&mdash; and equally derelict in duty-to-shareholders&nbsp;&mdash; in <i>not</i> asking &#8220;Why isn&#8217;t Microsoft&#8217;s research strategy-and-development strategy more viably like Ansys&#8217;?&#8221;</p>\n<p><b>Broadly illuminating summary</b>&nbsp; Better/broader answers than market-valuation can supply are illuminated (as it seems to me) by the friendly comments of Tim Gowers/Dick Lipton/Ken Regan/Alexander Grothendieck/Neil Stephenson/Wendell Berry, as quoted in comments #16, #30, #49, and #57 above.</p>\n<p><b>There&#8217;s more</b>&nbsp; Much more can be said upon the general topic of STEAM-hope, and needless to say, it is neither necessary, nor feasible, nor desirable, that everyone agree in these matters.  Perhaps we can all agree with John von Neumann (1955) though:<br />\n<blockquote>&#8220;The most hopeful answer is that the human species has been subjected to similar tests before, and seems to have a congenital ability to come through, after varying amounts of trouble.&#8221;</p></blockquote>\n<p>Here von Neumann is borrowing from then-SecD Charles Erwin &#8220;Engine Charlie&#8221; Wilson: &#8220;The price of progress is trouble, and I must be making lots of progress.&#8221; </p>\n<p><b>Postscript</b>&nbsp; Perhaps I had better say that my wife (Constance Sidles) has begun writing a book upon the topic of &#8220;hope&#8221;.  </p>\n<p>Especially on our hot crowded 21st century planet, Connie&#8217;s essays crucially grapple with STEAM-hope, regarding which there is *far* more to say than &#8220;obtusely concentrated&#8221; NASDAQ market-measures (and oracle-grounded complexity zoos)  can can ever encompass.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-09-27 15:47:22+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Seems pretty relevant to the discussion:</p>\n<p><a href=\"http://arstechnica.com/science/2014/09/are-we-producing-too-few-or-too-many-science-and-technology-grads/\" rel=\"nofollow\">http://arstechnica.com/science/2014/09/are-we-producing-too-few-or-too-many-science-and-technology-grads/</a></p>\n<p>We seem to be producing researchers fitted for academic setting but ill-prepared for commercial context.</p>\n]]>", "author": "fred", "published": "2014-09-27 22:11:17+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>bjuba #18:</p>\n<blockquote><p>&#8220;Sergey’s work was on systematic locally reconstructable codes. You can think of this as an improvement of the parity-check code used in RAID — when there are no errors, you can just read the data off directly from the code, and when disks fail, you can reconstruct the lost disk efficiently by only looking at a few of the other disks.&#8221;</p></blockquote>\n<p>Moving away from the layoffs-sage, does the Sergey-strategy circumvent the common worry about using RAID5 or RAID6 with large drive sizes? Say above 4 TB or so, the probability of dual / triple errors especially during reconstruction in the aftermath of a failed drive?</p>\n<p>Or the days or week long reconstruction time with large volumes?  </p>\n<p>I&#8217;d love a blog post or more comments on  Sergey&#8217;s work!</p>\n]]>", "author": "Rahul", "published": "2014-09-28 06:46:34+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>The following is not my explanation, but I find it convincing:</p>\n<p>Corporates perform research which they think will be useful for them for the period they see as &#8220;their future&#8221;. Moreover, the closer the corporate is to be a monopoly, the better it is positioned to have a monopoly on the applications of the research; thus the more beneficial it is for the corporate to be open about this research.</p>\n<p>In the 50s and 60s Bell and IBM saw their future as infinite, and where monopolies, so having huge and well funded labs made sense (they where right by the way &#8211; the labs output only increased the barriers to entry for new players &#8211; eventually the US DOJ had to deal with both of them). When MS research was founded, Gates thought the same; he was wrong (MS was not a monopoly long enough to take advantage of the research arm&#8217;s output), and they are no longer a monopoly.</p>\n]]>", "author": "David", "published": "2014-09-28 09:15:09+00:00", "title": "By: David"}, {"content": "<![CDATA[<p>What can be really scary about such lay-offs is how hard it can be to check that they actually happened. I work in the semiconductor manufacturing industry, and heard in June 2014 the following rumors regarding &#8220;real&#8221; lay-offs:</p>\n<blockquote><p>\nIn the multi-beam direct-write segment, <a href=\"http://semiengineering.com/multi-beam-sees-the-light/\" rel=\"nofollow\"> multiple sources indicate that KLA-Tencor is exiting</a> this market. Officials from KLA-Tencor declined to comment.</p>\n<p>[...]</p>\n<p>KLA-Tencor, meanwhile, has been developing Reflective Electron Beam Lithography (REBL), which was originally funded by DARPA. In fact, DARPA poured over $100 million in funding into the REBL program.</p>\n<p>KLA-Tencor was able to develop an alpha tool, based on the REBL concept. At the recent SPIE conference, the company reported some impressive results. The key to the technology is a CMOS-based digital pattern generator module, which enables more than 1 million beams at full current. Reports of its exit from this market leave its development efforts in question.\n</p></blockquote>\n<p>I actually have business cards from people that work(ed) there, but would you want to send them an email asking: &#8220;I heard your division will be closed and all of you are laid-off. Can you confirm this?&#8221; Maybe next time I go to a conference, I will try to find out what really happened&#8230;</p>\n]]>", "author": "gentzen", "published": "2014-09-28 16:12:33+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>krishna #26</p>\n<p>Do you have any idea how big a staff of 75 is? I worked with IMS Nanofabrication, one of the remaining players in the multi-beam market, and they had significantly fewer than 75 employees total (including all support staff), and will probably succeed in bringing their new technology to market. How will they do this? They know their own strengths, and collaborate with experienced partners for the parts where they are lacking experience and workforce.</p>\n<p>Known big players like ZEISS Semiconductor Manufacturing Technology might have more employees, but they also have a much bigger technology and product portfolio to manage. Any single product and technology of them will probably have significantly fewer than 75 employees working on it. This works, because they too collaborate with other groups, both internal and external (ASML&#8230;)</p>\n]]>", "author": "gentzen", "published": "2014-09-28 16:22:34+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>Rahul: depending on how liberally you interpret &#8220;RAID,&#8221; it may (1) reduce the number of disks involved during reconstruction, (2) tolerate more failures and/or (if you&#8217;re already considering previously existing state-of-the-art error-correcting codes to fall under the umbrella of RAID) (3) achieve 1 & 2 while allowing the normal-case data access to be just a single read from a disk. </p>\n<p>If you&#8217;re interested in the concrete quantitative improvements in overhead, speed, and/or error tolerance, I&#8217;d advise you to have a look at the USENIX ATC paper. Section 5 is a reasonably complete comparison with the Reed-Solomon codes that were previously the code of choice in distributed file systems.</p>\n]]>", "author": "bjuba", "published": "2014-09-29 03:11:47+00:00", "title": "By: bjuba"}]