[{"content": "&#39;Benedict, Pope emeritus&#39; is the preferred designation.  I don&#39;t think you can casually call him Pope the way an emeritus professor is still Prof.", "author": "Anonymous", "published": "2013-11-05 08:14:06.379000-06:00", "title": ""}, {"content": "I don&#39;t think Odifreddi is &quot;in politics&quot; in any way. He&#39;s just a mathematician who&#39;s written popularization and opinion articles about sundry topics. He&#39;s become well known to the public mostly because he&#39;s an outspoken atheist who often criticizes the Catholic church (as well as other religions). Hence the chance of getting a reply from the pope.", "author": "Anonymous", "published": "2013-11-05 08:21:03.003000-06:00", "title": ""}, {"content": "Anon 1- YES, that is a better way to refer to him, and I have made the change.<br /><br />Anon 2- YES, `in politics&#39; is not correct&#39; and I have changed it.<br /><br />I responded to your comments- does that make your Pope Number 3? :-) ", "author": "GASARCH", "published": "2013-11-05 08:28:10.270000-06:00", "title": ""}, {"content": "How does one define &quot;connection&quot; for this?  Co-authors is fairly well-defined.  Co-stars (Bacon Game) is less well-defined since a &quot;co-star&quot; might not even share a scene with the other &quot;co-star&quot; and still count.  Calling &quot;connected&quot; vague would be an understatement.  If I rode on a bus with someone, are we &quot;connected&quot; in terms of the degrees of separation?  I was at the inauguration with a million or so people, are we connected?  ", "author": "Anonymous", "published": "2013-11-06 08:55:23.565000-06:00", "title": ""}, {"content": "Link to wiki should be http://en.wikipedia.org/wiki/Six_degrees_of_separation", "author": "dom", "published": "2013-11-06 09:46:48.302000-06:00", "title": ""}, {"content": "Agreed that the term is ill-defined.<br />For my Pope Number I am using `will return an email from&#39; as the metric.<br />Odilfreddi would return and email from me, and the Pope Emeritus would return an email from him.", "author": "GASARCH", "published": "2013-11-06 09:54:48.103000-06:00", "title": ""}, {"content": "Thanks, Fixed.<br />(I had the pointer to the page talking about the page, rather than the page itself.)<br />", "author": "GASARCH", "published": "2013-11-06 09:55:17.763000-06:00", "title": ""}]