[{"content": "Interesting post -- thank you.  I&#39;m sorry, but I can&#39;t resist the troll bait: what exactly is the service that ACM offered in exchange for $1100/paper?  Could this service not have been offered much more cheaply by arxiv.org or some other competitor?", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gutoski:Gus.html\">Gus Gutoski</a>", "published": "2013-11-07 10:00:50.112000-06:00", "title": ""}, {"content": "Sigh.  As someone who has gone to systems-y conferences (though I&#39;ve never been to SOSP, I&#39;ve been to SIGCOMM and some others) I find your enjoying yourself unsurprising.  They generally have very good papers and talks.  There&#39;s generally lots of good theory work at systems conferences -- though it wouldn&#39;t get the attention of most of the theory community.  Their conferences get high attendance so there&#39;s plenty of people to talk to.  They&#39;re also fun people.    <br /><br />The &quot;practical proof-based verifiable computing&quot; paper you missed is excellent work by a group that&#39;s been working in parallel (and, more recently, in conjunction) with (my now-graduated student) Justin Thaler, which naturally has a lot of theory behind it, and the challenges (both theoretical and practical) are how to push the theory to a desirable system.  <br /><br />I&#39;d expect there to be more collaborations of that type between systems and theory -- and certainly there are some going on all the time -- but for the most part the two communities don&#39;t communicate and pay attention to each other.  (Actually, I think the systems people are better at paying attention to us than the other way around;  I think they know a good theoretical attack for a real problem will mean a good publication, while on the theory side, coming up with an algorithm for a real problem is not necessarily helpful and sometimes outright harmful to your publication chances at a theory conference.)  <br /><br />Constructively, perhaps the NSF should set up a grant specifically to fund theorists going to systems conferences for the first time and systems people going to theory conferences for the first time.  That seems like a possibly effective and relatively cheap way to get the communities to communicate more.  (Yes, at most universities, ostensibly a theorist could walk down the hall to talk to a systems person, or vice versa, but generally that doesn&#39;t actually happen.)", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2013-11-07 15:14:26.029000-06:00", "title": ""}, {"content": "there is more trust that ACM will preserve the papers in the very long run?<br />", "author": "Anonymous", "published": "2013-11-08 17:27:10.686000-06:00", "title": ""}]