[{"content": "<![CDATA[<p>OK, circling back to some older comments, Rahul #5:</p>\n<ul>Naive question: For a long time the laws of Physics seemed to be left-right symmetric. Until they were found to be not so in certain very specific cases- the overthrow of parity.</p>\n<p>Is a similar situation possible with the Time-symmetry of the laws of physics? Or have we reason to believe we won’t find such laws?</ul>\n<p>To maybe add to Audun #10 and #11: it turns out to be a theorem in quantum field theory (whose proof I don&#8217;t understand) that the laws of physics <i>must</i> be &#8220;CPT-invariant&#8221;: that is, symmetric under reversing the direction of time (T), exchanging left with right (parity, P), <i>and</i> exchanging particles with antiparticles (charge, C).  The theorem says nothing about what happens if you do only one or two of the three, and indeed, it was experimentally discovered (as you said) that the laws of physics are <i>not</i> invariant under any stronger symmetry, like charge only (C), parity only (P), or charge plus parity (CP).  But for CPT invariance to fail, basically the whole framework of quantum field theory would need to be wrong.</p>\n<p>Incidentally, if you just wanted the weaker statement that the laws of physics are <i>reversible</i>&#8212;i.e., that they don&#8217;t create or destroy information&#8212;rather than that they look exactly the same backwards and forwards up to CP symmetry, then that follows immediately from the unitarity of quantum mechanics; you don&#8217;t need anything about QFT.</p>\n]]>", "author": "Scott", "published": "2015-03-10 18:25:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Shmi Nux #6:</p>\n<ul>When you imagine a block universe compatible with QM, do you see it as a single slab of spacetime or as a tree of Many Worlds with a clear direction “up” into the future, where there are more branches than in the past? Or as something else? (I’m asking about your mental picture, not about any kind of underlying physical reality.)</ul>\n<p>I dunno &#8230; if someone says &#8220;block universe,&#8221; I guess I just picture some translucent 3-dimensional block, mostly because of the <i>word</i> &#8220;block&#8221; (if I called something the &#8220;giraffe universe,&#8221; what picture would <i>you</i> associate with it? <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> ), but also because the philosophers usually talk about the &#8220;block universe&#8221; within the context of classical special relativity, not bringing in quantum mechanics or even GR.</p>\n]]>", "author": "Scott", "published": "2015-03-10 18:30:36+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>anon #34:</p>\n<ul>for sure Einstein was referring to the block universe. So, I do not understand why you mention the T-invariance in mechanics.</ul>\n<p>Yeah, I thought about omitting it, for exactly the reason you say.  But on reflection, isn&#8217;t T-invariance part of the <i>intuition</i> for the block universe?  The thought being: given that we could run the equations backward just as easily as forward, should we even think of them as being &#8216;run&#8217; at all?  If T-invariance hadn&#8217;t held, then at least we could say that any computer program to reproduce our world from one spacelike slice would presumably need to start at the beginning and work forwards, just as we na&iuml;vely imagine time itself to do.</p>\n]]>", "author": "Scott", "published": "2015-03-10 18:39:21+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>fred #73:</p>\n<ul>Is there the equivalent of the wave function collapse going backwards?!</ul>\n<p>Some people might <i>define</i> the Many-Worlds interpretation (or more broadly, the &#8220;modern decoherence view&#8221;) to be the assertion that the answer to that question is yes&#8212;i.e., that in principle, just as an egg could spontaneously unscramble itself without violating any microscopic laws, so too a measured qubit could spontaneously get disentangled from the measuring apparatus and surrounding environment, and thereby become &#8220;unmeasured,&#8221; its original quantum state restored.  Both of these things are ruled out only on thermodynamic grounds (i.e., once again, because of the specialness of the initial state).</p>\n]]>", "author": "Scott", "published": "2015-03-10 18:43:58+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #82:</p>\n<blockquote><p>&#8220;Incidentally, if you just wanted the weaker statement that the laws of physics are reversible—i.e., that they don’t create or destroy information—rather than that they look exactly the same backwards and forwards up to CP symmetry, then that follows immediately from the unitarity of quantum mechanics; you don’t need anything about QFT.&#8221;</p></blockquote>\n<p>I didn&#8217;t get the distinction between the weak & strong version.</p>\n<p>e.g. Can you give an example of something that is reversible but the laws do not look exactly the same?</p>\n<p>i.e. What&#8217;s &#8220;create & destroy information&#8221; versus &#8220;look the same&#8221;?</p>\n]]>", "author": "Rahul", "published": "2015-03-10 18:51:58+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul #86: Suppose the &#8220;state of the universe&#8221; consisted of an integer mod N.  And suppose the &#8220;laws of physics&#8221; consisted of just applying the map</p>\n<p>x := x+1 (mod N)</p>\n<p>over and over.  Then the time-reversed laws of physics would be</p>\n<p>x := x-1 (mod N),</p>\n<p>which is different in form (it involves subtraction rather than addition), but clearly the laws are still perfectly reversible.  (In this example, the analogue of &#8220;CP reversal&#8221; would be interchanging addition with subtraction.)</p>\n]]>", "author": "Scott", "published": "2015-03-10 18:59:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #74 Is it safe to say that there is nothing new or interesting in <a href=\"http://arxiv.org/pdf/1502.05926v1.pdf\" rel=\"nofollow\">http://arxiv.org/pdf/1502.05926v1.pdf</a> ?  It is two years since your blog debates on the topic.  I expect the answer to be yes <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /></p>\n]]>", "author": "dorothy", "published": "2015-03-10 19:55:13+00:00", "title": "By: dorothy"}, {"content": "<![CDATA[<p>Scott:</p>\n<p>&#8220;And yes, relativity encourages this perspective, by showing that different observers, moving at different speeds relative to each other, will divide up the 4-dimensional manifold into time slices in different ways, with two events judged to be simultaneous by one observer judged to be happening at different times by another.&#8221;</p>\n<p>So why does everybody agree on the age of the universe?</p>\n]]>", "author": "DB", "published": "2015-03-10 20:03:15+00:00", "title": "By: DB"}, {"content": "<![CDATA[<p>DB #89: Unless I&#8217;m mistaken, because you can, e.g., define time in the rest frame of the cosmic microwave background radiation (or: the frame in which the observable universe looks roughly isotropic, with no anomalous redshifts in one direction and blueshifts in the other).  In effect, even though the underlying laws of physics have no preferred inertial frame, cosmology <i>does</i> pick out a preferred frame.  You can even measure the earth&#8217;s speed with respect to that frame; it&#8217;s <a href=\"http://image.gsfc.nasa.gov/poetry/ask/a10552.html\" rel=\"nofollow\">apparently</a> about 360 kilometers per second.</p>\n]]>", "author": "Scott", "published": "2015-03-10 20:26:47+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>dorothy #88: Yes, it&#8217;s <b>extremely</b> safe to assume that. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" />  Once again, the authors give a classical vortex model that they claim can violate the CHSH inequality, reproducing the prediction of quantum mechanics.  Once again, they wrongly assert that the derivation of the CHSH inequality improperly assumes that any influences between the two detectors have to &#8220;travel with the photons,&#8221; and that the reason their classical model can violate CHSH is that it doesn&#8217;t satisfy that assumption.  In fact, as I tried to explain to them about 200 times, the derivation of CHSH assumes nothing except the causal structure of spacetime (i.e., influences between the detectors can travel by <i>any means whatsoever</i>, as long as they don&#8217;t go faster than light).  This means that either</p>\n<p>(a) there must be signalling between the detectors in their model, perhaps smuggled into the &#8220;quadratic terms in Euler&#8217;s equation&#8221; (which would render the result uninteresting), or else</p>\n<p>(b) there must be an error in their derivation.</p>\n<p>I&#8217;ll be <i>extremely</i> grateful to any readers who want to look carefully, and explain to us whether (a) or (b) holds.  But if Alice and Bob get to choose polarizations v and w independently, and there&#8217;s no communication between them, then they&#8217;re not going to produce independently-uniform random bits that are correlated with probability cos<sup>2</sup>(v-w) and anticorrelated with probability sin<sup>2</sup>(v-w).  I&#8217;m as sure of that as I am that &radic;2 is irrational.</p>\n]]>", "author": "Scott", "published": "2015-03-10 20:38:33+00:00", "title": "By: Scott"}]