[{"content": "<![CDATA[<p>Sniffnoy #21: Yes, I think it can be made reasonably intuitive.  Suppose you&#8217;re a verifier, expecting two quantum witnesses that you&#8217;re going to cross-check against each other by measuring them in different, randomly-chosen bases.  If the prover can entangle the witnesses, that might open up lots of ways for the prover to cheat&#8212;just like how entanglement lets you &#8220;cheat&#8221; in the CHSH game, winning it with greater than the &#8220;maximum possible&#8221; probability.  So the assumption that the witnesses are unentangled gives more power to the verifier.  And of course, the other way to think about it is that, if the verifier had wanted to eliminate the prover entirely, in the case of one witness it would just need to solve a convex optimization problem, but in the case of two or more witnesses (that are promised to be unentangled) it needs to solve a non-convex one.</p>\n<p>If you want to understand how the promise of unentanglement actually gets used in real protocols, I think the first step would be to check out the <a href=\"http://arxiv.org/abs/0709.0738\" rel=\"nofollow\">Blier-Tapp protocol</a>, which verifies that a graph is 3-colorable with two unentangled quantum proofs of log(n) qubits each, albeit with only a 1/poly(n) probability of catching cheating provers (which is why it doesn&#8217;t imply QMA(2)=NEXP&#8212;that 1/poly(n) becomes 1/exp(n) when you scale up by an exponential).  Next you could look at <a href=\"http://www.scottaaronson.com/papers/qma2out.pdf\" rel=\"nofollow\">our paper</a>, where we verify that a 3SAT instance is satisfiable using O(&radic;n polylog(n)) unentangled quantum proofs of log(n) qubits each.  We tried hard to give an intuitive explanation of the protocol before delving into the soundness analysis.</p>\n]]>", "author": "Scott", "published": "2015-11-02 12:04:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #16,</p>\n<p>(1) thanks!<br />\n(2) ok then I&#8217;ll need to refine it</p>\n<p>Joshua Zelinsky #19</p>\n<p>Interesting! Could you provide a specific exemple (of a purposes for which one would want associativity, but for which alternativity may be enough)?</p>\n<p>Douglas Knight #20</p>\n<p>Is it possible your post was cut? What are OP, BFD, O(n), U(n), Sp(n), R, C, H?</p>\n]]>", "author": "Jay", "published": "2015-11-02 13:22:07+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>I looked briefly at the paper, and that level of math is obviously way over my head.<br />\nThe proof doesn&#8217;t seem that long, but how &#8220;difficult&#8221; is it for a professional in the field?<br />\nHow likely is it that some mathematical error is lurking in there?<br />\nIs there a way to test this with an actual program/simulation?</p>\n]]>", "author": "fred", "published": "2015-11-02 14:07:13+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>fred #25: This is a brand-new preprint that hasn&#8217;t been peer-reviewed, and I haven&#8217;t verified all the details.  So, yes, it&#8217;s always possible in such a case that an error will surface&#8212;either in this paper or in one of the several other recent papers that it relies on&#8212;and if it does of course I&#8217;ll update the post.</p>\n<p>I decided to blog this because, as I mentioned in the post, I&#8217;m very satisfied that Martin did everything reasonable to try to test and refute his own result (e.g., making sure it didn&#8217;t imply anything absurdly strong).</p>\n<p>Hopefully it will only take a year or so for this to be fully reviewed and appear in a journal.  In practice, though, &#8220;review&#8221; will happen faster: various experts (especially grad students <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> ) will work through the arXiv preprint, and will let Martin know if there&#8217;s anything they don&#8217;t understand.  And if this blog post causes that to happen a bit faster than it otherwise would have, so much the better.</p>\n<p>The question about testing with an actual program or simulation is actually a very interesting one in this case.  A curious feature of Martin&#8217;s proof is that, at the end of the day, it <i>gives an algorithm</i> to simulate QMA(2) protocols, but it does so in an extremely non-explicit way&#8212;basically by chaining together a sequence of reductions, rather than by directly telling you how you&#8217;d program your computer to do the simulation.  If there <i>were</i> a bug, then possibly a good way to find it would be to unravel the reduction sequence into an actual algorithm.  Actually <i>implementing</i> the algorithm might be overkill, though, particularly since the polynomial blowups would be quite large, and might make it almost impossible to notice the difference between exponential time and doubly-exponential time in any simulations that we could feasibly do.</p>\n]]>", "author": "Scott", "published": "2015-11-02 14:35:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Douglas #20 and Sniffnoy #22,</p>\n<p>Ok. Yeah, I&#8217;m convinced that&#8217;s a bad heuristic which I shouldn&#8217;t use, and certainly not in this case.</p>\n<p>Jay #24,</p>\n<p>Douglas&#8217;s example of OP^1 is a good example <a href=\"https://en.wikipedia.org/wiki/Cayley_plane\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Cayley_plane</a> . I was actually thinking of the connnection between the octonions and Spin(8), but thinking about that more, I&#8217;m not actually sure that being alternative is at all important there.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2015-11-02 16:25:52+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Joshua #27,</p>\n<p>Thanks. Would you say this mathematical operation looks like measuring some octonionic state by an apparatus itself an octonionic state, or it&#8217;s too far-fetched?</p>\n]]>", "author": "Jay", "published": "2015-11-02 18:01:30+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>joe #18: thank you very much: this is really what I was looking for!</p>\n]]>", "author": "anon", "published": "2015-11-02 19:33:27+00:00", "title": "By: anon"}, {"content": "<![CDATA[<p>Jay #28,</p>\n<p>I&#8217;m no sure what you mean. What mathematical operation are you referring to?</p>\n]]>", "author": "Joshua Zelinsky", "published": "2015-11-02 23:05:40+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Scott #23: OK, I guess I&#8217;ll have to take a look at those to get a better sense of it!</p>\n]]>", "author": "Sniffnoy", "published": "2015-11-03 00:43:15+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>More octonion nitpicking: The Cayley plane is <b>OP</b>^2, not just <b>OP</b>^1, that would really be terrible if you could only get <b>OP</b>^1.</p>\n<p>(Its existence can kind of be attributed to alternativity &#8212; it exists because of being able to divide, i.e. the loop property, and getting that from inverses uses alternativity.  Whereas if you go on to sedenions then you have useless &#8220;inverses&#8221; that don&#8217;t actually let you divide.)</p>\n]]>", "author": "Sniffnoy", "published": "2015-11-03 00:48:19+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Scott #8:</p>\n<p>I totally admire your gumption in engaging and debating all comers, on topics technical and otherwise, on top of a very demanding job. The physical and emotional energy required is enormous. There can&#8217;t be many people in the world taking on a task like this. </p>\n<p>So hang in there and keep up the good work!</p>\n]]>", "author": "Raoul Ohio", "published": "2015-11-03 04:52:38+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>I&#8217;m fairly sure the Sedonions were the bad guys in a 1970&#8217;s era Dr Who story (though it could have been their friends, the Sedonians).</p>\n]]>", "author": "Nick Read", "published": "2015-11-03 16:11:19+00:00", "title": "By: Nick Read"}, {"content": "<![CDATA[<p>I was really confused when I wrote that parenthetical. But OP¹ is not a triviality. If you think of it as just the one-point compactification of O, that is a triviality. But if you think of it as lines in O², so it has a bundle of lines, that&#8217;s a significant structure.</p>\n]]>", "author": "Douglas Knight", "published": "2015-11-03 17:29:34+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<blockquote><p>suppose that, instead of vectors composed of imaginary numbers (e.g. quantum state), QMA were defined as exchanging vectors of quaternions (or octonion, sednion, etc). Is QMA known to be, as a complexity class, robust to this kind of change, or would this modification deeply impact the properties of this complexity class?</p></blockquote>\n<p>My answer: Essentially every topic in both quantum physics and quantum computation/information has the property that anything that you could with real or quaternionic amplitudes can be co-opted in one way or another by formalism with complex amplitudes.  The essential point is that the norm squared of an amplitude is a probability.   After that, everything works better with complex amplitudes simply because the complex numbers are both commutative and algebraically closed.</p>\n<p>This point is woven into linear algebra itself.  Do you ever wonder why linear algebra is largely taught over the complex numbers?  There is a notion of quaternionic linear algebra, so why isn&#8217;t it usually taught?   The answer is that quaternionic linear algebra reduces to a special case of complex linear algebra.  Real and complex linear algebra also reduce to special cases of each other, but in the end the version with complex numbers is just nicer because they are algebraically closed.  (Since they are simpler for many purposes, I think that they should have been called the &#8220;complete&#8221; numbers rather than the complex numbers.)</p>\n<p>There are some questions in mathematics and even in quantum physics that are more nicely stated in terms of quaternions than complex numbers.  But it&#8217;s not that many, and even then, notational standardization based on complex numbers has its advantages.</p>\n]]>", "author": "Greg Kuperberg", "published": "2015-11-03 17:57:31+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<blockquote><p>The interesting question, to my mind, is whether this is because of something inherent about the silicon / integrated circuit architecture, or merely because once the whole world converges around some architecture and invests trillions of dollars in it, it becomes so good that nothing else can catch up.</p></blockquote>\n<p>I&#8217;ve heard about this question from time to time from Rena.  Apparently the answer is that gallium arsenide is historically the one major, credible alternative to silicon.   Doped semiconductor transistors clobber everything else for intrinsic reasons; in a nutshell, that you get an overwhelming combination advantage of speed, reliability, miniaturization, and scalability.   (Some of the hyped alternatives that show up in the press from time to time don&#8217;t even have voltage gain and thus aren&#8217;t yet viable; and have other practical disadvantages.)  In fact, the genesis of Moore&#8217;s Law is that people saw coming that once you have semiconductor transistors, you don&#8217;t have to invent anything fundamentally new for a long time.</p>\n<p>So, if it&#8217;s going to be a semiconductor, which one?  It would be coincidental for there to be more than a few &#8220;best&#8221; choices.  If there is more than one, then yes, trillions of dollars of prior investment could make a difference.  It is possible, albeit far from certain, that if humanity had standardized around gallium arsenide, then we would all have been better off for it.</p>\n<p>Around the corner you have graphene, which in some key respects would be superior to both silicon and gallium arsenide.  However, as a VLSI technology, it hasn&#8217;t really fully been invented yet.</p>\n]]>", "author": "Greg Kuperberg", "published": "2015-11-03 18:08:58+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<blockquote><p>Is there any intuitive way of explaining why it is that QMA(2) could potentially be larger than QMA?</p></blockquote>\n<p>It is potentially like the difference between IP, interactive proof, and MIP, multiple interactive provers.   It is believable, and known in the case of IP vs MIP, that you might learn more by interrogating two witnesses separately, even if both of them want to convince you of the same thing, than by interrogating just one witness.  It&#8217;s also intuitive that two witnesses interrogated together are equivalent to just one witness.</p>\n<p>So, QMA vs QMA(2) is somewhat similar, except with interactive proof replaced by quantum state and non-communication between provers replaced by non-entanglement of quantum proofs.</p>\n]]>", "author": "Greg Kuperberg", "published": "2015-11-03 18:16:39+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Greg #38: Yes, that&#8217;s a very good analogy (one that&#8217;s made particularly explicit in the <a href=\"http://www.scottaaronson.com/papers/jan19.pdf\" rel=\"nofollow\">paper</a> by Russell Impagliazzo, Dana Moshkovitz, and myself).  </p>\n<p>The other thing you can do is just <i>look at</i> the protocols we designed, and see how they involve learning one thing by measuring one state and then cross-checking it by measuring a second copy of the state.</p>\n<p>The one point that&#8217;s subtle to explain, is where exactly those protocols break down if the two states can be entangled.  The easiest two things to say are that, at any rate,</p>\n<p>(1) it&#8217;s a-priori plausible that such protocols <i>would</i> break down if the two states were entangled, and<br />\n(2) we know that they somehow <i>have</i> to break down in that case, because if they didn&#8217;t, then 3SAT would be solvable in subexponential time!</p>\n]]>", "author": "Scott", "published": "2015-11-03 19:05:41+00:00", "title": "By: Scott"}]