[{"content": "A lot of the suggestions in the reported discussion remind me of the well-known advice on how to make money on the stock market: buy low, sell high.<br /><br />More seriously, we&#39;re all taking the highway to hell when we get obsessed with the metrics and managerialism being bandied about in the discussion. Most of us, most of the places we work, will fail the tests being proposed by the panellists, apart from some of us who will be competitive and spend our careers looking over our shoulders for the competitors coming up behind and breathing down our necks.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Goldberg:Paul.html\">Paul Goldberg</a>", "published": "2016-11-09 22:28:52.078000+00:00", "title": ""}, {"content": "Paul, thanks for your comment. <br /><br />I agree with your &quot;highway to hell&quot; assessment: in my humble opinion, chasing metrics is not conducive to a healthy work environment and to a good professional life. However, some of the opinions aired in that discussion that are not related to metrics and managerialism are something to keep in mind when running a research institution. In particular, I tend to agree that giving early independence to young researchers is useful, so that they can choose their own path and make decisions, in combination with providing them with suitable mentoring and good role models.<br /><br />As a complete outsider, it seems to me that your own department at Oxford is implementing the six ingredients for research excellence isolated by Rogers Hollingsworth. None of those refers to metrics per se. I suspect that we would all agree that hiring &quot;good researchers&quot; is needed to have a thriving research environment. <br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Aceto:Luca.html\">Luca Aceto</a>", "published": "2016-11-09 23:04:01.488000+00:00", "title": ""}, {"content": "That&#39;s a good point, Hollingsworth&#39;s recommendations look good. Here at Oxford, the colleges (more than the departments) do indeed support interdisciplinary contacts.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Goldberg:Paul.html\">Paul Goldberg</a>", "published": "2016-11-10 09:23:18.877000+00:00", "title": ""}]