[{"content": "Student here. The students in my immediate vicinity were chatting about VEB trees because we&#39;d never seen them before and they were interesting, not because we were hopelessly lost. (On the whole, I for one think your presentation of them was excellent.) The discussion, of course, turned up a few things we realized that we didn&#39;t understand, which we were able to clear up after the break.<br /><br />If the structure of [ (1) present interesting novel topic (2) have short break (3) reconvene, and answer any questions that came to light over the break ] wasn&#39;t intentional, I would highly suggest trying it again. On Thursday, at least, it worked really well.", "author": "Anonymous", "published": "2014-09-07 22:47:46.332000-04:00", "title": ""}, {"content": "Sorting remains valuable for other interesting reasons: ask your students why Quicksort is often the preferred sorting method (e.g., in the C/C++ libraries) while it&#39;s only O(n log n) in the avg case -- over Heapsort, which is worst-case O(n log n) with small constants... there are some interesting lessons to learn there..", "author": "Anonymous", "published": "2014-09-08 00:36:42.521000-04:00", "title": ""}, {"content": "I have started to think that sorting is the most useful topic covered in a basic algorithms and data structures course.<br /><br />The traditional topics on such courses - dynamic data structures using pointers in the RAM model - work well when the data structures are not much bigger than the L3 cache. When the amount of data grows, the RAM model and the data structures and algorithms designed for it may no longer be that relevant. With larger datasets, using arrays of tuples as the fundamental data structure, with scanning, sorting, and joins as the basic operations, is often easier and more efficient.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sirn:Jouni.html\">Jouni Sirn</a>", "published": "2014-09-08 23:42:12.090000-04:00", "title": ""}, {"content": "After explaining about introspection sorting - http://en.wikipedia.org/wiki/Introsort you may want them to explore other hybrid sorts and whther they are useful/practical or not and explain why.", "author": "Anonymous", "published": "2014-09-09 12:53:33.163000-04:00", "title": ""}]