[{"content": "<![CDATA[<p>Chris #51: I think that again has to do with its being a rapidly-rotating black hole.</p>\n]]>", "author": "Scott", "published": "2014-11-12 16:48:00+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Or maybe the recent Phys Rev X paper published on many interacting worlds is correct and Paul&#8217;s benevolent humans in a good universe have learned to manipulate matter in the doomed universe via the interworld interaction potential to come to their rescue ;).</p>\n<p><a href=\"http://journals.aps.org/prx/abstract/10.1103/PhysRevX.4.041013\" rel=\"nofollow\">http://journals.aps.org/prx/abstract/10.1103/PhysRevX.4.041013</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bowen:Chris.html\">Chris Bowen</a>", "published": "2014-11-12 17:01:12+00:00", "title": "By: Chris Bowen"}, {"content": "<![CDATA[<p>Scott, can you expand on how linearity precludes interaction between parallel universes? That&#8217;s not obvious to me.</p>\n<p>Also, when are you go to do your next let us ask you anything thing?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/z/Zelinsky:Joshua.html\">Joshua Zelinsky</a>", "published": "2014-11-12 17:08:31+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Paul @ 49:</p>\n<p>The central paradox is a consistent paradox and the physics of today does allow it (though heavily debated). The time loop is closed and consistent and does not defy the principle of causality.<br />\nThis is as opposed to saying that descendants of blithe survivors on earth made the wormhole and sent it in the past. That is inconsistent and defies causality and is not allowed by physics. Essentially it means that the descendent of somebody on earth is going to make the wormhole. So the cause of somebody procreating will effect the building of the wormhole. But the wormhole is already there so the effect preceded the cause and thus physics does not allow it. Also it would mean that the blithe did take place, a fact recorded in history. The descendants cannot change something that happened. It would create multiple realities in the the same space time and thus violate Novikov&#8217;s theorem, or create a grandfather paradox, which our physics does not allow. Remember the scene where Cooper tries to get himself to stay. He can&#8217;t. It&#8217;s like 12 monkeys, Bruce Willis cannot change what happened and will live that loop ad infinitum.<br />\nThe way, I guess, to think about it is that the story, or the loop, is prewritten. What happens on the other side of the wormhole is not time sequentially related to what happens on this side. To think of time linearity between those systems is an incorrect assumption.</p>\n]]>", "author": "Garvit", "published": "2014-11-12 17:38:40+00:00", "title": "By: Garvit"}, {"content": "<![CDATA[<p>Greg Egan #46: </p>\n<p>Strictly speaking, a photon rocket can use the Penrose effect, but without an antimatter drive or similar it will not get enough extra thrust.</p>\n<p>Re tides, the square root of the Kretschmann scalar should be a good approximation of it. This link shows the calculation: <a href=\"http://iopscience.iop.org/0004-637X/535/1/350/fulltext/40794.text.html\" rel=\"nofollow\">http://iopscience.iop.org/0004-637X/535/1/350/fulltext/40794.text.html</a> . Note that for equatorial orbits the contribution from the angular momentum disappears, so you basically get Schwarzschild tides. (I have not checked the calculation.) For a 10 million solar masses black hole this works out to about 10,000 gee per meter near the horizon, falling off as 1/R^3. Not a chance for a planet to keep its shape there.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/Nux:Shmi.html\">Shmi Nux</a>", "published": "2014-11-12 19:42:27+00:00", "title": "By: Shmi Nux"}, {"content": "<![CDATA[<p>That Galois biopic idea (and the title) is golden! I say you take a sabbatical to write the screenplay and start showing it to the right people.</p>\n]]>", "author": "Sasho", "published": "2014-11-12 19:46:38+00:00", "title": "By: Sasho"}, {"content": "<![CDATA[<p>Interstellar sounds similar to Inception and Memento. At first glance it kind of makes sense, but when you think about it it really doesn&#8217;t make any sense at all.</p>\n<p>I like Will Self&#8217;s quote: &#8220;Inception wasn’t the last word in SF meta-sophistication, but rather a stupid person’s idea of what an intelligent film is like.&#8221;</p>\n]]>", "author": "fredo", "published": "2014-11-12 21:37:34+00:00", "title": "By: fredo"}, {"content": "<![CDATA[<p>The STEAM community can be *very* welcoming and appreciative of a recent film that:</p>\n<p>• addresses a broad spectrum of STEAM concerns with the utmost seriousness, maturity, and professional fidelity, and </p>\n<p>• creates a sense of wonder, and advances both the art of cinematography and our appreciation of the STEAM enterprise, <b><a href=\"http://www.youtube.com/watch?v=XxXWs74dKnE\" rel=\"nofollow\">even by the seamless technology of its making</a></b>, and</p>\n<p>• is contending seriously for Academy Awards in the major categories of Best Picture, Best Director, Best Actor, Best Actress, Best Supporting Actor, Best Supporting Actress, Best Original Screenplay, and Best Cinematography.</p>\n<p><b>Caveat:</b>&nbsp; The name of this outstanding STEAM-relevant film isn&#8217;t <i>Interstellar</i>&nbsp;&hellip; it&#8217;s <i>Birdman.</i></p>\n<p><b>Falsifiable Prediction:</b>&nbsp; In none of the above eight Academy Award categories will <i>Interstellar</i> surpass <i>Birdman</i>.</p>\n<p><b>It helps</b>&nbsp;&hellip; in viewing both <i>Birdman</i> and <i>Interstellar</i>, to watch for the transdisciplinary themes of contemporary STEAM-centric works like Yannick Grannec&#8217;s <i>The Goddess of Small Victories</i> and Francis Spufford&#8217;s <i>Red Plenty</i> and <i>Unapologetic</i>.</p>\n<p>&#8212;&#8212;&#8212;</p>\n<p><b>The World Wonders</b>&nbsp; Why do the blackboard equations in <i>Interstellar</i> eschew modern mathematical notations and frameworks\\(\\ \\)&mdash; commutative diagrams and exact sequences for example\\(\\ \\)&mdash; in favor of old-fashioned tensor-index/bra-ket equations? </p>\n<p>No wonder the capabilities of <i>Interstellar&#8217;s</i> earth-bound STEAM community evolve so fatally slowly!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-12 22:52:25+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Great your knowledge and hanging out with a real astronaut: your are very lucky and I think working at MIT helps in meeting certain people!</p>\n<p>Concerning Interstellar: typical low-level american-hollywood movie with poor and superficial analysis of supposedly big problems. All sounds and images and childish conversations. For sure a blockbuster for everyone but great movies are something else, even in the sci-fi realm..</p>\n]]>", "author": "Anon", "published": "2014-11-12 23:02:36+00:00", "title": "By: Anon"}, {"content": "<![CDATA[<p>My favorite part was the tensor network behind the horizon! At least that’s what the network of bookshelves looked like to me. In particular, it really tickled me how well the idea of an array of possible moments behind the horizon accorded with recent ideas of Susskind and friends, e.g. <a href=\"http://arxiv.org/abs/1411.0690\" rel=\"nofollow\">http://arxiv.org/abs/1411.0690</a>.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Swingle:Brian.html\">Brian Swingle</a>", "published": "2014-11-13 00:36:31+00:00", "title": "By: Brian Swingle"}, {"content": "<![CDATA[<p>Shmi Nux #56:</p>\n<blockquote><p>For a 10 million solar masses black hole this works out to about 10,000 gee per meter near the horizon.</p></blockquote>\n<p>You&#8217;ve used a tenfold smaller mass than the hole in the movie &#8230; but I think you&#8217;ve also slipped a few decimal places somewhere.  10,000 gee per <em>meter</em>?  I think Kip Thorne would have picketed the premiere if they&#8217;d really got it <em>that</em> wrong.</p>\n<p>I worked out the tidal accelerations exactly; the results are <a href=\"http://www.preposterousuniverse.com/blog/2014/10/29/the-science-of-interstellar/#comment-7295910552604300859\" rel=\"nofollow\">here</a>.  I believe we essentially agree on the formulas, which give tides of order <i>M</i>^{-2} near the horizon (i.e. <i>M</i> / <i>r</i>^3 with <i>r</i>≈<i>M</i>), but Gargantua is described as being 100 million solar masses, which is about 1.5 × 10^{11} metres in geometrical units.  That means the tidal acceleration in geometrical units is of the order of 4.4 × 10^{-23} per metre.  One gee, or 9.8 metres per second squared, corresponds to 9.8/<i>c</i>^2, or about 1.1 × 10^{-16} in geometrical units.</p>\n<p>So the tidal accelerations are of the order of 4 × 10^{-7} gees per metre, or 0.4 gees per thousand kilometres.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/e/Egan:Greg.html\">Greg Egan</a>", "published": "2014-11-13 04:53:25+00:00", "title": "By: Greg Egan"}, {"content": "<![CDATA[<p>STEM experts analyzing &#8220;Interstellar&#8221; reminds me of some creative writing grad student pals (back in the day) who would debate stylistic issues of &#8220;The Phantom&#8221; at great length. It was a lot of fun.</p>\n<p>I don&#8217;t see a lot of movies, but I have noticed that:</p>\n<p>(1) I generally love movies that are serious stories and do a good job of getting every detail right, so my thought process is not interrupted by thinking &#8220;could not happen&#8221;. Excellent examples: &#8220;Atonement&#8221;, &#8220;The English Patient&#8221;, and &#8220;Nowhere in Africa&#8221;. These are all so intense that the theater was silent from start to finish. NIA is a true story, written by the adult version of the girl in the movie. Check them out if you get a chance.</p>\n<p>(2) I often enjoy movies that are obviously adult cartoons, such as &#8220;Pulp Fiction&#8221;, &#8220;Ronin&#8221;, and &#8220;No Country for Old Men&#8221;. You don&#8217;t have to think about logic, evil, etc., because your brain is in cartoon mode.</p>\n<p>(3) I tend to get P.O.&#8217;ed by movies presented as serious but where insufficient effort was put into writing a plausible plot or getting historical detail right. I feel like I have been tricked into wasting time watching an unfinished product.</p>\n<p>(4) Science Fiction movies fit into the cartoon category. Once you understand what is possible and what is not, there is not much room to develop SF plots. To enjoy a SF movie, I suggest disabling your logic coprocessor.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-11-13 05:16:46+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>If Murphy has found a way to harness gravity, and tje technology is already that good to be able to terraform a barren looking planet like Edmund, then why they cant just fixing the earth? Or at least build cities inside a giant glass house? Where they can safe from dust strom? Also creating oxygen they need?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/Probo:Rahadianto.html\">Rahadianto Probo</a>", "published": "2014-11-13 06:32:47+00:00", "title": "By: Rahadianto Probo"}]