[{"content": "<![CDATA[<p><a href=\"#comment-1466439\" rel=\"nofollow\">Scott 23</a>, it was not <em>just</em> that the pundits failed to believe the Brexit polls, but that the polls were also off. Look at wikipedia&#8217;s list of people synthesizing polls (which I can&#8217;t link without being labeled spam). The median prediction was Remain by 2 points. Sure, you can call that &#8220;extremely close,&#8221; but it was wrong by 4 points, which is a lot (but less than the current US poll gap).</p>\n]]>", "author": "Douglas Knight", "published": "2016-10-10 18:10:53+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>I think I now see the outline of a complete, precise solution to the puzzle of consciousness.</p>\n<p>Shockingly, the answer appears to be nothing like what the currently most popular theories propose.  I now think that the two leading theories of consciousness, Information Integration (ITT) and &#8216;Self Modeling&#8217; are well wide of the mark.</p>\n<p>I&#8217;d been considering the idea that consciousness is some sort of subtle property of causality for a while, but what really made me think about it more intensely was Sean Carroll&#8217;s excellent recent book &#8216;The Big Picture&#8217;.  Sean really drives home some excellent points about &#8216;the arrow of time&#8217; and its close link to subjective experience.  Highly recommended, and very much on the right track I believe!</p>\n<p>The way to close the gap between mind and matter is to start from the bottom (elementary particles) and carefully trace a path *up* the complexity hierarchy.  At the same time, start from the top (mind) and carefully trace a path *down* the complexity hierarchy.  As the gap starts to close, the outline of the answer to the enigma of consciousness begins to appear out of the mist!</p>\n<p>Moving up:  Particle Physics > Mechanics > Spatial network and arrow of time emerging</p>\n<p>Moving down:  Values >  Decision Theory >  Cognitive Psychology >  Memory >  Working Memory >  Time perception</p>\n<p>The gap between mind and matter has closed right up!</p>\n<p>Matter-Arrow of time-GAP-Time Perception-Mind</p>\n<p>The gap can be completely closed by making the jump between &#8216;the arrow of time&#8217; (top-level  of matter) and &#8216;time perception&#8217; (base-level of mind)</p>\n<p>In my view, consciousness is a recursive 3-level symbolic representation of time (past-present-future).   This 3-level representational chain  is the link that completely closes the gap and provides the solution.</p>\n<p>See wikipedia article on &#8216;Time Perception&#8217; for some background material:<br />\n<a href=\"https://en.wikipedia.org/wiki/Time_perception\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Time_perception</a></p>\n]]>", "author": "mjgeddes", "published": "2016-10-10 18:26:31+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>Scott #23/Douglas Knight #26, part of the pundit fail had to do with the fact that &#8220;secede&#8221; votes regularly fail. Narrowly, but they fail. The Danish vote for Maastricht wasn&#8217;t quite the same thing, looking for an opt-in. </p>\n<p>I was among those who were shocked by the Brexit vote, and I think it&#8217;ll be a long time before we have a good understanding of why it went as it did, particularly since Government-level xenophobia&#8217;s been so quick to get formal. I don&#8217;t think pointing to the Midlands is enough. I do suspect that economic/trade union is simply not a strong enough matrix to bear the weight of both convenient economic fantasizing ca. 1992 and a massive influx of non-white refugees. There&#8217;s a European culture growing on that matrix that didn&#8217;t exist in the 1980s, and that includes (included?) the UK, but it&#8217;s not robust enough to support all that, I don&#8217;t think.</p>\n]]>", "author": "amy", "published": "2016-10-10 20:35:10+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>&#8220;non-white&#8221; is wrong; &#8220;non-European&#8221;. Complicated.</p>\n]]>", "author": "amy", "published": "2016-10-10 20:36:06+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Scott #NOTS</p>\n<p>Your paper shows (among other things) that unbounded CTCs, either Deutschian or ∞-Postselected,  would violate the Church Turing Thesis. It also describes several views on the physicial significance of that result. </p>\n<p>But I&#8217;m not sure to get the logical significance. I thought Deutschian CTCs were &#8220;CTCs that respect causality&#8221;. Is it logically consistent to have Deutschian CTCs (or ∞-Postselected CTCs) that can compute the halt function?</p>\n]]>", "author": "Jay", "published": "2016-10-10 21:19:31+00:00", "title": "By: Jay"}, {"content": "<![CDATA[<p>@Scott</p>\n<p>Any comment on the new NP vs PSPACE paper <a href=\"http://www.tecmf.inf.puc-rio.br/NPPSPACE\" rel=\"nofollow\">http://www.tecmf.inf.puc-rio.br/NPPSPACE</a> (or arXiv:1609.09562)? A serious shot or no?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Roberts:David.html\">David Roberts</a>", "published": "2016-10-10 22:42:33+00:00", "title": "By: David Roberts"}, {"content": "<![CDATA[<p><a>Matt Leifer #5</a>:</p>\n<blockquote><p>The paper sets out to solve a problem that I think is a pseudo problem in subjective Bayesian probability, namely, the supposed need for logical omniscience.</p></blockquote>\n<p>There is a key problem in modeling bounded rational reasoners. Namely, a good reasoner R should have beliefs about logical facts, such as the outputs of long-running computations. However, if R is computable, then there are computations that are too complicated for R to predict their results in advance with certainty. I think we both agree that the correct response here is the subjectivist point of view: you can still reason about logical facts, even if you are uncertain about them&#8212;you just use probabilities, which might be in (0,1) even for facts that are logically determined by things you already believe. </p>\n<p>The &#8220;problem of logical omniscience&#8221; is just that it doesn&#8217;t work to extend logic to probability in the natural way. Roughly, if you believe in all the axioms of first-order logic (assign P(&#8220;A&#8221;)=1 and P(&#8220;not A&#8221;)=0 for axioms A), and your probabilities respect logical connectives (so that P(&#8220;A or B&#8221;) + P(&#8220;A and B&#8221;) = P(&#8220;A&#8221;) + P(&#8220;B&#8221;)), then your beliefs are uncomputable. So we have to relax these constraints. </p>\n<p>This doesn&#8217;t argue against subjectivism, I don&#8217;t think. But it does mean we need a new notion of &#8220;good reasoning&#8221;. In the case of empirical uncertainty, we have what appears to be the correct theory of how to update on evidence (probabilistic conditioning). In the case of logical facts, we have a satisfying theory of computationally unbounded reasoning: logical deduction over recursively axiomatizable theories. </p>\n<p>But in the case of logical uncertainty, we need a notion of how to arrive at correct beliefs about logical facts in cases where you can&#8217;t just compute those facts. I hope that at some point this problem is completely solved in the framework of Bayesian probability theory, for example by having a computationally easy prior and then updating it on the results of non-trivial computations. The contribution of the paper is to give a candidate criterion for &#8220;good reasoning under logical uncertainty&#8221;.</p>\n<blockquote><p>I have always read the Dutch book criterion in the following alternative way, “if an agent BELIEVES that a bet is guaranteed to lead to a sure loss then the agent should not enter into it”.</p></blockquote>\n<p>This is one way to relax the constraint of logical coherence. Hacking [1] proposed something much like this. However, as pointed out by Eells [2], this criterion seems extremely weak: it only penalizes reasoners for reporting beliefs that are incoherent with respect to facts they already know, so it doesn&#8217;t incentivize them to discover new facts. </p>\n<p>The paper gives a less radical weakening of the Dutch book criterion: instead of requiring that reasoners report beliefs that are <em>completely</em> unexploitable by <em>any</em> bookie, we can require only that their beliefs not be <em>repeatedly</em> exploitable by <em>efficiently computable</em> bookies. This requirement turns out to be feasible, and to incentivize reasoners to satisfy a variety of desirable properties. Unfortunately, although the Garrabrant induction criterion is firmly subjectivist, it does not seem particularly Bayesian; it&#8217;s an active area of research to understand logical induction in a more interpretable and philosophically clean light.</p>\n<blockquote><p>[&#8230;] there is always some uncertainty about which formal system is the “correct” one.</p></blockquote>\n<p>Even if we assume that we only care about computations, which can be unambiguously referred to using logic, there remains the problem of reasoning under computational limitations about long-running computations. If we fix <em>any</em> formal system that represents computations (in the technical sense), logical deduction in that system is slow: sometimes the quickest way to &#8220;predict&#8221; the output of a computation using logical deduction is to directly simulate every step of the computation in your formal system. </p>\n<blockquote><p>all of these [logical] laws are basically empirical [&#8230;]</p></blockquote>\n<p>I somewhat agree with this&#8212;perhaps we should only care about logic insofar as it composes or models good reasoning in practice. However, there is something intuitively very fundamental about logical relationships, where logical structure feels like part of the territory rather than just part of the map, and I&#8217;m still confused around this.</p>\n<blockquote><p>[&#8230;] there is no situation in which all rational agents MUST regard inductive reasoning as valid</p></blockquote>\n<p>I might have some bets I&#8217;d like to make with you 🙂 More seriously, there is a sense in which Garrabrant induction performs objectively successful subjective reasoning. In empirical uncertainty, there is a prior in the background by which a reasoner is judged, and there need not be a canonical prior. However, in the case of logical uncertainty, there is a canonical objective territory against which reasoners can be judged: which statements are provable and which are refutable.</p>\n<p>[1] Hacking, Ian. &#8220;<a>Slightly more realistic personal probability</a>.&#8221; Philosophy of Science (1967): 311-325.<br />\n[2]\tEells, Ellery. &#8220;<a>Bayesian problems of old evidence</a>.&#8221; Scientific Theories 14 (1990): 205-223.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Benson=Tilsen:Tsvi.html\">Tsvi Benson-Tilsen</a>", "published": "2016-10-10 22:52:10+00:00", "title": "By: Tsvi Benson-Tilsen"}, {"content": "<![CDATA[<p>amy #28: Good to have you here as always!</p>\n<p>I certainly don&#8217;t want to instigate another gender-politics mega-thread (!), but the comment of Anon #19 reminded me of something that&#8217;s been bugging me greatly.  I was saddened, though not surprised, when Trump&#8217;s vile tape was met not only with the anger and disgust it richly deserved, but with editorials about how <i>virtually all men everywhere</i> are just like Trump, so are hypocrites if they criticize him.  Lindy West, in the NYT, provided one <a href=\"http://www.nytimes.com/2016/10/09/opinion/sunday/donald-and-billy-on-the-bus.html?ref=opinion\" rel=\"nofollow\">particularly explicit example</a>:</p>\n<ul>But here is the thing, the big thing, that Paul D. Ryan and Reince Priebus and Mike Pence and all the spineless Billy Bushes of the world (and plenty of progressive men too, for that matter) don’t understand: Most of you are no better than Mr. Trump; you are just more subtle&#8230;</ul>\n<p>Obviously I will never, ever support Trump, not if he showed up at my doorstep promising a trillion dollars for theoretical computer science research.  But if <i>anyone</i> could persuade me to see the positive in Trump, it would be Lindy West and those who&#8217;ve expressed similar sentiments.  It&#8217;s like, do they not see the logical implication of their argument?  If even progressive men, men who spend their lives trying to be as un-Trump-like as possible, are still tarred with the original sin of having been born male &#8230; well then, what&#8217;s the point of trying?  This seems like a perfect example of one of the central phenomena of the modern world, namely progressives (the ones on &#8220;our&#8221; side) doing everything they can to shoot themselves in the foot and alienate their potential allies.</p>\n]]>", "author": "Scott", "published": "2016-10-10 23:01:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>do you think 5% more white males will be boosted to go to the voting booths than normal?</p>\n]]>", "author": "easy", "published": "2016-10-11 00:15:26+00:00", "title": "By: easy"}, {"content": "<![CDATA[<p><a href=\"#comment-1466515\" rel=\"nofollow\">Amy 28</a>, there are two separate issues: why Brexit won and why the pundits failed. If secessions always fail, well, that doesn&#8217;t seem to me a useful category. But if secessions always underperform their polls, that seems like something for the pundits to adjust for, and a good excuse for the pundits getting it wrong. But that rule failed, so maybe you shouldn&#8217;t apply it to Trump, not that he&#8217;s a secession in the first place. </p>\n<p>As for whether pundits could have done better, wikipedia&#8217;s graph of polls make it look to me that undecideds broke 70:30 in favor of leave. That was true as undecided dropped from 20 to 10 on the eve of the election and it was true of the final 10 points (assuming that they actually voted and polls didn&#8217;t just fail to capture the demographics of who would actually vote). Should a pundit have made that extrapolation? I don&#8217;t know. <a href=\"http://fivethirtyeight.com/features/the-misunderstanding-of-momentum/\" / rel=\"nofollow\">Nate Silver</a> says that momentum doesn&#8217;t exist in elections, but he&#8217;s talking about people switching positions. Maybe it&#8217;s different with undecideds, who probably aren&#8217;t actually waiting to the last minute.</p>\n]]>", "author": "Douglas Knight", "published": "2016-10-11 01:08:36+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Anon #19</p>\n<p>Out of curiosity, but do Asians count as people of color under your interpretation?</p>\n<p>(Not saying this in a confrontational tone.)</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Seita:Daniel.html\">Daniel Seita</a>", "published": "2016-10-11 03:08:39+00:00", "title": "By: Daniel Seita"}, {"content": "<![CDATA[<p>The logical induction paper is nicely written from a scholarly perspective. Its section on related work traces both the historical relevant predecessors, as well as the recent relevant work on the topic. I have to admit that I am not really qualified to judge this, as I am not even an amateur probabilist. (Sniffnoy keeps repeating that he is not a logician, and he is the one who drew me into this&#8230;)</p>\n<p>So I learned that Ramsey had written something about probability, and decided immediately that I had to read that. Ramsey&#8217;s paper had 5 sections:<br />\n(1) The Frequency Theory<br />\n(2) Mr Keynes&#8217; Theory<br />\n(3) Degrees of Belief<br />\n(4) The Logic of Consistency<br />\n(5) The Logic of Truth<br />\nEspecially section (4) and (5) turned out to be just wonderful, sections (1) and (2) are nice and short too. Section (3) is a bit long, less convincing, and perhaps less worth reading (even so certainly important from a historical point of view). Section (3) may even unintentionally highlight just how one-dimensional naive Bayesian reasoning actually is.</p>\n<p>I also tried to read what de Finetti and Carnap had written on probability, but their writings turned out to be not so short after all. I also went back to take another look at Jaynes &#8220;Probability Theory: The Logic of Science,&#8221; which argues against certain technical points by de Finetti and Carnap, and was also mentioned in passing &#8220;(as argued extensively by Jaynes [2003])&#8221; in the logical induction paper. This showed to me just how scholarly well the logical induction paper is actually written. Jaynes text didn&#8217;t mention Ramsey anywhere, and instead delivered a totally wrong &#8220;essence&#8221; of Gödel&#8217;s theorem:</p>\n<blockquote><p>\nNow, whatever T may assert, the fact that T can be deduced from the axioms cannot prove that there is no contradiction in them, since, if there were a contradiction, T could certainly be deduced from them!</p>\n<p>This is the essence of the Gödel theorem, as it pertains to our problems. As noted by Fisher (1956), it shows us the intuitive reason why Gödel’s result is true. We do not suppose that any logician would accept Fisher’s simple argument as a proof of the full Gödel theorem; yet for most of us it is more convincing than Gödel’s long and complicated proof.\n</p></blockquote>\n<p>The logical induction paper on the other hand correctly relates Gödel&#8217;s theorem with &#8220;self-trust&#8221; of the logical inductor, and demonstrates that the proposed approach is able to handle the &#8220;self-trust&#8221; issue raised by Gödel.</p>\n]]>", "author": "gentzen", "published": "2016-10-11 09:26:32+00:00", "title": "By: gentzen"}, {"content": "<![CDATA[<p>1)\tAs just twitted to Sean Carrol for the cited paper of Ben-David and Sattath I suggested him to encourage his colleagues (so I suggest you) in writings little stories, fables, metaphors in their papers that can help the “non-technical” platea to better appreciate the work. You know that the “non-technical platea” is becoming larger and larger (I’m a writer that literally spend one, two hours per day reading yours exceptional works and admittedly not understand quasi-nothing) so I think a very huge work you have to do is (a part to kidnap some guys in your literature departments and force them to “shut up and&#8212;metaphorize”) to open a possibility to write some little parallel or “oracle” traslation in literally term in your papers.<br />\n2)\tRegarding your CTC’s Paper I really cannot understand how to conceptualize the Deutsch ½ probabilities to kill my grandfather. So I set-up the following: my grandmother narrated me how his husband died just after they ehm…did it! (my grandfather was a stunning stuntmen that at that particular moment was working on a Buster Keaton movie). In the narration of my grandmother she told me that he was poisened by his fierce enemy named Novikov (another stuntman in the movie). Now my grandmother is passed over and then I found a very huge amount of “titillating” Novikov’s love letters to my grandmother. So I really believe in this love affair! (Could it be the reason why my father is dead in searching to construct a time machine to recover the wasting time to make it?). Equipped with my own time machine (rounding on the CTC and hoping not to dissipate…Time), I popped up in the middle of the Keaton set movie, looking for the poisoned glass of wine of my grandfather, exchange it and wait for the night hidden behind a wooden little house. Now As I know I have a real, actual, classical, non-Deutsch huge ½ probabilities to survive (if my granfather is really my grandfather I survive, if not I will die (when?). How now it needs to be implemented the Deutsch probabilities in this (admittedly, very doofus) scenario?</p>\n]]>", "author": "Giorgio Castriota Scanderbeg", "published": "2016-10-11 10:28:22+00:00", "title": "By: Giorgio Castriota Scanderbeg"}, {"content": "<![CDATA[<p>Giorgio #38: Sorry, I didn&#8217;t understand your scenario.  Narrative has its place, but would it be possible to state your question more plainly?</p>\n<p>Deutsch is a diehard proponent of the Many-Worlds interpretation, so the way <i>he</i> thinks about a &#8220;1/2 probability of killing your grandfather&#8221; is simply that you do so in a 1/2 fraction of worlds.  But personally, I wouldn&#8217;t say you need to subscribe to MWI to say that Deutsch has given a valid mathematical procedure to get fixed points of CTCs.  The central issue, as Bennett et al. pointed out, is that because of nonlinearity, these &#8220;probabilities&#8221; couldn&#8217;t get mixed up with ordinary subjective probabilities, but would need to be treated as fully objective parts of the state of the universe.</p>\n]]>", "author": "Scott", "published": "2016-10-11 14:58:27+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Does Donald Trump represent the best of conservatism, any more than Lindy West represents the best of progressivism (per comments #19, #28, #33)?  </p>\n<p>Yet in the long run, isn&#8217;t the best of conservatism and progressivism&nbsp;&mdash; along with the best of mathematics, science, medicine, <i>etc.</i>&nbsp;&mdash; what matters most?</p>\n<p>After all, peer review would scarcely make sense otherwise.  Would it make any sense for the STEAM&#8217;s community&#8217;s gatekeepers to publicize only the worst works, and only the most abusive criticisms of those works?  Yet&nbsp;that&#8217;s what contemporary political debate too&nbsp;often&nbsp;resembles.</p>\n<p>Here&#8217;s Wendell Berry, speaking in the Afterword to the (recent) third edition of his <a href=\"https://books.google.com/books?id=LHiDCgAAQBAJ&pg=PT170\" rel=\"nofollow\"><i>The&nbsp;Unsettling of&nbsp;America: Culture&nbsp;& Agriculture</i></a> (1977&nbsp;& 2015)<br />\n<blockquote>[One] reason that my book has received no vigorous counterargument, I fear, is that in centers of learning and power, argument itself has become virtually obsolete, a lost art.  </p>\n<p>Public discourse of all kinds now tends to pattern itself either upon the arts of advertisement and propaganda (that is, the arts of persuasion without argument, which lead to reasonless and even unconscious acquiescent, or upon the allegedly objective or value-free demonstrations of science.</p></blockquote>\n<p>Ouch.</p>\n<p>What are the parallels between agri-culture and STEAM-culture?  What lessons does Berry&#8217;s analysis have for mathematicians, scientists, engineers, and physicians?  In&nbsp;ducking Berry&#8217;s tough questions, haven&#8217;t the rhetoricians of the cherry-picking left and the cherry-picking right evolved to be not opposed, but rather mutually&nbsp;complicit?</p>\n<p>This considerations are why (as it seems to me) we all of us owe a debt of appreciation and gratitude to transgressive works like Wendell&nbsp;Berry&#8217;s Jefferson&nbsp;Lecture &#8220;<a href=\"http://events.tvworldwide.com/Events/NEH2012JeffersonLecture.aspx?VID=events/neh/120423_NEH_Jefferson_Lecture_KennedyCtr.flv&Cap=events/neh/120423_NEH_Jefferson_Lecture_KennedyCtr.xml\" rel=\"nofollow\">It&nbsp;all turns on&nbsp;affection</a>&#8221; (2012) and Jonathan&nbsp;Israel&#8217;s Benjamin&nbsp;Franklin Medal&nbsp;Lecture &#8220;<a href=\"https://youtu.be/e3Pp-8PWXPI?t=0h41m48s;\" rel=\"nofollow\">Changing the world: the Enlightenment and basic human rights</a>&#8221; (2010).  </p>\n<p>Concretely, these lectures recall to our minds the transgressively transformative legacies that were bequeathed to humanity by two outstanding scientist-citizens: Thomas&nbsp;Jefferson and Benjamin&nbsp;Franklin.  </p>\n<p>Needless to say, the era of transgressive STEAM-legacies is far from ended&nbsp;&hellip; and&nbsp;for this reason, in&nbsp;coming decades, we&nbsp;will each and all&nbsp;of&nbsp;us be irretrievably and transformationally made to&nbsp;care for these&nbsp;matters, in&nbsp;all of the diverse and even frighteningly dangerous senses that the phrase &#8220;made&nbsp;to&nbsp;care&#8221; has&nbsp;for&nbsp;us.  Because yes, the 21st century&#8217;s STEAM enterprise is dangerous.</p>\n]]>", "author": "John Sidles", "published": "2016-10-11 15:26:43+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>I think that 5%+ white male participation is what their only strategy has been all along. Krugman thinks the ground game is not strong enough (but it ain&#8217;t over until it is right?).</p>\n]]>", "author": "easy", "published": "2016-10-11 15:50:39+00:00", "title": "By: easy"}, {"content": "<![CDATA[<p>Tsvi #32: Thank you for writing this comment, as I was about to write a similar but worse one. 🙂</p>\n<p>Corey #21: Personally, I find Cox&#8217;s theorem somewhat unsatisfying, as it relies on the assumption that we want to use real numbers in the first place; to me that seems a pretty big assumption.  I prefer <a href=\"http://lesswrong.com/lw/5te/a_summary_of_savages_foundations_for_probability/\" rel=\"nofollow\">Savage&#8217;s theorem</a>, which based on decision-theoretic concerns gives a foundation for both probability and utility simultaneously.  I mean, the downside there is that I guess not everyone likes that it&#8217;s grounded in decision-theoretic concerns rather than pure degrees of belief; but what is a &#8220;degree of belief&#8221;, anyway?  Savage interprets this the Bayesian way &#8212; it&#8217;s the odds you&#8217;d bet at.</p>\n<p>Anyway, the point is, Savage&#8217;s theorem doesn&#8217;t assume real numbers anywhere; it does make an Archimedean assumption, which one might argue is hardly any different, but I think it&#8217;s considerably better, as it&#8217;s actually listing out a constraint on how the agent will act, one which we might expect a &#8220;rational&#8221; agent might follow, as opposed to just assuming that we&#8217;re using real numbers for no real apparent reason.</p>\n]]>", "author": "Sniffnoy", "published": "2016-10-11 16:03:05+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Anon #19:</p>\n<blockquote><p>Am I the only one in seeing the irony in a group of math/CS folks who make the workplace uncomfortable at best for women and people of color stridently condemn Trump?</p></blockquote>\n<p>Even if we take your claim at face value[0] (and Scott has already given some reasons why we shouldn&#8217;t), there is zero irony here.</p>\n<p>Trump is awful for a large number of reasons; <a href=\"http://www.scottaaronson.com/blog/?p=2777\">Scott has discussed a few</a> that are almost entirely unrelated to anything you&#8217;re talking about.  There&#8217;s nothing ironic about voting against a candidate without agreeing that every reason given for voting against that candidate is a valid one.  Similarly, there&#8217;s nothing ironic about voting for a candidate without agreeing that every reason given for voting for that candidate is a valid one.  Indeed, if you ever find yourself thinking that literally <i>every</i> reason you&#8217;ve heard for voting for or against a given candidate is valid, that&#8217;s the point where you should say &#8220;Hm, maybe I&#8217;ve got some tribalism bias here I need to work on&#8221;.</p>\n<p>And&#8230; like, I know psychologizing is bad form, but&#8230; I&#8217;m having a hard time explaining your comment other than as a product of <a href=\"https://en.wikipedia.org/wiki/Out-group_homogeneity\" rel=\"nofollow\">outgroup homogeneity bias</a>.  It definitely looks to me like you&#8217;ve lumped things into people-who-agree-with-you and people-who-disagree-with-you and are acting like everyone who disagrees with you thus agrees with each other.  Rather than there just being a lot of disparate groups out there whose beliefs don&#8217;t have any sytematic relations to one another.  Group A who disagrees with you, and group B disagrees with you, are not necessarily closer to one another than either is to you.</p>\n<p>(Relatedly, this is why I think &#8220;political axes&#8221; are usually unhelpful; people always seem to draw them up with one of the axes being &#8220;agrees with me / disagrees with me&#8221;, leading to unnatural and outgroup-homogeneity-biased classifications.  I&#8217;m sure in a sufficiently high-dimensional space you could have a decent classification of political beliefs, but in practice the axes people draw rarely seem to be that helpful.)</p>\n<p>(By the way, have I mentioned how much I like the system of colors in Magic: The Gathering? 🙂  The actual colors themselves are not actually much good as a way of making sense of real-world ideas, of course, there&#8217;s a lot that it misses ther; but I think the system of relations <i>between</i> is&#8230; well, it has some nice clean symmetry that real life doesn&#8217;t, real life is much messsier, but it&#8217;s a good antidote to looking at axes, IMO.  This point shamelessly stolen from Taymon Beal <a href=\"https://anomalybeta.com/2013/08/15/my-favorite-game/\" rel=\"nofollow\">here</a>.)</p>\n<p>[0]OK, actually here I&#8217;m not really talking about taking it just at face value, but throwing in as well some of what you seem to be trying to imply as well.  And by the way, might I suggest that it&#8217;s really not a good thing to try to argue by hinting like that?  If you&#8217;ve got a claim to make, spell it out so it can be properly argued with.</p>\n]]>", "author": "Sniffnoy", "published": "2016-10-11 16:25:19+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Scott @#7: Mark Hadley has had some proposals about deriving QM from GR: see <a href=\"http://www2.warwick.ac.uk/fac/sci/physics/staff/academic/mhadley/papers\" rel=\"nofollow\">http://www2.warwick.ac.uk/fac/sci/physics/staff/academic/mhadley/papers</a>, particularly his thesis.</p>\n<p>I&#8217;m not knowledgeable enough about the topic to know if there&#8217;s any &#8220;there&#8221; there, though.</p>\n]]>", "author": "Jon Lennox", "published": "2016-10-11 16:49:38+00:00", "title": "By: Jon Lennox"}, {"content": "<![CDATA[<p>Fishlips #17 and David Roberts #31: Sheesh!  I already addressed this in comment #4.  </p>\n<p>I get proofs of P=NP, NP=PSPACE, P vs. NP is independent of set theory, etc. in my inbox every week.  Every single one has been wrong.  Not one has even contained useful new ideas.  So my prior is so massively, overwhelmingly against these things that, like <a href=\"http://www.wisdom.weizmann.ac.il/~oded/p-vs-np.html\" rel=\"nofollow\">Oded Goldreich</a>, I don&#8217;t elect to spend my time on them, <i>unless</i> someone convinces me that there&#8217;s at least a new idea worth understanding, or I have no choice (e.g. because of media coverage).</p>\n]]>", "author": "Scott", "published": "2016-10-11 17:23:33+00:00", "title": "By: Scott"}]