[{"content": "<![CDATA[<p>When I read Scott Alexander&#8217;s piece on hypothetical hardball questions for the next Republican debate, I found it funny to interpret the entire piece as an elaborate setup for the final question he proposed asking of Donald Trump: </p>\n<p>&#8220;My question for you is: WHY DIDN’T YOU CALL IT THE TRUMP CARD?!?!!!!111111111asdfdf&#8221;</p>\n<p>That was a genuine laugh out loud moment for me.</p>\n]]>", "author": "Chris Blake", "published": "2015-11-26 14:48:17+00:00", "title": "By: Chris Blake"}, {"content": "<![CDATA[<p>luca turin #42:</p>\n<p>Interesting suggestion. Scott perhaps knows as much about TCS + Complexity as anyone, and is not not likely to be looking for a new field to take up. Nevertheless, I can guess  how the unnamed physicist was thinking, perhaps something like the following:</p>\n<p>TCS+C is a fascinating extrapolation of basic concepts, following the path of discovering &#8220;What&#8217;s out there&#8221;. The intellectual excitement is palpable. </p>\n<p>You can say the same thing about TLC (Topology of Large Cardinals), ST (String Theory),  MWI, etc. TLC and TSC+C have in common starting with key useful facts (basic functional analysis; analysis of algorithms) and going off into the ozone. There is absolutely a chance that something useful will be found in the ozone. In contrast, ST has a remote chance of ever being worthwhile;  MWI has no chance.</p>\n<p>Current students might wonder; can a really smart person find happiness in boring old practical science, full of real world complications? Or is all the excitement in speculative stuff, where anything you can dream up goes?</p>\n<p>It is possible. A great example is Subrahmanyan Chandrasekhar. Many times he studied up on a major topic of the day, figured out much of what everyone was trying to do, organized and summarized the material in a book, and moved on the something new. Each time the entire field took a big jump forward; now grad students could read his book, and be prepared for the next generation of problems. See the obituary in &#8220;Physics Today&#8221;, or <a href=\"https://en.wikipedia.org/wiki/Subrahmanyan_Chandrasekhar\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Subrahmanyan_Chandrasekhar</a></p>\n]]>", "author": "Raoul Ohio", "published": "2015-11-26 18:28:36+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>There is something very self-referential about Scott&#8217;s question re: qubits and infinite regress and in your paraphrase of it.  Kind of like how can information theory describe information theory and it makes me think of formal mathematical systems being insufficient to prove their own consistency, etc.  You need a more powerful formal system or a higher order one.  Maybe we need a higher order quantum description&#8230; ??</p>\n]]>", "author": "AdamT", "published": "2015-11-26 21:56:09+00:00", "title": "By: AdamT"}, {"content": "<![CDATA[<p>luca turin #42,</p>\n<p>About hoping that Scott turns his guns towards physics over complexity theory, Lenny Susskind said at his recent Stanford lecture that his main focus in the big program is more complexity theory than some of the other areas.</p>\n<p>(I was able to catch lectures by Polchinski, Preskill, Van Raamsdonk, and Susskind at Stanford in the last couple of years. What a great place and time I find myself in.)</p>\n<p>A lot of the stuff about tensor networks and &#8220;cuts&#8221; in sketches of Escher-like diagrams is beyond me, but there seems to be something potentially there that is not just woo-woo. </p>\n<p>Exciting times. Complexity theory seems unrelated, except as Scott has hinted at in his book, and utterly impractical (10^89 years, come on!), but then entropy looked similarly difficult to actually consider a century or so ago.</p>\n]]>", "author": "Tim May", "published": "2015-11-27 06:21:57+00:00", "title": "By: Tim May"}, {"content": "<![CDATA[<p>Tim May #47</p>\n<p>Exciting indeed! You lucky man. It pains me to think that I will never properly understand this stuff (I am 62 and not a physicist) but even the simplified versions convey a strong feeling of something both beautiful and fundamental. I&#8217;ll keep watching those guys on YouTube&#8230;..</p>\n]]>", "author": "luca turin", "published": "2015-11-27 13:35:11+00:00", "title": "By: luca turin"}, {"content": "<![CDATA[<p>If Van Raamsdonk&#8217;s work is not wacky / crackpottery any thoughts over why multiple scientific journals turned it down? These are respectable journals, right so I&#8217;m sure the peer reviews were by knowledgeable people. </p>\n<p>I mean sure lots of turning down happens in the routing process of scientific publishing but this sort of work seems very high impact just so long as it is legit. </p>\n<p>I mean it doesn&#8217;t even have to be right but just has to meet the bars of legitimate scientific discourse to get published when the potential impact is so revolutionary.</p>\n]]>", "author": "Rahul", "published": "2015-11-27 16:32:32+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>#41 Tim</p>\n<p>Actually it just means we need irrationality to make the world work.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2015-11-28 01:01:16+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>James #50</p>\n<p>Great point. A world based on Rationality alone might be a scary place. </p>\n<p>Aren&#8217;t emotions like sentimentality, attachment etc. at odds with pure rational decision making?</p>\n]]>", "author": "Rahul", "published": "2015-11-28 02:23:38+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>#50 James Cross, I assume this is a joke, but of course QM is anything but irrational. Not &#8220;local realism,&#8221; of course, but this is not the same thing as not rational or irrational.</p>\n<p>Somewhere along the line, years after I was in college, I &#8220;internalized&#8221; the point that local realism (for instance, a box either has X in it or does not have X in it, be it a marble or a cat or a spin state) works at human scales and is deemed to be part of our &#8220;rationality.&#8221; But it manifestly DOES NOT WORK at smaller scales (nor at any scales, actually, but at large scales or long times, decoherence dominates).</p>\n<p>And when one realizes that it is this QM-type of non local realism that makes for stable atoms, to name but one of a hundred such example, one realizes that QM is really more &#8220;rational&#8221; than the classical world is.</p>\n<p>(Another way to put this is that really are only two choices for the &#8220;norm&#8221; of reality. The L1 &#8220;Manhattan geometry&#8221; norm or the L2 (&#8220;shortcut through the diagonal&#8221;) norm. (There are reason s why other norms can&#8217;t work. Scott&#8217;s book alludes to them, and real mathematicians no doubt can elaborate.) Both Lucien Hardy and Scott have made this point poignantly (and pointedly), and maybe it&#8217;s buried somewhere in John von Neumann&#8217;s papers, but this seems to be key. So, L1 is classical physics, L2 is quantum physics. There are no other &#8220;physical realities.&#8221; A really, really bright mathematician/physicist could have (perhaps) &#8220;predicted&#8221; a lot of quantum physics 200 years ago. Especially with just the results of Young&#8217;s light diffraction results. But the best we had, Newton, Lagrange, Laplace, Maxwell, Einstein, etc. did not.</p>\n<p>The revolution of QM made this much clearer. </p>\n<p>(And, in my own opinion, the &#8220;second revolution&#8221; of Bell, quantum computing, entanglement, which was largely a realization of the implications already laid-out by around 1930, has led to all this cool new stuff. Some say it was already known by way back then in the 1930s, but I think it too a while for people to think about the implications. And even probably wrong ideas like the AMPS &#8220;firewall&#8221; theory have served to trigger this huge flurry of papers and theories. Oftentimes a &#8220;wrong&#8221; theory stimulates fresh analysis. Einsteing, a critic of QM, was a major contributor just through is ER and EPR, separate analysis. </p>\n<p>Lenny Susskind had a hilarious line at his Stanford lecture several weeks ago. About ER and EPR, &#8220;they didn&#8217;t call him Einstein for nothing.&#8221; The whole lecture hall erupted with laughter.</p>\n]]>", "author": "Tim May", "published": "2015-11-28 02:56:48+00:00", "title": "By: Tim May"}, {"content": "<![CDATA[<p><a href=\"#comment-925972\" rel=\"nofollow\">Scott 33</a>,<br />\nA few comments on that article and then a general complaint about the whole discussion.</p>\n<p>I think it is a serious problem with the article that it suggests that the results of LHC would be stationary with respect to the Earth.</p>\n<p>The article mentions the rate of evaporation in 4 macroscopic dimensions. That is a very weird detail to throw in. We obviously don’t have 4 macroscopic dimensions. And if we’re going to talk about extra dimensions at all, why 1 extra, rather than 6? But the situation with 10 macroscopic dimension is much worse, both for Hawking radiation and for the rate of growth of a black hole. Probably not reassuring. [Maybe the idea is that the evaporation time is so small that the extra dimension is macroscopic on that scale?]</p>\n<p>I also have a general objection to this whole discussion, including my original comment. Why are we talking about micro black holes at all? Because someone once suggested that they might be a problem? If we are to seriously engage with the possibility of danger from LHC, we should generalize from micro black holes to all exotic new physics. The argument about cosmic rays is robust to this generalization, while the other two arguments are specific to black holes. </p>\n<p>Thus if we are going to talk about micro black holes, we should not pretend that LHC is the reason, and so we should not restrict to LHC-sized ones. But then argument about the rate of growth, aside from being much more elementary, has the advantage of applying to astronomically larger sizes of black holes than those that would evaporate.</p>\n]]>", "author": "Douglas Knight", "published": "2015-11-30 02:49:53+00:00", "title": "By: Douglas Knight"}]