[{"content": "<![CDATA[<p>Douglas #31: Thanks, good info, well summarized.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2013-12-12 22:04:31+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Scott says:<br />\n<b><br />\n&#8220;But as far as I know, there’s no evidence so far that even a single person was harmed.  Which isn’t so surprising: after all, people might run to their doctor terrified about something they learned on 23onMe, but no sane doctor would ever make a decision solely on that basis, without ordering further tests.&#8221;</b></p>\n<p>Here&#8217;s a thought experiment, say someone started a firm claiming they had a super-duper algorithm to scan you and very accurately tell if you&#8217;d die of an obesity induced heart attack. They charged $2000 a scan and then just gave everyone colorful authoritative looking charts and told everyone they had a super high risk. </p>\n<p>Assume somehow they do this discreetly enough that people don&#8217;t talk among themselves and no one&#8217;s wiser to their scam.</p>\n<p>Now medical no harm was done clearly. Probably significant good if you scared all those people into exercising a lot. </p>\n<p>Would we or should we tolerate this fraud? Harm isn&#8217;t the only metric here. Preventing fraud is another.</p>\n]]>", "author": "Rahul", "published": "2013-12-13 05:23:56+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul #37:</p>\n<ul>Harm isn’t the only metric here. Preventing fraud is another.</ul>\n<p>Completely agreed, but I don&#8217;t think there&#8217;s any evidence of fraud either&#8230;</p>\n]]>", "author": "Scott", "published": "2013-12-13 12:38:26+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Wait.  So for this genetic analysis, you don&#8217;t have to go to their lab personally and have then prick you with a needle, instead you just send in some spit in a jar?  I&#8217;ll go and scrape some hair of my employees from the chairs then, send them for analysis, and fire anyone with bad health results.</p>\n]]>", "author": "jonas", "published": "2013-12-13 12:40:45+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>jonas #39: Well, they don&#8217;t do it from hair, so you&#8217;d have to collect their spit somehow.  And I&#8217;m pretty sure you&#8217;d violate some law along the way. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Scott", "published": "2013-12-13 14:59:45+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>@Douglas Knight #27: </p>\n<p>Why my impression is that 23andMe is intentionally antagonizing FDA:</p>\n<p>(1) FDA has not received any communication from 23andMe since May 2013</p>\n<p>(2)  The FDA references 14 face-to-face meetings and telephone calls, hundreds of emails and dozens of written communications during which the agency said it provided specific feedback on study protocols that would prove 23andMe’s tests were useful as diagnostics and other tests to prove the 23andMe kits gave consistent results.</p>\n<p>(3)  In January, the FDA says the company promised that it was doing extensive studies that would take months to complete – and then that promised data never materialized. </p>\n<p>(4) The FDA’s account seems to show the agency giving 23andMe a lot of chances, and to show a willingness to find a way to work with the startup. </p>\n<p>Source:</p>\n<p><a href=\"http://www.forbes.com/sites/matthewherper/2013/11/25/23andstupid-is-23andme-self-destructing/\" rel=\"nofollow\">http://www.forbes.com/sites/matthewherper/2013/11/25/23andstupid-is-23andme-self-destructing/</a></p>\n<p>Is any of this factually wrong? </p>\n<p>I like how the Forbes article sums this up:</p>\n<p><b>This is not the story of a big regulator choosing to squash a small company, but of a company that decided that it didn’t have to follow the rules.</b></p>\n]]>", "author": "Rahul", "published": "2013-12-13 18:02:59+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Sorry, you are right. You are correct in your original point, which matches point (3) in the recent comment, that 23 failed to deliver data it promised. You are also correct to single out that point.</p>\n<p>I had attempted to read the FDA letter which emphasized (1) and (2), which seem to me like small potatoes (or at least lacking context); but I missed (3). I reject the interpretation (4) and the interpretation that 23 is trying to antagonize FDA. Do you really think Herper thinks they are trying to antagonize FDA?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Knight:Douglas.html\">Douglas Knight</a>", "published": "2013-12-13 20:29:24+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Douglas Knight, About point (4) above.</p>\n<p>I doubt they were TRYING to antagonize the FDA. More likely they thought they could ignore the FDA, or at least did not put much resources into jumping through the FDA&#8217;s hoops in correct order. Anyone with a Ph.D. knows the importance of jumping through the hoops, some of which are meaningful.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2013-12-13 22:22:48+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Scott #38:<br />\n<b><br />\n&#8220;Completely agreed, but I don’t think there’s any evidence of fraud either…&#8221;<br />\n</b></p>\n<p>No, not fraud yet, I agree. But there seems evidence of evasiveness & stonewalling. </p>\n<p>We, as a society,  give FDA the privilege of examining medical interventions before they get to the market. So anyone within that domain trying to circumvent or evade that oversight might cause some legitimate concern, yes? </p>\n<p>A watchdog might harbor some presumption of fraud in such cases?</p>\n]]>", "author": "Rahul", "published": "2013-12-14 07:03:50+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<blockquote><p><b>Rahul</b> says &#8220;A watchdog might harbor some presumption of fraud in such cases [as corporate disregard of evidence of efficacy]?&#8221;</p></blockquote>\n<p>Regrettably but foreseeably, history provides plenty of examples of <b><a href=\"http://www.dwlr.com/blog/2011-05-12/rico-convictions-major-tobacco-companies-affirmed\" rel=\"nofollow\">proven corporate fraud amounting to global-scale criminal conspiracy</a></b>, and even more commonly (in both individuals and corporations), <b><a href=\"http://www.ncbi.nlm.nih.gov/pubmed/16569567\" rel=\"nofollow\">sustained willful ignorance of lack of efficacy</a>.</b></p>\n<p><b>Example</b>&nbsp; Semiconductor manufacturers commonly sell high-quality batches of chips to elite customers at a premium price; while selling low-quality batches of unreliable chips to third-world customers at a discount.  </p>\n<p>What obstructs gene-chip manufacturers from selling high-quality batches of genechips to elite customers at a premium price; while selling low-quality batches of unreliable genechips to individual customers&nbsp;&hellip; <i>also</i> at a premium price?  </p>\n<p>That would be a *terrific* high-profit business model&nbsp;&hellip; exploiting market inefficiency at its best!&nbsp;&hellip; and how would individual customers ever know?</p>\n<p><b>Conclusion</b>&nbsp;  At a minimum, 23andMe appears to have significantly underestimated the challenge of verifying, validating, and documenting that their genomic products provide high-quality information in regard to health-care.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2013-12-14 13:09:10+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>As near as I can tell, no one has presented evidence contra Scott&#8217;s related claims:</p>\n<p>(2) FDA does not have a policy covering personal genome devices<br />\n(1) 23andme has not violated FDA policies covering personal genome devices. If (1) is true, (2) is true.</p>\n<p>Also, genetic correlation is a fairly &#8220;low-impact&#8221; feature for a medical device to have. I could understand the FDA having a problem with 23andme if the personal genome devices came bundled with self-mastectomy kits. But this seems like a reflexive anti-innovation / attention-grabbing response to me.</p>\n]]>", "author": "marris", "published": "2013-12-16 16:42:44+00:00", "title": "By: marris"}, {"content": "<![CDATA[<blockquote><p><b>marris</b> says: &#8220;This [FDA assertion of regulatory authority] seems like a reflexive anti-innovation / attention-grabbing response to me.&#8221;</p></blockquote>\n<p>The <i>National Human Genome Research Institute</i> hosts a diverse body of <b><a href=\"http://www.genome.gov/10002335\" rel=\"nofollow\">scientific, legal, economic, and ethical resources</a></b> will leaven <i>anyone</i>&#8216;s opinion that these issues are simple.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2013-12-16 22:14:13+00:00", "title": "By: John Sidles"}]