[{"content": "<![CDATA[<p>#fred #14</p>\n<p>Actually won&#8217;t you never know if it is true or false?</p>\n<p>The same situation we are in now without trying the experiment.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2016-02-05 22:32:01+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>:-O  Damn you’re good Scott!   Insightful.</p>\n<p>Well I think you’re right, without some causal mechanism you can point to that can fix something to be different, there’s no way to get a handle on the universe exists question.</p>\n<p>So we need a ‘multiverse of possible worlds’ to exist, and then we need to point to some causal feature that could be different in the space of possible worlds that would prevent our particular region from existing?  That still wouldn’t explain the existence of multiverse in the first though.</p>\n<p>Excellent answer to the mathematical question in the video, I agree with that.</p>\n<p>But I think we need to consider ‘existence’ not as an absolute Boolean value (Existence/Non-Existence), but more like a continuous shading (turning the brightness of a light up and down for example).  </p>\n<p>So while I agree with you that at least some mathematical truths ‘exist’ objectively (these seem like a plausible ‘ground-state’ for existence) I think that math has a ‘weaker’ sort of existence than physics.  If you imagine mathematics as the basic ‘reality fluid’, then physics is the ‘ice’ – it’s existence is more ‘solid’ than math.  But the most ‘solid’ form of existence, I think, resides in the coherent perceptions and explanations of a conscious mind.</p>\n<p>So we can define 3 main ‘states’ of existence; in order of increasing ‘solidity’:</p>\n<p>Mathematics >>>> Physics  >>>> Minds</p>\n<p>I think the correct measure of how strongly something exists is COHERENCE.  Coherence seems to be the only measure I can think of that can be applied across all three layers of existence above.  If we imagine ‘pulling out’ coherence, then ‘existence’ is lost for all three!  So perhaps we can say that COHERENCE is the reason why the universe exists.</p>\n]]>", "author": "mjgeddes", "published": "2016-02-05 23:14:03+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>@fred #9 #14</p>\n<p>Actually, you will never die, because there is always one more branch in the m.w.i. where you are kept alive.</p>\n<p>A bit creepy, but good luck to you &#8230;</p>\n]]>", "author": "wolfgang", "published": "2016-02-06 00:24:34+00:00", "title": "By: wolfgang"}, {"content": "<![CDATA[<p>Science can find an answer to materialistic nature of universe because this option can be explored & tested experimentally.<br />\nWhile philosophy explores an answer to conscious nature i.e. meaning & purpose of evolution of universe. This can not be detected by any method of science or physical laws of nature.</p>\n<p>Real progress can take place only if science & philosophy works together keeping respect for each other and exploring the hidden truth of universe.</p>\n<p>Philosophy drives the concept of independent existence of consciousness(responsible for behavioural traits & basic instincts of life) which should be acceptable to science.</p>\n<p>Science drives the concept of physical laws of nature and existence of an eternal matter/energy stuff which should be acceptable to philosophy.</p>\n<p>Thus, if acceptable to both, science & philosophy should believe in co-existence of two eternal realities in nature i.e. consciousness & matter/energy stuff.</p>\n]]>", "author": "Ajay saini", "published": "2016-02-06 09:40:03+00:00", "title": "By: Ajay saini"}, {"content": "<![CDATA[<p>Ajay #18: OK, but the tricky part is that the two realms presumably need to interface with each other somehow&#8212;and it&#8217;s in speculations about the interface that philosophy has traditionally &#8220;stepped on science&#8217;s toes&#8221;!  (Descartes, for example, thought that the soul influenced the body via the pineal gland, an idea already ridiculed by his student Princess Elisabeth.)</p>\n]]>", "author": "Scott", "published": "2016-02-06 13:30:58+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Fred, Bobby &#8212; a major worry with quantum immortality is that after 100 years or so the majority of the copies of you that are still alive might not want to be alive. They might be demented, frail, in horrible pain, or on the very verge of consciousness. You might find yourself to be eternally in a hospital bed, just wishing you could only ever die. Quantum immortality could in fact be a horrifying, hell-like possibility.</p>\n]]>", "author": "Orin", "published": "2016-02-06 23:04:06+00:00", "title": "By: Orin"}, {"content": "<![CDATA[<p>Wolfgang<br />\nIts more than a bit creepy, it ought to be truly terrifying because the future includes a multitude of arbitrarily bad, conscious-but-not-quite-dead-yet possibilities each of which will experienced by a future self in virtual solitude (everyone else you knew having long since died).  And of course, there would no escape &#8211; suicide being no use (as in the movie Ground Hogs Day ;). Fortunately, I think the many world&#8217;s fate is either highly unlikely or that my path thus far has been extraordinarily lucky (much luckier than required by many world&#8217;s).  If its the latter, my luck should be running out in a substantial subset of my futures 😉</p>\n]]>", "author": "dm", "published": "2016-02-06 23:19:57+00:00", "title": "By: dm"}, {"content": "<![CDATA[<p>I&#8217;m not sure that quantum suicide would extend to cases of &#8220;natural death&#8221;, compared to the usual thought experiment, where death is or isn&#8217;t caused by the outcome of a measurement of a quantum state. Reason being, when it comes to dying of old age, it may well be that *none* of the possible universes have a living me.</p>\n]]>", "author": "Vadim", "published": "2016-02-07 01:20:08+00:00", "title": "By: Vadim"}, {"content": "<![CDATA[<p>Well, there is some economy (and comfort!) in supposing that the universe only bothers to fork for quantum thought experiments.</p>\n]]>", "author": "dm", "published": "2016-02-07 03:34:46+00:00", "title": "By: dm"}, {"content": "<![CDATA[<p>That would be a lot like superdeterminism, wouldn&#8217;t it? My thought is (hopefully, but no promises) less silly, that if MWI is true, the only worlds that should exist are ones that could have evolved to their state with some non-zero probability. The thought experiment is designed to ensure this, since the result is based on the outcome of a single quantum measurement. On the other hand, if it turned out that human lifespan could be described a function similar to &#8220;every year, we die with a probability of n/130, where n is our age&#8221;, then we shouldn&#8217;t expect any worlds with people living to 135.  (Or maybe worlds that split long ago, so early in their evolution that n/130 wasn&#8217;t yet set in stone, have different lifespan function, but we&#8217;re now committed to ours, and we shouldn&#8217;t expect any branches from our present state to admit something as strange as a 135 year old.)</p>\n]]>", "author": "Vadim", "published": "2016-02-07 20:08:59+00:00", "title": "By: Vadim"}, {"content": "<![CDATA[<p>I watched the video with your thoughts on consciousness, interesting, but I don&#8217;t really agree with you there.</p>\n<p>My belief that &#8216;coherence&#8217; is correlated with the &#8216;existence&#8217; measure, strongly supports the Tononi/Koch Integrated Information Theory of consciousness.</p>\n<p>Remember, I hypothesized 3 main states of &#8216;existence&#8217; built from a ground-state of mathematical information, analogous to the Gas/Liquid/Solid distinction, with &#8216;coherence&#8217; playing the analogous role of &#8216;temperature&#8217;.  Increasing information coherence causes &#8216;phase transitions&#8217; in the mathematical information such that mathematical information can appear to us as matter and consciousness.</p>\n<p>Math (Weak coherence information) >> Matter (Medium coherence information) >>> Mind (Strong coherence information)</p>\n<p>Consciousness is just &#8216;highly crystallized&#8217; (highly integrated, high coherence) information in my model.  This matches the IIT.</p>\n]]>", "author": "mjgeddes", "published": "2016-02-08 06:16:28+00:00", "title": "By: mjgeddes"}]