[{"content": "<![CDATA[<p>Raoul #134: &#8220;That is a lot like being on a bus&#8230;&#8221;<br />\nMaybe this is closer to &#8220;a game in which two drivers drive towards each other on a collision course: one must swerve, or both may die in the crash, but if one driver swerves and the other does not, the one who swerved will be called a &#8216;chicken&#8217; &#8220;.<br />\nfrom:<br />\n<a href=\"https://en.wikipedia.org/wiki/Chicken_(game)\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Chicken_(game)</a></p>\n<p>In fact if you&#8217;re playing against Goldman-Sachs or their like you have to be prepared to play a very tough version of hardball.  In a less violent, repeatable version of chicken, if you give just an inch on every round, you&#8217;ll find yourself miles behind before you realize its too late to change strategies. I&#8217;m not sure what to do in such a situation, but the logic is not so obvious as some people are making it out to be.</p>\n]]>", "author": "sf", "published": "2016-06-27 09:42:23+00:00", "title": "By: sf"}, {"content": "<![CDATA[<p>@Raoul, That is another exaggeration and not an argument for anything.</p>\n]]>", "author": "Nerd", "published": "2016-06-27 09:59:52+00:00", "title": "By: Nerd"}, {"content": "<![CDATA[<p>amy #133: “Nerd #132, Ima go out on a limb here and bet that you haven’t read the TPP…”</p>\n<p>Sorry Amy, but despite your proclamation of ignorance, you haven’t gotten to the bottom of it yet; the period between the publication of the TPP and deadlines for ratification doesn’t leave enough time for anyone (outsider) to thoroughly digest it &#8211; its written in an arcane hierarchical structure where some sections can overrule others and you don’t know which until you’ve gotten through the whole thing.  Even worse, the hierarchy depends on references to equally incomprehensible external documents, and so on.  The only ones with a chance of using these things are the drafters, and their negotiations, notes etc remain secret.  It doesn’t take much to smell a rat here.  There are decent places to get started on the subject;<br />\n<a href=\"https://www.eff.org/\" rel=\"nofollow\">https://www.eff.org/</a><br />\nor blogs like slashdot or <a href=\"http://www.nakedcapitalism.com\" rel=\"nofollow\">http://www.nakedcapitalism.com</a> .</p>\n<p>amy #82: “Nerd #77, you’re talking like it’s 1992. Globalization hasn’t been a dominant factor in working-class discontent since whole crowds of Trump supporters were in elementary school…”<br />\nJust off the top of my head, I get the feeling you’re missing a lot here; offshoring of services like call centers is a lot more recent, but also problems of IT workers getting displaced by visa holders have been getting worse if anything.<br />\nTax evasion/optimization is also part of globalization, as well as CEO salaries and the whole issue of inequality, insofar as national law loses regulatory control.  </p>\n<p>I’m no expert, (on either of these 2 subjects) but I suspect you jump too quickly to dismiss the effects of globalization here.</p>\n]]>", "author": "sf", "published": "2016-06-27 10:05:09+00:00", "title": "By: sf"}, {"content": "<![CDATA[<p>@amy, </p>\n<p>I know enough about TPP to know that it is a bad deal for citizens. It is not just some journalists who consider it a very dangerous deal. Those opposing TPP include many reputable civil rights organizations, environmental organization, consumer protection organizations, relief organizations, unions, academics, lawyers, and winners of Nobel prize in economics, &#8230; All the tricks that they are pulling to ratify it despite its massive unpopularity shows that the supporters of it don&#8217;t think they can convince the voters it is a good deal, if it was HRC wouldn&#8217;t have come against it and would have defended it since she was involved with it. The fact that this was negotiated for over 5 years in secret from the public while corporate lobbyists had complete access to the text while even senators had extremely restricted access to it show what kind interests it is going to serve. Let me tell you what is the goal of the US in TPP: they view China as a strategic threat and fear that it will dominate the markets, so this is an attempt to set the global rules to benefit the American companies, particularly big media, big entertainment, and big pharma. It is going to enforce some of the stupidest laws in the US on the rest of the world. On the other hand, it is going to remove the ability of citizens to regulate, and if they do so they can be sued in ISDS courts. Just to give an example of how these things work, the tobacco company Philip Morris sued several countries because those countries passed regulations that would force tobacco companies to use plan packages with the goal of dropping the rate of smoking among their population. The laws that TPP will impose contains rules similar to PIPA and SOPA that MPAA and RIAA promoted, would restrict generic drugs that save the life of millions of people, threaten environmental regulations required to fight climate change, &#8230; This massive agreement is about imposing laws undemocraticly and irrevocably on people and has little to do with trade restriction between countries. The patent and copyright laws in the US are some of the stupids ones in the world and now they are going to be imposed globally. TPP is totally designed to benefit the big corporations at the expense of small business and consumers. The support for TPP is from big corporations, not people! This is going to increase inequality even further. If someone hates the corrupting influence of money and big corporate lobbyists TPP is the mother of all of them. This is what they couldn&#8217;t even pass in the US congress let alone other countries. Isn&#8217;t it again ironic that Obama fast tracked it despite the opposition from the democratic senators by the support of the republican senators while no one was paying attention?</p>\n<p>You still don&#8217;t get it and it doesn&#8217;t seem you are not going to get. You still avoid the issues and repeat yourself again and again. Since you are rather arrogant and feel comfortable making guesses about me (mostly wrong) let me return the favor. You are involved in HRC&#8217;s campaign, one of those people who would vote HRC just because she is a woman no matter what.</p>\n]]>", "author": "Nerd", "published": "2016-06-27 10:25:14+00:00", "title": "By: Nerd"}, {"content": "<![CDATA[<p>Lorraine Ford #131,</p>\n<p>&#8220;If Donald Trump doesn’t actually have personal agency, the ability to freely act, i.e. the ability to create some small part of a physical outcome that is otherwise 100% determined by laws-of-nature, then logically, railing against Trump is like railing against a volcano for exploding or railing against the earth for circling the sun.&#8221;</p>\n<p>Meh, the standard answer here is that in a universe lacking in personal agency, then those of us opposed to Trump don&#8217;t have a choice either and are acting in the only manner that the straight jacket of the universe without personal agency allows.</p>\n<p>Which is true insofar as if goes, but personally I think this whole line of inquiry betrays that deniers of personal agency don&#8217;t really believe what they say otherwise they&#8217;d never argue in the first place.  In other words, if it is true that the universe lacks personal agency, then I have never met anyone, who in accordance with the laws of the universe, arose to actually embody this viewpoint rather than just paying it lip service.</p>\n]]>", "author": "AdamT", "published": "2016-06-27 11:34:24+00:00", "title": "By: AdamT"}, {"content": "<![CDATA[<blockquote><p><b>Richard Gaylord</b> skeptically opines that &#8220;the quantum gravity, cosmology, multiverse and IIT physics communities [&hellip;] have severed the essential link between theory and experiment that defines science.&#8221;</p></blockquote>\n<p>This brand of skepticism can be allayed by constructing quantum field theory on the solid grounds that experimental condensed matter physics provides.  Fortunately there are many recent textbooks that take this approach.  Well-rated examples (by me) include in no particular order:</p>\n<p>• Tom Lancaster and Stephen Blundell, <i>Quantum Field Theory for the Gifted Amateur</i> (2014)<br />\n• David Tong, <i>Lectures on the Quantum Hall Effect</i> (2016)<br />\n• Alexander Altland and Ben Simons, <i>Condensed Matter Field Theory</i> (2010).<br />\n• Tony Zee, <i>Quantum Field Theory in a Nutshell</i> (2010).</p>\n<p>Particularly commended to impecunious students is David Tong&#8217;s on-line free-as-in-freedom series <a href=\"http://www.damtp.cam.ac.uk/user/tong/teaching.html\" rel=\"nofollow\"><i>Lectures on Theoretical Physics</i></a>, one of which is the above-cited <i>Lectures on the Quantum Hall Effect</i>.</p>\n<p>These texts survey the ground on which &#8220;The Battle for Quantum Supremacy&#8221; will be fought, and in particular, they motivate the modern-day quantum simulation research that descends from Lennie Susskind&#8217;s pioneering work with John Kogut in the 1970s (per&nbsp;comment&nbsp;#17).</p>\n<p><b>Local-to-global extensions in quantum field theory</b>&nbsp; Given the solid grounding of quantum field theory in local physics (laboratory space-time scales), it is natural to extend these ideas to global physics (cosmological space-time scales).  </p>\n<p>As every student discovers, the local-to-global field theory extension is natural, but not easy! 🙂</p>\n<p><b>Local-to-global extensions in politics</b>&nbsp; The difficulty of local-to-global extension applies in politics too.  Human interactions at the local, personal, familial level are dominated by empathic cognitive capacities, in the concrete sense that defects in empathic cognition generate far more human misery than defects in rational cognition (just ask any therapist).  </p>\n<p>Politics and economics, then, are naturally regarded as the extension of local empathic practices to global scales.  And just as in field theory, in politics the local-to-global empathic extension is natural, but not easy!</p>\n<p><b>Clinton versus Trump</b>&nbsp; As politicians go, Hillary Clinton is not notably gifted with charismatic empathy&nbsp;&mdash; she is more of a details-oriented public policy wonk (hence the rather tepid enthusiasm her campaign has excited to date).  But contrasted with the anger-stoking saber-rattling demagoguery-spouting disability-belittling torture-loving Donald Trump, Clinton shines as an empathic genius! 🙂</p>\n<p>This is why, among the fifty or more practicing teachers, writers, and therapists of my acquaintance&nbsp;&mdash; my wife and I&nbsp;happen to know a lot of teachers, writers, and therapists&nbsp;&mdash; the number of votes that Donald Trump will receive is&nbsp;&hellip;&nbsp;zero.</p>\n<p>Trumps not doing well among younger military veterans either (Trump&#8217;s nuclear saber-rattling being dangerously dumb) but that&#8217;s a separate story.</p>\n]]>", "author": "John Sidles", "published": "2016-06-27 14:22:48+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>sf: neh, it&#8217;s not that long. It&#8217;s long, but it&#8217;s certainly readable. The documents aren&#8217;t any more incomprehensible than scientific papers are. It does help if you go in understanding something about trade, if you have some language, same as if you&#8217;re reading papers. But if I were willing to give a few months to the project, which means starting very late and with no knowledge of specific trade issues, I&#8217;d be in reasonable condition.</p>\n<p>Nerd: wrong on all counts. I caucused for Bernie, I don&#8217;t involve myself in campaigns anymore, and you&#8217;ve got to be kidding about the vagina vote. You can stop flailing now.</p>\n<p>EFF is interested in its bit of TPP. Other organizations are interested in their bits of TPP. None of it means they&#8217;ve bothered with any of the rest of it, and you can&#8217;t look at individual pieces of trade agreements out of context because trade agreements come from wide-ranging negotiations. It&#8217;s not a chess match where they line up 400 players on one side and 400 on the other and each set of players hashes out a single issue. The question is: is it a good deal overall. And for that you have to look at the whole thing.</p>\n<p>In other words, if you want to understand it, you actually have to go do the work yourself. If I wanted to get started, I&#8217;d probably see if C-SPAN had any long programs with the US trade rep talking about it, just to get a sense of outlines and sticking points from our POV. </p>\n<p>You&#8217;re also yelling about truisms, not TPP. Of course major corporations, which used to be multinationals, and before that were transnationals, and in the mists of time were corporations in trusts and syndicates, work hand-in-glove with governments and run negotiations for their own benefit and not the people&#8217;s. You&#8217;re not Paul Revere, here. You want labor at the trade table on the US team, you&#8217;d better start domestically, by changing the labor-govt structure in ways that I can tell you the downtrodden will not accept: making trades unions an institution in government, as they are in Europe. </p>\n<p>The problem is that outside a few areas of this country with strong union histories, the downtrodden generally despise unions. Don&#8217;t want &#8217;em. And you can&#8217;t reason with people on this score. Goes right against that rhetoric of machismo and bootstrappiness. I&#8217;ve had destitute students from destitute families tell me that the minimum wage is for lazy people. And in fairness, unions do with great regularly fuck over their rank and file. They&#8217;ve not been great friends of poor women, either, particularly working caregivers. </p>\n<p>So when you find you can&#8217;t do that, you have to start looking at redistribution inside your own country. Likewise: ability to regulate (see under pre-emption), standing to sue, ability to sue rather than arbitrate &#8212; these are domestic problems first. If we have no control over them domestically, they won&#8217;t matter at the negotiating table. </p>\n<p>All of your arguing, incidentally, is internet arguing. It&#8217;s really plain from the way you&#8217;re constructing your arguments and the things you&#8217;re concerned about that you do not know anything about how regional trade negotiations work and why. And the don&#8217;t work simply by throwing the internet at them and having a rally. The Leave voters are, unfortunately, finding this out now, and in their dismay are already building conspiracy theories about who duped them and why. It turns out that the structures that allow the negotiations to happen in the first place not only matter but constrain how negotiations can go. Also that there are reasons, often very good if not happy reasons, for why they are that way.</p>\n<p>And I think this, in the end, is the seed of the discontent. Large number of people who are angry, some justifiably so, some recreationally, and what angers them more than anything else is that *these things are in fact complex and have structures*. And that before you can do anything, you have to learn how the machine works, on its own terms. At which point you get millions of angry people resorting to &#8220;Hulk smash&#8221;, and it never does go well. Nor does Hulk really want to hear about how many vulnerable people are collateral damage for his moment of catharsis.</p>\n]]>", "author": "amy", "published": "2016-06-27 21:32:53+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>So Trump is a lunatic (Susskind), a liar and a con man (#5), a bigot (#7), a sociopathic megalomaniac (#127) (nice one that, I&#8217;ll use it when I drive), Hitler and Mussolini rolled into one (#121 in an, oh how subtle, allusion). Etc., etc.<br />\nLast, not least, let&#8217;s not forget our dear Scott&#8217;s (#118) calculation that Trump is &#8221; possibly the least humble man on the face of the planet&#8221;.<br />\nFor its seven billion inhabitants endowed  with their well-kown structure of a set totally ordered  by humility, I suppose?<br />\nGuys, do I discern some slight reservations in your enthusiasm for Trump?<br />\nTalleyrand&#8217;s pithy aphorism comes to mind : &#8220;Tout ce qui est excessif est insignifiant&#8221;.</p>\n]]>", "author": "struwwelpeter", "published": "2016-06-27 22:00:52+00:00", "title": "By: struwwelpeter"}, {"content": "<![CDATA[<p>@John Sidles: &#8220;Trump’s nuclear saber-rattling being dangerously dumb&#8221; Yeah, maybe he would send 30,000 Nato troops to Russia&#8217;s borders in a war game, in order to get Russia&#8217;s attention (<a href=\"http://www.npr.org/sections/parallels/2016/06/17/482432771/nato-war-games-in-poland-get-russias-attention\" rel=\"nofollow\">http://www.npr.org/sections/parallels/2016/06/17/482432771/nato-war-games-in-poland-get-russias-attention</a>).Or he would endorse  Turkey, a NATO member,  after it shoots down a Russian plane. Or he might even station B-61 nuclear warheads in Turkey, that   stable, peace loving democratic ally.<br />\nActually it was Obama who  endorsed Erdogan, organized the war games and left the warheads in Turkey. Do you remembe that speech where Clinton promised she would reverse that US war-mongering?  Me neither. In contrast,  Putin praised  Trump as “bright and talented” and Trump’s reciprocated by calling  Putin “a leader, unlike what we have in this country”.<br />\n &#8220;Saber rattling&#8221;, really ?</p>\n]]>", "author": "struwwelpeter", "published": "2016-06-27 22:45:27+00:00", "title": "By: struwwelpeter"}, {"content": "<![CDATA[<p>AdamT #140,<br />\nLooking at reality from the point of view of string theory (which Leonard Susskind subscribes to) or from the point of view of the Mathematical Universe Hypothesis, a storm inside Leonard Susskind or a storm inside Donald Trump has the same status as a storm over the Pacific Ocean: none of them should be taken too seriously because all the storms are examples of reality going its inevitable way, 100% determined since the beginning of time.<br />\nIf on the other hand our intuition is correct, and reality is such that there is personal agency, the ability to freely act, the ability to personally create a tiny part of a physical outcome that is otherwise 100% determined by laws-of-nature, then what people say and do should be taken seriously because they have created a tiny, new bit of reality that will have an effect that is NOT 100% determined since the beginning of time. (One of the “weird” “inconvenient truths” about quantum mechanics is that observers/people/living things actually CAN have an effect on reality, an effect not 100% determined since the beginning of time.)</p>\n]]>", "author": "Lorraine Ford", "published": "2016-06-27 23:10:39+00:00", "title": "By: Lorraine Ford"}, {"content": "<![CDATA[<blockquote><p><b>struwwelpeter</b> wonders whether &#8220;Trump’s nuclear saber-rattling [is] dangerously dumb.&#8221;</p></blockquote>\n<p>There&#8217;s no shortage of folks who argue cogently that the answer is &#8220;yes&#8221;&nbsp;&hellip; including folks with considerable military expertise.   See for example &#8220;Open Letter on Donald Trump from GOP National Security Leaders&#8221; (March 2, 2016; search engines find it). The letter has 121 signatories (so far), and concludes unambiguously:<br />\n<blockquote>&#8220;We commit ourselves to working energetically to prevent the election of someone so utterly unfitted to the office.&#8221;</p></blockquote>\n<p>The names of some these &#8220;neverTrump&#8221; signers were both familiar (to me anyway) and surprising.  Max Boot?  Michael Chertoff? Eric Edelman? Robert Kagan? These aren&#8217;t people who ordinarily make common cause with liberal Democrats, or stoop to garden-variety electioneering, are they?</p>\n<p>Their concerns are shared by many.</p>\n]]>", "author": "John Sidles", "published": "2016-06-28 02:39:54+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Oh, and sf, yeah, I agree, you&#8217;re right about the guest-worker visas. That&#8217;ll be a bigger and bigger deal, sometimes because it has to be. We have no way of providing nursing care for 70 million baby boomers while paying the nurses reasonably. It&#8217;s going to be min-wage imports or nothing, but you won&#8217;t see the nursing schools talking openly about that with the nursing students as they take out their loans.</p>\n<p>There are ways of having guestworker programs that do not aggressively undercut wages, but again, for this you need a strong domestic labor movement, and nobody has been successful in unionizing IT guys. Not for lack of trying, and not because management is cracking heads. In the end you&#8217;re going to have to convince them to put down the Atlas Shrugged or it just won&#8217;t go.</p>\n]]>", "author": "amy", "published": "2016-06-28 06:19:49+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>@amy,</p>\n<p>Let&#8217;s clarify things about TPP. You admit that these reputable organization and people have read TPP, at least the parts that is their specialty and have express VERY STRONG OPPOSITION to TPP. You accept that this is written for the interest of corporations not citizen. You agree that the negotiations were conducted with large involvement of big corporate lobbyists but kept completely secret from people, organizations that work for the benefit of people, and even their representatives. You have not made a single reason why it is going to benefit ordinary Americans. All you have said is that you watched C-SPAN and a person who has been responsible for it say it is a good deal. What a relief. I rest my case there.</p>\n<p>On the issue of suing, it is not a domestic issue. ISDS is one of the major points of opposition to TPP. It allows corporations to sue countries if their actions would deprive them of their potential profits. Phillip Morris was able to sue and force governments to change their policy regarding smoking because those countries had signed trade agreements with ISDS provisions. Another area that TPP is criticized heavily is that it forces governments to privatize sectors and limits their ability to fund organizations like public broadcasters. You can see I know quite a bit about TPP and I can go on and on. But I end this with a Nobel economics laureate Joseph Stiglitz&#8217;s statements on TPP:</p>\n<p><a href=\"https://www.youtube.com/watch?v=6buNvM73NCA\" rel=\"nofollow\">https://www.youtube.com/watch?v=6buNvM73NCA</a></p>\n<p>The policies that Democrats have implemented starting with Bill Clinton have not benefited the middle class relative to their claims. The middle class is hollowed out at the benefit of the capitalist 1% class. Upper middle class (professionals with university education, considered to make the next around 15% of the population) are OK, but the economic situation and political influence for lower middle class (making up the next around 30% of the population) and working class (making up the next 30% of the populations) have deteriorated. These two make 60% of the US population. You keep talking about working poor (13% ) and underclass (12%) which make the bottom 25%. Under democrats the situation of working poor have improved and it is nice, but when you are at the bottom it doesn&#8217;t need much to improve your situation, specially when they make a small group. This has come at the expense of 60% of the population which make the middle. And every time I have made this point so far you have gone back to say, well, they did some good things for the working poor. Nice for them. I am not one of them and I want politicians who represent MY interests as well. The American GDP has more than tripled since 1980, so has the wage of the capitalist 1% class. The wages of upper middle class have gone a little bit up. But for the rest of the people either their wages have stagnated or have gone down in real terms. This has happened both under Republicans and under Democrats like Bill Clinton. And we are supposed to believe this is as good as it can get? And you don&#8217;t understand why people are showing their middle finger to political elites. </p>\n<p>I am sure you are going to reply with another long posts with little content that tries to dilute, obscure, and conceal the facts. Your posts regularly contain personal attacks and belittle the other side even on issues that you have already admitted you know little and the other side is considerably more knowledgeable than you. I think the facts are clear for those who want to see, there is no way to awaken someone who insists on sleeping.</p>\n]]>", "author": "Nerd", "published": "2016-06-28 09:27:18+00:00", "title": "By: Nerd"}, {"content": "<![CDATA[<p>amy #142 &#8220;if I were willing to give a few months to the project&#8230;&#8221;</p>\n<p>Not a realistic way to run a democracy, how many people do you think would take this up?  Would be safer just to work to reject it this time, and ask for a more transparent  process in the next try.</p>\n<p>A big part of the problem of how things work now is that its too easy for well financed lobbies to game any stage of the process, and this is just playing into their hands.  Regulators in the administration can&#8217;t even keep up with their games, how do you expect ordinary citizens to stand a chance.  With such a loaded deck who do you think would end up shortchanged?</p>\n]]>", "author": "sf", "published": "2016-06-28 09:35:46+00:00", "title": "By: sf"}, {"content": "<![CDATA[<p>Joseph Stiglitz thinks the ISDS provision of TPP:<br />\n<a href=\"https://www.youtube.com/watch?v=sIfO5HRRjQg\" rel=\"nofollow\">https://www.youtube.com/watch?v=sIfO5HRRjQg</a></p>\n]]>", "author": "Nerd", "published": "2016-06-28 10:06:01+00:00", "title": "By: Nerd"}, {"content": "<![CDATA[<blockquote><p><b>Nerd</b> (#148) wonders whether &#8220;We are supposed to believe this [current economic conditions] is as good as it can get?&#8221;</p></blockquote>\n<p>Plenty of economic trends are presently adverse, and have been adverse for decades, in plenty of nations around the world.  </p>\n<p>Yet it&#8217;s entirely plausible&nbsp;&mdash; isn&#8217;t it?&nbsp;&mdash; that no major political party (whether in the USA or around the world), and no major political leader (whether in the USA or around the world), and no major STEAM-discipline (whether economists, sociologists, scientists, engineers, physicians, etc.), and no any major ideological &#8216;ism&#8217; (conservatism, progressivism, libertarianism, etc), <i>presently has good ideas for reversing these trends</i>.</p>\n<p><b>No quick-and-easy solutions</b>&nbsp; As long ago as 1955, John von Neumann articulated (posthumously) some of the no-easy-solution realities of global politics and economics:<br />\n<blockquote>What safeguard remains [against global-scale challenges]? Apparently only day-to-day&nbsp;&mdash; or perhaps year-to-year&nbsp;&mdash; opportunistic measures, a long sequence of small, correct decisions.&nbsp;[&hellip;]</p>\n<p>The most hopeful answer is that the human species has been subjected to similar tests before, and seems to have a congenital ability to come through, after varying amounts of trouble.</p></blockquote>\n<p>For the STEAM community, Clintonian politics represents the near-term practice of von Neumann-style &#8216;small opportunistic measures&#8217;.  Policies that are uninspiring but not crazy.</p>\n<p>Whereas Trumpism represents&nbsp;&hellip; well heck&nbsp;&hellip; no one knows <i>what</i> Trumpism represents&nbsp;&hellip; not even Donald Trump! 🙂</p>\n<p><b>Incremental Enlightenment</b>&nbsp; Are there reasonable avenues by which we may hope that the world&#8217;s STEAM communities will evolve to embrace policies that are more effective than Clintonism&nbsp;&mdash; policies that necessarily will be radical?  </p>\n<p>For quite a few people (me included), such policies are implicit in the Enlightenment-centric historical worldview that is surveyed in (for exampled Jonathan Israel&#8217;s recent Benjamin Franklin lecture &#8220;<a href=\"https://www.youtube.com/watch?v=e3Pp-8PWXPI&t=41m48s;\" rel=\"nofollow\">Changing the World: Enlightenment and Basic Human Rights</a>&#8221; (search engines find it):<br />\n<blockquote><b>Conclusion</b> &#8220;Here we have a very very big problem.  The French revolutionaries were very clear: the whole idea of modern human rights comes from philosophy.  But <i>we</i> don&#8217;t understand that.  &#8216;What the hell does that mean?  The whole idea of modern human rights comes from philosophy?  Are you kidding?&#8217;  For most people, that is absurd and ridiculous.  </p>\n<p>And most historians just don&#8217;t know what to do about this. &#8216;What are you talking about?&#8217;  If you read [any] French revoutionary journals from 1789, on almost every page it will say &#8216;The world is being totally transformed and the main agent of change is philosophy.&#8217;</p>\n<p>And [nowadays] we don&#8217;t know what that means, we don&#8217;t understand that, and we&#8217;ve redefined philosophy: &#8216;We want to be neutral on important social questions.  We want to stay in our corner!  We&#8217;re <i>philosophers</i>&#8216; </p>\n<p>And so nowadays we think that&#8217;s what philosophy <i>is</i>.  Of course, this isn&#8217;t the Socratic idea of philosophy; it&#8217;s the <i>modern</i> idea of philosophy, that way philosophy was <i>made</i> to be neutral, by governments and states and universities.</p>\n<p>So we absolutely can&#8217;t understand what they&#8217;re talking about, when they [the 18th century <i>philosophes</i>] say &#8216;A new world, modern democracy, basic human rights, comes from philosophy.&#8217;  </p>\n<p>I think this is a complete mystery to a culture like ours.  Thank you very much, ladies and gentlemen, for your attention.&#8221;</p></blockquote>\n<p><b>STEAM faith and Enlightened practices</b>&nbsp; Concretely, <i>Shtetl Optimized</i> readers who seek to accelerate the world&#8217;s evolution toward a new, more modern, more democratic, more enlightened world, could do worse than apply all of the STEAM community&#8217;s tools toward the expansion of fundamental human rights, including (centrally and crucially in my view) <i>healthcare rights</i>.</p>\n<p>The point is that sustained Clinton-style / von Neumann-style &#8216;small opportunistic measures&#8217;&nbsp;&mdash; particularly in healthcare as a crucial human right&nbsp;&mdash; <i>already</i> are acting irreversibly and cumulatively to generate what will be (in the long run) transformationally Enlightened changes in the human condition.</p>\n<p>This is good (as most folks think, including me). 🙂</p>\n<p>Advantageously, this Enlightened transformation does not require charismatic leadership by magical politicians.</p>\n<p>&#8212;&#8212;&#8212;&#8211;</p>\n<p><b>Q</b>&nbsp; What <i>is</i> the Trumpist&nbsp;/ Republican platform regarding healthcare in general and ObamaCare in particular?  Uhhh&nbsp;&hellip; there <i>isn&#8217;t</i> any sort of rational platform, is there?&nbsp;   Why not?</p>\n]]>", "author": "John Sidles", "published": "2016-06-28 14:24:09+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Lorraine #145, I am not sure what you are getting at.  I have no idea what Professor Susskind&#8217;s views are on physicalism or free will nor do I have any idea what he makes of Tegmark&#8217;s mathematical universe hypothesis.  Just because he is a noted creator of string theory and a physicist doesn&#8217;t really tell what he thinks of these subjects you are on about.</p>\n<p>My best guess is that you are saying that physical reductionists or free will deniers have no business arguing over Trump or really over anything since according to them it is all preordained and we have no efficacy to change anything according to this viewpoint.  However, again, the standard response is that they have no free will NOT to argue over Trump and over all the other things they argue about.  Which, so far as it goes, is not inconsistent.</p>\n<p>Regardless, to the extent that you are intending to rebut the criticism of Trump by equating those who present such criticism as proponents of physical reductionism or as free-will deniers&#8230; YOU HAVE NOT DEMONSTRATED that the interlocutors you oppose ARE said proponents of such views.  There is nothing in string theory or physics in general that necessitates a physical reductionist/free-will-denying view of the world as can be amply demonstrated by the many scientists who do not subscribe to physical reductionism.</p>\n<p>In particular, I myself don&#8217;t subscribe to physical reductionism and yet I have many criticisms of Mr. Trump and his lunacy.</p>\n]]>", "author": "adamt", "published": "2016-06-28 15:48:40+00:00", "title": "By: adamt"}, {"content": "<![CDATA[<p>I think the lack of progress on addressing these issues can be attributed to the lack of serious attempts to address them. The status quo serves our politicians, both democrats and republicans, so why change it? Why restrict corporate donations and lobbying and superPACs when it serves them so well? Just check where our politicians end up after they retire.</p>\n<p>Do you any other country where its democratically elected members of legislature persistently get below 15% approval rating from their electorate for decades and still continue to get elected as if nothing is wrong?</p>\n]]>", "author": "Nerd", "published": "2016-06-28 16:44:38+00:00", "title": "By: Nerd"}, {"content": "<![CDATA[<p>Not only they are not trying to address these issues, they are after deals that would make things worse, increase inequality, severely reduce the influence of the ordinary citizens on policies, &#8230; blike TPP and TTIP.</p>\n<p>Obamacare is a progress. But ask yourself: what is its impact? How many people does it effect and how much does it improve access to healthcare for them? Who are the people who benefit from it? Ask yourself why America cannot have a decent universal healthcare coverage like every other developed nation? Why Americans spends way more than other countries and gets less than them in return on healthcare? Why is it that despite 80% of Americans supporting stricter background checks on gun purchases and so much publicity on the issue majority of members of congress can be against it? The political influence of average citizens is at historic lows that a single lobbying organization like NRA has more influence on the members of congress than 80% of Americans. This is not about this policy or that policy, this is about the feature of our democratic system. Do these policies address the underlying issues like increasing inequality, erosion of influence of ordinary citizens on policies, concentrations of power and wealth in the capitalist 1% class, &#8230;? That is the question. Now can you claim that there has been any progress over the past decades on these underlying issues?</p>\n<p>Minority rights, women&#8217;s rights, healthcare for working poor, etc. etc. &#8230; are important, and from time to time Democrats have made progress on these issues. But these are not of the same level for average Americans in the middle as the underlying issue of eroding political influence of average citizens and concentration of power and wealth at the capitalist 1% class.</p>\n<p>I will look at HRC&#8217;s positions during the campaign to see if she is going to support TPP, be aggressive on foreign policy, and fight to reduce inequality and the influence of money on our politics. These are the main issues that I care about and are of importance for me. If I don&#8217;t like what I see I may vote Trump despite the fact that he is a low-IQ ignorant bigot who cannot control even his own mouth. The amount of damage he can do internally in a system like ours where a president cannot implement reasonable policies even when he has the backing of 80% of the populations will be limited and he is less likely to start new wars than HRC.</p>\n]]>", "author": "Nerd", "published": "2016-06-28 17:46:27+00:00", "title": "By: Nerd"}, {"content": "<![CDATA[<p>John Sidles #151: I enjoy your posts and some of the links, but have a hard time seeing Clinton as an enlightenment reformer. Your excerpt is saying in effect that rights were acquired by power struggles, which were put in a changing philosophical context.  It might be more pertinent to read Graeber&#8217;s &#8216;Debt, the first 5000 years&#8217;, despite its at times painful telling of human nature involving slavery and the like. (He&#8217;s an anthropologist.)</p>\n<p>I&#8217;m afraid that a large part of the current problem is that Obama turned his back on Main Street, and fell into the arms of the TBTF banks right after taking power.  Almost no heads fell  (speaking figuratively!) among those who brought us the financial crisis, when some kind of reboot was needed.  Alot of this goes back to inflated expectations created during the galloping Dow Jones of the Clinton 90&#8217;s &#8211; (as extended by Bush/Greenspan) and the recovery is ultimately being held back by the difficulty of bringing  expectations, or habits, back into line with some kind of economic reality.</p>\n<p>I don&#8217;t see any honesty from either candidate along these lines, its not what gets short-term electoral advantage of course.  I suspect that Clinton&#8217;s failure to convince people that she wants to, or is able to, stand up to big money type interests is her weak point with the Sanders camp and with a big part of the middle class.  But the new economic reality cannot hold much promise for these groups if the &#8216;big money&#8217; isn&#8217;t held in check.</p>\n]]>", "author": "sf", "published": "2016-06-28 18:32:01+00:00", "title": "By: sf"}, {"content": "<![CDATA[<p>sf #149: a few months starting from zero, yeah. Like I said, I don&#8217;t know anything about the issues driving TPP, or indeed what issues are driving TPP, and I&#8217;ve paid no attention to these things for years, so I&#8217;d be coming in cold. Presumably if you&#8217;re interested in trade deals and immigration you&#8217;d have been paying attention for a while and keeping up, and it wouldn&#8217;t take so long.</p>\n<p>But what you say about the regulation is true. It really freaks people out when you say this, but lots of the federal govt is  undersized for the job. 585 people can&#8217;t hope to legislate for 300 million; they don&#8217;t have time to read the bills, much less understand them, and they don&#8217;t have adequate staffs for the job, either. That&#8217;s why even somebody like me can walk in and write legislation and have it pass. Same on the regulatory side, except there the problem&#8217;s compounded by money and the government&#8217;s total inability to compete with the kind of money you can make in industry. </p>\n<p>I think that to a considerable extent we&#8217;re stuck with the problem, but also that the problem&#8217;s ameliorated by having a knowledgeable electorate. And when I say &#8220;knowledgeable&#8221;, I mean that they do have a working notion not just of the issue they&#8217;re interested in, but of how things in government actually work and why. That thing I was talking about upthread, or on the other thread, about leaving your house and finding out what else is up in the world &#8212; this is part of that. </p>\n<p>I&#8217;ll give you an example: back when I worked for a terrible congressman, we&#8217;d get little bands of demonstrators in the plaza below the office. (District office.) Not infrequently they demanded things not taken care of on the federal level. Every now and then a demonstrator or three would come upstairs and demand to see the congressman. We didn&#8217;t keep him in a closet, of course, so usually he wasn&#8217;t there, or even in the state, and the demonstrators (who sometimes insisted on sitting in the office waiting for him to come back) would go away triumphantly persuaded that he was trying to dodge them. This is not a helpful way of demonstrating and pressing an interest. Better: in the 1980s, when the Reagan admin was uninterested in funding AIDS research and pressing FDA to get trials running, a group of activists *knowledgeable about both media technique and regulatory processes* put on a big damn show and turned the plaza outside FDA into a circus. Which meant that when Anthony Fauci, who usually could be found there, finally came down to talk to them, they were not only in the right place talking to the right guy, but they spoke enough FDA language to begin to have a useful conversation. Was it rough on both sides, yes, but the AIDS activists were aggressively willing to learn and the FDA people were willing to work with people who were willing to work with them, even through recriminations. The result was, in unusually short order, effective drugs, also a large funded research community, despite continuing Republican administrations.</p>\n<p>As for TPP &#8212; wouldn&#8217;t it be safer to scrap it, you ask. Well, given that I don&#8217;t know what it is, and you probably don&#8217;t either, I don&#8217;t think either one of us can say. We have the narrow opinions of several organizations each interested in narrow aspects of TPP, but we cannot see whether TPP is, on balance, a good thing or not, because we haven&#8217;t spent the time. It could as easily be that saying &#8220;no&#8221; is more dangerous than saying &#8220;yes&#8221;. </p>\n<p>Doing the homework>trusting the knowledgeable rep>slicing blindly at things.</p>\n<p>(Europe&#8217;s had the same problem. The Common Agricultural Policy&#8217;s been a bugbear since the day it was born, and you&#8217;ll find plenty of people who look at CAP and that&#8217;s their only measure of the goodness or badness of the EU. Plenty were happy to scrap the EU on the basis of the CAP. Which is nuts &#8212; all you have to do to know that is listen to the anguish of the young people in Britain who look like they&#8217;ll be cut off from having lives as Europeans.) </p>\n<p>In the end, there aren&#8217;t all that many choices. You can have direct democracy and hope that everyone is responsible and educates themselves well enough to vote responsibly and has time to do all that work. You can have a representative democracy and fight knowledgeably and responsibly to preserve it from becoming corrupt to the point where it cannot do anything but enslave the nominal citizens. You can run around blowing things up, which is very exciting if you enjoy that kind of thing; it gives you a brief and bloody reprieve from whatever had existed, and it costs vulnerable people big even if they hadn&#8217;t wanted a revolution, but guarantees nothing. I think it&#8217;s obvious where my sympathies lie, and in the inevitable debate about whether a rep ought to act mechanically to represent the shifting will of his constituency, like a pass-through, or ought to act as a knowledgeable elite, I&#8217;ll lean readily toward knowledgeable elite &#8212; but an elite whose ears are open to his constituents, who themselves have some responsibility to self-education.</p>\n]]>", "author": "amy", "published": "2016-06-28 21:49:19+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Nerd:</p>\n<p>1. I&#8217;m thinking you have no experience with &#8220;poor&#8221;. There&#8217;s no way you&#8217;d be saying the situation for the working poor was nice if you did have. Holy crap. Turn off Fox, man, they&#8217;re just making things up.</p>\n<p>2. You&#8217;ve managed to misread most of what I wrote. tl;dr: Nope.</p>\n<p>You are sort of a fascinating avatar of the internet, though.</p>\n]]>", "author": "amy", "published": "2016-06-28 22:41:51+00:00", "title": "By: amy"}]