[{"content": "<![CDATA[<p>#27</p>\n<p>Well yes, I think that&#8217;s right, *all* physics is indeed quantum physics in the sense that QM appears to be the fundamental (bottom) level.  But again&#8230;.we can still make useful divisions into various levels of abstraction.</p>\n<p>I think the principled distinction I want to make is between the level where you see coherent behaviour (explicit quantum superposition effects) and the level where you don&#8217;t.  So for instance, things like superconductivity or superfluidity I&#8217;d call quantum , whereas billiard ball motions not.  Or perhaps, the most useful distinction is between the level where thermodynamics applies (classical) and the level where it doesn&#8217;t (quantum)? </p>\n<p>To me, the distinction you made sounds like the one between mathematics and physics 😉  Vectors and Hilbert space , aren&#8217;t these *mathematical* objects?  Here&#8217;s where philosophy is rearing it&#8217;s diabolical head again you see!   Vectors and Hilbert space seem like they&#8217;re part of Algebra and Functional Analysis (branches of mathematics rather than branches of physics).  </p>\n<p>The difficulty is that no one seems to actually know what quantum physics is actually *referring to* (in the sense of the actual objective ontological entities involved).</p>\n<p>So after me dissing philosophy, suddenly it&#8217;s come roaring back into the conversation lol,  the old hoary question of how we should actually interpret the quantum mechanical wave function.  Is there something *physical* to which the wave function is *referring*,  is the wave function itself the actual reality?  Or is it simply a mathematical device recording our state of knowledge?</p>\n]]>", "author": "mjgeddes", "published": "2017-12-27 06:51:05+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>So since this apparently also a legitimate use of this thread, I&#8217;m going to use this to attempt to draw some attention to some math problems, falling outside my main research projects, on which either: (1) I&#8217;m basically stuck and don&#8217;t really expect to make further progress, or (2) I&#8217;m asking something that&#8217;s way beyond me and have not actually made any serious attempt to solve the problem but am asking anyway.  These problems are likely hard, to be clear!  Admittedly, the extent to which you should take &#8220;I find these problems hard&#8221; as evidence of &#8220;these problems are hard&#8221; is unclear.  Still, my assessment is that these problems seem hard.</p>\n<p>(Also, I don&#8217;t think any of these are well-known problems or have anything really out there written about them, but it&#8217;s not like I&#8217;ve tried to do much in the way of a literature search here; I could be wrong.)</p>\n<p>I&#8217;m just going to write some short summaries here; details will be in links.</p>\n<p><b>Problem 1: A greedy coloring of the natural numbers</b></p>\n<p>This problem is due to Joshua Zelinsky.  Here&#8217;s an old unsolved problem: Is there a finite coloring of the positive integers such that for all (n,m)&ne;(2,2), n+m and n*m get different colors?  My understanding is that the expected answer is no.</p>\n<p>Josh asks the following variant: Say we greedily color the positive integers so as to satisfy this constraint.  I.e., are colors will be the positive integers, and we will color them in order, assigning each the lowest color we can so as to be consistent with what&#8217;s been assigned so far.  Can we at least show that this particular coloring uses infinitely many colors?</p>\n<p>I&#8217;ve written a little more about this problem <a href=\"http://www-personal.umich.edu/~haltman/sillyprob.txt\" rel=\"nofollow\">here</a>, in which I also describe some other patterns appearing in this coloring that I&#8217;d like to see proven.</p>\n<p><b>Problem 2: Playing Snake on finite graphs</b></p>\n<p>Let&#8217;s say we consider the game of Snake, but instead of playing on a grid, we play on an arbitrary finite graph.  For which graphs does the player have a winning strategy?</p>\n<p>Well, if H is a spanning subgraph of G, and H is winnable, then so is G.  Therefore it makes sense to focus on the minimal winnables, thus that become unwinnable when any edge is removed.  I&#8217;ve found three (or, depending on how you count, five) families of minimal winnables.  And, on graphs of 8 or fewer vertices, I&#8217;ve manually verified that these are all.  Unfortunately my method just becomes too difficult to carry out once you go up to 9 vertices.</p>\n<p>Question: Are these really all the minimal winnables?  Frankly, it seems ridiculous that they should be &#8212; there&#8217;s no way I&#8217;m calling the idea that they are a conjecture &#8212; but I don&#8217;t have a counterexample.</p>\n<p>I&#8217;ve written more about this problem, and some other questions we can ask about Snake on graphs, <a href=\"http://www-personal.umich.edu/~haltman/snake.html\" rel=\"nofollow\">here</a>.  (I also have more notes on this problem that I haven&#8217;t posted to the internet, if anyone is really interested&#8230;)</p>\n<p><b>Problem 3: What if we redid homotopy theory?</b></p>\n<p>This one&#8217;s an open-ended problem, and one I&#8217;m not remotely qualified to answer; this one falls under category (2) above.  I&#8217;m just going to point to where I asked it on MathOverflow <a href=\"https://mathoverflow.net/questions/204498/what-if-homotopy-were-expanded-to-allow-any-connected-space-instead-of-0-1\" rel=\"nofollow\">here</a>.</p>\n<p><b>Problem 4: The classical analogue of PDQP</b></p>\n<p>This is one I can&#8217;t point you to a webpage for but have written about before in the comments here, so I&#8217;ll link to that. 🙂  I&#8217;ve also asked Scott, and Adam Bouland, about it before &#8212; so who knows, may want to talk to them, maybe they&#8217;ve done more with it that I don&#8217;t know about &#8212; but I feel like it&#8217;s worth publicizing again. 🙂</p>\n<p>Basically: In <a href=\"https://arxiv.org/abs/1412.6507\" rel=\"nofollow\">this paper</a>, Scott, Adam Bouland, Joseph Fitzsimmons, and Mitchell Lee introduced a model of computation where we imagine we have a quantum state we are working with, only in addition to being able to measure parts of it in the ordinary way, we are also allowed to do magical &#8220;non-collapsing measurements&#8221;.  They pointed out that, among other things, in this model, all of SZK can be solved in polynomial time (SZK&subseteq;PDQP), the collision problem can be solved in constant time, and the unstructured search problem can be solved in time O(n^1/3) while requiring time &Omega;(n^1/4).</p>\n<p>In the comments on <a href=\"https://www.scottaaronson.com/blog/?p=2096\">this post</a>, I noted that we can define a classical analogue of this model, in which we work not with a quantum state but an ordinary classical probability distribution (on which we can perform magical &#8220;non-destructive samples&#8221; 🙂 ); and that much of what was in the paper above doesn&#8217;t actually depend on the quantum aspects and so is still true in this weaker model.  In particular, even without the quantum aspects, SZK is still polynomial-time (thanks to Adam Bouland for that observation), and the collision problem is still constant-time.</p>\n<p>But what about the search problem?  I have an algorithm in this model that shows that it&#8217;s at most O(n^1/2).  But can we get any corresponding &Omega;(n^1/k) lower bound?</p>\n<p>What with me not really being a complexity theorist &#8212; this is another one from category (2) &#8212; I thought I&#8217;d post it here (again 😛 ).</p>\n<p>(Maybe I should ask this one on cstheory.stackexchange?  I hadn&#8217;t really considered that until now&#8230;)</p>\n]]>", "author": "Sniffnoy", "published": "2017-12-27 07:10:09+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Quick edit: I said above that &#8220;these problems seem hard&#8221; but it seems likely to me that question #4 would not be that hard to a complexity theorist!  But I can&#8217;t claim to know the area that well.  Number 1 and 2 though, certainly seem hard based on my own experience and just the general hardness of arbitrary number theory/combinatoics problems (these are in category (1)), and #3 seems hard because hardly anyone answered when I asked it on MathOverflow. 😛</p>\n]]>", "author": "Sniffnoy", "published": "2017-12-27 07:12:44+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Edit again: Argh, also I guess I misstated #4, seeing as we already know it has to be &Omega;(n^1/4) because that&#8217;s the lower bound when we do allow quantum stuff.  So: Can we get a lower bound on the time that&#8217;s <i>better</i> than what we know how to get in the quantum case?  That&#8217;s more like the question I intended&#8230;</p>\n]]>", "author": "Sniffnoy", "published": "2017-12-27 07:15:31+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>mjgeddes #28: I mentioned mathematical concepts only because they&#8217;re the language in which physics is written, not because of some ontological commitment about their physical reality.  (Strangely, commenter xyz seems to have had the exact same confusion.)  I&#8217;ve noticed that my physicist friends don&#8217;t even blink if you talk about the state of a physical system being a unit vector in Hilbert space.</p>\n<p>Yes, superfluidity is a &#8220;quantum phenomenon,&#8221; but so is the solidity of ordinary matter (which is largely due to the Pauli exclusion principle)!  So there&#8217;s a slippery slope here, where the &#8220;quantum&#8221; part of physics will keep threatening to swallow all of it.  The way I draw the line is by saying: there are physical systems that we can efficiently simulate on a classical computer, basically just by keeping track of what&#8217;s happening at each point in 3-dimensional space.  And then there are physical systems that we can&#8217;t simulate that way.</p>\n<p>(Note that there are some systems that are clearly &#8220;quantum&#8221; even by my criterion, but that can still be simulated efficiently on a classical computer, by switching to a more clever representation.  Stabilizer states are one example.)</p>\n]]>", "author": "Scott", "published": "2017-12-27 08:56:23+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #27, I quite expected that my #3 would languish, and indeed it has. No takers for me. But relative to your saying &#8220;that all physics is quantum physics!&#8221;, you could discover that quantum optics is also equivalent to a random field theory (in the sense that one can use a twist operation to construct a random field theory as a subalgebra of the algebra of raising and lowering operators of quantum optics) by letting me send you the prospective v3 of that paper. The quantum optics algebra of observables is obviously different from the random field theory&#8217;s algebra of observables, but the same Hilbert space supports representations of both algebras.<br />\nOr someone else. My e-mail address: peter[dot]w[dot]morgan[at]yale[dot]edu (so anyone at Yale especially welcome). Another day, another classified ad (the classified rates are very reasonable here, I must say).</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Morgan:Peter.html\">Peter Morgan</a>", "published": "2017-12-27 17:01:21+00:00", "title": "By: Peter Morgan"}, {"content": "<![CDATA[<p>The big paradox with the concept of physical reality: </p>\n<p>Consciousness is what&#8217;s at the very bottom of our experience, but we assume that there is something even lower than consciousness, something outside of it, which we call physical reality (that&#8217;s a reasonable assumption, although humans don&#8217;t always agree with each other on what &#8220;reality&#8221; is).</p>\n<p>But we can only perceive physical reality indirectly, as content in our sphere of consciousness.<br />\nAnd the content of consciousness is what comes about from the activity of the brain, as a physical construct sensitive to causal patterns between sensory data. &#8220;Looking for causality&#8221; is how the brain evolved as a means of survival/natural selection (predicting the future is always good!).</p>\n<p>But then there was a leap from &#8220;causal&#8221; statistical analysis to &#8220;hard&#8221; logic and mathematics, which is very fruitful (aka physics), but it&#8217;s not entirely clear to me whether that leap is necessarily always valid.</p>\n<p>Is it possible to imagine a general AI that is much more efficient at predicting the future than we are, yet it wouldn&#8217;t rely on logic and mathematics like we do?</p>\n]]>", "author": "fred", "published": "2017-12-27 18:09:47+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Actually, Scott, a thing I just realized last night:</p>\n<p>The computation model that&#8217;s used to define PDQP, it&#8217;s said that solving the collision problem is constant-time in it, and I repeated that statement above (applying it also to the classical analogue); but isn&#8217;t the algorithm for this actually <i>logarithmic</i> time, when you keep track of everything?  Consider &#8212; the final step is to take the results of your non-collapsing measurements on the domain and compare them.  But if the domain is of size n, its elements must be of size log n, meaning comparing them takes time log n.  In fact really to my mind we ought to count the non-collapsing measurements themelves as taking log n time, seeing as how many bits they&#8217;re measuring simultaneously.  But even if the model was defined in a way where that doesn&#8217;t count, the comparison definitely ought to count, right?</p>\n]]>", "author": "Sniffnoy", "published": "2017-12-27 22:34:15+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Sniffnoy #29, #35: I like your question about a lower bound for search in the classical analogue of the PDQP model!  I conjecture that ~&radic;n should be optimal, just as I conjecture that ~n<sup>1/3</sup> is optimal for the quantum version.</p>\n<p>Yes, you&#8217;re right, the gate complexity of the collision-finding algorithm in the PDQP model is O(log n); it&#8217;s only the query complexity that&#8217;s O(1).</p>\n]]>", "author": "Scott", "published": "2017-12-28 00:20:13+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #36: I&#8217;ve written to you and Adam about this before, have you forgotten? 🙂</p>\n<p>Oh yeah query complexity.  Because the queries are a black box which notionally could take a long time so that&#8217;s a thing that it makes sense to look at.  I keep forgetting that&#8217;s a thing that people care about.  So many types of complexity&#8230;</p>\n]]>", "author": "Sniffnoy", "published": "2017-12-28 00:29:02+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Israeli Minister of Transportation Yisrael Katz has announced that a new high-speed rail station in the Old City of Jerusalem will be named after the second most admired man in the world, President Donald Trump.</p>\n<p>In fact, since Trump recognized Jerusalem as Israel&#8217;s capital. a Trump naming frenzy has swept Israel, with plans to name a street and a park after Trump as well.</p>\n<p>Since I get the impression you like Israel, but don&#8217;t like Trump, I was wondering what your thoughts were on all of this.</p>\n]]>", "author": "fnord", "published": "2017-12-28 01:49:47+00:00", "title": "By: fnord"}, {"content": "<![CDATA[<p>Scott #32</p>\n<p>It seems to me that HH unavoidably pulls in the issue of mathematical realism&#8211;a mathematical realist would say that the result of the firewall calculation has a reality independent of whether it can actually be computed in the available time, and so the possibility of making the necessary observations should necessitate the firewall&#8217;s presence regardless. </p>\n<p>The &#8220;monte carlo&#8221; objection seems to me to be an attempt to show that the reality of the result can&#8217;t be contingent on the difficulty one would expect to encounter in deriving it. I think my confusion arises from your observation that getting the result from a &#8220;monte carlo&#8221; procedure in the available time is of comparable unlikelyhood to the spontaneous appereance of a firewall. I took from this the implication that the two were somehow causally connected&#8211;otherwise I&#8217;m not sure how that actually answers the objection. Then it just seems like saying <i>&#8220;no-one will ever collect the Powerball jackpot, because winning Powerball is less likely than being hit by lightning, so people will always be hit by lightning before they can redeem their ticket.&#8221;</i></p>\n]]>", "author": "xyz", "published": "2017-12-28 01:52:15+00:00", "title": "By: xyz"}, {"content": "<![CDATA[<p>@Fred #34:<br />\n&#8220;the big paradox with the concept of physical reality&#8221;<br />\nThe Veda&#8217;s, the spiritual texts of India, say that the physical universe is essentially an illusion , they use the term maya. Which begs the question &#8220;what is real &#8221; then. Maybe the weirdness of quantum mechanics is prima facia evidence that our physical realty is a real &#8220;illusion&#8221; and to try and make perfect mathematical sense out of it (physics, computer science, ect) may be the ultimate fools errand 🙁</p>\n]]>", "author": "William Hird", "published": "2017-12-28 01:53:18+00:00", "title": "By: William Hird"}, {"content": "<![CDATA[<p>BTW, Scott, if you&#8217;d prefer a complexity-theoretic angle on my problem #2 above, note that if my hypothesis about which graphs are winnable is true (which, again, I expect it <i>isn&#8217;t</i>, because it&#8217;s ridiculous, but I&#8217;ve yet to find what a counterexample might look like), it would mean that the language of winnable graphs, na&iuml;vely just in PSPACE, is in fact in NP. 😛</p>\n]]>", "author": "Sniffnoy", "published": "2017-12-28 08:19:55+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Sniffnoy #37:</p>\n<ul>I’ve written to you and Adam about this before, have you forgotten?</ul>\n<p>Yes. 🙂  Not because the question is uninteresting, but because my memory is poor and worsening.</p>\n]]>", "author": "Scott", "published": "2017-12-28 11:13:09+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>xyz #39: In that case, I think you just have a factual misunderstanding about how the AMPS paradox works.  A firewall doesn&#8217;t get created merely because the result of a computation is perceived in someone&#8217;s mind, or stored in a computer memory somewhere&#8212;that would indeed be bizarre, even more so than what we&#8217;re actually talking about! 🙂</p>\n<p>Rather, the reason the firewall forms is that an physical transformation was applied to the quantum state of the early Hawking radiation&#8212;and because of a holographic duality, that&#8217;s equivalent to applying a physical transformation to the quantum state of the black hole.</p>\n<p>By using computational complexity, one can plausibly lower-bound the amount of time it would take to <i>apply</i> that physical transformation.  But it&#8217;s still a physical transformation of an actual quantum state.  (And interestingly, even if we assumed for example that P=PSPACE, we&#8217;ve been unable to show that applying the physical transformation would be <i>easy</i>.  The implication, from HH decoding being easy to solving a computational problem being easy, currently only works in one direction.)</p>\n<p>So at the end of the day, just like in any other physics, if you want to change a physical system you have to act on it, not just sit at home thinking about it or simulating it on your computer.  It&#8217;s just that this particular system&#8212;i.e., a quantum black hole dual to its own Hawking radiation&#8212;is one of the weirdest ones that physics ever considered.</p>\n]]>", "author": "Scott", "published": "2017-12-28 11:46:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>fnord #38: As you&#8217;d imagine, I think it&#8217;s horrible, and an eternal disgrace that the Netanyahu government allowed it to happen, on top of the much more fundamental disgrace of the Netanyahu government supporting Trump in the first place for craven and short-term reasons.</p>\n<p>Maybe I should comment that my feelings about Israel are as complicated as my feelings about the US.  Both countries&#8217; foundings are among the most important events in human history for me, Herzl and Ben-Gurion are my heroes along with Adams, Hamilton, Franklin, and Paine, and the survival of both countries is one of the things I most care about.  But both countries clearly need to be defended not just against external threats but also against internal rot.  Just like I know hundreds of Americans hardly any of whom support Trump, so I know hundreds of Israelis hardly any of whom support Netanyahu.  But obviously my sample is biased, because (alas) quasi-democratic processes have brought these opportunistic strongmen to power in both countries.</p>\n]]>", "author": "Scott", "published": "2017-12-28 12:03:30+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>WANTED: Good surveys of interpretations of quantum mechanics. Seeking mid-level between popular and professional, eg Stanford Encyclopedia of Philosophy, any length, moderate math welcome. Must be team player suited to our fast-paced multidisciplinary environment. All submissions will be read with gratitude. EEOE (Equally Epistemic/Ontic Enquirer)</p>\n]]>", "author": "Noob, LLC", "published": "2017-12-28 14:11:30+00:00", "title": "By: Noob, LLC"}, {"content": "<![CDATA[<p>I don&#8217;t have anything to publicize, but I&#8217;d like to take this opportunity to point out that Shtetl Optimized was responsible (at least partially) for my recently landing a job at a big research outfit in Research Triangle Park. I was asked an out-of-the-blue apropos-of-nothing &#8220;science geek&#8221; question and I drew on some of the discussions here to blow my interviewers out of the water. Thanks, Scott and everyone else!</p>\n]]>", "author": "Bob Strauss", "published": "2017-12-28 14:17:01+00:00", "title": "By: Bob Strauss"}, {"content": "<![CDATA[<p>William #40</p>\n<p>Yes, and it&#8217;s so interesting (lucky for us!) that Schrodinger was so fascinated by those questions</p>\n<p><a href=\"http://www.cortona-india.org/Storage/20101121-2Bitbol.pdf\" rel=\"nofollow\">http://www.cortona-india.org/Storage/20101121-2Bitbol.pdf</a></p>\n]]>", "author": "fred", "published": "2017-12-28 14:18:14+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>William Hird #40,</p>\n<p><i><br />\n&#8220;Maybe the weirdness of quantum mechanics is prima facia evidence that our physical realty is a real “illusion” and to try and make perfect mathematical sense out of it (physics, computer science, ect) may be the ultimate fools errand&#8221;</i></p>\n<p>This seems like the exact opposite lesson. The mathematicis of quantum mechanics has been enormously successful in understanding things on a small scale, with many modern technologies relying on that (e.g. anything with lasers and most modern electronics). If anything, this shows us that the use of mathematics to understand things taken together with empirical observation of the universe is a really good combination and much stronger than anything else. </p>\n<p>I could easily imagine someone in 1700 just as people are really starting to realize that Newtonian gravity implies something like chaos for very long-term predictions of orbits saying something very similar to what you have said about gravity. I&#8217;m curious what you would say to that person.</p>\n]]>", "author": "Joshua Zelinsky", "published": "2017-12-28 14:30:38+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>fred #34&#8217;s &#8216;causal statistical analysis&#8217; reminded me of Scott&#8217;s proposal/challenge to develop a theory of causal computational learning from some time ago. Well, is there any status update on it, anyone?</p>\n]]>", "author": "Ashley", "published": "2017-12-28 14:49:39+00:00", "title": "By: Ashley"}, {"content": "<![CDATA[<p>Bob Strauss #46: Awesome, enjoy your new job, and you&#8217;re welcome!!</p>\n<p><i>Shtetl-Optimized</i>: Helping people get jobs since &#8230; well, you may have actually been the first.  (Or was that me?)  😀</p>\n]]>", "author": "Scott", "published": "2017-12-28 16:48:23+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Ashley #49: Alas, nothing worth writing about.  I had some ideas about learning an unknown circuit via &#8220;injection queries&#8221; (i.e., causal interventions), but I then discovered that I&#8217;d basically just recapitulated some of the 2006 work of Dana Angluin and her collaborators.  Between writing about it and now, I also met Judea Pearl and had a lovely conversation, but we didn&#8217;t manage to discuss anything substantial about the prospects for &#8220;causal COLT.&#8221;  In the meantime, the deep learning revolution has happened, and reminds us that learning theory is hopelessly behind practice even just in understanding, explaining, and predicting the successes of <i>non-</i>causal kinds of machine learning.  Which, of course, presents an opportunity for ambitious theorists.</p>\n]]>", "author": "Scott", "published": "2017-12-28 16:56:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>@ William Hird #40</p>\n<p>Please note that &#8220;beg the question&#8221; doesn&#8217;t mean &#8220;raise the question.&#8221; It means &#8220;presuppose or assume the premiss of an argument.&#8221;</p>\n]]>", "author": "Braithwaite Prendergast", "published": "2017-12-28 20:16:39+00:00", "title": "By: Braithwaite Prendergast"}, {"content": "<![CDATA[<p>@Joshua # 48:<br />\nSounds like you are forgetting that no one can give a simple explanation for the double slit experiment and that no one can give a simple explanation of why two magnets attract or repel each other (action at a distance, see the Richard Feynman YouTube video where he says he cannot give a simple explanation of why magnets work). If one of the greatest physicists of the 20th century cannot give a &#8220;laymans&#8221; explanation of action at a distance, then I &#8220;don&#8217;t have to&#8221; explain anything about physics to someone from the 1700&#8217;s 🙂</p>\n]]>", "author": "William Hird", "published": "2017-12-28 20:57:16+00:00", "title": "By: William Hird"}, {"content": "<![CDATA[<p>Joshua #48</p>\n<p>&#8220;The mathematics of quantum mechanics has been enormously successful in understanding things on a small scale [&#8230;] the use of mathematics to understand things taken together with empirical observation of the universe is a really good combination and much stronger than anything else.&#8221;</p>\n<p>When people bring up &#8220;QM mathematics does work!&#8221;, I ask &#8211; okay, but what would be the alternative?</p>\n<p>If I try to imagine some system where &#8220;things&#8221; happen, but mathematics would have no power of explanation, e.g. there is simply no causality or apparent logic between events, no matter how closely you look at them. So &#8220;things do happen somehow&#8221;, but we don&#8217;t know why and will never know why.</p>\n<p>One definition for this could be &#8220;magic&#8221;&#8230;</p>\n<p>But isn&#8217;t this also exactly the definition of the kind of &#8220;randomness&#8221; that&#8217;s at the very core of QM?<br />\nSo, I could equally say that QM also strongly suggests that mathematics does not always work to describe reality.</p>\n]]>", "author": "fred", "published": "2017-12-28 21:48:20+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>I guess one could say that QM randomness sort of vanishes if you consider multiverse theories &#8211; all the alternatives exist at once.<br />\nBut, still, why are we subjectively experiencing one particular branch and not another?</p>\n<p>It&#8217;s the same massive asymmetry that&#8217;s also (apparently) at the core of the consciousness of the self: </p>\n<p>Why am I, at this moment, experiencing the life of a particular human, among the millions of trillions of other humans, animals, aliens, conscious AIs who have ever existed, exit, or will exist, anywhere in the known universe?</p>\n]]>", "author": "fred", "published": "2017-12-28 21:58:12+00:00", "title": "By: fred"}]