[{"content": "<![CDATA[<p>[&#8230;] Scott Aaronson weighing in on the controversy caused by Robin Hanson&#8217;s article &#8211; Robin&#8217;s original post and follow-up. Scott notes that Robin has spawned many important, original ideas, and that though he can be tone-deaf or insensitive, he is a genuine person. Robin&#8217;s original post noted that there is liberal sympathy for people who lack access to money but not for those who lack access to sex, about as taboo of a comparison as is possible to make. But as Scott points out, Robin doesn&#8217;t hold your hand or slowly walk you through his ideas, which is why I prefer Scott&#8217;s article instead. He handles the topic much more delicately, and his article won&#8217;t invoke the involuntary feelings of disgust that Robin&#8217;s might. The biggest takeaway is that we don&#8217;t consider Muslim extremists as representative of all Muslims nor do we consider leftist extremists to be representatives of all leftists. So similarly, we should not consider extremist involuntary celibates as representatives of all involuntary celibates. And since we recognize that the majority of Muslims are normal, decent people, and feel compassion for their plight in combating discrimination, we should recognize that the majority of involuntary celibates are decent people as well and extend our compassion for their plight in finding human connection. No, I&#8217;m not saying you should feel compassion for the minority that sexually harasses the other sex (mostly women) or demand sex as a right, just like I wouldn&#8217;t expect you to feel compassion for Muslim extremists who terrorize the population. But do recognize that most are deserving of your compassion. [&#8230;]</p>\n]]>", "author": "Weekly Digest 5/10/18  On The Nose", "published": "2018-05-10 17:46:34+00:00", "title": "By: Weekly Digest 5/10/18 – On The Nose"}, {"content": "<![CDATA[<p>Re. Aumann&#8217;s theorem. To me it does not seem counter-intuitive, but maybe I am missing the point. You state that:</p>\n<p>&#8220;they should converge on exactly the same conclusions about every matter of fact, even ones as remote-sounding as the existence of extraterrestrial life.&#8221;</p>\n<p>But, in that example what would the exact agreement that they come to look like? </p>\n<p>&#8220;Finally, at long last, we agree that the probability that extraterrestrial life exists is between 0 and 1.&#8221; is a correct, but meaningless statement. Presumably, trivial agreement doesn&#8217;t count.</p>\n<p>Instead, we might insist on agreement on a value for probability. However, any such estimate would come with an error term.  They could then agree on an estimate for the error. The size of the error term might depend on various choices of assumptions, etc. In some cases, there may not be an objective best choice for the set of assumptions, so various scenarios might have to be analyzed. If things can not be constrained sufficiently, the overall result might not be an appreciable improvement over the trivial case. </p>\n<p>In any case, a realistic, good faith agreement might be some complicated conditional statement that rigorously weights the various unknowns and sources of uncertainty that the combined Bayesian&#8217;s are aware of, etc to the best of their collective abilities.  While the content of that agreement might truly be insightful, the fact that it can in principle be achieved seems unremarkable especially since they are starting with the same prior. In fact, it sounds like ordinary science in action.</p>\n]]>", "author": "mdr", "published": "2018-05-10 17:54:09+00:00", "title": "By: mdr"}, {"content": "<![CDATA[<p>It seems like all of these proposals to help romantically frustrated people are unhelpful, and possibly self-parodies. But in the interest of trying to actually help by some epsilon, here&#8217;s some advice to anyone going on a date about how to make it go better</p>\n<p>(1) Before saying anything, think to yourself &#8216;Is this a negative sentiment?&#8217; If it is, don&#8217;t say it.</p>\n<p>(2) Be interested in the person you&#8217;re with. Find them fascinating.</p>\n<p>(3) Don&#8217;t mention your romantic attempts with anyone else. This is the only date you&#8217;ve ever been on in your life.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cohen:Bram.html\">Bram Cohen</a>", "published": "2018-05-10 17:57:03+00:00", "title": "By: Bram Cohen"}, {"content": "<![CDATA[<p>Scott, you already have the moral right to ignore Arthur Chu. He&#8217;s a picked-on nerd who instead of responding by standing in solidarity with his fellow nerds responds by trying to demonstrate his non-loser bona fides by picking on people who he perceives as being even lower on the social pecking order than he is.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cohen:Bram.html\">Bram Cohen</a>", "published": "2018-05-10 19:48:54+00:00", "title": "By: Bram Cohen"}, {"content": "<![CDATA[<p>How many men are celibate because they truly, genuinely cannot find ANY women willing to date them? There are equal numbers of men and women out there. Our society still has bradly monogamous norms. So if there are large numbers of single males, there are almost certainly a (at least nearly) equal number of single females.<br />\nWhy are the male &#8220;incels&#8221; unable to find and hook up with the female &#8220;incels&#8221;? Perhaps the problem is not one of the &#8220;distribution of sex&#8221; which by it&#8217;s framing presupposes that there is a fixed amount of sex available, but the total amount of sex. Maybe we can &#8220;grow the pie&#8221; by creating better mechanisms for unattractive single men to meet unattractive single women, and have sex with them.<br />\nA supply side solution that everyone can get behind!</p>\n]]>", "author": "Hazel Meade", "published": "2018-05-10 20:03:06+00:00", "title": "By: Hazel Meade"}, {"content": "<![CDATA[<p>Bram #242: All good advice, but worth noting that for someone who&#8217;s actually caught in the trap none of this is going to come up. 😛</p>\n]]>", "author": "Sniffnoy", "published": "2018-05-10 20:18:56+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Scott #236</p>\n<p>haha, you have a good sense of humour, even enough to reply to my unhelpful and rude post yesterday.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/g/Gallagher:James.html\">James Gallagher</a>", "published": "2018-05-10 21:52:50+00:00", "title": "By: James Gallagher"}, {"content": "<![CDATA[<p>For sure there are extremists Muslims out there. Luckily I don&#8217;t know any. All the Muslims I knew were generally conservative (I&#8217;d say I&#8217;m a conservative progressive). Like most people they want to preserve their traditions and way of life. And they want to get on. At least that&#8217;s true in Bangladesh. It&#8217;s tougher here in Europe because there is the question of how far should one go to assimilate and also how easy or difficult that is. </p>\n<p>I was actually working at Hewlett-Packard when 9-11 hit. I felt sick. There were some Muslims from the Middle-East there and they could barely hide a snigger looking at me. To them, I was too westernised. But I was born in the West, I can&#8217;t change that and nor would I want to. Were they extremists? I doubt it. But their loyalties lied elsewhere.</p>\n<p>Some-one once asked me about Sharia, I had nothing to say about it. To me British law is compatible with Islam.  </p>\n<p>As for the whole Israel-Palestine conflict. That&#8217;s tragic. Some real pressure needs to be applied to both sides so a decent peace agreement can be arrived at.</p>\n]]>", "author": "Mozibur Rahman Ullah", "published": "2018-05-11 00:54:12+00:00", "title": "By: Mozibur Rahman Ullah"}, {"content": "<![CDATA[<p>Bram #242: Thanks!!  In that spirit, while no one would mistake me for an expert, let me share what as far as I can tell might be the <i>single most important</i> piece of dating advice for nerds.</p>\n<p>Namely: you need to develop a personality that&#8217;s</p>\n<p>(1) laid-back, confident, funny, and taking nothing too seriously, as opposed to nervous, tightly-wound, and obsessed with avoiding errors and correcting the errors of others; but also</p>\n<p>(2) consistent with your overall beliefs and values, so that it doesn&#8217;t feel like play-acting or putting on a costume.</p>\n<p>You then need to display that personality, and <i>only</i> that personality, for the first few dates.</p>\n<p>Here&#8217;s an example: suppose you discover that your date is partial to some form of irrationality or pseudoscience&#8212;let&#8217;s suppose, palm reading.</p>\n<p>Nerd impulse #1 is to rush to educate your date about cognitive biases, double-blind testing, Bayes&#8217; theorem, etc. etc. in an attempt to get her to drop the absurd, pre-scientific belief.</p>\n<p>Nerd impulse #2 is to recognize the stupidity of impulse #1, so instead <i>lie</i>, and pretend to be open to the pseudoscience as well so your date won&#8217;t hate you.</p>\n<p>The conflict between these two impulses can itself produce enormous stress that will be visible on your face and will ruin the date.</p>\n<p>But there&#8217;s a third way.  You announce that it so happens that you&#8217;re an <i>expert</i> palm reader, and offer to read her palm&#8212;and then &#8220;discover&#8221; surprising lines that prove, e.g., that she&#8217;s only attracted to guys who look exactly like you do.</p>\n<p>The result: she laughs.  You laugh.  You haven&#8217;t had to compromise your disdain for irrational woo-woo; in fact you mocked and ridiculed the woo.  She <i>knows</i> that you&#8217;ve ridiculed it, but is actually fine with that, because truth be told, she never regarded the woo the way you would, as a proposition about the world to be judged true or false.  (I hasten to add that this is compatible with her being highly intelligent, in the sense of IQ tests&#8212;she simply doesn&#8217;t have the nerd&#8217;s attitude toward truth, which is rare among women and men alike.)  The final result is that you&#8217;re now holding her hand.</p>\n<p>If I had to give just a single piece of romantic advice to my younger self, or to any teenage nerd who might be in a similar situation, it would be this: distill the lesson from the above example; then apply it to <i>literally everything</i> that happens on the date.</p>\n<p>One final remark: in the happy event that your date is herself a nerd&#8212;by which I mean, not the &#8220;omigod I&#8217;m the <i>biggest</i> nerd&#8221; kind of nerd, but an <i>actual</i> nerd&#8212;you can throw what I said above out the window.  Confidence and humor are still attractive, but beyond that, you can interact <i>much</i> more in the way you&#8217;re used to, the way you&#8217;d interact with any fellow nerd.  It&#8217;s just that, if you use e.g. online dating, then actual nerds are a very small percentage of the people you&#8217;ll meet&#8212;again, not because they&#8217;re rare among women, but because they&#8217;re rare among <i>everyone</i>.</p>\n]]>", "author": "Scott", "published": "2018-05-11 01:28:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;My hope was to sit out this Robin Hanson affair entirely, but then Arthur Chu started shaming me on Twitter. So, much like with Pearl Harbor, I had no choice but to enter somebody else’s war!&#8221;</p>\n<p>Unfortunately, this is a highly problematic strategy, as tempting as I know it is in the heat of the moment. If someone opposed to you can force you to spend 10 hours of your effort with 10 minutes of theirs, they can effectively use up all of your time and paralyze you. It&#8217;s like how terrorists attack major states: do something that they feel they have to massively respond to, preferably with minimal effort yourself. That way, you can render them ineffective even without a head-to-head fight.</p>\n]]>", "author": "Alyssa Vance", "published": "2018-05-11 02:33:39+00:00", "title": "By: Alyssa Vance"}, {"content": "<![CDATA[<p>@Scott#236- that&#8217;s a bad analogy. The Japanese only bombed Pearl Harbor after the Americans put an embargo on them to get them to stop their war with China.</p>\n]]>", "author": "Michael", "published": "2018-05-11 02:45:43+00:00", "title": "By: Michael"}, {"content": "<![CDATA[<p>Thanks again for a very generous blog post. I do not have the time to read all the comments so apologies if it&#8217;s full of repeats.<br />\nWhy no love for the loveless?</p>\n<p>1. Because &#8220;jealousy&#8221;. It&#8217;s the continuation of the best pupil in the class who isn&#8217;t considered &#8220;cool&#8221; and worth or even sensible to be hanging around with, except by the odd other misfit. That is where I think a response from society could be effective. First in some way (how?) society must stop elevating crass ignorance. Not easy considering Trump, what passes as politics nowadays, the decline of the newspaper, reality TV starification etc&#8230; Secondly, the thought models where nerds are rejected, are precisely formed at school (from end of kindergarten to high school) where the not-so-academically inclined tend to be crushed by the system, the scoring, the value judgements from authority figures, and integrate that it is some kind of battle. And later, consciously or not, that the nerds &#8220;deserve it&#8221; when something does not go their way. It&#8217;s some sort of comeuppance that they do not manage when it comes to romantic relations. I only understood recently why most of the class during the middle/high school years LOVED the physical education classes. It&#8217;s because it was the ONLY class during the week where the teachers told them that they were &#8220;good&#8221; or at least adequate&#8230; Something (what?) should be done there.</p>\n<p>2. The idea that it&#8217;s not the role of society to correct this. If somebody is shy/awkward/etc it&#8217;s an inner problem, that can be solved with inner work. I don&#8217;t know if this idea has merit, but I think lots of people see it that way. The result, there is no talk on how to make society more inclusive to &#8220;shy&#8221; people. If somebody is black, gay, a woman, that is not a problem. There is no &#8220;inner work&#8221; to do to &#8220;correct&#8221; this. The problem resides purely in the racism/bigotry/misogyny of society. That is an important distinction I think. On how these things are perceived. For what is worth, my own opinion is that the &#8220;unlucky nerd&#8221; should do some work on himself (who should not strive to &#8220;improve&#8221; anyway?) AND society should meet the nerd halfway by being more kind, welcoming, etc.</p>\n<p>3. Triage. The idea that there are more pressing problems in this world, and that for the same amount of work one can have a much greater impact elsewhere. Also, other problems are better diagnosed and a clearer solution is seen. For example: There may be 3 million &#8220;love shy&#8221; nerds in the USA (no idea of a true number btw, part of the diagnosis problem). OK, but what to do for them right now, concretely? There are 75 million working women in the US, who would benefit immediately and with certainty from an equal-pay law. Grasp the big, (somewhat) low hanging fruits first&#8230;Now I am not comfortable with this argument. I could imagine somebody in the 1930s/40s saying &#8220;The Jews? OK it&#8217;s unfortunate but anyways they are a small part of the population, in the grand order of things who cares?&#8221; and that is basically the same reasoning and it stinks for a lot of reasons. Still, how does one choose a cause to defend? Because one cannot focus on everything.</p>\n<p>4. The idea that problems are equal. Like Maslow&#8217;s Pyramid but flattened. Like &#8220;This nerd has a good job, a good pay, a nice apartment, academic success, can understand almost anythink anyone says or writes, and a flatlined love life. Well, 5 out of 6! 85% of his possible life goals are fulfilled, not much to complain about!&#8221;. Of course &#8220;the nerd&#8221; will not see it this way and with some reason I think. Still, life is often hard, and for a lot of people, be it finances, love life, health, shitty jobs&#8230;</p>\n<p>To conclude, more &#8220;studies&#8221; should be done on the contemporary &#8220;love shy&#8221; problem(s) and this blog post and discussion are the beginning/part of the solution but much remains to be done, before concrete action, in my opinion.</p>\n]]>", "author": "Jo", "published": "2018-05-11 05:58:48+00:00", "title": "By: Jo"}, {"content": "<![CDATA[<p>Scott #248</p>\n<p>I myself would recommend to take some drama/improv classes.<br />\nThat helped me a lot (of course by then I was in my mid-twenties and most of the women who I met enough to develop a interest possibly evolving, were engaged/married&#8230;but that&#8217;s another story, missing the &#8220;high school/college dating window&#8221;&#8230;)</p>\n<p>Anyway, shy people can do theatre/acting as much as extroverts, there is no correlation between extra/intoversion and acting talent. And the first time going on the stage in front of &#8220;real&#8221; people, everybody is terrified whether they say it or not&#8230;And then the next day you realize that you are still alive so it&#8217;s OK&#8230;</p>\n<p>A problem that I had was that everything I did/said was over-thought. Like I had to solve a tiny math problem before choosing how to say that I liked potatoes but not carrots. I guess this is a common problem for &#8220;nerds&#8221;. No spontaneity whatsoever. Theatre/improv can help you work (yes it&#8217;s training for the big &#8220;muscle&#8221; in the middle of your skull) on spontaneity, which will help you in most social situations including dating.<br />\nAnd when the analytical (and insulting/boring) response will be to scientifically diss palm reading, the simplistic will be to fake embracing it, and the &#8220;smart&#8221; one will be to read the other one&#8217;s palm, somebody who has some spontaneity will have more probability to find the &#8220;smart&#8221; response on the spot.</p>\n<p>Another benefit will be self-image and confidence. </p>\n<p>The third benefit will be to reconcile the nerd with his/her body. In the sense, quitting the &#8220;classical view&#8221; mind and body separated/mutually exclusive, with emphasis/focus solely on the mind, and realizing that mind and body go together. This can be a big help for &#8220;life balance&#8221; in addition to reducing physical awkwardness. And knowing how to &#8220;occupy&#8221; the space.</p>\n<p>Lastly it can help for knowing how to read other people&#8217;s emotions.</p>\n<p>So, my advice for fellow nerds, at least try it! You will never know if it&#8217;s for you or not if you don&#8217;t try! It won&#8217;t kill you either way!</p>\n]]>", "author": "Jo", "published": "2018-05-11 06:51:13+00:00", "title": "By: Jo"}, {"content": "<![CDATA[<p>Speaking of domain theory, I had a burst of monster insights and finally powered through to the complete solution to consciousness over the weekend! 😀  </p>\n<p>Domain theory is related to set theory.  It&#8217;s the natural math of hierarchies!  I don&#8217;t know why in the heck I never saw this before!  (Side-note: I was amused to learn that there&#8217;s such a thing as a &#8216;Scott Domain&#8217;).  Any way, I realized domain theory is the natural math of recursion!  Consciousness manages the flow of time in dynamical systems by generating self-models, and the way it does it can be explained using domain theory to generate conceptual trees.  </p>\n<p>Hyperbolic geometry is the natural mathematics of mind!  Look at a Poincare disk and you&#8217;ll see the distance increases exponentially as you approach the border &#8211; it&#8217;s the natural way to represent hierarchical structures such as conceptual trees!</p>\n<p>I generalized the notion of a parse tree using domain theory and embedded in hyperbolic space to create a new model of time representing how dynamical systems generate conceptual knowledge.  I think this new model of time might just be the second arrow of time &#8211; consciousness!  </p>\n<p>I believe I deserve a super-model for finally cracking consciousness.  Barbara Palvin is the girl for me! </p>\n<p><a href=\"https://www.instagram.com/realbarbarapalvin/?hl=en\" rel=\"nofollow\">https://www.instagram.com/realbarbarapalvin/?hl=en</a></p>\n]]>", "author": "mjgeddes", "published": "2018-05-11 10:43:14+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>Ellen Pao should be interested in this:</p>\n<p>&#8220;Chinese tech companies hiring &#8216;pretty&#8217; women to motivate male employees by chatting, playing ping pong and buying them breakfast&#8221;</p>\n<p><a href=\"http://www.dailymail.co.uk/femail/article-3208366/Programming-cheerleaders-hired-motivate-Chinese-employees.html\" rel=\"nofollow\">http://www.dailymail.co.uk/femail/article-3208366/Programming-cheerleaders-hired-motivate-Chinese-employees.html</a></p>\n]]>", "author": "Arc Bends", "published": "2018-05-11 11:33:51+00:00", "title": "By: Arc Bends"}]