[{"content": "<![CDATA[<p>Anonymous: What??  I didn&#8217;t acknowledge that commenter &#8220;Candide&#8221; had a &#8220;Jew issue&#8221; because of the Voltaire reference, but because of his many remarks (e.g., the US&#8217;s wars being fought for &#8220;tikkun olam&#8221;) that you can read for yourself above.</p>\n<p>Also, while I wouldn&#8217;t choose to commission a Voltaire statue myself, I freely admit that other people might have reasons to honor him that are unrelated to his vociferous antisemitism.</p>\n]]>", "author": "Scott", "published": "2017-05-31 19:01:17+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>dorothy #122: Yes.</p>\n]]>", "author": "Scott", "published": "2017-05-31 19:06:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Incidentally, one side benefit of these debates over monuments is that, to use the history teacher&#8217;s cliche, they &#8220;bring the past alive,&#8221; probably more directly than any other modern political disagreements.  Like, I&#8217;ve already learned a few new tidbits from this thread, and been reminded about things I&#8217;d forgotten.</p>\n]]>", "author": "Scott", "published": "2017-05-31 19:11:57+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>well the commenter&#8217;s name is &#8220;Candice III&#8221; not Candice so I thought you referred to the novella (or the main character in it who killed a  Jew but also a priest), sorry for the mix up</p>\n]]>", "author": "Anonymous", "published": "2017-05-31 19:19:52+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>Scott #87:</p>\n<blockquote><p>one of the world’s 167 other countries</p></blockquote>\n<p>Where did you get that number? The United Nations has 193 members, and then there are a bunch of other entities which may or may not be considered independent countries depending on who you ask. The last time your number was even remotely accurate was in 1991 before the Soviet Union dissolved.</p>\n]]>", "author": "Aula", "published": "2017-05-31 21:20:36+00:00", "title": "By: Aula"}, {"content": "<![CDATA[<p>I appreciate the suggestions for Southern heroes, but I realized I should have expanded on what I was looking. The statues of Lee, Jefferson Davies and the other racist traitors are often placed in cities and states where they were not born or active. They are pan-Southern heroes (to a segment of the population.) </p>\n<p>So ideally, I am looking for heroes who naturally are general Southern heroes, not just a hero who happens to be from the south.</p>\n]]>", "author": "Jr", "published": "2017-05-31 21:24:36+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>Aula:  Thanks!  Misremembered.  I&#8217;ve now corrected to 195.</p>\n]]>", "author": "Scott", "published": "2017-05-31 21:29:14+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>It seems to me that we have two competing issues here.  One, the right of people not to be confronted in public spaces with things a large number of them find offensive.  Two, the desire not to live in a society where art is destroyed, and books are burned.</p>\n<p>That statue of a Confederate general some people find offputting was carefully crafted by an artist, scaled up, and cast in bronze.  Quite a bit of highly skilled work.</p>\n<p>So while I do not object to the removal of Confederate monuments, I am concerned over what happens to them once they have been removed.</p>\n<p>If they are donated to a museum&#8217;s Civil War collection, great.  If they are smashed to bits and hauled to a landfill, not so great.</p>\n]]>", "author": "Choronzon", "published": "2017-05-31 22:18:40+00:00", "title": "By: Choronzon"}, {"content": "<![CDATA[<p>Choronzon: Agreed.</p>\n]]>", "author": "Scott", "published": "2017-05-31 22:20:32+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<blockquote><p><b>Jr</b> says: &#8220;I am looking for heroes who naturally are general Southern heroes, not just a hero who happens to be from the south.&#8221;</p></blockquote>\n<p>When and where I grew up, honored heroes included&nbsp;&hellip; <a href=\"https://en.wikipedia.org/wiki/Jimmie_Rodgers_(country_singer)\" rel=\"nofollow\">Jimmy</a>&nbsp;&hellip; <a href=\"https://en.wikipedia.org/wiki/Johnny_Cash\" rel=\"nofollow\">Johnny</a>&nbsp;&hellip; <a href=\"https://en.wikipedia.org/wiki/June_Carter_Cash\" rel=\"nofollow\">June</a>&nbsp;&hellip; <a href=\"https://en.wikipedia.org/wiki/Dolly_Parton\" rel=\"nofollow\">Dolly</a>.  Last names superfluous. </p>\n<p>This list is serious: there exist no small number of statues and/or monuments that honor these country-culture heroes.</p>\n]]>", "author": "John Sidles", "published": "2017-05-31 22:37:50+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>I gather you were bending over backwards to say something nice about &#8220;Social Justice Warriors&#8221; here, but perhaps that&#8217;s just showing the uselessness of that category.  The struggle to take down Confederate monuments has been a long one, pursued in large part by traditional civil rights organizations full of people who aren&#8217;t just following the latest campus or online enthusiasm.  Yes, there&#8217;s some overlap between the people fighting against Confederate monuments and the people fighting free speech they don&#8217;t like, but perhaps less than you think.</p>\n]]>", "author": "Isotopeblue", "published": "2017-06-01 10:59:28+00:00", "title": "By: Isotopeblue"}, {"content": "<![CDATA[<p>Scott #14: </p>\n<blockquote><p>Of course the First Amendment allows private individuals to buy t-shirts honoring Mao, Hitler, the Confederacy, or whatever else, as disgusting as the rest of us might find that.</p></blockquote>\n<p>That&#8217;s disingenuous. If a shop sold Hitler t-shirts openly, it would be picketed, vociferously protested and possibly destroyed through private action. Imagine what would happen if a person appeared in a Hitler t-shirt on a campus! On the other hand Che Guevara t-shirts are always in fashion.<br />\nScott #104: Yeah, I know about the Chinese moving themselves and their money to U.S. Enjoy it while it lasts, because things like Merkel&#8217;s boner do create a very unfavorable impression in China. Also, the reverse trickle is not to be dismissed lightly for it may be a sign of things to come. As for moving, Seattle is a very unfortunate and expensive example, being both the site of Microsoft HQ and a prime target for Chinese parking money in U.S. via real estate. As for being an attractive place to move to, it helps when you are the ones defining what is attractive.<br />\nScott #106: </p>\n<blockquote><p> If you want to be venerated for your service to the US military, I’d think it reasonable to ask that you at least join the US military, as opposed to a rebel military engaged in treason against the US.</p></blockquote>\n<p>Wat? I&#8217;m talking about modern military. You&#8217;re not making any sense. Have you served in the military? These people were soldiers and generals from the American South, and part of the reconciliation process in the Civil War was that they were acknowledged as American soldiers and generals. Now by attacking their memory you tell new soldiers and potential generals that <i>their</i> memory can be dishonored and destroyed post factum based on the evil principle you enunciate in #10. That&#8217;s not good for morale at all. By the way, your seeing Southern generals as traitors is yet another sign that you&#8217;re only grosstopically a Southerner. Also, arguing about what the government should or should not do is the mark of belonging to the ruling class. Most Americans, in fact, think of government as &#8220;they&#8221;.<br />\nSidles #107: Indeed. I&#8217;m sure there&#8217;s a lot of SJ-positive material in modern U.S. army reading lists, and that there is much more to come. You&#8217;re getting women &#8220;Marines&#8221; now and NYT is slobbering all over it.<br />\nScott #117: My handle is a reference to Voltaire only <a href=\"https://candide3.wordpress.com/2012/02/15/4/\" rel=\"nofollow\">through the Strugacki brothers</a>, Soviet Jewish scientists and fiction writers of some fame in older Soviet intelligentsia circles. I don&#8217;t have a problem with Jews per se. I might have gotten carried away a bit mentioning <i>tikkun olam</i> when there&#8217;s a perfectly good Puritan tradition of the shining city on the hill (New England rules and saves!), but I do bristle when e.g. your co-ethnic B tells me that Ukrainians must not be allowed to venerate Khmelnitsky because he was the general in a war when many Jews were massacred <i>inter alia</i>. There is an equestrian statue of him in the center of Kiev &#8212; should they remove it?<br />\nScott #121: if you mention that Hegel&#8217;s philosophy led to Nazism, you ought in fairness to mention that it also led directly to Marxism-Leninism. Do you know what were the three sources of Marxism-Leninism according to official doctrine of CPSU? German classical philosophy (meaning Hegel), English political economy and French utopian socialism (Fourier). Nazism&#8217;s connections to Hegel are rather more tenuous, owing more to his earlier contemporaries such as Herder. Nazism was never very intellectual.</p>\n]]>", "author": "Candide III", "published": "2017-06-01 11:00:54+00:00", "title": "By: Candide III"}, {"content": "<![CDATA[<p>As a supplement to the above country-culture list (<a href=\"#comment-1736263\" rel=\"nofollow\"><i>circa</i> #132</a>), please allow me to commend also J. D. Vance&#8217;s generally praised, and not-uncommonly damned&nbsp;&mdash; <a href=\"http://www.goodreads.com/book/show/27161156-hillbilly-elegy\" rel=\"nofollow\">with ten thousand GoodReads reviews  to date</a>&nbsp;&mdash; <i>Hillbilly Elegy: A Memoir of a Family and Culture in Crisis</i> (2016).</p>\n<p>More generally, please let me observe too, that the discussion here on <i>Shtetl Optimized</i> amply illustrates a crucial feature of culture-war debates: the&nbsp;most vociferous culture-war participants read&nbsp;lamentably narrowly.</p>\n<p>This too-common anti-literacy trait is what makes <i>Existential Comics</i> #195, “<a href=\"http://existentialcomics.com/comic/185\" rel=\"nofollow\">Philosophy News Network: Derrida Arrested</a>“ so&nbsp;forcefully funny.</p>\n<p>With a view toward encouraging broader reading habits among <i>Shtetl Optimized</i> readers, over the next day or so, I&#8217;ll pull together a (multi-linked) reading list, with a view toward demonstrating the shared trait of suppressive wasp-swarming outrage&nbsp;&mdash; per the wasp-swarming story of <a href=\"#comment-1736123\" rel=\"nofollow\">comment <i>circa</i> #24</a>&nbsp;&mdash; that nowadays comes equally from the outraged (yet too-often non-reading) ideological left, the outraged (alas mostly non-reading) alt.Right, and even from outraged (yet again, notably non-reading) rationalists.</p>\n<p>Hoorah for broad-ranging, fearsomely Enlightening literacy!&nbsp;🙂</p>\n]]>", "author": "John Sidles", "published": "2017-06-01 13:00:33+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Candide #134: I can&#8217;t remember the last time I saw someone actually wear a Che t-shirt, but maybe I just don&#8217;t hang out with the right (wrong) people.</p>\n<p>Yes, Marx drew on Hegel (though I suspect that, had there been some fashionable obscurantist German philosopher saying the opposite of what Hegel said, Marx could equally well have drawn on that guy).  But I&#8217;m averse to blaming people for others&#8217; misapplications of their theories: for example, people constantly try to say that there&#8217;s something bad about Darwinism, or about Darwin himself (who from what I can tell was an exemplary human being), because of the later Nazi perversion of Darwinian ideas.</p>\n<p>So, particularly given the lack of a clear distinction between &#8220;is&#8221; and &#8220;ought&#8221; in this sort of philosophy, it&#8217;s enough for me that Hegel himself reached political conclusions (e.g. about the perfection of the 19th-century Prussian state) that we can clearly see are laughable.</p>\n<p>Regarding the US&#8217;s wars being fought for &#8220;tikkun olam,&#8221; the issue isn&#8217;t just getting carried away but factual inaccuracy.  Thus, to take one prominent recent example, Jews <a href=\"http://www.gallup.com/poll/26677/among-religious-groups-jewish-americans-most-strongly-oppose-war.aspx\" rel=\"nofollow\">apparently</a> opposed the Iraq war at a higher rate than any other major religious group in the US, not so surprising given their liberal Democratic leanings.</p>\n]]>", "author": "Scott", "published": "2017-06-01 13:13:17+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>How much of the racial arguments (e.g. whites are the superior race) behind slavery during the civil war started as a justification for free labor as a tool for the economy? (of course once the &#8220;theory&#8221; is out there, it takes a life of its own).</p>\n<p>Even Thomas Jefferson was a slave owner, right? And it&#8217;s not like America (the West) started importing slaves by principle to demonstrate their superiority over other races.</p>\n<p>Today, slavery is gone, but a big portion of the economy still relies on really low cost labor (i.e. illegal immigrants). </p>\n<p>In contrast, the Nazis&#8217; desire to eradicate other races was at the very core of their philosophy &#8211; even without any use for them as free labor (in war factories) they would still have gone after them.</p>\n]]>", "author": "Bob", "published": "2017-06-01 13:20:30+00:00", "title": "By: Bob"}, {"content": "<![CDATA[<p>There&#8217;s also a quality to statues that makes them obviously way more &#8220;permanent&#8221; and &#8220;in your face&#8221; than what&#8217;s typically protected by &#8220;free speech&#8221;.<br />\nThere are two ways to spread ideas &#8211; through dialog or through force. Statues fall somewhat more in the latter category.</p>\n]]>", "author": "Bob", "published": "2017-06-01 13:29:00+00:00", "title": "By: Bob"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>This post is the perfect example of the &#8220;over compensation&#8221; tendency of today&#8217;s Democratic liberals that I mentioned in the other post. The battle against slavery was fought in the late XIX-the century. Back then, the majority of Democrats were in favor of slavery. The battle against organized racism was fought in the 1960s. Back then, the majority of Democrats were against the 1964 Civil Rights Act. Those battles (and wars) have already been won where it matters in addition to the legal arena: the public perception that any sort of discrimination based on race or ethnicity is profoundly wrong. </p>\n<p>Instead of worrying about statues, I see a bigger battle to worry about the well being of 6, 7, 8, 9 month unborn babies who are slaughtered at the altar of choice every day in America with the support of liberal Democrats. The public has also become increasingly prolife since 1973, mostly because of advances in science and technology, like medical imaging and techniques that can ensure the survival of around one third of babies born 22 weeks after conception and older.</p>\n<p>There is a name for what you are doing here: <a href=\"https://en.wikipedia.org/wiki/Whig_history\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Whig_history</a></p>\n]]>", "author": "TrumpSupporter", "published": "2017-06-01 13:35:20+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>TrumpSupporter #139: If calling the Confederates traitors is Whig history, then saying that Democrats are &#8220;compensating&#8221; for their party&#8217;s past support of slavery is completely ass-backwards history.  People identify deeply with their &#8220;tribes,&#8221; and only more shallowly with political parties that might take up the causes of those tribes for a generation or two.  And whatever other psychological issues modern progressives might have, I can 300% guarantee you that <i>guilt over the Democratic party&#8217;s racist past</i> is not one of them.  With some justice, they simply see their predecessors as whoever the progressives and radicals were in previous generations&#8212;whether they were abolitionists, suffragettes. Republicans, Northern Democrats opposed to southern segregationist Democrats, etc.</p>\n<p>In many cases, we&#8217;re literally talking about the exact same people.  Thus, you might have heard of one Hillary Rodham, who switched from the Republican to the Democratic party in the 1960s over the issue of civil rights.  Meanwhile, of course, millions of southern whites, including Strom Thurmond, switched from the Democratic to the Republican party over the exact same issue, in one of the great political realignments of the 20th century.  Given this well-known history, who do you think should have, or did, feel more remorse over the southern Democrats&#8217; racist past: Hillary, or Strom?  (Strom, to his credit, did express some remorse late in his life.)</p>\n]]>", "author": "Scott", "published": "2017-06-01 15:27:46+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>As Scott may have impishly intended, <a href=\"https://en.wikipedia.org/wiki/Essie_Mae_Washington-Williams\" rel=\"nofollow\">the story of Essie Mae Washington-Williams</a>&nbsp;&mdash; who was Strom Thurmond&#8217;s biological daughter&nbsp;&mdash; as told in Washington-Williams autobiography <a href=\"http://www.goodreads.com/book/show/709715.Dear_Senator\" rel=\"nofollow\"><i>Dear&nbsp;Senator: A Memoir by the Daughter of Strom Thurmond</i></a> (2006), ranks as a paradigmatic chapter in American history. </p>\n<p>As one GoodReads reviewer noted:</p>\n<blockquote><p>The book taught me not to make assumptions, that the truth is more complex. And the truth was almost sadder and more amazing than my preconceptions.</p></blockquote>\n<p>Here we have an informed contextualization, that is worthy of reflection for every <i>Shtetl Optimized</i> commenter.</p>\n]]>", "author": "John Sidles", "published": "2017-06-01 16:42:11+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Scott #140,</p>\n<p>It says a lot about your way of thinking about these issues when your example of political virtue is Hillary Clinton. Hillary Clinton&#8217;s political affiliations throughout her life show statism at its worst, namely, the very reason people is cynic about career politicians. Hillary Clinton allegedly switched parties in 1968, when she was 21. Most people don&#8217;t become politically aware until they are in their late 20s and early 30s. </p>\n<p>Hillary Clinton has only had one political interest in her life: herself. Her political positions have only changed as she saw fit to advance her political career. Thus, she was against gay marriage in 1996 when DOMA was passed and it had overwhelming support, just as she was for the war in Iraq in the aftermath of 9/11 when the nation went through a period of extreme fear. Later, she turned against the war in Iraq and traditional marriage, and in this order, when both became unpopular positions. She is now back in the public eye blaming everybody for losing the 2016 election except herself.</p>\n<p>Here is a different take by Dinesh D&#8217;Souza <a href=\"https://www.youtube.com/watch?v=ol7OMGBDMao\" rel=\"nofollow\">https://www.youtube.com/watch?v=ol7OMGBDMao</a> . I hope you can engage his arguments on the merits, rather than issuing ad-hominem epithets. Basically, his argument is that the South began to move Republican as racism in the South began to become less popular. It might be an instance of correlation doesn&#8217;t imply causation but is hard to argue with the hard data: the less racist the South became -as measured by rigorous opinion polls-, the more Republican it became.</p>\n<p>Finally, I am still asking the same question: what is the progressive/statist take on the constitutional rights of 6, 7, 8, 9 month unborn babies? Let me add some extra info here. The New England Journal of Medicine study I mentioned shows that more than 20% of babies born after 22 weeks (that&#8217;s below the second trimester mark) make it with the appropriate medical care. The survival rate for people diagnosed with pancreatic cancer is 14%.</p>\n<p>My 2017 pressing question is: why should we spend any money treating people diagnosed with pancreatic cancer if we say that 6 month old unborn babies, whose survival prospects outside their mothers&#8217; wombs are higher than the aforementioned cancer patients, have no constitutional rights whatsoever. This is the 2017 moral conundrum I am interested in hearing progressives about, not about their over-compensating efforts on the issue of race.</p>\n]]>", "author": "TrumpSupporter", "published": "2017-06-01 17:22:43+00:00", "title": "By: TrumpSupporter"}, {"content": "<![CDATA[<p>#103 I guess I don&#8217;t see why there are so many strong emotional reactions around the taking down of these statues because I&#8217;ve never cared much about statues themselves, more about the message they send. If people legitimately feel that that it&#8217;s important to have a nice statue in their main square, perhaps the one built by their grandfather, I can see why they might be upset by it&#8217;s removal.</p>\n<p>As a thought experiment to separate these individuals from the rest, why don&#8217;t we put up plaques prominently next to each statue saying, e.g., &#8220;Jefferson Davis: slave owner, traitor, and failed​ leader of a country founded for racist reasons and on racist principles&#8221;, and see who is still upset.</p>\n]]>", "author": "Kavi Gupta", "published": "2017-06-01 18:22:43+00:00", "title": "By: Kavi Gupta"}, {"content": "<![CDATA[<p>Scott #136:</p>\n<blockquote><p>I can’t remember the last time I saw someone actually wear a Che t-shirt, but maybe I just don’t hang out with the right (wrong) people.</p></blockquote>\n<p>Maybe, but they&#8217;re not a proscribed item by any means. If I came to your campus in a Che t-shirt nobody would bat an eye.</p>\n<blockquote><p>But I’m averse to blaming people for others’ misapplications of their theories</p></blockquote>\n<p>In that case you oughtn&#8217;t have mentioned Nazism in #121. As for my opinion of Hegel, I follow Schopenhauer&#8217;s, so, not a fan.</p>\n<blockquote><p>because of the later Nazi perversion of Darwinian ideas</p></blockquote>\n<p>There you go about Nazis again. There are more things in heaven and earth than Nazis. Check out what e.g. Margaret Stanger had thought on the matter. What you call &#8220;perversion of Darwin&#8217;s ideas&#8221; was extremely <a href=\"http://www.eugenicsarchive.org/eugenics/topics_fs.pl?theme=8\" rel=\"nofollow\">popular</a> and fashionable in the whole civilized world, including Japan, from the turn of the XX century to around the beginning of WWII &#8212; the modern usage of &#8220;fit&#8221; is a leftover from those times. </p>\n<blockquote><p>Regarding the US’s wars being fought for “tikkun olam,” the issue isn’t just getting carried away but factual inaccuracy.</p></blockquote>\n<p>Exactly why I said that I got carried away. This isn&#8217;t a scholarly discussion. But do you really think the progressive enterprise would be better off without a club to wield, or threaten to, on the recalcitrants?</p>\n]]>", "author": "Candide III", "published": "2017-06-01 18:23:49+00:00", "title": "By: Candide III"}, {"content": "<![CDATA[<p>#142 I don&#8217;t think that this thread is the right place to litigate the issue of abortion, which to many people, including me, is a complex issue. However, the short (and necessarily oversimplified) progressive case: (1) fetuses aren&#8217;t considered full people for the purposes of all constitutional rights, (2) the principle of bodily autonomy applies: if someone else&#8217;s life depended on being physically connected to you, you would have the right to disconnect yourself from them; this same principle is applied even after death to allow individuals not to be organ donors. Some more extreme than myself would say that anti-abortion activists thus treat pregnant individuals as having fewer rights than the dead (I think the situation is more complicated for a variety of reasons).</p>\n<p>Frankly, I don&#8217;t know what the statist response would be. Most liberals I know are civil libertarians. To speculate, statists don&#8217;t necessarily believe in bodily autonomy, so I suppose they might be more anti-abortion.</p>\n<p>Also, you are right on the mark with correlation-doesnt-imply-causation and the Republican South. If you look at *any* data regarding race and party membership or racist attitudes by county vs Trump vote, you will see that your impression of the Democratic Party as racist is frankly absurd.</p>\n<p>Finally, I don&#8217;t think that Scott probably mentioned Clinton just to trigger you, given your handle :-). Substitute &#8220;City liberals&#8221; or &#8220;Minorities&#8221; into that sentence for more or less the same message.</p>\n]]>", "author": "Kavi Gupta", "published": "2017-06-01 18:35:48+00:00", "title": "By: Kavi Gupta"}, {"content": "<![CDATA[<p>TrumpSupporter #142: I answered your claim about progressives opposing Confederate statues merely as a way to &#8220;overcompensate&#8221; for the past racism of the Democratic party.  Then, rather than addressing my argument, you changed the subject to unrelated things that you don&#8217;t like about Hillary Clinton, as well as the <i>completely</i> unrelated topic of late-term abortions.  I don&#8217;t know why you&#8217;re so unrelentingly focused on that: the law already allows late-term abortions only in situations of extreme medical need, and in any case, you&#8217;ve made it clear that you oppose <i>all</i> abortions, not just late-term ones.  But more importantly, this tendency to lash out and change the subject when cornered in argument&#8212;reminiscent of Sean Spicer and the other Trump collaborationists&#8212;shows extreme argumentative bad faith, and makes debating you <i>no longer of enough interest to be worth the time</i> (if it ever was).  So thanks for having participated here, and as Trump said to Comey, I wish you well in your future endeavors.</p>\n]]>", "author": "Scott", "published": "2017-06-01 18:38:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Great article. I&#8217;m a fellow new Southerner, and I really hope that my town (liberal Decatur, GA!) takes down or modifies its obelisk honoring the Confederacy.</p>\n<p>The one sentence I disagreed with:<br />\n&#8220;And today, incredibly, fascism and white nationalism are greater threats here in the US than they are in Germany.&#8221;<br />\nI get where you&#8217;re coming from with this, but I think that things are even worse in Germany. None of the groups in the US that are as extreme as AfD have anywhere near as much of a following.</p>\n]]>", "author": "D", "published": "2017-06-01 19:33:46+00:00", "title": "By: D"}]