[{"content": "<![CDATA[<p>Slight counter argument to expecting movies to not grow significantly in size by the time petabyte drives come around - most HD movies today are 1080p@23FPS, weighing in at 0.5-1.0 GB per half hour of content. I would expect that movies will instead be 8k UHD @ 90 FPS and 3D (if it&#8217;s not a fad, halve the following numbers otherwise); weighing in at a much heftier 50-100 GB per half hour of content, supposing we can get a laser disc or replacement format that can hold half a terabyte of video data and stream it at a high enough rate to be usable. Or maybe we&#8217;ll see companies ship movies on dedicated disk drives. That&#8217;d be a sight.</p>\n<p>Do keep in mind however, that such a movie would only be 250-500 Mb/s, easily fitting into even today&#8217;s high-end Gigabit internet connections. As your other readers pointed out before me - data will always expand to fit the available space.</p>\n]]>", "author": "skyboy", "published": "2016-03-28 06:51:50+00:00", "title": "By: skyboy"}, {"content": "<![CDATA[<p>An additional note about virtual reality: such applications generally emphasize interactivity, which raises the ratio between data stored and information viewed. Just having a choice of which room in a virtual building to walk into means that the storage requirements are much higher than panoramic streaming video. Throw in interactive and time-based events, and detailed replication of one building can easily exceed the petabyte range. I take the pessimistic view that this will never occur, and virtual reality will mainly be limited to simple scenes without high data and bandwidth requirements.</p>\n]]>", "author": "kktkkr", "published": "2016-03-28 10:42:05+00:00", "title": "By: kktkkr"}, {"content": "<![CDATA[<p>The problems of VR in terms of storage and streaming etc. are exactly the same as for an computer game viewed on a 2D monitor.<br />\n(Rendering and displaying two somewhat separate images, and doing so fast enough to make a smooth experience does require a faster CPU and graphics card compared to displaying the same image on a monitor, but only about as much as the difference in spec between what&#8217;s required to run this years games compared to one from a few years ago. Roughly.)<br />\nFundamentally, there&#8217;s not any difference between a VR scene, and a first person computer game when it comes to the amount of saved data that needs to be loaded and streamed.<br />\nSo, if we want to know how VR will change storage requirements we can just look at how the requirements of computer gaming have changed over time.</p>\n]]>", "author": "phuzz", "published": "2016-03-28 11:42:13+00:00", "title": "By: phuzz"}, {"content": "<![CDATA[<p>It&#8217;s hard to fill a petabyte (million GB) hard drive with downloads if the best ISP offering service where you live limits your household to 300 GB (Comcast) or, worse, 10 GB (Exede) per month.</p>\n]]>", "author": "Pino", "published": "2016-03-28 13:46:45+00:00", "title": "By: Pino"}, {"content": "<![CDATA[<p>One reason to have an abstraction of a &#8220;file&#8221; is that &#8220;save&#8221; provides a point to which the user can &#8220;revert&#8221;. The Apple Newton PDA had automatic saving for everything, and I ended up losing data because I accidentally made an unwanted deletion. Ideally, revision history would allow playback of the creation of a file from start to finish, but even then &#8220;save&#8221; provides important things, such as a set of timestamped revisions deemed &#8220;important&#8221;, as well as a way to export the latest revision without the threat of disclosure of embarrassing earlier revisions.</p>\n]]>", "author": "Pino", "published": "2016-03-28 13:51:06+00:00", "title": "By: Pino"}, {"content": "<![CDATA[<p>I shoot video and stills and capture long-term multi-camera timelapse in an industrial setting. My storage budget for a day video job is 200Gb; the source files alone from my timelapse cameras are the same figure, per month, and I have had as many as eight cameras running at the same time. Still photography storage demands are a trivial few tens of Gb per shoot. There&#8217;s a nice new 50Tb storage array whirring away in my office, and a clone in a server room, and they will need to be upgraded soon.</p>\n<p>So, some of us would *kill* for Pb drives!</p>\n]]>", "author": "Bob Shaw", "published": "2016-03-28 14:27:35+00:00", "title": "By: Bob Shaw"}, {"content": "<![CDATA[<p>Not hard if you generate your own data!</p>\n]]>", "author": "Bob Shaw", "published": "2016-03-28 14:28:45+00:00", "title": "By: Bob Shaw"}, {"content": "<![CDATA[<p>Some of your concern about the boundary between permanent and temporary memory is exacerbated by the appearance of Intel&#8217;s 3D XPoint memory that is both dense and fast.  It&#8217;s also expensive, but maybe that will be solved with time.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Light:John.html\">John Light</a>", "published": "2016-03-28 18:11:24+00:00", "title": "By: John Light"}, {"content": "<![CDATA[<p>It&#8217;s interesting to look at a few other things.  We went smoothly from 4 bits to 32, but the transition to 64 bits took a loooooong time, and there is no evidence that anyone even wants 128-bit bus widths, pointer sizes, and fixed-width integers or floats.  Similarly, neither 8-bit nor 16-bit character encodings are sufficient, but we aren&#8217;t going to surpass the Unicode range of 0 to 0x10FFFF unless we join the Galactic Empire or go insane with emoji — there just aren&#8217;t that many distinct character repertoires out there.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cowan:John.html\">John Cowan</a>", "published": "2016-03-28 19:25:02+00:00", "title": "By: John Cowan"}, {"content": "<![CDATA[<p>The reason we don&#8217;t have petabyte HDDs is simply the the industry has run out of physics. The superparamagnetic limit finally caught up with available materials.</p>\n<p>FYI, I believe that your reality line is actually much worse than depicted as, IIRC, there was a stagnant areal density period. </p>\n<p>Both SMR and TDMR have and will help but they are limited and more or less one time upgrades. There are still a lot of problems with HAMR as evidenced by Seagate&#8217;s production delays.</p>\n]]>", "author": "Demagnetized Magnetician", "published": "2016-03-28 21:21:21+00:00", "title": "By: Demagnetized Magnetician"}, {"content": "<![CDATA[<blockquote><p>Why, after all, do we still distinguish between “memory” and “storage” in computer systems? Why do we have to open and save files, launch and shut down applications? Why can’t all of our documents and programs just be everpresent and always at the ready?</p></blockquote>\n<p>This is already the way it works on smartphones. There&#8217;s no difference between &#8220;launching&#8221; or &#8220;showing&#8221; an app, and in many cases you can only hide apps but the OS decides when they will be terminated. And many apps will automatically save anything you enter (or maybe they will just keep it in RAM but this is mostly fine since they keep running in the background).</p>\n<p>So differences RAM and long-term storage are pretty much hidden from the user. In fact, even differences between local long-term storage and cloud-based long-term storage are increasingly hidden away through automatic synchronization.</p>\n]]>", "author": "oliver", "published": "2016-03-28 21:42:10+00:00", "title": "By: oliver"}, {"content": "<![CDATA[<p>I can say that, many companies nowadays trying to decrease speed of technological innovations for private persons in order to make more and more money on us. This one of the reasons why there is no petabytes drives. All their new technologies are targeting business to business clients that&#8217;s why it is not cheap. Is someone here agree with me and my statements?</p>\n]]>", "author": "RUSLAN KHUSNUTDINOV", "published": "2016-03-28 21:48:00+00:00", "title": "By: RUSLAN KHUSNUTDINOV"}, {"content": "<![CDATA[<p>I like the article, the problem with your extrapolation is assuming that the growth would continue in a linear fashion. The growth wasn&#8217;t linear from the beginning. At best the curve appears to be more logarithmic or&#8221;S&#8221; shaped. One would expect that due to natural constraints such as physics that the growth would start tapering off and eventually reach a maximum.<br />\n     I remember thinking my commodore with 128k of RAM and a 5.5inch floppy had plenty of storage. Look at how quickly that changed. The needs (and convenience) of faster storage and larger amounts will continue to drive growth in a variety of areas. I don&#8217;t foresee physical disks disappearing any faster than fossil fuel vehicles. Form factors may change. It may make more sense to make larger disks with larger/faster buses for data center usage. Ultimately, like most things in life, the evolution of storage will be cost driven.</p>\n]]>", "author": "Jeremy", "published": "2016-03-30 18:55:12+00:00", "title": "By: Jeremy"}, {"content": "<![CDATA[<p>The difference between storage and ram is that storage preserves data over a reboot and RAM will not.  That has not changed so the distinction should not either. </p>\n<p>Also.  RAM will not wear out and NAID has a limited number of write cycles.   You would not want to be writing excessively to it and your .   </p>\n<p>Also their is a difference between a program running in ram and being in ram. Don&#8217;t believe me? Go find a linux live CD like gparted. </p>\n<p>Since they are in RAM applications load much quicker but you can still start and stop them.<br />\nIn the case of the LIVE cd, a &#8220;disk&#8221; is created in RAM and then read from.  Not all liveCD work that way some keep some in RAM and some on the disk until accessed. </p>\n<p>This leads me to my final point.  The user experience of the the HDD / RAM analogy   and the workings of the underlying technology are unrelated by design and entirely independent of  one another.</p>\n]]>", "author": "Andrew", "published": "2016-03-31 02:51:51+00:00", "title": "By: Andrew"}, {"content": "<![CDATA[<p>No, the industry did not run out of physics but before the peta hard drive, it&#8217;s going to be peta DVD. 1,000 of today&#8217;s 1TB HD on one single disk. All your existing movies, pictures, music and documents, that you can easily and cheaply duplicate for back-up&#8230; and distibute ! </p>\n<p>I can foresee street peddlers haggling you on street corners : Hey wanna buy all the books every written, and all the music ever recorded for 10$ ?? Effective piracy will be able to reach every non-technical mom and pop and everyone in lands where bandwidth is not available.  Porn will die, music industry maybe, and you&#8217;ll have the whole library of congress on a single disk with plenty room to spare. :-)</p>\n<p><a href=\"http://gizmodo.com/researchers-have-found-a-way-to-cram-1-000-terabytes-on-531549229\" rel=\"nofollow\">http://gizmodo.com/researchers-have-found-a-way-to-cram-1-000-terabytes-on-531549229</a></p>\n<p>Oh, and for 4K, 1TB discs are on the way<br />\n<a href=\"http://www.extremetech.com/gaming/178166-1tb-per-disc-sony-and-panasonic-team-up-on-next-gen-blu-ray\" rel=\"nofollow\">http://www.extremetech.com/gaming/178166-1tb-per-disc-sony-and-panasonic-team-up-on-next-gen-blu-ray</a></p>\n]]>", "author": "Frederick", "published": "2016-03-31 18:56:28+00:00", "title": "By: Frederick"}]