[{"content": "<![CDATA[<p>Alexander #51: Luke explicitly implements a &#8220;copy&#8221; gate&#8212;see page 11 of his paper, under the heading &#8220;Deflection.&#8221;</p>\n]]>", "author": "Scott", "published": "2014-06-30 15:19:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #54, O&#8217;K indeed (BTW, I would recommend MCell program I have used to check, it is working directly with Margolus neighborhood, yet Golly may be more convenient for huge patterns).<br />\nThere is also questions with synchronizations almost not discussed in the paper. E.g., I know an example of CA that may not be universal just because exchange of signals needs for odd number of steps, but interaction even.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/v/Vlasov:Alexander.html\">Alexander Vlasov</a>", "published": "2014-06-30 15:47:49+00:00", "title": "By: Alexander Vlasov"}, {"content": "<![CDATA[<p>Alexander #55: You can email Luke (or wait for him to check this thread again) if you have detailed questions&#8212;but the fact that he <i>actually implemented</i> the construction in Golly, and it works, is strong evidence that he sufficiently thought through the synchronization issues. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n]]>", "author": "Scott", "published": "2014-06-30 15:55:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #56, Sorry, I am asking because result is important, but there are only a few examples, e.g. I would like to see operation on small set of small patterns, e.g. 4&#215;4.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/v/Vlasov:Alexander.html\">Alexander Vlasov</a>", "published": "2014-06-30 16:02:35+00:00", "title": "By: Alexander Vlasov"}, {"content": "<![CDATA[<p>Itai Bar-Natan #39</p>\n<p>I like these ideas. </p>\n<p>1. I hadn&#8217;t considered this approach. You could certainly redirect the particles to space them out, and it is trivial to redirect the particles in a single cell so they won&#8217;t interact (put them on slightly different diagonals so they miss, or point all of them northeast). But it will be tricky (but not necessarily impossible) to do both at the same time. That is, I worry that the extra particles in each macrocell will interfere with each other, or the input. </p>\n<p>2. This is certainly plausible. I can imagine a CA with mirrors which deflect incoming particles from one direction, but collapse if hit from any other direction. So the mirrors can be used to keep particles from escaping, but can always be disassembled if they&#8217;re in the input. Or you could have a mirror which absorbs the incoming heat particle and radiates it back after a couple timesteps, but is destroyed if it is hit by another heat particle before it can radiate the first one. The price you pay for walls like this is that extracting the input bits is more difficult.</p>\n]]>", "author": "Luke", "published": "2014-06-30 17:49:38+00:00", "title": "By: Luke"}, {"content": "<![CDATA[<p>Alexander #55</p>\n<p>In the absence of other particles and signals, you can redirect a signal anywhere you like given enough time. In the Margolus neighbourhood version of this CA, for any position (x,y) there exists a time t0 such that you can redirect the signal to position (x,y) in any time t >= t0. The idea is to use deflections to do the actual work of getting the signal into position, then waste as much time as you like with a pair of reflections. You should try to convince yourself of this fact.</p>\n<p>If there is some kind of parity issue, and a particle arrives at a position on an odd timestep instead of an even timestep, then we can stall (using the argument above) for an extra timestep to fix the problem. </p>\n<p>That said, I did run into a parity issue in the last step of my construction, taking a signal from the column of output bits to its final destination in the output region. I could have added more reflection/deflection operations to fix this, but I decided to manipulate the output bits instead. The output signals are not actually consecutive, but spaced out so that each one has the right parity. </p>\n<p>You can see where I add spaces at the top left of the &#8220;computation triangle&#8221;. The line of particles there correspond to places where I took the &#8220;NOR&#8221; of a single bit, known to be 1, to create a 0 output bit. This is not the most efficient way to space out the output bits, but it was the easiest at the time.</p>\n<p>I used to use MCell, but I had some trouble getting it to run on Windows 8, and it doesn&#8217;t seem to be actively maintained (most recent version is Sept 2001?). I also doubt it could match Golly&#8217;s speed, which matters for large patterns.</p>\n]]>", "author": "Luke", "published": "2014-06-30 18:59:29+00:00", "title": "By: Luke"}, {"content": "<![CDATA[<p>Liron #41</p>\n<p>The number of distinguishable configurations (and similarly the number of possible output configurations) of an n*n region is going to be exponentially smaller than 2^(n^2). </p>\n<p>For instance, we cannot distinguish between an empty 3&#215;3 block and a 3&#215;3 block with one live cell in the middle, since both blocks become empty after one timestep. In other words, there are at most 2^9-1=511 distinguishable configurations of a 3&#215;3 block. If we divide the entire region into 3&#215;3 blocks, then there are n^2/9 blocks and hence at most 511^(n^2/9)=1.9996^(n^2) distinguishable configurations of the entire region.</p>\n<p>On the other hand, there is probably some way to pack Omega(n^2) bits into an n*n square in the Game of Life, such that we can perform an arbitrary transformation on those bits.</p>\n<p>You might be able to define the number of &#8220;arbitrarily manipulable bits&#8221; you can pack into an n*n region. By the arguments above, this should be less than log_2(1.9996) n^2, but at least Omega(n^2). Presumably the number of bits is asymptotically cn^2 + o(n^2), but the constant c would be hopelessly difficult to estimate, possibly even uncomputable.</p>\n]]>", "author": "Luke", "published": "2014-06-30 20:10:41+00:00", "title": "By: Luke"}, {"content": "<![CDATA[<p>Luke #59, Thank your for reply.<br />\nI am mainly troubling currently about step 3 in Scott&#8217;s classification, i.e. it is not obvious for me that CA is universal. An example of problem: if row of cells has no distance between cells, then exchange occupies one step, but any delay for synchronization must be even. So it is better to use row with even distances between cells. On the other hand I found problematic to reorder n x n square into such a row.<br />\nPS. I also got problem with MCell with Windows 7, but it was resolved using compatibility with Windows XP mode.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/v/Vlasov:Alexander.html\">Alexander Vlasov</a>", "published": "2014-07-01 10:48:32+00:00", "title": "By: Alexander Vlasov"}, {"content": "<![CDATA[<p>Luke #59</p>\n<blockquote><p>\nIf there is some kind of parity issue, and a particle arrives at a position on an odd timestep instead of an even timestep, then we can stall (using the argument above) for an extra timestep to fix the problem.\n</p></blockquote>\n<p>I would like to see any example of introduction extra timestep (or, in general, odd number of time steps). I myself failing to do that with MCell and Golly implementation hiding all too much, e.g. in your example all cells in 5&#215;5 square have even positions with spaces between them.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/v/Vlasov:Alexander.html\">Alexander Vlasov</a>", "published": "2014-07-01 12:41:12+00:00", "title": "By: Alexander Vlasov"}, {"content": "<![CDATA[<p>PS. I guess, we are considering different tasks &#8211; I mentioned situation when all cells of region may be used, not only quarter of them with both coordinates are even.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/v/Vlasov:Alexander.html\">Alexander Vlasov</a>", "published": "2014-07-01 12:58:50+00:00", "title": "By: Alexander Vlasov"}, {"content": "<![CDATA[<p>Is/Are there algebraic way/s to think about/study CA?</p>\n]]>", "author": "J", "published": "2014-07-02 06:44:12+00:00", "title": "By: J"}, {"content": "<![CDATA[<p>Alexander #59</p>\n<p>I think you may be confused about the &#8220;sparse&#8221; Golly implementation, in which cells are empty unless both coordinates have the same parity as the timestep. I describe it as a performance optimization (compared to the dense representation) on the webpage, but you can also look at it as a simulation of the Margolus neighbourhood CA. </p>\n<p>Take the Margolus neighbourhood and &#8220;collapse&#8221; each 2&#215;2 block into the top left corner. That cell will have 16 states corresponding to the 16 configurations of the block. Only cells with both coordinates even (top left corners) are nonempty. In the next timestep, the blocks shift, so the top left corner of each block has odd coordinates. Take a look at<br />\n<a href=\"http://web.mit.edu/lrs/www/physCA/sparseexample.png\" rel=\"nofollow\">http://web.mit.edu/lrs/www/physCA/sparseexample.png</a> and <a href=\"http://web.mit.edu/lrs/www/physCA/binarycoloured.png\" rel=\"nofollow\">http://web.mit.edu/lrs/www/physCA/binarycoloured.png</a> to see the relationship between the sparse representation and the Margolus representation.</p>\n<p>I&#8217;m not sure where you get the idea that exchanging signals necessarily takes an odd number of timesteps. Here&#8217;s an example: <a href=\"http://web.mit.edu/lrs/www/physCA/exchange.mc\" rel=\"nofollow\">http://web.mit.edu/lrs/www/physCA/exchange.mc</a><br />\nThe gray cells should be initially empty, or contain a particle moving northeast (for simplicity, we forbid the other 14 possible states). Then the configuration above will swap the contents of the gray cells in 16 steps.</p>\n]]>", "author": "Luke", "published": "2014-07-02 18:29:03+00:00", "title": "By: Luke"}, {"content": "<![CDATA[<p>J #64</p>\n<p>I&#8217;m not an expert, but here are some mathematical results I&#8217;ve come across.</p>\n<p>1. I would say the Curtis-Hedlund-Lyndon theorem (<a href=\"http://en.wikipedia.org/wiki/Curtis%E2%80%93Hedlund%E2%80%93Lyndon_theorem\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Curtis%E2%80%93Hedlund%E2%80%93Lyndon_theorem</a>) is an algebraic statement about cellular automata.<br />\n2. &#8220;Linear cellular automata&#8221; are cellular automata where the states are vectors in some finite vector space, and the update rule is a linear map. There are a lot of papers on LCAs. For instance, here is a characterization of the &#8220;columns&#8221; (i.e., the history of a single cell) in a 1 dimensional LCA. <a href=\"http://thales.math.uqam.ca/~rowland/papers/A_characterization_of_p-automatic_sequences_as_columns_of_linear_cellular_automata.pdf\" rel=\"nofollow\">http://thales.math.uqam.ca/~rowland/papers/A_characterization_of_p-automatic_sequences_as_columns_of_linear_cellular_automata.pdf</a><br />\n3. Evaluating a cellular automaton is comonadic. <a href=\"http://blog.sigfpe.com/2006/12/evaluating-cellular-automata-is.html\" rel=\"nofollow\">http://blog.sigfpe.com/2006/12/evaluating-cellular-automata-is.html</a></p>\n]]>", "author": "Luke", "published": "2014-07-02 19:06:50+00:00", "title": "By: Luke"}, {"content": "<![CDATA[<p>I&#8217;m missing something&#8230;can someone please explain what Luke&#8217;s construction or physically universal CAs have to do with physics?  Are analogies trying to be made between the arbitrary region of interest to the universe and the complement of this region to a view from outside the universe (whatever that means) and Luke&#8217;s CA rules to the &#8220;laws&#8221; of physics?  Has luke created a &#8220;toy universe&#8221;?  Does quantum mechanics have to be able to perform any transformation to a given region of the universe from outside that region?  Confused.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/O:Matthew.html\">Matthew O</a>", "published": "2014-07-02 19:55:22+00:00", "title": "By: Matthew O"}, {"content": "<![CDATA[<p>Matthew #67: CAs are <i>precisely</i> &#8220;toy universes&#8221;&#8212;that is, models that capture some aspects of the laws of physics, though obviously not other aspects.  Their simplicity and discreteness makes them very convenient if one wants to study things like computational universality, the rise and fall of complex behavior, or other phenomena that aren&#8217;t necessarily specific to &#8220;our&#8221; physical laws.</p>\n<p>Luke&#8217;s CA, in particular, captures the following aspects of the real laws of physics:</p>\n<p>- Spatial locality<br />\n- Reversibility<br />\n- A finite &#8220;speed of light&#8221;<br />\n- Translational symmetry<br />\n- Rotational symmetry (albeit only fourfold)<br />\n- Particles that propagate across space at a constant velocity, unless perhaps they collide with other particles<br />\n- Conservation of &#8220;energy&#8221;</p>\n<p>Meanwhile, his CA fails to capture the following aspects of real physics, among others:</p>\n<p>- Galilean and Lorentz symmetry<br />\n- Quantum mechanics<br />\n- The existence of gravity (or any other gauge force)<br />\n- General relativity (i.e., spacetime being dynamical)<br />\n- Conservation of &#8220;momentum&#8221;<br />\n- A meaningful notion of angular momentum<br />\n- The number of spatial dimensions (it&#8217;s 2 rather than 3)</p>\n<p>Now, the purpose of Luke&#8217;s construction is to prove the conceptual point that it&#8217;s possible to have laws of physics that implement &#8220;physical universality,&#8221; in the sense of the ability to implement any mapping between physical states whatsoever within any finite region, by appropriately initializing the state outside of that region.  It&#8217;s <i>possible</i> that &#8220;our&#8221; laws of physics implement (a quantum analogue of) physical universality, but it&#8217;s not obvious; indeed, it&#8217;s not even obvious precisely what one should <i>mean</i> by that.  But I think it would <i>definitely</i> be interesting to know!  And now, at least we know that physical universality holds in <i>some</i> semi-reasonable toy universe, which is more than we knew about the matter before Luke&#8217;s work.</p>\n]]>", "author": "Scott", "published": "2014-07-02 22:13:29+00:00", "title": "By: Scott"}]