[{"content": "<![CDATA[<p>I like Greg&#8217;s parable and it certainly led to interesting discussion. What seem to be missing (at least for me) is what should we take as the &#8220;doctor&#8217;s position&#8221; in the analogy with global warming. Can we consider the IPCC&#8217;s report as the best representative of (most) expert&#8217;s assessments?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2014-11-25 22:15:53+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>The &#8220;proven reserves&#8221; of coal (or oil or natural gas) are in the larger scheme of things an underestimates, for reasons that have to do with what the phrase means.   Proven reserves means reserves that can be extracted with at least 90% probability or efficiency, profitably at current prices.   After that you have probable reserves (conceptually 50%), possible reserves (conceptually 10%), and technically recoverable reserves (recoverable at an economic loss).</p>\n<p>So, if you improve geological mapping, all of the lines can move:  Between provable and probable, probable and possible, etc.   If you improve extraction technology, again, all of the lines can move.  And if simply the price of the fuel goes up, then all of the lines move other than boundary of technically recoverable.   For instance, Canada&#8217;s proven oil reserves skyrocketed when the price of oil passed a certain threshold, because everyone knew that the tar sands are there in Alberta, but merely expensive to excavate.</p>\n<p>Coal is at the moment more than 10 times cheaper than oil in the US, per joule of energy.  It is so cheap and widespread that it is largely a regional resource rather than a global one.  It has a global price spread rather than a global price, because it also costs money to transport it.  Changes in the price of coal largely reflect mining supply vs demand, rather than the geological endowment.  There is a lot less effort to figuring out how to find and extract as much of it as possible, even at a fixed level of quality.  If Wikipedia or similar estimates that we have ~150 years of coal, all that&#8217;s really being said is that there is &#8220;plenty&#8221;.</p>\n<p>If you estimate the total amount of technically recoverable coal in the world, it really could (by my wild guess) be something like 1000 years at the current rate of consumption.   I don&#8217;t know if I would say thousands, plural, but one thousand is already beyond the atmospheric/oceanic capacity.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-11-25 22:25:11+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Gil &#8211; &#8220;Can we consider the IPCC’s report as the best representative of (most) expert’s assessments?&#8221;</p>\n<p>That is the report&#8217;s purpose.   For all I know, it is respectable for that purpose, if surely not perfect.   I have skimmed it and I see many valuable things to learn from it.  And each new IPCC report tends to be more interesting than the last one as knowledge improves.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-11-25 22:27:37+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Gil #75: My understanding is that the IPCC recommendations get watered down by political considerations before they make it from the scientists to the public.  So, in this metaphor, they&#8217;d be like a surgeon general&#8217;s warning that maybe people should smoke less, but whose wording had to be negotiated with Philip Morris and R. J. Reynolds.  It would <i>still</i> be much better to follow the warning than to do what we&#8217;re doing now.</p>\n]]>", "author": "Scott", "published": "2014-11-25 22:32:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott &#8211; &#8220;My understanding is that the IPCC recommendations get watered down by political considerations before they make it from the scientists to the public.&#8221;</p>\n<p>That&#8217;s true, but most of the controversy has been in the &#8220;summary for policymakers&#8221; rather than the full report.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-11-25 22:36:03+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Scott #6:</p>\n<p>> I think it’s unfortunate that people focus so much on the computer climate models, and in retrospect, it seems clear that climate researchers made a mistake when they decided to focus so heavily on them—it was like announcing, “as soon as these models do a poor job at predicting any small-scale, lower-order phenomenon, you’re free to ignore everything we say.”</p>\n<p>Right, that&#8217;s exactly my point, and the parallel is with the way quantum computer capabilities are being overhyped. Once the marketing promises prove false, the credibility disappears, be it inaccurate climate models or no &#8220;computing all answers at once&#8221;.</p>\n<p>I, of course, agree that relying on mother nature to fix our screwups is foolish.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/Nux:Shmi.html\">Shmi Nux</a>", "published": "2014-11-25 23:12:40+00:00", "title": "By: Shmi Nux"}, {"content": "<![CDATA[<p>Scott, you have my support at least in this argument. However I would like to add the economic dimension to this. It is, in my opinion, unlikely that climate change from unmitigated human activity over the next couple of centuries would be catastrophic from the perspective of survival of the human species. But it&#8217;s likely to be very expensive in terms of raw economic cost.</p>\n<p>We have probably hundreds of trillions of dollars of capital and infrastructure that depends on the current climate being what it is, and spending a few trillion, even with a steep discount rate, to delay having to invest in new infrastructure to accommodate a changed climate will likely save us quite a bit of cash&#8230; from massive irrigation projects for existing farm lobbies, to property damage and destruction from rising sea level. This is before you take into account externalities from fossil fuels that aren&#8217;t climate related (air quality health related issues for instance, or heavy metals contamination of water supplies)</p>\n<p>Doing the simplest and cheapest of mitigations are easy; Ban all coal power plants and replace them with nuclear, buttress the grid with HVDC transmission infrastructure would be a top down approach. A carbon tax would be the simplest market based approach, especially since you need to raise tax revenue somehow anyways.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Akin:Dez.html\">Dez Akin</a>", "published": "2014-11-26 00:48:34+00:00", "title": "By: Dez Akin"}, {"content": "<![CDATA[<p>I thought up another version of this parable, which for the most part seems closer; although it does introduce a new few problems:</p>\n<p>Economist: You ought to balance the budget, among other reasons because excessive deficit spending causes recessions.<br />\nSenator: Are you sure? My constituents like it when I spend government money. Plus, it injects money into the economy.<br />\nE: Yes, the science is settled.<br />\n[Actually, I don&#8217;t know if this is true; but never mind&#8230;]<br />\nS: All right, if the science is settled, can you tell me when the recession will start if we continue with the current budget?<br />\nE: No, of course not, it’s not that precise.<br />\nS: Okay, how much excess spending can the economy handle?<br />\nE: I can’t tell you that, although I would recommend no excess spending at all.<br />\nS: Do you know that there will be a recession at all no matter how much we spend?<br />\nE: No, it’s a statistical risk. But overspending also causes inflation.<br />\n[Would our economist really admit this?]<br />\nS: I certainly know some countries with serious inflation problems, but some of them don&#8217;t have significant deficits. Even if we do start having serious problems with inflation, would you really know that it’s because of our overspending?<br />\nE: No, not necessarily; it’s a statistical effect.<br />\nS: If it’s statistical, then you do know that correlation is not causation, right?<br />\nE: Yes, but &#8230;<br />\n[No idea what to put here.]<br />\nS: Some of those countries&#8217; economies subsequently recovered, you already admitted.<br />\nE: Yes, but there is a lot of research to back this up.<br />\nS: Look, I’m not a research scientist, I’m interested in the policies I vote on. You have an extended brief for me with models, computations, graphs, you name it. You can gather more data about the economy if you like. Yet you’re hedging everything you have to say.<br />\nE: Of course, there’s always more to learn about economics. But it’s a settled recommendation that deficit spending is bad for the economy.<br />\nP: It sounds like the science is anything but settled. I’m not interested in hypothetical recommendations. Why don’t you get back to me when you actually know what you’re talking about. In the meantime, I will continue to spend public money, because as I said, my constituents enjoy it.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Standeven:Ben.html\">Ben Standeven</a>", "published": "2014-11-26 02:51:43+00:00", "title": "By: Ben Standeven"}, {"content": "<![CDATA[<p>Scott #74:</p>\n<blockquote><p>&#8220;The trouble is that, as the world runs out of relatively “clean” fossil fuels, it’s entirely possible that, rather than switching to nuclear or solar, we’ll just keep digging up dirtier and dirtier fossil fuels that we previously wouldn’t have even included in the “reserves” count, and will keep doing so even as it becomes more and more dangerous, destructive, and expensive to get it out.&#8221;</p></blockquote>\n<p>Only if you assume the industry is unusually stupid or you are very very pessimistic about the future technology trajectory of solar. </p>\n<p>People are already talking about grid parity of solar right now (though I&#8217;m skeptical we are there yet). The prices of solar panals have halved in the last decade whereas like you say the deeper, more inaccessible coal will get more expensive to mine. I&#8217;m not saying this exponential fall  in SPV will continue for ever but it&#8217;s reasonable to imagine that at some point in the next 150 years solar will be hugely more competitive than digging deeper for coal. </p>\n<p>Why would you imagine the power industry wouldn&#8217;t switch even when there&#8217;s a clear, sustainable, proven cost advantage to switching?</p>\n]]>", "author": "Rahul", "published": "2014-11-26 03:54:07+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul #83:</p>\n<ul>Why would you imagine the power industry wouldn’t switch even when there’s a clear, sustainable, proven cost advantage to switching?</ul>\n<p>Because if the world was rational, then we would&#8217;ve switched already.</p>\n<p>In the US, there&#8217;s now a whole subculture of people who engage in <a href=\"http://www.huffingtonpost.com/2014/07/06/rolling-coal-photos-video_n_5561477.html\" rel=\"nofollow\">&#8220;rolling coal&#8221;</a>: spending thousands of dollars to outfit their cars and trucks with useless smokestacks, just as a way of thumbing their noses at environmentalism.  Likewise, when Reagan became president, he removed solar panels that Jimmy Carter had installed on the White House roof, even though the panels were just sitting there saving money&#8212;solely because he didn&#8217;t like the symbolism.</p>\n<p>Given everything we know about the United States, I find it entirely plausible that we&#8217;ll continue burning fossil fuels, <i>even in a hypothetical future where the alternatives have become indisputably cheaper</i>&#8212;purely as a matter of obstinacy and spite, of inertia and entrenched financial interests, and of people being unable to admit they were wrong.  Consider Sen. James Inhofe (R-OK): do you seriously think he would ever, under any circumstances, install a solar panel&#8212;regardless of how much money he&#8217;d save?  Well, there&#8217;s a third of the country that thinks like him, and that third wields disproportionate power.</p>\n]]>", "author": "Scott", "published": "2014-11-26 04:12:02+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p><i>Economist: You ought to balance the budget, among other reasons because excessive deficit spending causes recessions.</i></p>\n<p>But then that it is a really bone-headed economist.  Many real-life economists have explained why this is simplistic and wrong in many cases.  In fact even outright backwards in many cases, including in actual periods of American and modern European history.</p>\n<p>The presumption of my parable is that the doctor fairly represented the established science of the health consequences of smoking cigarettes.   (Even if that weren&#8217;t true, the patient did nothing to improve matters.)</p>\n<p><i>[Actually, I don’t know if this is true; but never mind…]</i></p>\n<p>It&#8217;s a good thing you said that, except that I don&#8217;t want to not mind.</p>\n<p><i>E: No, it’s a statistical risk. But overspending also causes inflation.  [Would our economist really admit this?]</i></p>\n<p>Actually this is true:  Overspending does cause inflation.  But overspending is not at all the same thing as merely not always balancing the budget.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-11-26 04:50:36+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p><i>Consider Sen. James Inhofe (R-OK): do you seriously think he would ever, under any circumstances, install a solar panel—regardless of how much money he’d save?</i></p>\n<p>Well, there is more to learn about global warming and its mitigation than just to identify and reject pseudo-skepticism.  Inhofe is an incredibly obnoxious ideologue on this issue and on environmental issues in general.  He is an unvarnished denialist, in fact a Biblical fundamentalist to the extent that that&#8217;s logically possible in science, and not even much of a pretense of a skeptic.</p>\n<p>The problem is that residential solar electricity is not a useful way to mitigate greenhouse gases, and is not going to be useful for the forseeable future.   Utility solar electricity could become competitive, but that&#8217;s different.   Residential solar is a way to buy off environmentalists with roof jewelry instead of listening to rational science.  Depressingly, it has also served as a way to procrastinate.  It is a fantasy approach in countries that want to reject both coal electricity, and unpalatable but realistic alternatives such as natural gas and nuclear electricity.   In practice, the coal largely stays.</p>\n<p>If you think that committed anti-environmentalists would always reject solar on their own roofs, actually that&#8217;s not always true.   I know a counterexample.   They don&#8217;t consider it hypocrisy, because they think of liberalism as a philosophy for suckers and they are happy to accept the subsidy.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-11-26 05:43:51+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Actually the reason we haven&#8217;t stopped using fossil fuels is perfectly rational, and perfectly thermodynamic. Not just in analogy, but in actual practice, once we lit the match on fossil fuel reserves that fire was going to burn, no matter what; and will do so until it is no longer favored by entropy.</p>\n<p>You see, over about 25 million years a chemical potential was stored up in the form of the organic hydrocarbon bounds, a small potential in geological terms, but large biologically. Life being the stochastic process it is, explored that elevated potential energy manifold until it found an enzymatic pathway to reduce the potential energy stored in fossil fuels and thermally exhaust it back to space: namely homo sapiens industrious. What we consider to be the endless advancement of the human race, is really just a short term (2-3 centuries) set of transitions through planetary metabolic pathways to oxidize the stored chemical potential.</p>\n<p>Now that we are starting to dredge the really low EROEI fuels, in the 1:5 to 1:2 range we will see industrialization slow down, as agriculture and photosynthetic pathways become competitive again, having EROEI in a similar range. If you are still in denial over what is a pretty straightforward planetary thermodynamic process I ask you to consider this:</p>\n<p>For the last 3 years rail companies in Canada have chosen to ship bitumen over grain, stranding incredible amounts of agriculture products on the prairies. So how long can a modern industrial society sustain its demand for energy when it is quite literally starving itself of food for that energy? The Canadian labor market is equally being drained by this apparently insatiable appetite for fossil carbon.</p>\n<p>&#8230;and this my learned colleagues is just the tip of the iceberg, the whole of human civilization is on the cusp of slowing down to  an enormous degree; not collapsing, just slowing.</p>\n<p>Now there will be some who will try to claim we can run an industrial society off of renewable energy resources, but I have some very crafty arguments regrading that as well. Arguments that make it clear that an appeal to industrialized renewable energy will leave us in a very tenuous position.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sheldon:Aaron.html\">Aaron Sheldon</a>", "published": "2014-11-26 06:40:24+00:00", "title": "By: Aaron Sheldon"}, {"content": "<![CDATA[<p>Love the parable.  Personally I find climate change deniers about as irritating and annoying as 2nd hand smoke.</p>\n]]>", "author": "quax", "published": "2014-11-26 07:03:57+00:00", "title": "By: quax"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> appreciates &#8220;The IPCC recommendations get watered down by political considerations before they make it from the scientists to the public.&#8221;</p></blockquote>\n<p>Harvard scientist/historian Naomi Oreskes analyzes these issues in a brief on-line interview <b><a href=\"https://www.youtube.com/watch?v=-Ur_I3mfqvk\" rel=\"nofollow\">Why are climate scientists so conservative?</a></b>  </p>\n<p>More recently, Prof.\\(\\ \\)Oreskes has given an in-depth presentation of these views in her summary lecture at the Pontifical Academy Workshop, <i>Sustainable Humanity, Sustainable Nature: Our Responsibility</i> (2-6 May 2014, Vatican City)<br />\n<blockquote><b><a href=\"http://www.youtube.com/watch?v=bXS6X3P0sVU&t=8h7m10s\" rel=\"nofollow\">Scientific Consensus and the Role<br />\nand Character of Scientific Dissent</a></b></p>\n<p>I would argue that something has been lost, over the last fifty or sixty years; something that Bohr and Einstein knew how to articulate.  </p>\n<p>And that, I would argue, is a sense of moral gravity, a sense of what is at stake. </p>\n<p>We miss the opportunity to communicate what Bohr and Einstein recognized, in a different context: that scientists, by virtue of our expertise, at least in some cases have a uniquely vivid appreciation of the risks that we face, and in the case we&#8217;ve studied most closely, the damage that climate-change can wreak.</p></blockquote>\n<p>Note: Oreskes&#8217; lecture begins at 8:07:03 (on most web-browsers, the URL links directly to it).</p>\n<p>At this Vatican Workshop, the follow-on praise by Walter Munck&nbsp;&mdash; the world&#8217;s most celebrated oceanographer, and a long-time JASON member&nbsp;&mdash; spoke well to the merits of Oreskes&#8217; work.</p>\n<p><b>Falsifiable assertion</b>&nbsp; Historically, the inhibitory mechanisms that Oreskes identifies in respect to climate-change science have operated strongly in the context of dynamical transport theory broadly conceived, and specifically in quantum information theory regarded as an aspect of transport theory; an interlocking interest in climate-change and quantum dynamics is in this sense natural both historically and technologically.</p>\n<p>&#8212;&#8212;&#8212;&#8212;&#8211;<br />\n<b>Readings</b></p>\n<p>@misc{Oreskes:2014ab, Author = {Naomi Oreskes},<br />\nHowpublished = {Joint Workshop of the Pontifical Academy<br />\nof Sciences and the Pontifical Academy of Social Sciences,<br />\n\\emph{Sustainable Humanity, Sustainable Nature:<br />\nOur Responsibility} 2-6 May 2014, Vatican City}, Month =<br />\n{2-6 May}, Note = {video presentation,<br />\n\\url{http://www.youtube.com/watch?v=bXS6X3P0sVU&t=8h7m10s},<br />\nbeginning 8:07:03; the title-slide is &#8220;The role of<br />\nscientists: what is &#8216;our responsibility&#8217;?&#8221;}, Title =<br />\n{Scientific Consensus and the Role and Character of<br />\nScientific Dissent}, Year = {2014}}</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-26 09:22:53+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Greg #86: OK, I wasn&#8217;t trying to argue that residential solar is (or will become) a cost-effective answer&#8212;just that there&#8217;s a large fraction of the American population that will reflexively oppose <i>even those environmental initiatives that move us strictly northeast on the Pareto curve.</i>  So my hypothetical question should be revised to read, &#8220;do you think James Inhofe would ever support <i>any</i> energy/environment initiative that Greg Kuperberg also supports?&#8221;</p>\n]]>", "author": "Scott", "published": "2014-11-26 12:21:03+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #68<br />\n<img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /> I meant that nuclear war and global warming are ways for nature to weed out species/civilizations at the galactic scale (Martians didn&#8217;t make it).</p>\n]]>", "author": "Fred", "published": "2014-11-26 13:26:21+00:00", "title": "By: Fred"}, {"content": "<![CDATA[<p>Imagine that we suddenly discover a free, totally clean, and unlimited source of energy.<br />\nSince it&#8217;s all free, potentially everyone on the planet would be consuming multiple times what the current American average is (already pretty high). Industries would also be consuming way more: getting clean water by removing salt out of sea water is free, dealing with pollution by brute force is feasible, etc.<br />\nThere wouldn&#8217;t be any dirty emission, but every KW generated would still end up in the environment as wasted &#8220;heat&#8221;.<br />\nI&#8217;ve always wondered what would be the impact of that heat. I&#8217;ve tried estimating that (it&#8217;s very likely I messed up :P)</p>\n<p>In the US the total energy consumption (including industries, etc) per million ppl per year is ( <a href=\"http://en.wikipedia.org/wiki/Energy_in_the_United_States\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Energy_in_the_United_States</a> ):<br />\n82 TWh per year per million ppl<br />\nSay that with unlimited free energy that consumption would be multiplied by 12, (for everyone on the planet):<br />\n1,000 TWh / year per million ppl<br />\nFor the whole planet (7 billion)<br />\nP1 = 7,000 x 1,000 TWh per year<br />\nP1 = 2 x 10^13 KWh/day</p>\n<p>Comparing that to the sun energy hitting the earth surface<br />\n<a href=\"http://www.itacanet.org/the-sun-as-a-source-of-energy/part-2-solar-energy-reaching-the-earths-surface/\" rel=\"nofollow\">http://www.itacanet.org/the-sun-as-a-source-of-energy/part-2-solar-energy-reaching-the-earths-surface/</a><br />\n = 2.88 kwH/day  per m^2<br />\n(Earth surface = 5.1 x 10^8 km^2)<br />\nP2 = 1.5 x 10^15 KWh/day</p>\n<p>P1 is about 1.3% of P2.<br />\nWould that be enough to have a significant impact on the environment?</p>\n]]>", "author": "Fred", "published": "2014-11-26 14:50:54+00:00", "title": "By: Fred"}, {"content": "<![CDATA[<p>I would add to Scott&#8217;s Comment #3 that smokers&#8217; habits also inhibit public funding of research into thoracic cancers. For example, many people hear about lung cancer and immediately assume that the afflicted are smokers (who disregarded a mountain of evidence). Consequently, people are reluctant to donate money. </p>\n<p>This is in contrast to, say, the massive pink-ribbon campaigns. Despite that 10% to 15% of lung-cancer patients have never smoked, and that lung cancer is by far the deadliest cancer, this disease simply doesn&#8217;t attract the support it should, in part thanks to smokers.</p>\n<p>&#8211; A very different Max</p>\n]]>", "author": "Maxwell", "published": "2014-11-26 16:07:47+00:00", "title": "By: Maxwell"}, {"content": "<![CDATA[<p>Scott &#8211; Sure, those people exist.  However, some years ago there was an interesting article in the New York Times about this.   It seems that many or most ordinary political conservatives are actually very receptive to clean energy and energy conservation <i>until you mention global warming, or worse, Al Gore</i>.   And then identity politics kicks in and they lose their heads.</p>\n<p><a href=\"http://www.nytimes.com/2010/10/19/science/earth/19fossil.html\" rel=\"nofollow\">In Kansas, Climate Skeptics Embrace Cleaner Energy</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-11-26 17:00:53+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>Fred #92</p>\n<p>I think you may be ignoring energy lost due to the reflection of radiation back into space. </p>\n<p>In any case, I believe you would have to see how the increase by x% increases the amount of energy loss of the Earth, then put this into a differential equation with starting condition +1.3%, and find its limiting behavior.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/coward:Anonymous.html\">Anonymous coward</a>", "published": "2014-11-26 17:15:35+00:00", "title": "By: Anonymous coward"}, {"content": "<![CDATA[<p>Scott #74 and Greg #76</p>\n<p>Yes it&#8217;s hard to precisely estimate how much coal can be extracted, for the reasons well explained by Greg. But reasonable estimates range from 100 to 500 years (one thousand would require almost any ressource to become a reserve), not thousands with an s.</p>\n<p>That said, I don&#8217;t think this point is actually central to your position, Greg&#8217;s or mine. First because you would then know these numbers very well! Second Greg directly indicated &#8220;150 years is already too much&#8221;, and third I don&#8217;t think I would change my mind either if clathrate extraction was suddenly economically feasible with thousands of years of reserves (which is not too unreasonable scenario -we just don&#8217;t know yet).</p>\n<p>So imho the main reason is elsewhere, maybe in #39 and as per Greg that 150 years is already too much: you think the choice is suffer now (massively according to you, slightly according to Greg) or our children will suffer massively latter. I think massive suffer latter is not especially likely, and, more important, massive suffer now could as well delayed the rise of technological improvements that would make the cost lower both now and latter. Of course we can agree a few dollar on carbon tax is not massive suffer at all, and should be done anyway. </p>\n<p>Scott #70: Or maybe people mostly only leave comments here when they disagree with me?</p>\n<p>Sure! My guess is it forms some mexican hat, as for Kohonen maps. If you&#8217;d turn SO in LSO, I won&#8217;t comment -at least because I won&#8217;t read either. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /> </p>\n<p>Fred #92: no, direct heating is peanut as compared to anthropic forcing. Multiply by ten and you&#8217;ll get ten peanuts. Worse, inertia is completly different: stop heat now and it leaves, stop CO2 now and AGW will still be on us for centuries (unless we also find fast ways to recapture huge amounts of CO2)</p>\n]]>", "author": "Jay", "published": "2014-11-26 17:36:39+00:00", "title": "By: Jay"}]