[{"content": "<![CDATA[<p>Can anyone clarify what exactly was going on with the blind injections? It seems to me that an experiment like LIGO would be way more concerned about false positives, but blind injections seem to be designed to fish out false negatives (which I wouldn&#8217;t have thought would be a concern).</p>\n]]>", "author": "thepenforests", "published": "2016-02-17 05:58:58+00:00", "title": "By: thepenforests"}, {"content": "<![CDATA[<blockquote><p><b>thepenforests</b>&nbsp; wonders &#8220;Blind injections seem to be designed to fish out false negatives (which I wouldn’t have thought would be a concern).&#8221;</p></blockquote>\n<p>This history of science provides plenty of poignant examples of false negatives.  </p>\n<p>A paradigmatic example is <a href=\"https://en.wikipedia.org/wiki/Cornelis_Jacobus_Gorter#Work\" rel=\"nofollow\">Cornelis Jacobus Gorter&#8217;s</a> &#8220;Negative Result of an Attempt to Detect Nuclear Magnetic Spins&#8221; (1936), which anticipated by a full decade the Nobel-winning 1946 observations of  Edward M Purcell, Robert V Pound, and Henry C Torrey.  The successful 1946 experiment used a similar apparatus and experimental protocol to Gorter&#8217;s failed 1936 experiment; even today it is not entirely clear why Gorter&#8217;s early attempt failed.</p>\n<p><b>Lesson-learned</b>&nbsp; It is prudent to systematically verify, to the maximum degree feasible, that if a signal is present, then the experiment will see it.</p>\n<p>That&#8217;s why the LIGO program ran <i>two </i> independent signal-detection protocols simultaneously, known as &#8220;PyCBC&#8221; and &#8220;GstLAL&#8221; (per LIGO Document P1500269 of comment #16).</p>\n]]>", "author": "John SIdles", "published": "2016-02-17 13:33:56+00:00", "title": "By: John SIdles"}, {"content": "<![CDATA[<p>Fred #88, Nick #93,</p>\n<p>Has this been actually worked out? Do gravitational waves obey the same laws in terms of geometrical optics? Contrary to EM, gravity is very nonlinear (i.e., contrary to photons, I suppose, gravitons do interact with each other). As a consequence, it probably doesn&#8217;t satisfy a superposition principle, right? Does it make sense to immediately import intuition from interferometry, geometrical optics, etc? </p>\n<p>Maybe graviton-graviton interaction is just so weak that geometrical optics is a good approximation in any interesting range. Then again, if the gravitational lens is a black hole or something like it and we&#8217;re deep in the strong-field regime, maybe not.</p>\n<p>I have no intuition either way.</p>\n]]>", "author": "Daniel", "published": "2016-02-17 14:33:22+00:00", "title": "By: Daniel"}, {"content": "<![CDATA[<p>If the strength of the wave falls off as 1/r instead of 1/r^2 (as you originally thought) doesn&#8217;t that mean it falls off more slowly in actuality? You seem to imply it falls off more quickly with 1/r.</p>\n]]>", "author": "Lewikee", "published": "2016-02-17 14:38:39+00:00", "title": "By: Lewikee"}, {"content": "<![CDATA[<p>Do any or all models of dark matter that might or might not be in the vicinity of a black hole merger affect the GW signal?</p>\n<p>Similar question for dark matter being part of an accretion disk? If so, would there be any way to determine that it was there?</p>\n]]>", "author": "Raoul Ohio", "published": "2016-02-17 16:09:38+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Lewikee #97: Think about it.  If it fell off as 1/r<sup>2</sup>, then <i>knowing</i> how strong it still is when it reaches the earth, it would have to be really, <b>really</b> strong even (say) 1 AU away from the black holes.  Because it falls off as 1/r, it can already be imperceptible at an AU away.</p>\n]]>", "author": "Scott", "published": "2016-02-17 16:10:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I could be wrong but my intuition tells me that provided the wavelength  of the gravitational wave is greater than the length of my body they could not harm me regardless of how intense they are. The reason is the wave will not cause the atoms in my body to move through space and so will perform no work on it, that is to say will cause no damage to it. Instead the wave will cause the very space inside my body to expand, so the wave might cause me to look taller to you but I would feel just the same as I always did, although you would look squashed to me. The detected waves were many miles in length so I think they be of no danger no matter how strong they were. </p>\n<p>For the same reason I don&#8217;t think you could extract work out of the accelerating expansion of the universe even if you could build machines of cosmological size, although at one time I thought you could.  Suppose you had a spool of string on an axle and you extended the string to cosmological distances and tied a weight on the end of the string. I thought there would be torque on the spool, so the axle would rotate. The axle could then be connected to an electric generator and it seemed to me you&#8217;d get useful work out of it. Of course you&#8217;d have to constantly add more mass-energy in the form of more string to keep it operating, but the amount of mass per unit length of string would remain constant, but because the universe is accelerating the amount of energy per unit length of string you&#8217;d get out of it would not remain constant but would increase asymptotically to infinity. </p>\n<p>Then I realized my brainstorm wouldn&#8217;t work, there would be no torque on the spool because the weight on the end of the string was not moving through space with respect to the spool, instead space itself was moving. It&#8217;s as if I grabbed the string with my left hand 4 feet from the spool and I grabbed the string with my right hand 1 foot from the spool and pulled my hands in opposite directions I would create tension in the string between my hands but I&#8217;m doing no work and producing no torque on the spool, and the same would be true of the Dark Energy that&#8217;s accelerating the universe. If I pulled hard enough the string would break and if Dark Energy got strong enough every atom in the string would pull apart from every other atom in it, that&#8217;s what happens when space expands, but there would still be no torque on the spool and no useful work could be extracted from the spacial expansion.</p>\n]]>", "author": "John K Clark", "published": "2016-02-17 18:12:03+00:00", "title": "By: John K Clark"}, {"content": "<![CDATA[<blockquote><p><b>Daniel</b> supposes&nbsp; &#8220;Contrary to photons, I suppose, gravitons do interact with each other.&#8221;</p></blockquote>\n<p>Quantum electrodynamics (QED) theoretically predicts that <a href=\"https://en.wikipedia.org/wiki/Two-photon_physics\" rel=\"nofollow\">photons <i>do</i> interact with one another</a>.   The cross-section for direct &#8220;light-by-light scattering&#8221; is too small to be observed in terrestrial laboratories (by any means discovered to date), but it does naturally explain an observed astronomical cut-off in gamma-ray photons that appears beginning at 80 TeV: photons of greater energy are lost to scattering from relic microwave photons.</p>\n<p>If we accept&nbsp;&mdash; as observations indicate&nbsp;&mdash; that QED and quantum gravity alike have well-defined weak-field limits, then it is interesting to contrast the strong-field pathologies of both theories.</p>\n<p>In QED, when electric fields become sufficiently strong, it is thought that electron-positron pairs non-perturbatively emerge from the background, such that the created charges act to reduce the E-field below the critical level. </p>\n<p>In quantum gravity the situation is more complicated.  For sufficiently massive black holes, the metric curvature at the event horizon can be arbitrarily low; thus classical GR should work just fine.  Inside the event horizon something non-classical/non-perturbative presumably happens, but it is far from clear just <i>what</i> this internal quantum dynamics might be.  </p>\n<p>It would be nice if this unseen internal quantum black-hole dynamics acted to preserve quantum unitarity and macroscopic causality&nbsp;&hellip; but as to how this might work in detail, <strike>&nbsp;no one knows&nbsp;</strike> so many credible postulates have been advanced in the literature, that no one of these postulates is considered (so&nbsp;far) to be very convincing.</p>\n]]>", "author": "John Sidles", "published": "2016-02-17 18:37:11+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>[&#8230;] posted some back-of-the-envelope calculations on his blog, Shtetl Optimized, which is very popular in two-advanced-degrees-and-counting corners of the [&#8230;]</p>\n]]>", "author": "This is how close you'd have to be to feel a gravitational wave | Free Books Zone", "published": "2016-02-17 22:21:03+00:00", "title": "By: This is how close you'd have to be to feel a gravitational wave | Free Books Zone"}, {"content": "<![CDATA[<p>[&#8230;] posted some back-of-the-envelope calculations on his blog, Shtetl Optimized, which is very popular, or at least in two-advanced-degrees-and-counting corners of the [&#8230;]</p>\n]]>", "author": "This is how close youd have to be to feel a gravitational wave  Izon Inc", "published": "2016-02-17 23:35:17+00:00", "title": "By: This is how close you’d have to be to feel a gravitational wave – Izon Inc"}]