[{"content": "<![CDATA[<p>@wolfgang  #199:</p>\n<p>1. You&#8217;re changing the goalposts. The original claim was about the parsimony of QM, not QFT.</p>\n<p>2. Even so, there are many relativistic extensions of dBB (and a few field theory formulations). Most of them include an unobservable preferred foliation, although no particular theory has gathered enough support to be considered canonical.</p>\n<p>3. There are dBB extensions that do not require preferred reference frames:<br />\n<a href=\"http://arxiv.org/abs/1002.3226\" rel=\"nofollow\">http://arxiv.org/abs/1002.3226</a></p>\n<p>And formulations in which the unobservable reference frame is derived from the wave function, thus not requiring any addition axioms:<br />\n<a href=\"http://arxiv.org/abs/1307.1714\" rel=\"nofollow\">http://arxiv.org/abs/1307.1714</a></p>\n<p>4. What this shows is that John Bell was correct: the real problem of QM that needs serious investigation is non-locality. Waving it away by denying realism is just a cheat.</p>\n]]>", "author": "Sandro", "published": "2014-03-28 13:25:19+00:00", "title": "By: Sandro"}, {"content": "<![CDATA[<p>From a programmer&#8217;s perspective, it seems that in considering what constructively could be in a MUH one could find some connection to infinitary programming languages, e.g. λ_ZFC: <a href=\"http://faculty.cs.byu.edu/~jay/static/toronto-2012flops.pdf\" rel=\"nofollow\">faculty.cs.byu.edu/~jay/static/toronto-2012flops.pdf</a>, which &#8220;contains infinite sets as values, in which to express exact mathematics and gradually change infinite calculations to computable ones.&#8221;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/t/Thrift:Philip.html\">Philip Thrift</a>", "published": "2014-03-28 13:53:11+00:00", "title": "By: Philip Thrift"}, {"content": "<![CDATA[<p>&#8220;What this shows is that John Bell was correct: the real problem of QM that needs serious investigation is non-locality. Waving it away by denying realism is just a cheat.&#8221;</p>\n<p>Agreed, but perhaps not such a problem. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /> </p>\n<p><a href=\"http://arxiv.org/abs/1109.6223\" rel=\"nofollow\">http://arxiv.org/abs/1109.6223</a></p>\n<p><a href=\"http://arxiv.org/abs/0909.2673\" rel=\"nofollow\">http://arxiv.org/abs/0909.2673</a></p>\n<p><a href=\"http://arxiv.org/abs/quant-ph/9906007\" rel=\"nofollow\">http://arxiv.org/abs/quant-ph/9906007</a></p>\n]]>", "author": "Mike", "published": "2014-03-28 14:29:57+00:00", "title": "By: Mike"}, {"content": "<![CDATA[<p>Jason &#8211; <i>As I understand it, there are no functions from a non-empty set to the empty set, measure-preserving or otherwise.</i></p>\n<p>You&#8217;re right, so the definition is a little different from what I said.   A morphism between two measurable sets is a <b>partial</b> function, defined everywhere except on a set of measure 0 (and which is also a measurable function).   Such a partial function is equivalent to what you get if you erase its values on a measure 0 subset.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-03-28 15:02:11+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>David Brown # 76 says</p>\n<p>“&#8217;… anything that can be described at all can be described mathematically.&#8217; This is an interesting conjecture. What is the mathematical description of Thomas Hardy’s novel &#8216;Jude the Obscure&#8217; or Shakespeare’s &#8216;King Lear&#8217;?&#8221;</p>\n<p>It&#8217;s an excellent question, and I answered it in a technical end note to an essay that responds directly to Scott Aaronson&#8217;s question of computing &#8220;using the resources of the universe&#8221; under the title &#8220;Well Ordered, Totally Ordered, Partially Ordered or Random?&#8221;:</p>\n<p>&#8220;Mathematicians have many ways to speak of order.  We have tried to make clear in these pages that we have taken our terms from mathematical set theory and applied them to the theory of computation.</p>\n<p>&#8220;When we speak of computing &#8216;using the resources of the universe,&#8217; we have assumd a parameter outside of classical computability using the rules of arithmetic &#8212; numbers aren&#8217;t physical, though counting is.  I.e., physical quanta are countable by definition.</p>\n<p>&#8220;&#8216;Countable&#8217; doesn&#8217;t necessarily imply well ordered, though &#8212; cardinality of sets {a,b,c &#8230;} might be represented by labels that are well ordered (1,2,3 &#8230;) independent of the orderedness or randomness of the set.  For example, when we speak of the set of all books, the information contained in Tolstoy&#8217;s *War and Peace* differs from Vonnegut&#8217;s *Slaughterhouse Five*, yet both have the cardinality of the continuum (uncountably infinite) &#8212; even though the set N of all books is countably finite.  As strange as it may seem to speak of an finite set of infinite things, the case is true: a comprehensible explanation may be found in Hermann Weyl&#8217;s 1918 classic, *The Continuum: a critical examination of the foundation of analysis.*</p>\n<p>&#8220;In our essay, we have proposed that global information is totally ordered and finite, while our ways of computing are partially ordered and infinite.  Gregory Chaitin&#8217;s application of his Algorithmic Information Theory would seem to bear this out in an experimental way; Chaitin&#8217;s Omega number is produced from an algorithm that outputs different and random results depending on which computer language is &#8216;speaking.&#8217;  Metaphorically, one program would output *War and Peace*; the other, *Slaughterhouse Five*, from the same algorithm.</p>\n<p>&#8220;So it goes.&#8221;</p>\n<p>If Max Tegmark is correct, it&#8217;s more than a metaphor; it&#8217;s a mathematical identity.  I&#8217;ve always been a big fan of Tegmark&#8217;s premise, and I am reading the book now.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Ray:T_H.html\">T H Ray</a>", "published": "2014-03-28 16:34:18+00:00", "title": "By: T H Ray"}, {"content": "<![CDATA[<p>Addendum:  I should have made clear the context:</p>\n<p>&#8220;Scott Aaronson asks a seminally important question – “Can NP-complete problems be solved in polynomial time using the resources of the physical universe?”6 – arguing that NP-complete problems themselves possibly constrain physical theories. We find, however, that infinite self similarity in any finite time interval promises self organized, and therefore self limiting, maps of short (local) intervals to long (global) intervals. (Cf. Perelman’s proof strategy for Thurston’s geometrization conjecture.7)&#8221;</p>\n<p>(The references are to Aaronson&#8217;s paper, “NP Complete Problems and Physical Reality,&#8221; and to Anderson, M.T. “Geometrization of 3-Maniolds via the Ricci Flow.” Notices of the AMS (vol. 51. No. 2, February 2004)</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/r/Ray:T_H.html\">T H Ray</a>", "published": "2014-03-28 16:50:33+00:00", "title": "By: T H Ray"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>Re #108d:</p>\n<p>> I do reject the arguments of Everett, Deutsch, Wallace, Zurek, and others that the Born rule can be “derived” from unitary QM.</p>\n<p>What about your friend Sean Carroll? (Admittedly, he does not claim deriving the Born rule.) In his recent blog post <a href=\"http://www.preposterousuniverse.com/blog/2014/02/12/the-many-worlds-of-quantum-mechanics/\" rel=\"nofollow\">The Many Worlds of Quantum Mechanics</a> he unapologetically supports MWI. Here is <a href=\"http://image.bayimg.com/83cff1dfa16722abd38568161e5822548e72306a.jpg\" rel=\"nofollow\">slide 34</a> from his presentation. Note the line <b>it&#8217;s tested every time we observe interference</b>, so, presumably, deriving the Born rule is not even necessary.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/Nux:Shmi.html\">Shmi Nux</a>", "published": "2014-03-28 22:37:34+00:00", "title": "By: Shmi Nux"}, {"content": "<![CDATA[<p>I can&#8217;t wait to read this book &#8212; MUH has been a pet &#8220;gedanken-hobby&#8221; of mine ever since I independently (no, really!) came up with it a decade or so back.  I was gobsmacked when I first came across Tegmark&#8217;s formulation of it, and while I even consider it a likely explanation of the cosmos, I largely agree with Scott&#8217;s objections here in regards to evidence.  So anyway, I have been pondering the implications of MUH for a long while, and attempting to poke holes in it.  Here are two holes that I can&#8217;t seem to get past &#8212; perhaps they are addressed in the book, or have obvious flaws, but I will mention them here anyway.</p>\n<p>1.  A single universe in a Level 4 Multiverse consists not just of a set of laws, but also an initial state.  In fact, in MUH, every possible combination of initial state state and set of laws would define a different universe.  So there would be universes with our own set of physical laws, but with all manner of initial states, of ALL sizes/complexities (including ones which look very much like &#8220;last Thursday&#8221;, say with a minor tweak).  The odds of us finding ourselves in universe with a highly complex initial state would have to be considerably higher than if our beginning were simple.  So why is our initial state so simple (or why does it seem to be)?  (This is exactly analogous to the low entropy problem in standard cosmology, but just because MUH has the same flaw doesn&#8217;t mean it&#8217;s dismissable.)</p>\n<p>2.  Where are the really oddball laws in our universe?  A personal preference for simple and beautiful laws is fine, but consider ugly, discontinuous functions (such as F= [ma if m=41.3] where 41.3 is just some number I picked out of the air).  These functions are just as valid in the mathematical definition of a universe, and would seem to be at least as numerous (again with the measure problem) as the simpler functions.  It wouldn&#8217;t be hard to devise some that wouldn&#8217;t threaten the existence of life, I would say, so we can&#8217;t fall back on the anthropic principle.  So why haven&#8217;t we found any such functions?  Why are all our laws so seemingly simple?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Schnitzius:Mark.html\">Mark Schnitzius</a>", "published": "2014-03-28 23:46:33+00:00", "title": "By: Mark Schnitzius"}, {"content": "<![CDATA[<p>Shmi Nux #240: I&#8217;m not exactly the world&#8217;s biggest MWI opponent, nor is Sean its biggest cheerleader (&#8220;I&#8217;m happy to bring up the outstanding issues with the approach, but I do want people to know it should be taken seriously&#8221;).  But yes, he and I do have somewhat different perspectives about MWI.  As for Sean&#8217;s derivation of the Born rule, I heard him give a talk about it at MIT and found it quite nice.  I&#8217;d place it in the same class as Deutsch&#8217;s, Zurek&#8217;s, etc. arguments: it&#8217;s another way to see why the Born rule is &#8220;the only rule that&#8217;s mathematically sane.&#8221;  No, it doesn&#8217;t get you all the way from unitary QM to the experiences of observers without an extra &#8220;anthropic&#8221;/metaphysical assumption to help it along, but as long as you&#8217;re clear about what your extra assumption is (and Sean is always clear), more such arguments can only lead to more insight.</p>\n]]>", "author": "Scott", "published": "2014-03-29 00:03:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #242: Thanks, I must have misunderstood Sean&#8217;s position.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/n/Nux:Shmi.html\">Shmi Nux</a>", "published": "2014-03-29 01:20:13+00:00", "title": "By: Shmi Nux"}, {"content": "<![CDATA[<p>Scott &#8211; <i>I do reject the arguments of Everett, Deutsch, Wallace, Zurek, and others that the Born rule can be “derived” from unitary QM.</i></p>\n<p>As I see it, the full Born rule can be derived from &#8220;unitary&#8221; QM plus a far weaker version of the Born rule.</p>\n<p>First of all, even in &#8220;unitary&#8221; QM, you do have a specific version of decoherence from locality.   If Alice and Bob have a joint state, then the state of Alice alone is for all quantum purposes described by a density matrix.   In conjunction with other reasonable physics, you do expect to see decoherence, thermalization, approximate Maxwell-Gibbs distributions, and ultimately physical objects which have classical behavior expressed in density matrices.</p>\n<p>The only catch is that if you are a strict unitarian, you would say: &#8220;Sure, this is called a density matrix, but if that is meant as a reference to a probability distribution, that&#8217;s misleading.  We only know it as a partial-trace entity; the density aspect is purely formal.&#8221;  Still, let&#8217;s take the interpretation that if almost all of a wave function or density matrix is concentrated at a certain condition, then we can, qualitatively, call that condition approximately true.   After all, if almost all of the wave function of an electron is near an atomic nucleus, then even without any quantitative Born rule, you would informally say that the electron is near the nucleus.   You would have to be a truly reactionary unitarian to say, &#8220;We can&#8217;t say anything about the location of the electron if even some infinitesimal bit of its wave function is far away from the nucleus.&#8221;   Actually, little bits of wave functions are assigned to all sorts of wild possibilities for any physical object.</p>\n<p>So, if Alice is a quantum object who is a human being or an intelligent computer who has witnessed many quantum experiments, then her own density matrix is highly concentrated at a perception that the Born rule is true and that wave functions &#8220;collapse&#8221;.   In this sense, the Born rule is almost a corollary of &#8220;unitary&#8221; QM and really plays the same role as Bayesian &#8220;collapse&#8221; in classical probability.</p>\n<p>Not to mention that much of the calculus of density matrices is mathematically identical to classical probability, even if those density matrices happen to come from partial trace and physical locality rather than from the Born rule.   It is dubious to reject that coincidence as philosophically meaningless.  (Again, even if an external philosopher rejects the point, an &#8220;Alice object&#8221; still perceives this mathematical agreement to make complete sense.)</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kuperberg:Greg.html\">Greg Kuperberg</a>", "published": "2014-03-29 03:48:18+00:00", "title": "By: Greg Kuperberg"}, {"content": "<![CDATA[<p>@Greg #244</p>\n<p>The universal wavefunction of mwi follows objectively a deterministic evolution. Therefore probabilities have to be subjective &#8211; and this is indeed what you use in your derivation: Alice does not know the state of the environment.</p>\n<p>But once you go the subjective route, why not use Copenhagen, which basically uses the fact that you know the state of your mind (by definition) &#8211; therefore you reduce the wavefunction every time it affects your state of mind (i.e. during a measurement) ?</p>\n<p>The latter seems much simpler to me.</p>\n]]>", "author": "wolfgang", "published": "2014-03-29 11:55:04+00:00", "title": "By: wolfgang"}]