[{"content": "<![CDATA[<p>That&#8217;s the thing about the internet.  When I met Hank Aaron at a Red-Lobster with the rest of my little league team in the late 80&#8217;s, it was so cool to get his autograph.  Still, Scott and John, y&#8217;all know how to make a guy&#8217;s day.  Thank you.</p>\n]]>", "author": "J.R.", "published": "2016-03-20 21:17:49+00:00", "title": "By: J.R."}, {"content": "<![CDATA[<p>Scott #2:</p>\n<p>There might well be important basic things undiscovered yet.</p>\n<p>I am sure there are tons of useful basic things undiscovered all over in the STEM areas, even in math. This is particularly true in areas where it is only now feasible to do calculations, so that Euler, Gauss, etc., didn&#8217;t already figure out all the important stuff. (Actually, Gauss often did anyway, such as the FFT).</p>\n<p>I have lately been working in representation, and propagation in calculations, of uncertainty in models, data, etc. There are a lot of results involving basic approaches to well defined problems, but little or nothing about issues that emerge when you try to look at the big picture.</p>\n<p>This might not be good career advice, but I want to suggest to young scientists the possibility of studying a lot of subjects and to discover stuff off the main highways, and try to figure out part of the big picture.</p>\n]]>", "author": "Raoul Ohio", "published": "2016-03-21 04:13:24+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<blockquote><p><b>Scott</b> says &#8220;I’m not at all confident that every concept as basic to math as the logarithm has already been discovered.&nbsp;&hellip;&#8221; </p>\n<p><b>Raoul Ohio</b> (#2) says:  &#8220;I am sure there are tons of useful basic things undiscovered all over in the STEM areas, even in math.&nbsp;&hellip;&#8221;</p></blockquote>\n<p>A pair of essays that ringingly affirm Scott and Raoul&#8217;s perspective, by Nobelists Edward Mills Purcell and Felix Bloch (yes, <i>that</i> Bloch), appear as the &#8220;Preface&#8221; and opening chapter &#8220;The Past, Present, and Future of Nuclear Magnetic Resonance&#8221; of the two-volume historical survey <i>Magnetic Resonance Imaging</i> (1988, <a href=\"http://tinyurl.com/Purcell-Bloch-scanned-excerpts\" rel=\"nofollow\">excerpts here</a>).</p>\n<p>The following passage conveys the main themes of Purcell and Bloch&#8217;s essays:<br />\n<blockquote>It is nearly 400 years since the practice of medicine and the study of magnetism were combined in the career of Sir William Gilbert, physician to Queen Elizabeth I, president of the Royal Colleague of Physicians, and author of <i>De Magnete</i> [<i>De Magnete, Magneticisque Corporibus, et de Magno Magnete Tellure</i>, 1600], one of the great scientific treatises our civilization has produced.</p>\n<p>By 1950, plus or minus a year or two, the basic physics that underlies NMR imaging was for practical purposes completely understood.&nbsp;&hellip; Yet with all this knowledge ready to apply, the realization of medically useful MRI images lay more than 20 years in the future. What essential ingredients were lacking?</p>\n<p>For one thing, <i>sensitivity</i>.&nbsp;&hellip; The key was computer power, and the great advance in signal-processing techniques that became feasible as computer power and speed grew by their own powers of ten.&nbsp;&hellip; NMR imaging could hardly have been developed to its present state, no matter how well established its base in modern physics, without the modern computer.</p>\n<p>But something even more essential was lacking in 1950: <i>the idea</i> that a useful interior image was in principle obtainable, and was a goal worth pursuing.&nbsp;&hellip; </p>\n<p>My own confident expectation is that clinical experience (accumulating at a rate that for a while may seem exponential) and empirical testing in the 10-Tesla range (which ought to be part of a systematic long-term program) will eventually prove beyond question that the extension of William Gilbert&#8217;s &#8216;orb of virtue&#8217; into the human body is in the deepest sense benign.</p></blockquote>\n<p>Needless to say, even today, new capabilities of NMR imaging are <i>still</i> accumulating, as Purcell foresaw, &#8220;at a rate that seems exponential&#8221;.  Long may this medical progress be sustained!  <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> </p>\n<p>Hmmmm&nbsp;&hellip; upon what new ideas &#8220;as basic to math as the logarithm&#8221; has this progress been founded?  And can the continued appearance of ideas be reasonably anticipated in coming decades? </p>\n<p>Since WWII we can identify as simple-yet-fundamental advances:</p>\n<p>• The Cooley-Tukey fast fourier transform algorithm.<br />\n• Ken Wilson&#8217;s renormalization group<br />\n&nbsp;&nbsp;&nbsp;(see <a href=\"\" rel=\"nofollow\">John Preskill&#8217;s remarks on Ken Wilson</a>)<br />\n• The stochastic calculus of Ito and Stratonovich<br />\n• Carmichael&#8217;s unraveled dynamics of open quantum systems<br />\n• Algebraic varieties as dynamical state-spaces<br />\n• Duality in statistical mechanics and field theory</p>\n<p>Doubtless other simple-yet-fundamental recent math advances will occur to <i>Shtetl Optimized</i> readers.</p>\n<p><b>Purcell&#8217;s deep question</b>&nbsp; What is meant when we say (or hope) that a STEM-advance is (in Purcell&#8217;s phrase) &#8220;in the deepest sense benign&#8221;?</p>\n<p>Although opinions may differ (and <i>should</i> differ), it seems to me that the advances in quantum information theory that <i>Shtetl Optimized</i> has so justly celebrated for the past several years, indeed have been benign in this deepest sense. Long may this quantum research tradition be sustained!  <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> </p>\n<p><b>A double-barrelled conclusion</b>&nbsp; Scott&#8217;s new postdocs can be wholly confident of participating in continued advances in quantum information theory that are both &#8220;as&nbsp;basic to math as the logarithm&#8221; (in Scott&#8217;s phrase) and &#8220;in&nbsp;the deepest sense benign&#8221; (in Purcell&#8217;s phrase).  </p>\n<p>Who could ask for more?</p>\n]]>", "author": "John Sidles", "published": "2016-03-22 10:51:29+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p><b>Corrigenda</b>&nbsp; The intended link (in #7) is to John Preskill&#8217;s beautiful <i>Quantum Frontiers</i> encomium &#8220;We are all Wilsonians now&#8221;  (June&nbsp;18, 2013, Google finds it).   Also, the quoted Ed&nbsp;Purcell essay is not a &#8220;Preface&#8221; but a &#8220;Foreword&#8221;.</p>\n]]>", "author": "John Sidles", "published": "2016-03-22 12:21:59+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>John, thanks for the pointer to Ken Wilson. I had met Ken in his later work on reforming math and science education in schools (a task for those much tougher than me).</p>\n<p>The following about Ken Wilson, from &#8220;Not even wrong&#8221;, is very interesting, particularly the replies. Check it out:</p>\n<p><a href=\"http://www.math.columbia.edu/~woit/wordpress/?p=6059\" rel=\"nofollow\">http://www.math.columbia.edu/~woit/wordpress/?p=6059</a></p>\n]]>", "author": "Raoul Ohio", "published": "2016-03-23 05:03:39+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Thank you, Raoul, for the further references on Ken Wilson (I had not known that Ken Wilson was a raised Quaker).  </p>\n<p>A reference that describes Wilson&#8217;s high-school days at George School (a Quaker institution) is his lab partner Peggy McIntosh&#8217;s article &#8220;Gender Perspectives on Educating for Global Citizenship&#8221; (2004, <a href=\"https://books.google.com/books?id=8JR0W8AQp6oC&pg=PA30\" rel=\"nofollow\">Google finds it</a>).  </p>\n<p>It turns out, too, that Mario Capecchi (Nobel Prize in Physiology or Medicine, 2007) attended that same George School science class, four years after Wilson.  </p>\n<p>So that was one terrific high-school science teacher! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>&#8212;&#8212;&#8212;&#8212;&#8211;</p>\n<p>In further regard (#2), a recent mathematical discovery that is (plausibly) “as basic to math as the logarithm” is the idea of <i>perfect simulation</i> (sometimes called &#8220;perfect sampling&#8221; or &#8220;coupling from the past&#8221;). </p>\n<p>The arxiv server supples plenty of preprint-examples, and see also Mark Huber&#8217;s textbook <i>Perfect Simulation</i> (2015).  </p>\n<p>The relevance of perfect simulation to the ongoing STEAM-race between quantum supremacists and algorithm supremacists arises as follows.  We suppose that quantum supremacists are able to (no doubt ingeniously) prove that <i>exact</i> BosonSampling collapses the Polynomial Hierarchy.  </p>\n<p>In riposte, the algorithm supremacists model the open quantum system dynamics associated to BosonSampling experiments as a Markov Chain&nbsp;&mdash; i.e., as an unraveled unitary Hamiltonian flow, plus a stochastic Lindblad flow, as driven by finite-state classical controller/clock that &#8216;triggers&#8217; successive detection attempts&nbsp;&mdash; and we suppose furthermore that the algorithm supremacists (no doubt ingeniously) are able to code their Markov Chain as a <i>perfect</i> simulation of realistic BosonSampling experiments.</p>\n<p><b>A natural question</b>&nbsp; If we assume that exact simulations of BosonSampling collapse the Polynomial Hierarchy, does it rigorously follow that perfect simulations of BosonSampling collapse the Polynomial Hierarchy too?  Or are the definitions of &#8220;exact&#8221; and &#8220;perfect&#8221; sufficiently different (at some fine-grained level) that no contradiction need&nbsp;arise?</p>\n<p><b>Conclusion</b>&nbsp; Now that quantum supremacists are using phrases like &#8220;exact simulation&#8221; in <i>their</i> articles, and algorithm supremacists are using phrases like &#8220;perfect simulation&#8221; in <i>their</i> articles, it&#8217;s a presumably a prudent idea for <i>everyone</i> to study their STEAM-dictionaries mighty&nbsp;carefully.</p>\n<p>In any event, the ongoing flow of new ideas like &#8220;perfect simulation&#8221; promises to create plenty of exciting research opportunities for the coming generation of STEAM-workers, both quantum and otherwise! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n]]>", "author": "John Sidles", "published": "2016-03-23 21:43:29+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>John Sidles, what do you make of the slide-rule as a perfect simulation?  I think the problem is that quantum physicists and computer scientists have an incomplete definition of &#8220;random.&#8221;  I look at random and not random as a launch point for an analog simulation for negated behavior.  It&#8217;s not random but it&#8217;s not not random.</p>\n<p>An incomplete statistical definition of random is the problem (and why so many argue Turing was complete on his argument of negation regarding the Halting problem).  If a negator says the machine is not stuck when it is stuck, or it says it is stuck when it is not stuck, this is a problem for logic.  But what of it is not not stuck?  Let&#8217;s say the machine is stuck (0) or not stuck (1).  All negated behaviors (k) can be described in the following manner:</p>\n<p>The mapping of these outcomes to the real numbers between 0 and 1 inclusive are given by recursion:</p>\n<p>M[1; the base case] = 1-4*abs(P(observed) &#8211; 1/2)<br />\nM[k] = 1-2*abs(M[k-1])</p>\n<p>So any seemingly logical inconsistencies do disappear.  For instance, if I ask the question will the machine get stuck (0), then if the machine gets stuck then machine&#8217;s negator says it could be because the behavior is not-not certain or not-not-random or not-not-&#8230;-not(k) random.</p>\n<p>It just seems to me that the math being used are incomplete.</p>\n<p>Please tell me if this somehow is wrong, I would love to know.  The simulation here folds (Napier&#8217;s scaled).</p>\n]]>", "author": "J.R.", "published": "2016-03-24 17:29:45+00:00", "title": "By: J.R."}, {"content": "<![CDATA[<blockquote><p><b>John Sidles</b>  &#8220;What do you make of the slide-rule as a perfect simulation?&#8221;</p></blockquote>\n<p>The simplest example (that occurs to me anyway) of a &#8220;perfect simulation&#8221; is John von Neumann&#8217;s celebrated <a href=\"https://en.wikipedia.org/wiki/Fair_coin#Fair_results_from_a_biased_coin\" rel=\"nofollow\">algorithm for simulating a perfectly fair coin-flip using biased coin-flips</a>.  </p>\n<p><b>The point</b>&nbsp; The quality of &#8220;perfection&#8221; resides entirely in the ingenuity of von Neumann&#8217;s algorithm, <i>not</i> in the axioms of probability or in their subtle philosophical interpretations.  </p>\n<p>This pragmatic notion of &#8220;perfection&#8221; is characteristic of the entire literature on perfect simulation.</p>\n<p><b>Recommended reading</b>&nbsp; Microsoft researcher David Wilson maintains a vast &#8220;Web Site for Perfectly Random Sampling with Markov Chains&#8221; (Google finds it); this website links to dozens (hundreds?) of articles and textbooks that describe similarly &#8220;perfect&#8221; sampling algorithms.</p>\n<p><b>Practical perfectibility</b>&nbsp; &#8220;Almost perfect&#8221; sampling algorithms too are commonly encountered; these are algorithms that have (in David Wilson&#8217;s phrase) &#8220;some bias ε that the user can make as small as desired.&#8221;  Recent preprints associated to sampling algorithms that aspire to &#8220;almost-perfection&#8221; are &#8220;A positive tensor network approach for simulating open quantum many-body systems&#8221; (2015, arXiv:1412.5746v2) and &#8220;Density functionals with the help of matrix product states&#8221; (2016, arXiv:1603.06565). </p>\n<p>Needless to say, these works acknowledge the considerable complexity-theoretic subtleties and challenges that are associated to &#8220;almost perfect&#8221; sampling algorithms: the former preprint self-admittedly tackles a class of problems that formally is QMA-hard, the latter self-admittedly tackles a class of problems that formally is  #P-hard.</p>\n]]>", "author": "John SIdles", "published": "2016-03-24 23:50:15+00:00", "title": "By: John SIdles"}, {"content": "<![CDATA[<p>Oh my Gosh!  John, I did not know what you did for a trade.  Thank you.  I am very grateful for what you do for us veterans.  I promise to read more.  Thank you.</p>\n<p><a href=\"https://rjlipton.wordpress.com/2014/02/13/seeing-atoms/\" rel=\"nofollow\">https://rjlipton.wordpress.com/2014/02/13/seeing-atoms/</a></p>\n]]>", "author": "J.R.", "published": "2016-03-25 01:12:22+00:00", "title": "By: J.R."}, {"content": "<![CDATA[<p>J.R. #3: </p>\n<p>(notwithstanding the vivid catbox fantasy, raises eyebrow in the direction of the sexism inherent in your last scenario, what with lady comp-sci profs being all up in the high-society fashion-war madness with arch-rivals, meow.)</p>\n<p>(note to self: prescribe better fiction to the grad students)</p>\n]]>", "author": "amy", "published": "2016-03-25 04:24:17+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Hi John,</p>\n<p>I hope you are well.  If you like Von Neumann&#8217;s definition, I bet you $10 I can show you something better than his definition.  Sounds like a win-win to me.  Scott says he&#8217;s got guys reading P!=NP papers for $100 (I saw this in an interview with Scott); now Scott wants me to factor 5000 digit numbers with my algorithm.  That&#8217;s not how I wrote it; I wrote it even more fundamental; it&#8217;s set up to find the optimal solution to minimax: as seen here: <a href=\"https://www.youtube.com/watch?v=5oXyibEgJr0\" rel=\"nofollow\">https://www.youtube.com/watch?v=5oXyibEgJr0</a>.  I am arguing that it would destroy this game described here.  I&#8217;m pretty certain y&#8217;all reduced the problem in that video to 3SAT sometime in the 70&#8217;s.  I could be wrong, but the algo which I am really concerned about because it would allow just about anyone to hack into Amy&#8217;s phone.</p>\n<p>Amy.  I just happened to use a scenario with my wife for that last scenario; it actually happened.  I&#8217;m sorry your life includes such a state that you need to anchor on a completely innocuous scenario that actually passed without much fanfare outside of a situation where I just asked her a question so that I could be there for her in that moment (and was greatful that I divined a very powerful logic that she was applying that we are not in the sciences), and I can assure you that no-one in the scenario felt offended, nor is it my intent to offend you with completely innocuous scenarios.  In my society, my wife loves me and I love my wife, always, and we have real conversations like that include the one I mentioned; here, in Atlanta, we feel sorry that you are lonely, or at least that you come off as a lonely and angry person.  Someone must have been very mean to you, and I am sorry.  I am happy to talk about math with you if you like, but I am not a grad student so I may not know what you are talking about (I only know the stuff I have specifically spent all my money on researching).  I am a special disabled Veteran of the Gulf War Era and I cannot afford to go to any more schooling than what I was able to do with the Montgomery G.I. Bill (I managed to get an M.S. in Finance).</p>\n<p>I respect females for being both female and my equal.  I sure did serve with many, all of whom had my deepest respect.  I acknowledge that women have the short end of the stick, but if one allows one to be shaped by that into a hammer then all things will appear as nails, and you don&#8217;t have to hit me to change my opinion.  That&#8217;s what it means to be a man.</p>\n]]>", "author": "J.R.", "published": "2016-03-25 23:40:12+00:00", "title": "By: J.R."}, {"content": "<![CDATA[<blockquote><p><b>J.R.</b> says (#13) &#8220;I am very grateful for what you do for us veterans. I promise to read more.&#8221;</p></blockquote>\n<p>J.R., any gratitude that you may feel to my STEAM-colleagues (or me) is eclipsed by the gratitude that <i>any</i> society properly owes to its veterans.  So thank <i>you</i> for <i>your</i>&nbsp;service.  </p>\n<p><b>Readings</b>&nbsp; At the top of my blog-comments, my name always links to the latest version of our &#8220;Green Sheet Seminar&#8221; notes; these notes include a stack of references that are basic to the quantum theory of atomic-resolution spin-imaging.  </p>\n<p><b>Book-in-progress</b>&nbsp; My colleagues Rico Picone and Joe Garbini and I are expanding these seminar notes into a textbook on the quantum transport mechanisms that are the physical basis of spin imaging technologies.  The writing proceeds rather slowly, but as fast as we can.  </p>\n<p>J.R., comments like (#13) encourage us to write faster.  And for this encouragement, we thank you very much.</p>\n<p><b>A further acknowledgement</b>&nbsp; Scott, your uniquely vigorous and outstandingly thoughtful essays here on <i>Shtetl Optimized</i>, together with the comments that the whole quantum community contributes, are plenty valuable and encouraging to&nbsp;every quantum researcher (including me).  Moreover, the unflagging sustainment of your collegial commitment over many years is justly deserving of everyone&#8217;s appreciation and respect.  So thank you for <i>your</i> service, Scott.</p>\n<p><b>Primary conclusion</b>&nbsp; Get those postdoc applications in the mail to&nbsp;Scott! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>&#8212;&#8212;&#8212;&#8212;&#8212;-</p>\n<p><b>PS to Amy (#14)</b> Our Green Sheet Seminar&#8217;s reading list does include STEAM-fictions; the arc of these fiction spans:</p>\n<p>• <b>An ultra-utopian world</b>&nbsp; Kathleen Ann Goonan&#8217;s &#8220;Girl in Wave: Wave in Girl&#8221; (2014), as a prelude to reading&nbsp;&hellip;</p>\n<p>• <b>A world <i>hors catégorie</i></b>&nbsp; Nnedi Okorafor&#8217;s <i>Lagoon</i> (2015), as a prelude to reading&nbsp;&hellip;</p>\n<p>• <b>An ultra-dystopian world (or is it?)</b>&nbsp; Carter Scholz&#8217; <i>Gypsy</i> (2015).</p>\n<p>At the dystopian endpoint of this narrative arc, <a href=\"http://www.locusmag.com/Reviews/2015/12/paul-di-filippo-reviews-carter-scholz/\" rel=\"nofollow\">Scholz&#8217; <i>Gypsy</i></a> is a parable that describes a dire 21st century in which our shared STEAM-narratives prove to be utterly deluded:<br />\n<blockquote>I [Scholz&#8217; chief engineer] thought it was the leaders, the nations, the corporations, the elites, who were out of touch, who didn&#8217;t understand the gravity of our situation.  I believed in the sincerity of their stupid denials&nbsp;&mdash; of global warming, of resource depletion, of population pressure.  I thought them stupid.  </p>\n<p>But if you judge them by their actions instead of their rhetoric, you can see that they understood it perfectly and accepted the gravity of it very early.  They simply gave it up as unfixable.  Moved quite purposefully and at speed toward this dire world they foresaw, a world in which, to have the amenities even of a middle-class life&nbsp;&mdash; things like clean water, food, shelter, energy, transportation, medical care&nbsp;&mdash; you would need the wealth of a prince.  You would need legal and military force to keep desperate others from seizing it.  </p>\n<p>Seeing that, they moved to amass such wealth for themselves as quickly and ruthlessly as possible, with the full understanding that it hastened the day that they feared.</p></blockquote>\n<p>Fictionally speaking, a crucial capacity that is associated to quantum research (a capacity that is a primary focus of the Green Sheet Seminar) is to help mitigate the economic,  ecological, medical, and social forces that impel our world toward Scholz&#8217; dystopian future&nbsp;&mdash;  and to realize new capabilities (medical especially) that are foundational to Kathleen Goonan&#8217;s cheerful utopia&nbsp;&mdash; necessarily embracing  Nnedi Okorafor-style transformations of individual and shared cognition along the&nbsp;way.  Uhhhh&nbsp;&hellip; hopefully! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p><b>Secondary conclusion</b>&nbsp; As Jason Nesmith&nbsp;/ Commander Peter Quincy Taggart memorably reminds us in the comedic film <i>Galaxy Quest</i> (1999): &#8220;<a href=\"https://www.youtube.com/watch?v=nF_6OfgbF7c\" rel=\"nofollow\">It&#8217;s&nbsp;all&nbsp;real</a>.&#8221;  Oh yes, it is.</p>\n]]>", "author": "John Sidles", "published": "2016-03-26 10:47:03+00:00", "title": "By: John Sidles"}]