[{"content": "It&#39;s an absurdity that is meant to balance out other absurdities, such as preserving the number of teaching days, even though the last of those teaching days is the Tuesday after Thanksgiving. Teaching on Columbus day instead wouldn&#39;t help, because it&#39;s a Monday (Harvard classes are, right now at least, either MW or TT). I think if Veterans Day falls on a Friday it will again be a non teaching day, not sure about Monday or Wednesday.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lewis:Harry.html\">Harry Lewis</a>", "published": "2014-11-11 16:56:19.259000-05:00", "title": ""}, {"content": "At Univ of MD at College Park<br />1) Nobody gets Columbus Day off<br />2) Nobody gets Veterans Day off<br />3) Everyone gets MLK day off (this used to not matter for teaching since it was between terms, but we now have a 3-week winter term for mostly 1-credit clases, so it does matter).<br />4) We used to (and maybe still do) get Veterans day off on Dec 26, Columbus day on Dec 27, Guy Fawkes day on Dec 28, etc as a way of getting the days between Christmas and New Years off<br />5) My conservative relatives thing that we DON&quot;T get Veterans and Columbus off and DO get MLK day off because we are a liberal school. I doubt thats true.<br />6) In current times most holidays are merely a day off with no meaning. Was it always this way? There was a lot more talk about MLK day when some states didn&#39;t want to celebrate it, or would celebrat Jefferson Davis day instead. Now that the controversy has died down there is much less talk of MLK<br />or MLK day. <br />7) It bothers me that Veterans day is not the second monday in Nov. I assume that Veterans want 3-day weekends like the rest of us.<br />8) Back to your post- it seems ABSURD to have a holiday that some people at a school get off but not others. <br />9) When I was at Harvard my memory is that Harvard did NOT get Patriots day off but MIT did, allegedly because Harvard was a Tory School during the revolution. Is that really true?", "author": "GASARCH", "published": "2014-11-12 10:55:15.255000-05:00", "title": ""}, {"content": "7) &quot;the eleventh hour of the eleventh day of the eleventh month&quot;<br /><br />But yeah, if no one knows that anymore, it&#39;s probably become a pretty pointless holiday.", "author": "Anonymous", "published": "2014-11-13 08:09:19.544000-05:00", "title": ""}]