[{"content": "<![CDATA[<p>BPP = NEXP #189: That&#8217;s an excellent question (I don&#8217;t mean whether BPP=NEXP, I mean what &#8220;loophole&#8221; G&ouml;del found in the Constitution).</p>\n<p><a href=\"https://d78508e2-a-97b1dc77-s-sites.googlegroups.com/a/jeffreykegler.com/morgenstern-document/Home/files/Morgenstern_onGoedelcitizenship.pdf?attachauth=ANoY7cpfpGA2IYXVkFHGXQEo6SocHydi1uucSp34dGLUpk0tLDw7nx7KWrLKBE6JQv1sNv7wtyeEDrASK5hEzXyeHV5XpWFFtroV55lCUMChS1HzsC1SEpgaayu2l1az7EowJrYJBjp6_Yqc0RnYw0I6L0CUU4S1blv1CMJ6VoY9Xv45vCFlZso58zd92qtoSRudWekaILD9Incs-bfrUtLmezQAw8zNjiuOQ4wku8_CVwOfHodv8sHQpPvWJ7E4958tudrsZrdH-EaftxhRown2E9Wkbveanw%3D%3D&#038;attredirects=0\" rel=\"nofollow\">Here&#8217;s</a> Morgenstern&#8217;s written account of the incident, which is the closest history is probably ever going to get and which unfortunately provides no details about the loophole.  You can read speculation about it <a href=\"http://io9.gizmodo.com/the-mathematician-who-showed-how-the-us-could-be-made-a-1607024259\" rel=\"nofollow\">here</a> or <a href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2010183\" rel=\"nofollow\">here</a> or <a href=\"https://www.quora.com/What-was-the-flaw-Kurt-G%C3%B6del-discovered-in-the-US-constitution-that-would-allow-conversion-to-a-dictatorship\" rel=\"nofollow\">here</a> among other places.</p>\n<p>The leading contenders seem to be:</p>\n<p>&#8211; The constitutional amendment process</p>\n<p>&#8211; The President&#8217;s ability to suspend normal constitutional protections in wartime</p>\n<p>&#8211; The commerce clause, which lets the federal government do almost anything it wants by declaring it relevant to regulating interstate commerce (indeed, that&#8217;s been the main justification that the courts have used to allow the dramatic expansion of the federal government in the 20th century)</p>\n<p>Alas, all three proposals seem to me to have the drawback of being way too obvious.</p>\n]]>", "author": "Scott", "published": "2016-06-12 11:22:39+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I really cannot understand why ultraclever people like Hawking, Tao, Aaronson, 13 nobel laureates and others are so concerned about Trump becoming a president. So lets make a poll:</p>\n<p>-Why prominent scientists are taking sides in this presidential election?</p>\n<p>A) Because #113 in US billionaires list Trump is incompetent?</p>\n<p>B) Because Trump will go to schools and give guns to young children in order to defend themselves against bad guys?</p>\n<p>C) Because Trump will put illegal immigrants, muslims and gays into concentration camps?</p>\n<p>D) Because Wall street will collapse in order for the real estate balloon to go stratospheric?</p>\n<p>E) Because Trump will close universities and fire all prominent scientists because they spread evil to the &#8216;peoples&#8217;?</p>\n<p>F) Because Trump is a bloody communist?</p>\n<p>G) Because all scientists work for the petroleum and defense lobby and want Hillary for president?</p>\n<p>H) Because Hllary&#8217;s lobby gives more money for research?</p>\n<p>I) Because Hillary has greater probability to become a president and todays &#8216;political correctness&#8217; will pay off better in the future?</p>\n<p>J) Because they didn&#8217;t like &#8216;The Apprentice&#8217; show?</p>\n<p>K) Other? (please feel free to add to the list&#8230;)</p>\n<p>P.S.<br />\nI vote for J&#8230;</p>\n]]>", "author": "George", "published": "2016-06-12 11:56:22+00:00", "title": "By: George"}, {"content": "<![CDATA[<p>BPP = NEXP #189 & Scott # 192,<br />\nI don&#8217;t know the details of Godel&#8217;s findings, but would like to add a bit to speculations. 🙂<br />\nI think there is indeed a way for legal assumption of power by one of the branches of the government, bordering on dictatorship, but the branch is judicial rather than executive. We have seen dramatic increase of judicial power throughout decades, including a perfectly legal assumption of legislature (just declare whatever law the Congress tries to pass &#8220;unconstitutional&#8221;), executive (any judge can order immediate and unlimited imprisonment for &#8220;contempt of court&#8221;), in 2000 Supreme Court decided presidential elections, etc etc etc. Given the widespread practice in US of courts definng laws by precedent and SCOTUS power to declare anthing at all constitutional or unconstitutional, the Supreme Court might as well, purely theoretically of course, legally assume dicatorial power.</p>\n]]>", "author": "Michael P", "published": "2016-06-12 15:21:04+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>Michael #194 The president appoints the military bosses who report to him. He has a much easier job to assume dictatorial power than anyone else. I think there is a suggestion in the political science literature that presidential systems are more prone to dictatorship than parliamentary ones. The US has never come close to becoming a one-man dictatorship (whatever other democratic deficits you may find) but many other countries with presidential systems have had fragile democracies. (For example in Latin America.) </p>\n<p>Scott #192: I suspect that if Gödel had had some amazing or even quirky insight that would have been preserved as part of the story. That it was not suggests it was a boring, obvious one. I suspect the amendment process. The commerce clause merely makes the federal level more powerful than intended, without threatening democracy (I suppose you could argue that turning 50 states into dictatorships is more difficult than one federation but that seems rather an indirect connection). The president&#8217;s emergency powers are mostly implied or extra-textual and I am not sure anyone would be lead to consider them by reading the text. The amendment process is an obvious potential risk however.</p>\n]]>", "author": "Jr", "published": "2016-06-12 16:13:35+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p><i>&#8220;I felt certain in 2000 that Bush would be a disaster for the world. Yet if you’d asked me: “what exactly is the bad thing you expect will happen?,” I couldn’t have said.  </p>\n<p>And yet electing him did have horrible consequences. There was, it turned out, a tight connection between the way he talked, the way he thought, and the way he acted.&#8221; </i></p>\n<p>In my opinion, this is the strongest argument I&#8217;ve heard made against a Trump presidency. Very eloquent &#8211; I wish this was the totality of your original post, Scott.</p>\n<p>At extreme moments in history, the president is uniquely positioned to influence events. Off the top, consider isolationism vs. involvement in WW2, abolition, desegregation, 9/11. </p>\n<p>Not all presidents have faced such monumental decision points. But when they arise, we want the best possible person at the steering wheel.</p>\n<p>So it&#8217;s not about predicting the future and stating &#8220;Donald Trump is unqualified because he will commit action X upon being elected&#8221;.</p>\n<p>Rather, people should ask themselves something along the lines of: &#8220;Would I rather have Donald or Hillary making decisions during an event similar to the Cuban missile crisis?&#8221;</p>\n]]>", "author": "DownWithTheLegoPatriarchy@gmail.com", "published": "2016-06-12 18:37:52+00:00", "title": "By: DownWithTheLegoPatriarchy@gmail.com"}, {"content": "<![CDATA[<p>By the way, Scott, I retract the suggestion that you are &#8220;devoted&#8221; to the constitution. I was reacting to what I see as a common tendency of American political debate, and as I perceived it found in points 1 and 3 of your list, to refer to the constitution rather than directly to the political principles one wants to protect. In Sweden one might profess ones support for free speech but one would do so directly most likely, not refer to article 10 of the ECHR or the Freedom of the Press Act. I see that as more honest, since most people care about the actual policy, not what the best interpretation of a legal document might be.</p>\n<p>I am reading now about the tragic news from Orlando. I don&#8217;t want to seem insensitive, but it is clear that it might have political impact. Trump might try to exploit the tragedy but the counter-argument must be that it shows the dangers of homophobia and other bigotry, which can hardly help Trump.</p>\n]]>", "author": "Jr", "published": "2016-06-12 19:41:52+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p><a href=\"http://www.nbcnews.com/politics/2016-election/legal-scholar-trump-s-muslim-ban-may-be-constitutional-n484981\" rel=\"nofollow\">http://www.nbcnews.com/politics/2016-election/legal-scholar-trump-s-muslim-ban-may-be-constitutional-n484981</a></p>\n]]>", "author": "szopen", "published": "2016-06-12 19:50:48+00:00", "title": "By: szopen"}, {"content": "<![CDATA[<p>I haven&#8217;t looked into the matter closely, but Stephen Hawking writes (in &#8220;God Created the Integers&#8221;), that Godel&#8217;s concern was with the president&#8217;s power of recess appointments. He gives Morgenstern as the source for this.</p>\n]]>", "author": "jonathan", "published": "2016-06-12 20:16:43+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>Just curious&#8230; Does it matter to the respondents to this post whether rising wages in the places that are taking U. S. manufacturing jobs is a net plus for worldwide human happiness and well being?</p>\n<p>And if free movement of goods and free movement of capital is good economic policy, why would free movement of labor not be good economic policy?</p>\n<p>Might it not be the case that the prosperity the U. S. enjoyed from the end of World War Two to the oil shocks of the 1970s might be the anomaly?</p>\n<p>Regarding identity politics, why was it okay to enslave African-Americans and deny women basic rights?  Because of identity politics.  I think that once you introduce identity politics you can&#8217;t un-introduce them.  To complain about political correctness, social justice warriors and the like is to ignore history.  People who were at any one time in history persecuted for their group affiliations don&#8217;t forget that persecution.  To ask African-Americans, Native Americans or women to renounce their hostility to and mistrust of white men is to ask them to pretend that the persecution never happened.</p>\n]]>", "author": "Michael Murden", "published": "2016-06-12 21:17:19+00:00", "title": "By: Michael Murden"}, {"content": "<![CDATA[<p>@adam #164<br />\nyes, to say that Einstein was &#8220;advocating against the atomic bomb before it was dropped on Japan&#8221; is incorrect.</p>\n]]>", "author": "anonymous", "published": "2016-06-12 22:08:18+00:00", "title": "By: anonymous"}, {"content": "<![CDATA[<p>9/11 and the financial collapse would have happened under Clinton or Obama but the emotional response would have been far more mature. That&#8217;s a very big part of leadership. You&#8217;re looking for a father for the nation (or mother I suppose).</p>\n]]>", "author": "keith", "published": "2016-06-13 01:31:56+00:00", "title": "By: keith"}, {"content": "<![CDATA[<p>Michael Murden (Comment #200). You and all the people who think like you, need to scream your message from every rooftop. You&#8217;ll drive millions of traditionally left of center voters to vote for Donald Trump.</p>\n]]>", "author": "AnonLeftyForTrump", "published": "2016-06-13 01:57:19+00:00", "title": "By: AnonLeftyForTrump"}, {"content": "<![CDATA[<p>1. Don&#8217;t conflate Internet &#8220;feminists/civil rights/[whatever] activists&#8221; with actual people. Internet political &#8220;discussions&#8221; have been nothing but echo chambers for PR sock puppets since 2003. </p>\n<p>2. I&#8217;m starting to think that three Ukrainian conspiracy theories are right: (a) Russia&#8217;s trying to incite a color revolution in America using the NED color revolution playbook; (b) Trump&#8217;s controlled by the FSB; and (c) the Oath Keepers are a Russian Fifth Column. The anti-Muslim/anti-feminist/anti-TPP/pro-nativism/GTFO-of-Pipelineistan combo is just a *bit* too convenient for Putin&#8230;</p>\n<p>3. I bet you an autographed copy of <i>Death by Black Hole</i> that Trump and/or Clinton will be forced out of the race after their conventions but before the November election. </p>\n<p>Furthermore, if #3 happens, I strongly suspect that (a) Christie will replace Trump, and/or (b) a Biden/Warren/Gore ticket will be chosen to replace Clinton. (Needless to say, Clinton will walk away with a sweetheart deal.)</p>\n]]>", "author": "Ola Hoya Paranoia", "published": "2016-06-13 03:04:27+00:00", "title": "By: Ola Hoya Paranoia"}, {"content": "<![CDATA[<p>@Michael #200: I do not know any African Americans or Native Americans but I do know many women and none of them have any hostility or particular mistrust of white men. Social justice warriors more stir up a hostility that does not exist before, than react to a pre-existing one. </p>\n<p>I also don&#8217;t understand why mention white men in particular. Women, if we accept they have been oppressed by men, which I don&#8217;t, have been oppressed by plenty of men of other skin colors and white. Nearly all cultures have been male-dominated and western culture has not been the worst in its treatment of women. </p>\n<p>I also note that slavery of black Africans was very widespread in Muslim/Arab culture. Do you think African-Americans should mistrust Arab men? </p>\n<p>Finally, you are on dubious ground with your claim about enslavement. Slavery was a complicated institution, practiced in many cultures and not always based in any racial prejudice. The above mentioned Arab slave trade, which was as cruel in many ways as the Western one, was not motivated by racism. Many women were openly used as sex slaves and the children born of these unions were accepted, unlike the racist reaction to mixed-race offspring in America.</p>\n<p>Even for American slavery, it is more true to say that slavery caused racism, than the other way around. Originally slaves were taken from Africa because of practical reasons (there being willing sellers among African rulers) and religion (they were not Christian and thus could be enslaved). Only later did an elaborate racial ideology arise.</p>\n]]>", "author": "Jr", "published": "2016-06-13 08:47:39+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p>@TrumpSupporter #184 &#8211; I don&#8217;t think anyone is saying he can simply &#8220;crown himself emperor.&#8221; But it&#8217;s not that hard to imagine paths he could take to become a dictator that people like Clinton could not. Trump is great at commanding a mob, and has no compunctions about encouraging them to use violence. He promised to use his money to  legally defend his supporters who engaged in it. The notion of him having the power of a Presidential pardon is terrifying. I could easily see him wanting to pass legislation that would greatly expand executive power, and when Congress pushes back, he encourages his supporters to show up outside congress to &#8220;show support,&#8221; and if they get a little carried away, don&#8217;t worry, he can pardon them. Nobody else who was running can command that kind of fanatical support, except maybe Sanders, and he seems principled enough not to use it.</p>\n<p>Do you really think that this is not in Trump&#8217;s character? It&#8217;s not like the encouragement of mob violence is the first indication he&#8217;s given. He&#8217;s shown every sign of being this sort of person. He has a long history of abusing the legal system by filing frivolous but ruinously expensive lawsuits against people who say things he doesn&#8217;t like. Having him in office would give him freedom to actually write and pass laws to punish people who do it.</p>\n<p>I&#8217;m pretty cynical about politics, I think pretty much every politician would choose to become a dictator if they were unconstrained, but there are lots of systematic constraints that stop them. Trump is untethered to existing power structures in a way that no other politician has been. In the best case scenario, that could leave him free to pursue great policies that no other politician could touch, but we haven&#8217;t seen anything like that from him. No great policy suggestions, or indication that he has a grasp of policy at all. What we have seen from him are all the hallmarks of authoritarians, and in the worst case scenario, that&#8217;s exactly how we&#8217;ll see him behaving. </p>\n<p>To steal a thought experiment from Sam Harris, imagine you have a crystal ball that tells you what happened four years from now. It can&#8217;t tell you who was elected, just what happened. What you see is absolute catastrophe, would you bet that this means Clinton or Trump was elected?</p>\n]]>", "author": "Graham", "published": "2016-06-13 11:24:51+00:00", "title": "By: Graham"}, {"content": "<![CDATA[<p>I&#8217;ll just mention one thing&#8211; Trump&#8217;s cruelty. I didn&#8217;t see that &#8216;feature&#8217; of his political personality right away, but I think now that it explains part of his attraction. It&#8217;s ugly to say, but I think there&#8217;s a significant part of the Trump constituency that admires him because he&#8217;s cruel and gets away with it.</p>\n<p>Just consider his &#8216;plan&#8217; to go after the families of suspected terrorists&#8211; explicitly, it&#8217;s &#8216;Do what I want or I&#8217;ll kill your mother&#8217;. So.</p>\n]]>", "author": "MattF", "published": "2016-06-13 13:13:06+00:00", "title": "By: MattF"}, {"content": "<![CDATA[<p>The rise of Donald Trump is indeed very concerning. It is good to see high-profile scientists engaging with this issue and making their voices heard!</p>\n<p>Coincidentally, on the other side of the ocean a different kind of apocalypse is looming &#8211; the upcoming &#8220;Brexit&#8221; vote. This too has become serious enough for high-profile scientists to raise alarm! Here is a link to Tim Gowers&#8217; post arguing for the case of &#8220;in&#8221;:</p>\n<p><a href=\"https://gowers.wordpress.com/2016/06/02/6172/\" rel=\"nofollow\">https://gowers.wordpress.com/2016/06/02/6172/</a></p>\n]]>", "author": "Mris Ozols", "published": "2016-06-13 16:48:13+00:00", "title": "By: Māris Ozols"}, {"content": "<![CDATA[<p>Māris #208: I confess that I don&#8217;t have feelings about Brexit nearly as strong as my feelings about Trump.  I.e., I&#8217;m not sure that either choice would be &#8220;apocalyptic,&#8221; and whatever feelings I have, they&#8217;re not strong enough for me to feel like telling the people of a faraway island what to do. 🙂</p>\n<p>Thanks very much for the link to Timothy Gowers&#8217; post!  As expected, he makes a very strong case for &#8220;in,&#8221; and I appreciate his laying the case out so clearly from his perspective.</p>\n<p>On the other hand, when I visited David Deutsch on my recent trip to Oxford, I learned that Deutsch is a strong Brexit supporter (something I could also have learned from Deutsch&#8217;s <a href=\"https://twitter.com/DavidDeutschOxf?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" rel=\"nofollow\">Twitter feed</a>).  Deutsch&#8217;s arguments appealed to the existence of something distinctive and individual-freedom-valuing in the British national character, the thing that enabled Britain to fight Nazism even while the rest of Europe succumbed to it (besides, of course, Britain being an island 🙂 ).  Of course, that&#8217;s a perspective diametrically opposed to the unabashed internationalism of Timothy Gowers&#8217; post (&#8220;I also have far more in common with a random European academic, say, than I do with a random inhabitant of the UK&#8221;).  I guess I see something in both.  So, uh &#8230; may the voters of Britain choose wisely!</p>\n]]>", "author": "Scott", "published": "2016-06-13 17:30:01+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>The condemnation of Trump&#8217;s embrace of abusive and cruel rhetoric (by Graham in #206 and Mattf in #207) extends to Trump&#8217;s notorious advocacy of torture as state policy.  </p>\n<p>To many people (including me) public advocacy of torture is&nbsp;entirely disqualifying for any job that requires:</p>\n<p>&nbsp;&nbsp;&nbsp;• supreme command of the armed services<br />\n&nbsp;&nbsp;&nbsp;• executive direction of the intelligence agencies<br />\n&nbsp;&nbsp;&nbsp;• nominations to the Supreme Court<br />\n&nbsp;&nbsp;&nbsp;• prosecutorial discretion and pardoning power<br />\n&nbsp;&nbsp;&nbsp;• visits to the wounded at Walter Reed</p>\n<p>In Trump there is no shortfall of rationality, but rather a shortfall of empathy so profound that Trump himself is utterly unconscious of this shortfall.</p>\n<p>It is regrettable too, that the self-proclaimed &#8220;Party of Lincoln&#8221; should nominate a candidate who is so entirely unconscious of Lincoln&#8217;s General Order 100 (formally &#8220;Instructions for the government of armies of the United States in the field&#8221;, also known as &#8220;the Lieber Code&#8221;):<br />\n<blockquote>Men who take up arms against one another in public war do not cease on this account to be moral beings, responsible to one another, and to God.  </p>\n<p>Military necessity does not admit of cruelty, that is, the infliction of suffering for the sake of suffering or for revenge, nor of maiming or wounding except in fight, nor of torture to extort confessions. It does not admit of the use of poison in any way, nor of the wanton devastation of a district. </p>\n<p>It admits of deception, but disclaims acts of perfidy; and, in general, military necessity does not include any act of hostility which makes the return to peace unnecessarily difficult.</p></blockquote>\n<p>Every officer of every US military service is instructed in Lincoln&#8217;s General Order 100 and its history; it is disqualifying that Donald Trump, or any other political leader who aspires to responsibility for military and intelligence oversight, should be so woefully, willfully, and arrogantly ignorant of it.</p>\n]]>", "author": "John SIdles", "published": "2016-06-13 19:02:45+00:00", "title": "By: John SIdles"}, {"content": "<![CDATA[<p>Hi Scott, </p>\n<p>Regarding your original post, the answer you can give to your daughter after Trump destroys this country: those who voted for Trump are just not the same demographics that you or Terry Tao or Stephen Hawkins or even Edward Witten could possibly reach. It looks like Trump voters are almost exclusively from the not-very-well-educated wing of Republican Party:</p>\n<p><a href=\"http://fivethirtyeight.com/features/the-key-to-the-gop-race-the-diploma-divide/\" rel=\"nofollow\">http://fivethirtyeight.com/features/the-key-to-the-gop-race-the-diploma-divide/</a></p>\n<p>If Trump supporters hear that the above mentioned academicians are warning against the dangers of electing Trump all they would say would be: &#8220;Scott who? Terry who? Stephen who? Edward who?&#8221;</p>\n<p>It seems they the best way to prevent Trump from winning is to gain support of popular football players, not scientists&#8230;</p>\n]]>", "author": "Michael P", "published": "2016-06-13 20:37:24+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>Michael #211: Yes, my post itself made that same (obvious) point.  That someone has a moral duty to say something, doesn&#8217;t imply that their saying something will convince many people!</p>\n<p>Of course, it&#8217;s not just scientists who&#8217;ve denounced Trump.  From a few minutes of googling, here&#8217;s a very incomplete list of the celebrities who&#8217;ve done so, counting only ones who I&#8217;ve personally heard of, and excluding anyone who&#8217;s <i>mostly</i> known for politics or liberal activism:</p>\n<p>Chris Brown, Russell Simmons, Chrissy Teigen, Muhammad Ali (before he died), Stephen King, Jack Black, Sarah Silverman, Samuel L. Jackson, Chelsea Handler, Cher, Ben Stiller, J. K. Rowling, George Clooney, Jennifer Lawrence, Johnny Depp, Miley Cyrus, Louis C. K., Shakira, Richard Gere, Susan Sarandon, Rosie O&#8217;Donnell, Bette Midler, Lady Gaga, Ricky Martin, Matt Damon, Neil Young, Tim Allen, Salma Hayek.</p>\n<p>Of course, none of them seem to have had a huge impact either! 🙂  (Or would Trump&#8217;s support be even greater without their denunciations?  It seems rather doubtful&#8230;)</p>\n<p>I do note that Trump has done surprisingly well with sports stars (Mike Tyson, Tom Brady, etc).  So maybe the issue is indeed that we need fewer denunciations from Hollywood, and more from the NFL and NASCAR?</p>\n]]>", "author": "Scott", "published": "2016-06-13 21:14:16+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scot #212: More and more people like Trump because they want change, they want real change. They want the good old &#8216;american dream&#8217; back. They don&#8217;t want to work 10-15 hours a day just to pay their loans and eat a plate of food. They want the present inequality to end. Trump is clear and understandable in his speech as he addresses those problems. His words might seem simple and crude but that&#8217;s what the people like to hear.</p>\n<p>The question is still:<br />\nWhy scientists &#8220;denounce&#8221; Trump. What change will bring to their lives? You are 1 in a million, maybe 1 in 10 million talents that you can work for 6 figures everywhere in the world, anytime you want. What is your (plural) problem with Trump? How much more he can f.k up things than the previous presidents?</p>\n]]>", "author": "George", "published": "2016-06-13 22:05:02+00:00", "title": "By: George"}, {"content": "<![CDATA[<blockquote><p><b>George</b> (#213) describes scientists as &#8220;1 in a million&#8221;</p></blockquote>\n<p>The US Census Bureau&#8217;s &#8220;Disparities in STEM Employment by Sex, Race, and Hispanic Origin: American Community Survey Reports&#8221; provides in &#8220;Table 4. Selected Characteristics by Employment in STEM Occupations: 2011&#8221; the following figures on aggregate US STEM employment:</p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp; 007,227,620&nbsp; [STEM employed (direct)]<br />\n&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp; 007,829,769&nbsp; [STEM-employed (related)]<br />\n&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp; 101,387,919&nbsp; [non-STEM employed]<br />\n&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp; 116,445,308&nbsp; [total]</p>\n<p>Thus the total number of STEM-employed (eligible) voters is about 15% of total employed (eligible) voters.</p>\n<p>Under the three plausible assumptions of (1)&nbsp;high voting rates for the STEM-employed cohort, and (2)&nbsp;pronounced aversion to Trumpian STEM-denialism, and (3)&nbsp;strong influence of STEM-professionals among family and friends,  Fermi-estimate of the number of anti-Trump STEM-voters is 10-30 &nbsp;million.</p>\n<p>This anti-Trump STEM-voter cohort is comparable in size to the landslide victory margins of Roosevelt, Eisenhower, Johnson, Nixon, Reagan, and Clinton over (respectively) Landon, Stevenson, Goldwater, McGovern, Mondale, and Dole. </p>\n<p><b>Conclusion</b>&nbsp; The cohort of STEM-employed US voters&nbsp;&mdash; a cohort having good reason to &#8220;<a href=\"https://terrytao.wordpress.com/2016/06/04/it-ought-to-be-common-knowledge-that-donald-trump-is-not-fit-for-the-presidency-of-the-united-states-of-america/#comment-469653\" rel=\"nofollow\">speak up early, speak up plainly, and speak up loudly</a>&#8221;&nbsp;&mdash; numbers sufficiently many (if&nbsp;unified) as to ensure the defeat of Trumpian ideology in a landslide. </p>\n<p>Thanks are extended to <i>Shtetl Optimized</i> and many other STEM-related blogs, for speaking out early, plainly, and loudly, and for encouraging and enabling individual members of the STEM community to speak out early, plainly, and loudly.</p>\n]]>", "author": "John Sidles", "published": "2016-06-13 23:44:30+00:00", "title": "By: John Sidles"}]