[{"content": "<![CDATA[<p>This is great news! </p>\n<p>It also shows that Google&#8217;s interest in quantum computing starting with cooperation with D-wave was actually (if I may say, as I expected,) positively correlated (and not negatively correlated) with interest in other quantum computing endeavors.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2014-09-08 07:59:36+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>About the Google press release:</p>\n<p>&#8220;With an integrated hardware group the Quantum AI team will now be able to implement and test new designs for quantum optimization and inference processors based on recent theoretical insights as well as our learnings from the D-Wave quantum annealing architecture.&#8221;</p>\n<p>Does it mean that the work done by Martinis now &#8220;belongs&#8221; to the private sector?</p>\n]]>", "author": "fred", "published": "2014-09-08 13:36:54+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>To add on #34</p>\n<p>What is the exact nature of the relationship?<br />\n&#8220;We are pleased to announce that John Martinis and his team at UC Santa Barbara will join Google in this initiative&#8221;<br />\nWhat do they mean by &#8220;join&#8221;?<br />\nWill there be any impact on the publication of results and openness, etc?</p>\n]]>", "author": "fred", "published": "2014-09-08 13:50:59+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Right on Fred. I also would like to know if this means that &#8220;learnings&#8221; is now a real word.</p>\n]]>", "author": "rrtucci", "published": "2014-09-08 14:22:57+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>I believe that the New York Times hasn&#8217;t reported this Martinis/Google news yet. I hope it&#8217;s because they first want to get some much needed clarification from Neven. I hope they are reading these blog comments and intend to answer some of the questions asked here about Google&#8217;s intentions. Hmm, Can one comment on a NYT article before it has been written?</p>\n]]>", "author": "anonymous", "published": "2014-09-08 17:01:37+00:00", "title": "By: anonymous"}, {"content": "<![CDATA[<p>joe #27: <a href=\"http://arxiv.org/pdf/1407.8183v1.pdf\" rel=\"nofollow\">That paper</a> was discussed at our weekly quantum information group meeting, and I remember there was a consensus that one of the conditions they assumed (I <i>think</i>, that you need a polynomial upper bound on the number of states on which the driver Hamiltonian acts nontrivially?) could severely limit the method&#8217;s practical relevance.  But I don&#8217;t remember the details.  If I remember to, I&#8217;ll ask again next time and get back to you.</p>\n<p><b>Update:</b> It&#8217;s worse than that.  As it turns out, Ed Farhi proved that the above-mentioned condition <i>implies</i> that the spectral gap will be exponentially small, basically because it triggers the BBBV lower bound for the Grover search problem.  So then you use this method to calculate the gap, and lo and behold, you find out that the gap is exponentially small.  It would be a bit like if you had a fast factoring algorithm, but it only worked for positive integers N satisfying certain conditions, and those conditions turned out to imply that N was prime.</p>\n]]>", "author": "Scott", "published": "2014-09-08 17:05:49+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott 38: Thanks for checking that out. That assessment appears consistent with some things that struck me in their paper: 1.) Figure 1 seems to show exponentially small gaps at one point in the annealing; 2.) Figure 2 shows only the Grover sqrt speedup, and nothing more (and presumably if they found a nontrivial, unexplored problem class that got a better speedup they would have presented it!</p>\n]]>", "author": "joe", "published": "2014-09-09 02:09:42+00:00", "title": "By: joe"}, {"content": "<![CDATA[<p>Good video, but almost exclusively male characters <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_sad.gif\" alt=\":(\" class=\"wp-smiley\" /></p>\n]]>", "author": "Ann", "published": "2014-09-09 20:16:31+00:00", "title": "By: Ann"}, {"content": "<![CDATA[<p>1)  I will say you were correct no matter what happens.<br />\n2) Your point of view has always been reasonable- call out bad science when warranted (and, alas, when asked to&#8212; which is one of the reasons you end up talking about D-wave more than&#8230; more than you want to is my guess), and promote good science when it happens<br />\n(even if that is less fun).<br />\n3) Jon Stewart: Fox News  == Scott Aaronson:D-wave.<br />\n(Wonder how it would be if Jon Stewart called out D-wave and Scott Debunked Fox News?)</p>\n]]>", "author": "gasarch", "published": "2014-09-10 16:32:02+00:00", "title": "By: gasarch"}, {"content": "<![CDATA[<p><a href=\"http://vzn1.wordpress.com/2014/09/10/google-ups-ante-and-hedges-qm-computing-bet-by-buying-up-martinis-lab/\" rel=\"nofollow\">google ups ante and hedges qm computing bet by buying up martinis lab</a><br />\ncollected links, videos, news, articles, etc, other stuff on TCS + physics</p>\n]]>", "author": "vzn", "published": "2014-09-10 23:42:26+00:00", "title": "By: vzn"}, {"content": "<![CDATA[<p>1. Fox News == D-Wave: That is an inspired comparison. </p>\n<p>2. &#8220;call out bad science when warranted (and, alas, when asked to— which is one of the reasons you end up talking about D-wave more than… more than you want to is my guess), and promote good science when it happens (even if that is less fun).&#8221;: </p>\n<p>This is an important task for the progress of science. Of the few  knowledgeable enough to do this effectively, Scott is one of few^2 who does not duck this chore. And it is a hard chore, requiring enormous effort, and drawing tons of uninformed criticism, which I hope Scott can learn to totally ignore. RO says: hang in there and keep up the good work.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-09-11 04:49:45+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Scott, you saw this?</p>\n<p><a href=\"http://spectrum.ieee.org/tech-talk/semiconductors/optoelectronics/quantum-photonics-on-a-single-chip\" rel=\"nofollow\">http://spectrum.ieee.org/tech-talk/semiconductors/optoelectronics/quantum-photonics-on-a-single-chip</a></p>\n]]>", "author": "fred", "published": "2014-09-11 20:39:39+00:00", "title": "By: fred"}]