[{"content": "<![CDATA[<p>a #56: Well, maybe it will <i>also</i> age white&#8212;give it time!  (Indeed, I may have developed white hairs just within the last month&#8230;)</p>\n]]>", "author": "Scott", "published": "2015-01-26 11:39:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Congratulations.</p>\n]]>", "author": "Jr", "published": "2015-01-26 11:47:38+00:00", "title": "By: Jr"}, {"content": "<![CDATA[<p><a href=\"http://www.scottaaronson.com/blog/?p=2189#comment-407056\" rel=\"nofollow\">Anonymous 48</a>, asdf made a false claim about second language acquisition, so I responded with real data about second language acquisition, which I explicitly labeled as about foreign languages. asdf claimed that children lose their &#8220;amazing&#8221; ability to learn languages around age 12. This is completely false. 8 year olds are slower at learning new languages than 14 year olds, who are slower than 20 year olds.</p>\n<p>I have read about the &#8220;critical period hypothesis.&#8221; There is a critical period for the recognition and production of sounds. Linguists often make the very narrow claim that there is a critical period for learning a first language, meaning merely that if a child does not learn any language before, say, age 12, then the child will never learn a language. This claim is plausible, but based on very little data. It is also not relevant to anything.</p>\n<p>If you claim that there is a critical period for first language learning says something about the difference between learning one language and learning two, not the difference between zero and one, can you say what you mean? Many people make such a vague claim, but no one has ever made a concrete claim to me. When I push linguists and psychologists on it, they usually retreat to the two standard hypotheses, or admit that they have no idea what the textbook was talking about. Nor has anyone provided me with data from which I can extract my own claim.</p>\n<p>And if you do want to claim that very young children are good at learning languages (outside of sounds), you have to be very careful what you mean. By naive measures, they are terrible. An adult immersed for six months in a foreign language will have a greater vocabulary than a five year old native speaker. Is it fair to say that the adult learned 30x as fast? Mainly the child was learning the very concept of language and the abstractions behind those words. The adult will use more complex grammar and make fewer grammatical mistakes, which is a more fair comparison, but still problematic. If you just want to say that it is a miracle that the child learns a language while simultaneously learning what language is and learning so much about thew world, sure, whatever. But that says nothing about whether learning additional languages is a good idea.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Knight:Douglas.html\">Douglas Knight</a>", "published": "2015-01-26 17:41:22+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>FWIW, here&#8217;s what Mark Rosenfelder has to say about the subject: <a href=\"http://www.zompist.com/whylang.html\" rel=\"nofollow\">http://www.zompist.com/whylang.html</a></p>\n<p>(Not really competent to evaluate this, but thought it might be worth introducing.)</p>\n]]>", "author": "Sniffnoy", "published": "2015-01-27 01:09:57+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Scott, re. your #36, floating on your back in a nice deep bath is a great way to get comfortable being in water without floats; it solves the taking-off-the-training-wheels problem that can make learning to swim unaided quite scary.<br />\nShe might be a little old for it now, and some people just aren&#8217;t buoyant, but it really helps build confidence. </p>\n<p>Much better than learning to kick around in floaties, then getting scared when it&#8217;s time to take them off, which I&#8217;ve seen a lot of kids have trouble with.</p>\n]]>", "author": "Eggo", "published": "2015-01-27 03:29:33+00:00", "title": "By: Eggo"}, {"content": "<![CDATA[<p>I have often asked parents of a 1-year old, jokingly, if the child is good at math. </p>\n<p>At what age can you tell if a child has talents at Math? Music?<br />\nOther things?</p>\n<p>At what age can you tell if a child has an interest in Math? Music? My little Pony? Other things?</p>\n]]>", "author": "GASARCH", "published": "2015-01-27 13:21:31+00:00", "title": "By: GASARCH"}, {"content": "<![CDATA[<p>Douglas Knight comment #48: &#8220;An adult immersed for six months in a foreign language will have a greater vocabulary than a five year old native speaker.&#8221; I am not sure. </p>\n<p>My experience (which is statistically irrelevant): when I was 6, me and my family went to France (from Italy). We spent 2 years there, my father working at the University, my mother caring about me and my little brother (and constantly interacting with French people speaking French *only*), and myself attending grade school. My French vocabulary quickly grew from 0 to N (very large). Of course I could not learn words and expressions &#8220;for adults only&#8221;, but in general my vocabulary quickly became richer than my parents&#8217; one (and their vocabulary did not start from 0!).<br />\nMy brother was 1 when we wen to France. At 3, he was able to speak French, him too (not to write or read complex statements, of course). Later, he studied French at school in Italy (I did not! I chose English). Today, we both speak, read and write in French very well (we practice with French friends, sometimes).</p>\n<p>In 2013, I spent 6 months in France, as a visiting researcher (history repeating..). To French people I met, I always had to tell I am Italian, as the usual impression was that I was French &#8211; just coming from another French university. I am neither a genius, nor particularly talented for languages. I strongly feel that my French could not be so good, if I had to learn it at 10, 20, or 30. Maybe I am wrong, but I think an important aspect is the &#8220;accent&#8221;. When you are a little kid, you do not have (yet) any particular accent. So, if you interact with people speaking different languages, you may learn (for life) their different accents more easily.</p>\n<p>@ Scott, wonderful post and congratulations!</p>\n]]>", "author": "Michele", "published": "2015-01-27 15:53:09+00:00", "title": "By: Michele"}, {"content": "<![CDATA[<p>Apropos of GASARCH #63, I recently came across the following intriguing publication of the American Mathematical Society:</p>\n<p><i>Math from Three to Seven: The Story of a Mathematical Circle for Preschoolers</i> by Alexander Zvonkin (Université Bordeaux I, Talence, France), AMS-MSRI Publications, 2011.</p>\n<p>You can see large chunks of it at Google Books:</p>\n<p><a href=\"https://books.google.com/books?id=iTN-AwAAQBAJ&#038;printsec=frontcover&#038;source=gbs_ge_summary_r&#038;cad=0#v=onepage&#038;q&#038;f=false\" rel=\"nofollow\">https://books.google.com/books?id=iTN-AwAAQBAJ&#038;printsec=frontcover&#038;source=gbs_ge_summary_r&#038;cad=0#v=onepage&#038;q&#038;f=false</a></p>\n<p>Quite a bit of highly nontrivial mathematical concepts are introduced to the kiddies, providing some actual basis for those good ol&#8217; Cold War hyperbolic worries that at least some Russian kindergarteners were more mathematically proficient than the median American undergrad.  </p>\n<p><i>Sidenote</i>: This *was* a general fear, right?  I cannot have been the only American undergrad to have heard his professor half-jokingly-yet-half-ruefully exclaim:  &#8220;This is simple!  SIMPLE!  Russian kindergartener could do it!&#8221;, can I?</p>\n<p>Seriously though, here&#8217;s the introduction written by the book&#8217;s translator:</p>\n<blockquote><p>\nThis book is a captivating account of a professional mathematician&#8217;s experiences conducting a math circle for preschoolers in his apartment in Moscow in the 1980s. As anyone who has taught or raised young children knows, mathematical education for little kids is a real mystery. What are they capable of? What should they learn first? How hard should they work? Should they even &#8220;work&#8221; at all? Should we push them, or just let them be? There are no correct answers to these questions, and the author deals with them in classic math-circle style: he doesn&#8217;t ask and then answer a question, but shows us a problem&#8211;be it mathematical or pedagogical&#8211;and describes to us what happened. His book is a narrative about what he did, what he tried, what worked, what failed, but most important, what the kids experienced.</p>\n<p>This book does not purport to show you how to create precocious high achievers. It is just one person&#8217;s story about things he tried with a half-dozen young children&#8230;\n</p></blockquote>\n<p>I&#8217;ll close just by saying that while those last 2 sentences must be borne in mind &#8212; i.e., the book fundamentally is &#8220;just&#8221; a detailed diary of one mathematician trying a bunch of things over the course of 4 years with 6 children &#8212; the mathematician in question is well-read in some child development literature and is quite observant himself, and so the fact this is all anecdotal doesn&#8217;t mean it ain&#8217;t highly interesting.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kaminsky:Bill.html\">Bill Kaminsky</a>", "published": "2015-01-27 16:01:51+00:00", "title": "By: Bill Kaminsky"}, {"content": "<![CDATA[<p>Douglas Knight #60: </p>\n<p>If we&#8217;re talking about second language acquisition, children gain fluency much faster, and I&#8217;ve seen living evidence of this everywhere around me throughout my life. Try talking to immigrants with children (assuming they immigrated to their new country before the kids reached puberty): I expect all of them to tell you that their children became fluent in English in very little time while their own (adult) English never reached a comparable level even though they started out knowing (significantly) more English than their kids did. I&#8217;m one data point myself: I knew no English in the first few years of elementary school, and then it became my dominant language in grade 5 (one to two years after I left my country of birth) to the point where I stopped speaking my native language at home, whereas my parents still speak broken ungrammatical English to this very day (almost two decades later) even though they&#8217;ve had no less exposure to English. I don’t recall actively “trying” to learn English because I didn’t memorize words or grammatical constructions; hearing the language around me for a year was simply good enough. My parents, on the other hand, still couldn’t gain grammatical competence despite attending English universities and living in an English environment, and my family’s story is unremarkable because it’s the same as everyone else&#8217;s. I therefore believe that there is a critical period for acquiring grammatical competence. </p>\n<p>If you&#8217;re looking for more scientific evidence, I remember some relevant papers that I read a while ago for a course on bilingualism. My interpretation of the “critical period hypothesis” is not the same as yours; maybe there are different versions of it floating out there. Just now, I looked up the papers that I was thinking of:</p>\n<p>&#8211; Newport, E. L. (1990), Maturational Constraints on Language Learning. Cognitive Science, 14: 11–28<br />\n(<a href=\"http://onlinelibrary.wiley.com/doi/10.1207/s15516709cog1401_2/abstract\" rel=\"nofollow\">http://onlinelibrary.wiley.com/doi/10.1207/s15516709cog1401_2/abstract</a>) </p>\n<p>&#8211; Lardiere, D. (2006) Establishing ultimate attainment in a particular second language grammar, in Z.H.. Han & T. Odlin (eds.) Studies of fossilization in second language acquisition, 35–55. Clevedon: Multilingual Matters</p>\n<p>I think the latter article looked at how an adult’s grammar became fossilized, and here’s a snippet from the first paper above: “Normal language learning occurs only when exposure to the language begins early in life. With exposure beginning later in life, asymptotic performance in the language declines: the effects over age of first exposure are approximately linear through childhood, with a flattening of the function in adulthood.”</p>\n]]>", "author": "Anonymous", "published": "2015-01-27 17:35:45+00:00", "title": "By: Anonymous"}, {"content": "<![CDATA[<p>Douglas Knight comment #48:</p>\n<p>The value of learning more than one language in early childhood goes very far beyond the usefulness of the learned language. </p>\n<p>The child learns how to look at things from different (verbalized) viewpoints; learns the difference between the concepts and the names of the concepts thus learning instinctively a bit of philosophy and becoming less likely to be fooled by a wordplay; gains the ability to understands things that are better expressible on one language than the other, etc. </p>\n<p>IMO the ability to speak another language is just a pleasant side effect of the cognitive benefits provided by learning the second language, as in Sapir-Whorf <a href=\"http://en.wikipedia.org/wiki/Linguistic_relativity\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Linguistic_relativity</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/p/P:Michael.html\">Michael P</a>", "published": "2015-01-27 17:57:07+00:00", "title": "By: Michael P"}, {"content": "<![CDATA[<p>Bill Kaminsky  #65. It&#8217;s  a lovely book but if you haven&#8217;t, read the end notes about what came of the children. The upshot is that the children of mathematicians went on to do math or math related things and the others didn&#8217;t.  One moral for me is that you don&#8217;t teach your children so that they will learn what you have taught them.  The point of the lesson is the lesson itself.</p>\n]]>", "author": "dorothy", "published": "2015-01-28 16:12:47+00:00", "title": "By: dorothy"}, {"content": "<![CDATA[<p>Adorable! That cat deserves a medal.</p>\n]]>", "author": "27chaos", "published": "2015-01-28 17:32:51+00:00", "title": "By: 27chaos"}, {"content": "<![CDATA[<p>Dorothy,</p>\n<p>Among the children who didn&#8217;t go on to do math or math related things, were there any discernible correlations or patterns in the work they did end up doing?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bacon:Michael.html\">Michael Bacon</a>", "published": "2015-01-28 19:27:09+00:00", "title": "By: Michael Bacon"}, {"content": "<![CDATA[<p>Another data point &#8211; I moved from California to Oslo at the age of about 37 after marrying a Norwegian girl. I speak only English to our 3 kids and the wife speaks only Norwegian. It worked beautifully. Around the dinner table, the kids answer in the same language they are spoken to. No accent in either language. </p>\n<p>I, however, am instantly identifiable as a native English speaker in the same way that we instantly picked out the German or Russian bad guys in 80s Hollywood action movies. </p>\n<p>On the other hand, I help the kids with their Norwegian homework. It seems that my vocabulary is better in some areas, and my grammar is generally better than the kids&#8217;. </p>\n<p>I did not learn by &#8220;immersion&#8221;, I went to classes at night for three years. I think people learn in different ways, and a pedagogical classroom approach was the right one for me. Immersion got me from 80% to where I am now (95?) but it didn&#8217;t work until I could grasp a lot of what was flying by.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/j/John:EE.html\">EE John</a>", "published": "2015-01-28 21:28:20+00:00", "title": "By: EE John"}]