[{"content": "<![CDATA[<p>Jack #15: You&#8217;ve been working on an email to me for <i>years</i>??  Eh, send it!  I just can&#8217;t guarantee a reply, is all&#8230; 🙂</p>\n]]>", "author": "Scott", "published": "2017-12-10 08:52:24+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>If one graphs the ratio of incoming email rate / time, it might turn downward when you cross over, or maybe not: kind of a phase transition at the time of your own phase transition. </p>\n<p>Java 8 can help to avoid continuing to get further behind:</p>\n<p>EmailQueue myQueue =<br />\nemail().stream()<br />\n.filter(me ->  me.isGhost()).pitch();</p>\n<p>BTW, not sure Knuth is getting off so easy; Vols 5, 6, and 7 are not going anywhere.</p>\n]]>", "author": "Raoul Ohio", "published": "2017-12-10 17:49:42+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Good story. But I must protest that no-one, in any period of human history, ever said &#8220;what thou requesteth&#8221; or &#8220;I wouldst granteth&#8221;. I think the best fit would be &#8220;what thou requestest&#8221; and &#8220;I would grant&#8221;.</p>\n<p>Also (picky, picky) a ghoul is an eater of the dead. Which you are not, unless there&#8217;s something you haven&#8217;t told us.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/e/Evans:David.html\">David Evans</a>", "published": "2017-12-10 23:07:11+00:00", "title": "By: David Evans"}, {"content": "<![CDATA[<p>David #18: The Lord speaketh in mysterious ways.  And as long as we&#8217;re nitpicking, <i>I</i> wasn&#8217;t a character in the story! 🙂</p>\n]]>", "author": "Scott", "published": "2017-12-10 23:16:59+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Off topic question: now that Trump has accepted Jerusalem as the capital of Israel, how can you still call him anti-semite?</p>\n]]>", "author": "murmur", "published": "2017-12-11 21:07:23+00:00", "title": "By: murmur"}, {"content": "<![CDATA[<p>I think lawyers have a more practical approach to this than computer scientists seem to:</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Email_bankruptcy\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Email_bankruptcy</a></p>\n]]>", "author": "asdf", "published": "2017-12-12 18:22:44+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>murmur #20: There are so many layers of wrongness in that question that it&#8217;s hard to know where to start.</p>\n<p>But how about here: I never once called Trump an anti-semite.  A thug, bully, racist, harasser, ignoramus, sociopath, fraud&#8212;yes, of course, but I explicitly rejected the view that he&#8217;s personally anti-semitic.</p>\n<p>What he&#8217;s done, which is bad enough, is to turn over a rock that the country&#8217;s anti-semities, along with its racists, xenophobes, neo-Nazis, theocrats, etc., have gleefully crawled out from under.  He has an Orthodox Jewish daughter and son-in-law, but he was also advised by the white nationalist Bannon and refused to condemn neo-Nazis, and obviously the tension doesn&#8217;t weigh too heavily on him.</p>\n<p>Regarding the Jerusalem thing, I suppose like many Jews around the world I have mixed feelings about it.  On the one hand, it&#8217;s an obvious fact that Jerusalem <i>is</i> the capital of Israel (i.e., the seat of its government), and will remain so as long as Israel exists.  So Trump&#8217;s latest international incident was at least prompted by his saying something truthful&#8212;which puts it in something like the 95<sup>th</sup> percentile of all the international incidents he&#8217;s caused! 🙂</p>\n<p>On the other hand, because Israel has so badly wanted the US to say that truthful thing, there&#8217;s been this game for decades where the US has dangled it as a carrot to try to induce Israel into a peace deal (which, of course, the Netanyahu government <i>does</i> need to be induced into, kicking and screaming).  So Trump effectively gave away this major prize for nothing&#8212;which would count as doofus diplomacy if it were diplomacy at all, rather than what it obviously is, namely more red meat for Trump&#8217;s evangelical base, damn the external consequences.  I would&#8217;ve preferred following the policy of previous US administrations, which is that Jerusalem gets recognized as the capital as part of a peace deal and only then.</p>\n<p>Note that I&#8217;ve avoided making any argument of the form, &#8220;you shouldn&#8217;t say that Jerusalem is Israel&#8217;s capital, because if you do there might be violent protests in Gaza or the West Bank or elsewhere in the Muslim world.&#8221;  Thankfully, that worry seems so far to have been overblown&#8212;but in any case, I don&#8217;t like giving in to blackmail.</p>\n]]>", "author": "Scott", "published": "2017-12-13 05:40:05+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>>  it’s an obvious fact that Jerusalem is the capital of Israel (i.e., the seat of its government)</p>\n<p>I didn&#8217;t realize that but I suppose it makes sense.  On the other hand it seems to say that if, for example, the Australian government rents an office building in Buenos Aires and starts holding its parliament meetings there, that Buenos Aires becomes the capital of Australia.  I can accept that reasoning too, but it stops having political meaning at that point.</p>\n]]>", "author": "asdf", "published": "2017-12-16 00:21:12+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>Thanks for the fun read!</p>\n<p>Like others, I feel the strange compulsion to post a link to fiction which I&#8217;m reminded of..</p>\n<p>In my case, this is classic R. A. Lafferty &#8211;  &#8216;Been A Long, Long Time&#8217; at <a href=\"https://pastebin.com/raw/d9ZXakAB\" rel=\"nofollow\">https://pastebin.com/raw/d9ZXakAB</a> &#8211; which was brought to mind by both the enormity of Umesh Vazirani&#8217;s email schedule, and by the premise of a little indecision and unclarity having some very long-term consequences in the present work.</p>\n]]>", "author": "pete", "published": "2017-12-16 01:42:51+00:00", "title": "By: pete"}, {"content": "<![CDATA[<p>asdf #23: In case it helps explain, the Knesset (Israeli parliament) building, Supreme Court, Prime Minister&#8217;s offices, etc., are all in the West, Israeli part of Jerusalem, and have been since about 1949, a year after Israel&#8217;s founding.  If you go visit there, it doesn&#8217;t <i>look</i> like rented office space; it looks like a capital. 🙂  More importantly, this is not a <i>part</i> of Jerusalem whose sovereignty is in serious dispute, except for those who treat Israel&#8217;s existence itself as in dispute.  I.e. all the peace proposals that have been seriously discussed would cede at most parts of East Jerusalem to Palestine.</p>\n]]>", "author": "Scott", "published": "2017-12-16 06:46:07+00:00", "title": "By: Scott"}]