[{"content": "<![CDATA[<p>Preventing long-term climate change (as opposed to mitigating its short-term effects) is an enormous distraction from the real story in human affairs, which is the historically simultaneous understanding of the atom, the gene, and the brain, and the subsequent transformation of the world by the application of that knowledge. </p>\n<p>Saying all that is a mouthful, but when you say singularity, people think you mean living in virtual reality; when what it really means is nanotechnology, biotechnology, and artificial intelligence, all tumbling out of Pandora&#8217;s box at the same time. </p>\n<p>I used to say such a situation is a race between superweapons and superintelligence, but now it just looks like a question of which of the world&#8217;s technical elites will first master all of the potential, and what they will do with it.</p>\n]]>", "author": "Mitchell Porter", "published": "2017-07-18 01:22:46+00:00", "title": "By: Mitchell Porter"}, {"content": "<![CDATA[<p>It just so happened that I was browsing the Web sites of a few leading mathematics journals last week. (Was trying to see if my diffusion equation result might be seen as being fit for publication in this journal or that. Eventually decided that in its current form, it might better fit in a physics journal.) </p>\n<p>Anyway, that&#8217;s how I was going through the home-pages of the editors of the Journal of American Mathematical Society. I thus landed at Maryam Mirzakhani&#8217;s home page, checked out her Wiki-page and other things, and was left wonder-struck. Yes, as an engineer, it was impossible to figure out anything about work let alone form any kind of a judgment about it. Yet, since I come from a &#8220;third-world&#8221; country, it also was, in a way, &#8220;easy&#8221; enough for me to relate to some aspects of her story: a genius, an immigrant, and a success. And, damn it, let me add: also a beautiful, lady-like face, one that silently exuded a quiet kind of a confidence. </p>\n<p>And, then, just one or two days later, I read this news on the &#8216;net. &#8230; It was disconcerting, to say the least.</p>\n<p>RIP, Maryam! And may her family find the strength to survive this, unusually unfortunate, loss.</p>\n<p>&#8211;Ajit</p>\n]]>", "author": "Ajit R. Jadhav", "published": "2017-07-18 01:57:41+00:00", "title": "By: Ajit R. Jadhav"}, {"content": "<![CDATA[<p>It is tough to know how to deal with impending certain doom, although it is not as scary when you get to be an old guy. </p>\n<p>When I was a kid in the early 1950&#8217;s, at school we would practice kneeling down by basement walls and tucking our hears under our arms, the better to survive Russian atom bombs. Every time I would hear a loud airplane, I would think this is it. </p>\n<p>Then I got interested in science, and became aware of the Bulletin of the Atomic  Scientists, who had the clock at maybe 1.5 minutes to midnight. Just checked; now they are giving us 2.5 minutes, so I guess things are getting better.</p>\n<p>In 2017, of course, the future looks much worse. Those guys are probably wrong about methane burps, but something even worse will surely turn up. Like Trump.</p>\n<p>I suggest everyone pay attention, but try not to freak out. Soldier on, creating whatever it is you do. And, try to get out in nature and take long hikes. Beer  is good!</p>\n]]>", "author": "Raoul Ohio", "published": "2017-07-18 05:40:37+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Is anyone able to comment on how this 51-atom quantum simulator is different than recent work done at MPI-Garching? e.g., <a href=\"https://arxiv.org/pdf/1705.08372.pdf\" rel=\"nofollow\">https://arxiv.org/pdf/1705.08372.pdf</a> and <a href=\"https://arxiv.org/pdf/1604.04178.pdf\" rel=\"nofollow\">https://arxiv.org/pdf/1604.04178.pdf</a> (which had atom numbers in the hundreds)</p>\n]]>", "author": "JP", "published": "2017-07-18 08:52:36+00:00", "title": "By: JP"}, {"content": "<![CDATA[<p>A 51-qubit experiment is indeed very impressive, though it&#8217;s important to note that this is a linear array, as opposed to the 2d setups proposed by some other groups. In particular, it looks like the dynamics of this experiment can be simulated quite well classically using matrix product states (Figs 5-6)&#8230;</p>\n]]>", "author": "Ashley", "published": "2017-07-18 13:59:04+00:00", "title": "By: Ashley"}, {"content": "<![CDATA[<p>Ashley #5: Aha, thanks for the crucial context about MPS!</p>\n<p>I knew that if there were a claim to quantum supremacy here, superseding e.g. the Google group&#8217;s planned 7&#215;7 qubit array, then that would&#8217;ve been prominent in the paper.  But I didn&#8217;t know exactly <i>why</i> there wasn&#8217;t such a claim.</p>\n]]>", "author": "Scott", "published": "2017-07-18 14:07:13+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>why do i never see discussed an obvious strategy for mitigating global warming?  blow up a pacific island or two.  blow up as many as necessary.</p>\n<p>the explosion of mount tambora in 1815 produced the year without a summer in 1816.  that&#8217;s the proof of concept. </p>\n<p>yes, there would be obvious drawbacks such as radioactive fallout, but even that seems like a small cost weighted against the earth becoming &#8220;uninhabitable.&#8221;</p>\n<p>we have all those bombs sitting around; a few of them could actually do some good.</p>\n]]>", "author": "jk", "published": "2017-07-18 15:37:52+00:00", "title": "By: jk"}, {"content": "<![CDATA[<p>jk #7: The more &#8220;controlled&#8221; version of what you&#8217;re advocating&#8212;i.e., the one with fewer wild side effects&#8212;is blotting out some percentage of sunlight using sulfur dioxide cannons.  That <i>is</i> something that&#8217;s pretty widely discussed (look, it even has its own <a href=\"https://en.wikipedia.org/wiki/Stratospheric_aerosol_injection_(climate_engineering)\" rel=\"nofollow\">Wikipedia page</a> 🙂 ).  And my guess is that humans <i>will</i> eventually be forced to resort to that and similar strategies.  But when we do, it will be like putting band-aids over a ruptured artery&#8212;i.e., a desperation measure that can at most buy us a bit more time.  More sulfur dioxide would continually need to be injected into the atmosphere to counteract the warming, and that would no doubt have all sorts of nasty side effects of its own, not all of which we know yet.  And it wouldn&#8217;t solve the underlying problem of the atmosphere containing vastly too much carbon, which then gets absorbed into the oceans, causing ocean acidification etc. etc.</p>\n<p>But yes, I absolutely support more research in this direction, as well as into every other aspect of climate change adaptation and mitigation.</p>\n]]>", "author": "Scott", "published": "2017-07-18 16:54:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Given all the different ways we could end (nuclear terror, epidemic, global warming, meteor strike, &#8230;), more focus on space colonization seems like a good idea.</p>\n]]>", "author": "fred", "published": "2017-07-18 17:29:45+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>On the topic of climate change, there are times that I feel that the situation is essentially too late &#8212; that even belated action that we take now across the world to mitigate climate change will not undo the warming scenario that will lead to mass extinctions and the scenario posed by Wallace-Wells. </p>\n<p>Thus the destructive impacts of climate change is inevitable. Thus any attempt to mitigate is ultimately pointless, and we should be content to accept our ultimate fate.</p>\n<p>For those on this forum &#8212; convince me that my sentiment is wrong.</p>\n]]>", "author": "AJG", "published": "2017-07-18 17:53:09+00:00", "title": "By: AJG"}, {"content": "<![CDATA[<p>When it comes to sea level rising, I think it&#8217;s not too late to start digging a new big giant lake in the Midwest to hold all the extra water&#8230;</p>\n]]>", "author": "fred", "published": "2017-07-18 19:57:46+00:00", "title": "By: fred"}]