[{"content": "I think that the stress of univ prof should be compared to the stress of jobs they would have otherwise, outside academia. In particular, it depends on the area: CS, Math, literature, chemistry, etc", "author": "Anonymous", "published": "2014-12-09 09:44:54.285000-05:00", "title": ""}, {"content": "This reminds me of nice article I read recently: &quot;Tension, Stress, and the Tapestry of Faculty Lives&quot; by Ann E. Austin and Mary Pilat. http://www.jstor.org/stable/40249663", "author": "Farbod", "published": "2014-12-09 10:00:10.784000-05:00", "title": ""}, {"content": "hi, interested in this topic also, blogged about it along with the <a href=\"http://vzn1.wordpress.com/2013/10/04/zhang-twin-prime-breakthru-vs-academic-trackgrind/\" rel=\"nofollow\">zhang twin prime breakthru</a> where there is some case study. (zhang temporarily left academia to work at different jobs including subway sandwiches, the reason is not clear.) <br />my own take is that all fields have more or less stress very much depending on very localized conditions. another factor is employment insecurity (in academia this manifests as increasing adjunct/ assistant positions with higher difficulty of advancement) and wage inequality which are both very verifiably stress-producing for everyone in our culture. (and consider also rising productivity with flat wages. rising productivity surely carries more worker/ laborer stress.) our capitalist economic system seems to be increasingly stress producing. so its a systemic/ crosscutting issue across many fields.", "author": "vzn", "published": "2014-12-09 10:58:50.385000-05:00", "title": ""}, {"content": "My impression is that most jobs are stressful and most people work more hours than is probably healthy.  <br /><br />That being said, one of the things I think contributes to the stress of both graduate students and junior faculty is the uncertainty and randomness of research.  You might be working on a big paper and the results just don&#39;t pan out.  Or you might have a string of bad luck with program committees or grants.  Even tenure decisions can sometimes have a degree of randomness involved.  I don&#39;t think people cope with uncertainty and randomness well, and it can cause a lot of stress.  It might be interesting to compare the highs and lows of junior faculty with the highs and lows of high-stakes poker players. ", "author": "Anonymous", "published": "2014-12-09 11:06:33.157000-05:00", "title": ""}, {"content": "Pre-tenure stresses are obviously very high - there aren&#39;t many places where the probationary period can last as long - but your post and the examples focus on tenured faculty.  <br /><br />There isn&#39;t one picture of this and lumping all tenured faculty together simply doesn&#39;t make sense.<br /><br />Like many current faculty, I grew up around an academic.  The stress level for a career Associate Professor who enjoys and is good at teaching and service, can be very low.  If CareerCast is taking an average over academia, I bet there are plenty who fit this profile across all fields.<br /><br />Tenured faculty have an extraordinary level of control over the direction of what they do - lack of control being one of the key factors for stress.  Unlike many other jobs, stress for tenured faculty is generally a secondary consequence of internal drive and the peer pressure of what being successful means.   It is the stress of an entrepreneur.<br /><br />Hiring and tenure processes are Darwinian mechanisms designed to select for those individuals who have that drive and are likely to maintain it. (Type A people as you put it.) So, the more successful this selection is, the more things are opened up to the possibilities of stress.<br /><br />However, there are some ways in which we can try to reduce stress in academia.  <br /><br />- Being an individual entrepreneur can be isolating and stressful.  Having an ethos that recognizes collaborative work as much as individual work yields a more supportive and less stressful environment.<br /><br />- In hiring (tenure time may be too late) take into account the likely impact of those we are considering on the levels of stress of those around them.   Not all &quot;Type A&quot; personalities are the same.  Internal drive is a critical piece for success but if that internal drive does not also play out in positive behavior towards others then you will be adding to stress rather than relieving it.<br /><br />- Work on keeping on open and friendly environment where there is lots of communication and mentoring.  If all we do is teach our classes, do our research, and advise our students separately, only coming together occasionally for faculty meetings, then the stress of isolation becomes  problematic.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Beame:Paul.html\">Paul Beame</a>", "published": "2014-12-09 13:23:17.844000-05:00", "title": ""}, {"content": "Thanks to all for the comment so far.  Farbod, thanks for the article pointer (I&#39;ll read it tonight).  Anon #4, you&#39;ve pointed out a key stress aspect, one I wanted to bring up and I&#39;ll (hopefully) blog more about sometime soon.  Paul, great comment -- definitely the multiple aspects of being part of a community can be key to avoiding stress and a happier life, something again I&#39;ll hopefully blog more about soon.     ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-12-09 15:47:16.881000-05:00", "title": ""}, {"content": "I would like to reiterate that I do not claim that professors are more stressed. Many industries are clearly very damaging to their workers, but academia does not qualify.<br /><br />This being said, I think that there is a difference between stress and the patterns of thoughts that lead to depression.<br /><br />Believing that you are only as good as how well you are ranked by others... a deeply ingrained belief in academia... is unhealthy.<br /><br />Unnecessary competition is also very damaging... unnecessarily so.", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/l/Lemire:Daniel.html\">Daniel Lemire</a>", "published": "2014-12-09 19:48:04.052000-05:00", "title": ""}, {"content": "Following up on Daniel&#39;s comment above, the tenure process is unnecessarily harsh at many top universities. Not only do you need to be very good in your field (a reasonable requirement) but you need to win the swimsuit competition as well: do the academic rounds, sell yourself to the authorities in the field, join program committees simply for name recognition, etc.<br /><br />Radhika talks about this in her SciAm blog.<br />", "author": "Anonymous", "published": "2014-12-09 22:25:27.768000-05:00", "title": ""}, {"content": "Daniel -- glad that we agree on some points.  I&#39;ll probably have more to say later, but while I agree that &quot;Believing that you are only as good as how well you are ranked by others... is unhealthy.&quot;, I don&#39;t think that academia especially has that belief ingrained.  (Again, what&#39;s your comparison point or aim here.  Most companies have annual reviews where employees are ranked and that determines their salary.  Ranking happens.  In academia, whatever ranking there is is generally over fairly long time scales, and seems very &quot;friendly&quot; -- there can be many &quot;bests&quot; because there are many subareas and ways to succeed.)  <br /><br />Anonymous #9:  I have to admit, at least in my field, I&#39;d disagree with your (and Radhika&#39;s) analysis.  Here Radhika is an example of a person who is saying, &quot;I&#39;m told you have to do this to get tenure;  but I didn&#39;t do this and got tenure!&quot;  (Read my &quot;To be clear&quot; paragraph...)  You don&#39;t have to win any swimsuit competition.  <br /><br />(I would say, though, that part of the job is working to try to ensure your work is known.  There are a variety of ways to do that, and sometimes your work will be so good it will get known without you having to do much of anything.  That, again, is just life, I think, nothing particular to academics.)    ", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mitzenmacher:Michael.html\">Michael Mitzenmacher</a>", "published": "2014-12-10 01:44:33.758000-05:00", "title": ""}, {"content": "One of the things I find most interesting about academia is that one is constantly aware of their &quot;ranking&quot; with respect to others in the field, worldwide. (I don&#39;t mean this in the literal sense of a public, numerical ranking; I mean this in the broad sense of being aware of what others are doing, and generally aware of one&#39;s standing in the community.) Compare this to lawyers, doctors, or software engineers, who in general have no idea what other doctors/lawyers/software engineers are doing, or perhaps might be compared annually to others in their firm/practice/company but not worldwide.<br /><br />The only comparable profession, in this sense, is sports where there are often ranking (e.g., tennis) or at least relative standings due to quantitative measures (e.g., statistics).<br /><br />I think this explains a lot of the pressure.", "author": "Anonymous", "published": "2014-12-12 06:46:18.636000-05:00", "title": ""}]