[{"content": "<![CDATA[<p>Shozab #116: My to-watch list includes all the lectures of the IQC &#8211; Quantum Error Correction class taught by Daniel Gottesman and Beni Yoshida (<a href=\"http://pirsa.org/C17045\" rel=\"nofollow\">pirsa</a>).</p>\n<p>A few months earlier, I would&#8217;ve said algebra for life. But recently, I am beginning to appreciate the power of analysis. In quantum information, for instance, we talk about Haar random matrices all the time. And in complexity theory, we talk about random oracles and randomness. I think one is alienating oneself from a lot of questions and answers if one swears allegiance to a single camp.</p>\n<p>I think you are in the right field if you want to do TCS, Math and Physics. </p>\n<p>I don&#8217;t know much functional analysis or operator theory (or any analysis really) so I cannot comment on that. The tiny bit I know comes from Vern Paulsen&#8217;s <a href=\"http://www.math.uwaterloo.ca/~vpaulsen/FAQIdraft.pdf\" rel=\"nofollow\"><em>A Survey of Functional Analysis Methods for QIT</em></a> and the first few chapters of his book <em>Completely Bounded Maps and Operator Algebras</em>. If you like analysis and TCS, you might also appreciate Ryan O&#8217;Donnell&#8217;s <em><a href=\"http://www.contrib.andrew.cmu.edu/~ryanod/\" rel=\"nofollow\">Analysis of Boolean Functions</a></em>.</p>\n<p>Like any other (amateur) computer scientist, I struggle with the continuum. If you read QCSD you know the argument. Also, it is not just mathematicians who struggle with it but also physicists. See, for instance, <a href=\"http://math.ucr.edu/home/baez/continuum.pdf\" rel=\"nofollow\"><em>Struggles with the Continuum</em></a> by John C. Baez.</p>\n]]>", "author": "Sanketh", "published": "2018-04-03 23:36:14+00:00", "title": "By: Sanketh"}, {"content": "<![CDATA[<p>Job #119: To clarify, while you&#8217;re welcome to read an Ayn Rand book because it was discussed on this blog, you &#8220;do so at your own risk&#8221;!  I&#8217;ve obviously been <a href=\"https://www.scottaaronson.com/blog/?p=386\">extremely critical</a> of her.  Although, Peter #121, I don&#8217;t regard her as having been any <i>more</i> wrong than Marx or Freud were. 🙂</p>\n]]>", "author": "Scott", "published": "2018-04-04 04:36:16+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Jay #120:</p>\n<ul>Permutation city not there… you read it before the age of 10?</ul>\n<p>LOL, the opposite, alas.  I only read it a few years ago, even though I&#8217;d previously read and enjoyed some of Egan&#8217;s other work (like <i>Quarantine</i> and <i>Zendegi</i>).  I&#8217;m sure <i>Permutation City</i> would&#8217;ve had a huge influence on me if I <i>had</i> read it in or around adolescence.</p>\n]]>", "author": "Scott", "published": "2018-04-04 05:27:48+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>I am surprised the nobody has mentioned the best books ever written by a mathematician:<br />\nAlice&#8217;s Adventures in Wonderland,<br />\nThrough the Looking-Glass,<br />\nThe Hunting of the Snark</p>\n]]>", "author": "alberto_ol", "published": "2018-04-04 07:03:56+00:00", "title": "By: alberto_ol"}, {"content": "<![CDATA[<p>Sanketh #123: Good choice! </p>\n<p>I do agree with you on the fact that constricting oneself to one style of thinking can be harmful since it hinders the adaptations of other methods which might be useful. Having said that, I definitely think everyone should at least master a few methods to a high degree of proficiency. For instance, Norbert Weiner was a master at Fourier Transforms, John von Neumann (well, a number of methods) had an intuitive &#8220;feel&#8221; for mathematical theories (Stainslaw Ulam pointed out other proficiencies). </p>\n<p>Be a bit weary to study functional analysis :p at least as a physicist, I found it to be very pedantic. Though I feel like analysis gets easier as you go deeper. And it does give explanations to certain questions that one encounters with quantum mechanics (most of which can be condensed up though!). I found real analysis to be a bit tricky but complex analysis easier. </p>\n<p>The continuum can be very murky ground indeed! Interestingly, most of my friends from Physics are people who don&#8217;t really care about differential geometry and the like (hard-core experimentalists or people whose research interests just don&#8217;t involve curved spacetime) In my experience, people who are into GR and the like tend to be more on the mathematical side of things.</p>\n]]>", "author": "Shozab", "published": "2018-04-04 09:23:22+00:00", "title": "By: Shozab"}, {"content": "<![CDATA[<p>Hi Scott. I saw your list of recommended books, and I&#8217;m surprised that you recommended Mind&#8217;s Eye by Hofstadter, but not included Godel, Escher, Bach (given the importance of that book as inspiration for both theoretical CS and AI).</p>\n<p>Also, somewhat off-topic, are you familiar with the web page of Cosma Shalizi (currently Stats professor at CMU, with a background in physics)? He has a section on book reviews, and he&#8217;s reviewed a number of books on your list (specifically, the book on computational learning theory by Kearns & Vazirani).</p>\n<p>bactra.org</p>\n]]>", "author": "Aaron G", "published": "2018-04-04 20:12:37+00:00", "title": "By: Aaron G"}, {"content": "<![CDATA[<blockquote><p>To clarify, while you’re welcome to read an Ayn Rand book because it was discussed on this blog, you “do so at your own risk”!</p></blockquote>\n<p>And the same goes for every other author really.</p>\n<p>It&#8217;s not like there isn&#8217;t tons of bad fiction out there &#8211; i&#8217;ve read others.</p>\n<p>I guess i just didn&#8217;t expect it to be that bad (Anthem it was, i think).</p>\n<p>Have you ever considered authoring a fictional work?</p>\n<p>You could use it to criticize society without the direct repercussions you&#8217;ve experienced on your blog. In a passive aggressive sort of way.</p>\n<p>At worst, it&#8217;s just bad fiction. The story is its own author, it goes where it wants.</p>\n]]>", "author": "Job", "published": "2018-04-04 20:41:27+00:00", "title": "By: Job"}, {"content": "<![CDATA[<p>Aaron #128: GEB is a true classic, and some of its dialogues with Achilles and the Tortoise even rise to the level of great literature.  I think my problem is simply that I came to GEB too late, and already &#8220;knowing too much,&#8221; to appreciate it way it&#8217;s meant to be appreciated.  I.e., I no longer had the patience for hundreds of pages on G&ouml;del and Turing&#8217;s world-shaking insights when I already knew the punchlines and could reach them myself with a hundred times fewer words.  Had I discovered GEB as an 11-year-old, it would almost certainly have made my list.</p>\n<p>(How do I reconcile this with the presence on my list of <i>Logicomix</i>, a work that I similarly &#8220;came upon too late&#8221;?  Simple: with <i>Logicomix</i>, the human drama grabs your interest and holds it throughout even if you already know the math.)</p>\n<p>Yes, I&#8217;ve been familiar with Cosma Shalizi&#8217;s website since the ancient days of Web 1.0.  Every single time I go there, I find whatever he has to say penetrating and insightful whether I agree with it or not.  Given the extent of our nerdy overlap, it&#8217;s sort of weird that he and I have never actually talked to each other; hopefully I&#8217;ll have some occasion to remedy that.</p>\n]]>", "author": "Scott", "published": "2018-04-04 20:58:55+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Job #129:</p>\n<ul>Have you ever considered authoring a fictional work?</p>\n<p>You could use it to criticize society without the direct repercussions you’ve experienced on your blog. In a passive aggressive sort of way.</ul>\n<p>Right!  As they say, I&#8217;ve written at least 20 timeless novels in the shower&#8212;each of them so moving that anyone who reads even a single chapter will spend the rest of his or her life fighting for truth and goodness, and extolling the moral courage as well as the sexual irresistibility of the introverted nerd.  We&#8217;ll see whether any of these great works make it onto the page before I die. 🙂</p>\n]]>", "author": "Scott", "published": "2018-04-04 21:16:56+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<blockquote><p>We’ll see whether any of these great works make it onto the page before I die. 🙂</p></blockquote>\n<p>If you ever do, channel your inner Dostoevsky.</p>\n]]>", "author": "Job", "published": "2018-04-04 21:41:43+00:00", "title": "By: Job"}]