[{"content": "<![CDATA[<p>Again, I&#8217;m not sure of this <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /></p>\n<p>Suppose n=3<br />\nIt seems to me your method will create an 8 dim subspace in a 2^8 space<br />\na|1000,0000> + b|0100,00000> + c|0010,0000> +&#8230;+<br />\nh|0000,0001><br />\nbut you want to map it into a state<br />\nof 3 qubits, unentangled from the other 5 qubits</p>\n]]>", "author": "rrtucci", "published": "2014-10-17 18:51:25+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>rrtucci #36: Yes, a single photon in 8 modes <i>does</i> span an 8-dimensional Hilbert space, whose basis vectors are |10000000>, |01000000>, etc.  But, OK, suppose you wanted to &#8220;compress&#8221; such a state into a 3-qubit state, which lives in the Hilbert space spanned by the basis vectors |000>, |001>, |010>, |011>, etc.  You could do that using a recursive procedure, like so:</p>\n<p>First, <i>in parallel</i>, compress |10000000> and |01000000> into a single qubit, along with |00100000> and |00010000>, etc.  Next, compress the |xx000000> qubit with the |00xx0000> qubit to form a 2-qubit state, and in parallel, the |0000xx00> qubit with the |000000xx> qubit.  Finally compress the |xxxx0000> qubits with the |0000xxxx> qubits to form a 3-qubit state.</p>\n<p>You might complain that, in order to do this, I&#8217;ve used a linear number of operations (albeit, O(log(N)) time).  But now we come to the key point: <i>a linear amount of logic would completely analogously have been needed to access a classical RAM.</i>  The only real difference is that, in the classical case, only a single path through the logic gates would have been relevant to any given query.  But it doesn&#8217;t seem fair to penalize the qRAM for having the power to make superposed queries&#8212;that&#8217;s, like, its whole thing!  And it&#8217;s not as if the energy required, or any other obvious resource, is greater in the quantum case than in the classical.  (A single photon in superposition costs no more energy than a single photon not in superposition.)  But maybe I&#8217;m missing something?</p>\n]]>", "author": "Scott", "published": "2014-10-17 19:04:36+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Nice talk!<br />\nI see your point about HHL being a &#8220;pre-algorithm&#8221; but also am curious whether you&#8217;d describe Hamiltonian simulation, Jones polynomial approximation, or a hypothetical algorithm for graph isomorphism the same way, given that in each case we do not know how to construct distributions that are believed to be hard on average (apart from making use of BQP-hardness results for the first two cases).  Or are you just referring to the fact that the input is specified by an oracle, and so would say the same thing about amplitude amplification, triangle-finding or the HSP?</p>\n<p>On a different note, I totally agree with you about the substantive point that Hamiltonian simulation is still likely to be the most useful q algorithm among the ones invented to date. I just wouldn&#8217;t use the word &#8220;algorithm&#8221; so narrowly.</p>\n]]>", "author": "aram", "published": "2014-10-17 19:37:05+00:00", "title": "By: aram"}, {"content": "<![CDATA[<p>I&#8217;ll quit while I&#8217;m ahead. This is like the first time in 10 years you partially agree with me <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /></p>\n]]>", "author": "rrtucci", "published": "2014-10-17 20:00:33+00:00", "title": "By: rrtucci"}, {"content": "<![CDATA[<p>aram #38: It&#8217;s a good question.  I would say that pre-algorithm vs. algorithm is not a sharp distinction, but a matter of degree.  Is this algorithm something that you take right out of the package, put in the oven, and get an exponential speedup?  Or is it more like one of those brownie mixes where all you need to add is the flour, sugar, eggs, butter, and chocolate?</p>\n<p>For graph isomorphism, it&#8217;s true that we don&#8217;t know a distribution over hard instances, but at least it&#8217;s very easy to state the problem being solved.  Whereas with HHL, the problem being solved is often summarized as &#8220;solving linear systems,&#8221; but of course there are 3 caveats (how to specify the input, the condition number, what observable to measure about the solution vector).  As long as those caveats are remembered, I&#8217;d say yes, it&#8217;s very similar to graph isomorphism.</p>\n]]>", "author": "Scott", "published": "2014-10-17 20:24:06+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #30, and later: Ah, I see. The point I was missing is that a qRAM allows you to keep generating copies of |psi> (n-qubit register encoding a N=2^n-dim vector in its coefficients) in time O(1), once you have expended the O(N) or O(NlogN) effort in preparing the qRAM.</p>\n<p>Now I think I understand your beamsplitter network example: the n beamsplitters somehow act to encode the N-dim vector, so that when a photon passes through, the photon is in the state |psi>, which took O(1) effort (time for the photon to pass through the beamsplitter network).</p>\n<p>Is there any physical-implementation-agnostic way to describe how to construct a qRAM? Can we describe the construction and operation of a qRAM in terms of qubits and one- and two-qubit gates? (Of the small number of papers I&#8217;ve seen in the literature so far, they all seem to give examples of how to construct a qRAM using some very specific set of physical tools, e.g. optical beamsplitter networks; atoms in cavities and photons, etc.)</p>\n<p>In the case of the beamsplitter network qRAM you describe, what is the physical meaning of the qubits in the resulting |psi>? e.g., for n=3, I first thought that |100> is the state where there is 1 photon in the first mode, and 0 photons in the second and third modes. However, I suppose that&#8217;s not right, since then if you only put a single photon into the beamsplitter network, only the states |100>, |010> and |001> can have non-zero amplitude (and |000> if you consider photon loss). Let&#8217;s suppose I want to make a beamsplitter qRAM that can produce the following |psi>, how would I do it?</p>\n<p>|psi>=(1|000> + 1.1|001> + 1.2|010> + 1.3|011> + 1.4|100> + 1.5|101> + 1.6|110> + 1.7|111>)/a</p>\n<p>(where &#8220;a&#8221; is the normalization factor)</p>\n<p>Thanks again, and good luck with the article. If you have even some of your discussion points from this comment thread in it, I think it&#8217;s going to be a really helpful article.</p>\n]]>", "author": "joe", "published": "2014-10-18 00:30:20+00:00", "title": "By: joe"}, {"content": "<![CDATA[<p>Scott, re #37 about the RAM.  The principle sounds about right to me.  </p>\n<p>There&#8217;s some magic about constant factors in the classical case.  These days we use DRAM, which is a brilliant invention of an electronic circuit that lets you store lots of bits in both very little circuit board space and much less energy consumption than the more obvious SRAM.  But of course, as while we have no idea how to build practical quantum computers at all currently, we can&#8217;t really speculate about the details in quantum computers.</p>\n]]>", "author": "jonas", "published": "2014-10-18 07:26:19+00:00", "title": "By: jonas"}, {"content": "<![CDATA[<p>joe i don&#8217;t see how a qram will allow u to copy registers there is a no cloning theorem</p>\n]]>", "author": "upen", "published": "2014-10-18 23:42:11+00:00", "title": "By: upen"}, {"content": "<![CDATA[<p>upen #43: Dude.  The No-Cloning Theorem doesn&#8217;t apply to <i>classical</i> information, and the information in the qRAM is completely classical.  As I said, the &#8220;q&#8221; in the name only means that the information can be <i>queried</i> in coherent superposition, not that it itself is in a quantum state.</p>\n]]>", "author": "Scott", "published": "2014-10-19 01:55:45+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>thanks scott, i have always wondered if superposition of light waves ,let aside all the implementation difficulties can lead to<br />\nquantum states that are more abstract than superposition of<br />\nelectrons only 0/1 possible  assume i superpose  wavelength l1 with l2<br />\nwhat will be the size of such a quantum register will it still be a<br />\nqbit or is it a qDigit  ? even  if we can somehow implement a qDigit<br />\nwhat quantum operators can we define on it ?</p>\n]]>", "author": "upen", "published": "2014-10-19 04:05:12+00:00", "title": "By: upen"}, {"content": "<![CDATA[<p>Please excuse me for briefly revisiting a sad topic of a few months ago: creativity, depression, and suicide. I think most of us will find this from today&#8217;s Ars Technica to be useful, insightful, and touching: </p>\n<p><a href=\"http://arstechnica.com/staff/2014/10/harnessing-depression-one-ars-writers-journey/\" rel=\"nofollow\">http://arstechnica.com/staff/2014/10/harnessing-depression-one-ars-writers-journey/</a></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/o/Ohio:Raoul.html\">Raoul Ohio</a>", "published": "2014-10-20 04:06:00+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>Hi Scott:</p>\n<p>In the slides, you refer to your 2009 result about Fourier Checking. I&#8217;m wondering what your current take is on the other result in that paper, about Fourier Fishing.</p>\n<p>My interpretation of Fourier Fishing has always been that you give a black box problem that&#8217;s solvable in polynomial time on a quantum computer; whereas that black box problem is not in the classical polynomial hierarchy (that is, a reasonably natural definition of PH for black box problems).</p>\n<p>To me, it seems like a pretty strong result. But, in conversations over the years, I&#8217;ve often found myself defending the interestingness of it.</p>\n<p>If you had included it in your talk, what would you have said?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cleve:Richard.html\">Richard Cleve</a>", "published": "2014-10-20 14:32:16+00:00", "title": "By: Richard Cleve"}, {"content": "<![CDATA[<p>Richard #47: I would&#8217;ve said that Fourier Fishing is basically the black-box analogue of BosonSampling.  I.e., compared to BosonSampling, the advantage of Fourier Fishing is that you can <i>prove</i> an exponential separation (and not only that&#8212;as you said, you can prove that Fourier Fishing is not in BPP<sup>PH</sup>), but the corresponding disadvantage is that Fourier Fishing is relative to an oracle.  Indeed, &#8220;historically,&#8221; thinking about Fourier Fishing is exactly what led me to think about BosonSampling (and to suggest to Alex Arkhipov to think about it more): I was looking for an unrelativized analogue of something I already knew in the relativized setting.</p>\n<p>Of course, you could also &#8220;instantiate&#8221; Fourier Fishing with an explicit Boolean function.  If you do that, then you get something that&#8217;s basically equivalent to Bremner, Jozsa, and Shepherd&#8217;s IQP model.  For that model, we have results about the hardness of exact sampling directly analogous to what we have for BosonSampling (i.e., if you can do it efficiently classically, then PH collapses to BPP<sup>NP</sup>).  But we don&#8217;t yet have results about the hardness of approximate sampling analogous even to the incomplete results that we have for BosonSampling.</p>\n]]>", "author": "Scott", "published": "2014-10-20 16:07:09+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Another quick (and sobering) announcement:<br />\n&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;<br />\n<b><i>Take my research, please!</i></b>&nbsp; <a href=\"http://hardware.slashdot.org/story/14/10/20/1233235/ibm-pays-globalfoundries-15-billion-to-shed-its-chip-division\" rel=\"nofollow\">IBM Pays GlobalFoundries $1.5 Billion To Shed Its Chip Division.</a>  This news has long been foreseen by the QM/QIT/QC research community within IBM, yet it is by no means welcome.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-10-20 18:32:20+00:00", "title": "By: John Sidles"}]