[{"content": "<![CDATA[<p>Amy #139: Welcome back.</p>\n<p>I <i>hope</i> everyone here agrees that sending someone rape or murder threats is not only disgusting but criminal.  And in the cases you write about, it sounds like law enforcement is involved, as it should be.  Maybe they could be doing a better job, or maybe it&#8217;s just hard as a practical matter to track down the sources of the threats&#8212;I don&#8217;t know, and would be grateful if anyone wanted to give details.  As someone who&#8217;s received death threats himself, I can testify to how frightening it is, and speak from experience when I condemn such behavior in the strongest imaginable terms (as everyone should).  But it&#8217;s not obvious what moral debate we need to have: is there <i>anyone</i> within the &#8220;community of the reasonable&#8221; who isn&#8217;t already on our side?</p>\n<p>The reason I wrote this post is that, when it comes to online shaming&#8212;the &#8220;nonviolent&#8221; kind, which &#8220;only&#8221; tries to destroy jobs and reputations over minor verbal offenses&#8212;there doesn&#8217;t seem to be any similar consensus within the community of the reasonable, and I&#8217;d like create one.  Ironically, it seems like some of the activists who eloquently speak out against online rape threats and death threats, <i>themselves</i> gleefully participate in life-crushing public shaming campaigns, against victims who never threatened anyone but merely used the wrong word or told the wrong joke.</p>\n<p>If pressed to explain the tension, the activists might fall back on some variant of the famous formula you alluded to: &#8220;Men are afraid women will laugh at them.  Women are afraid men will kill them.&#8221;  (Or taking inspiration from Arthur Chu: &#8220;I&#8217;m concerned about crimes that could happen in the external world.  You&#8217;re only concerned about people getting called nasty names, which is purely a mental issue.&#8221;)</p>\n<p>If so, then this is a central point where I&#8217;d part ways from the activists.  Throughout recorded history, human beings often defended their reputations with their lives, <i>and it&#8217;s perfectly understandable why they did.</i>  A death threat can create immense fear (I know this!), but in the cases we&#8217;re talking about, at least you know that the whole moral and legal might of your community stands behind your physical safety.  A public shaming, by contrast, inevitably raises the question of suicide, because it purposefully creates the impression (whether true or not) that your entire community is <i>against</i> you, and will be forever.  I don&#8217;t know which of the two carries the greater risk of actual death.</p>\n<p>One other point where I disagree with you: in certain circumstances, I&#8217;d say that people <i>absolutely</i> have the right to complain if they&#8217;re singled out for punishment for crimes lots of other people are committing.  (And if we changed the example, I&#8217;m sure you&#8217;d agree: e.g., a poor black kid thrown in jail for marijuana possession while a rich white kid goes free.)  Indeed, one of the main tactics of despotic regimes is to make some nearly-universal behavior illegal, then selectively enforce the law against the regime&#8217;s enemies.</p>\n<p>In such cases, it seems to me like we should be asking the following two questions:<br />\n(1) <i>Is</i> the behavior actually that widespread?<br />\n(2) If it is, then should its widespread nature cause us to question whether <i>anyone</i> deserves to be punished for it?</p>\n<p>In the case of marijuana, I&#8217;d say the answers are (1) yes and (2) yes.  Marijuana laws shouldn&#8217;t be selectively enforced, they shouldn&#8217;t be enforced against <i>anyone</i>.</p>\n<p>In the case of serious financial crimes by CEOs, I&#8217;d say the answer to (1) is already no.  If the only people you can point to, who committed the same crime and got away with it, are a few other corrupt CEOs&#8212;well, sorry you got caught, dude.  Get in the back of the squad car.</p>\n<p>In the case of the Holocaust, I&#8217;d say the answers are (1) yes and (2) no.  Yes, almost everyone around you was doing the same thing.  And yes, <i>all</i> of you deserve to be punished.  And if we caught you, and failed to catch 10 other perpetrators&#8212;well, you should still be punished.</p>\n<p>Finally, in the case of puns about genitalia, made to amused listeners and accidentally overheard by non-amused ones, I&#8217;d say that just like for marijuana, the answers are (1) yes and (2) yes.  <i>No one</i>, male or female, is consistently above ribald humor: incredibly, <a href=\"http://uberfeminist.blogspot.com/2013/03/what-you-should-know-about-dongle-joke.html\" rel=\"nofollow\">Adria Richards herself tweeted penis jokes</a> (!) prior to this affair.  And yes, the ubiquity of the behavior, the lack of any intention to harm or offend, and the lack of any <i>actual</i> harm (to anyone except a few hardened privilege warriors), should together make it clear that destroying someone over this alleged &#8220;crime&#8221; is a much greater crime than the crime itself.</p>\n]]>", "author": "Scott", "published": "2015-03-01 22:24:30+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Rahul #140 &#8211; you&#8217;re assuming that women haven&#8217;t tried complaining to organizers and bosses about these kinds of things? Because&#8230;the obvious eludes them? Of course women complain about these things &#8212; until it becomes apparent that by complaining they not only mark themselves as troublemakers, but nothing happens. There are actual studies. The vast majority of the time, when a woman brings up a harassment issue with a supervisor, she&#8217;s been fired or moved along within a couple of years and there&#8217;s been no disciplinary action against the harasser. (Which was part of the shock in the Lewin incident.)</p>\n<p>When people go through channels for years and get punished for doing it, and there&#8217;s a real problem, they&#8217;re going to find another way of doing something about the problem. And what she did was, in the end, valuable. She let the rest of the world know, right there, what goes on. People in that world were very quick to say &#8220;it&#8217;s nothing, it happens everywhere,&#8221; but those of us outside that world know that isn&#8217;t true. Dick jokes are not a part of my ambient work environment. In other industries I&#8217;ve worked in, that&#8217;s the kind of thing that, if overheard, would make people decide on the spot that you&#8217;re not suitable for promotion and maybe don&#8217;t belong in the company at all. </p>\n<p>So &#8211; end of the day, I&#8217;d say she did the right thing. Otherwise people can&#8217;t know what goes on.</p>\n]]>", "author": "Amy", "published": "2015-03-01 22:35:06+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Scott #141, more in a bit, but law enforcement has been, as far as I can make out, useless in not only Brianna&#8217;s case but in several other well-publicized harassment campaigns involving credible threats of harm. It&#8217;s not that they could be &#8220;doing a better job&#8221;, it&#8217;s that they aren&#8217;t doing the job. The women call the police, the go to the police, they get shuffled around&#8230;and there are no arrests. There is a case sitting with SCOTUS right now about a guy who&#8217;d made hideous and (given the guy) credible threats online against his ex-wife, then claimed it was just rap lyrics and should be ignored. I don&#8217;t have a good feeling about how it&#8217;ll go.</p>\n<p>I just want to clarify, though: you&#8217;re saying that &#8220;I am going to come over and rape you with a pickaxe and strangle you and fuck your dead face, this is your address and here&#8217;s where your car is and here&#8217;s what you ate for dinner, that&#8217;s what you get for talking about our games you bitchslut&#8221; (or some such) is something on the same level as a crowd of people you&#8217;ve never heard of saying you&#8217;re an awful person?</p>\n]]>", "author": "Amy", "published": "2015-03-01 22:43:35+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Amy #143:</p>\n<ul>you’re saying that “I am going to come over and rape you with a pickaxe and strangle you and fuck your dead face, this is your address and here’s where your car is and here’s what you ate for dinner, that’s what you get for talking about our games you bitchslut” (or some such) is something on the same level as a crowd of people you’ve never heard of saying you’re an awful person?</ul>\n<p>Yes.  I&#8217;m someone who <i>personally experienced both of these</i> (well, not a rape threat, but graphic death threats that continued for weeks), and given the choice, I&#8217;d pick five more death-threat episodes over one more public vilification episode.</p>\n]]>", "author": "Scott", "published": "2015-03-01 22:55:44+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Just a quick note that various anti-gamergate people (I&#8217;m not sure whether this is true for Brianna Wu, but it&#8217;s certainly true for Anita Sarkeesian)  have gotten simultaneous massive hate/shaming campaigns and numerous death threats. This is different than a singular death threat.</p>\n]]>", "author": "J", "published": "2015-03-01 23:10:40+00:00", "title": "By: J"}, {"content": "<![CDATA[<p>Scott #144 &#8211; ack, gotta run, but I think this is probably key: </p>\n<blockquote><p> A death threat can create immense fear (I know this!), but in the cases we’re talking about, at least you know that the whole moral and legal might of your community stands behind your physical safety. </p></blockquote>\n<p>I think women, particularly women who&#8217;ve had cause to call on police or community support, are far less certain of that support. It has actually not occurred to me in the last few decades that, if attacked, anyone would do anything but blame me for having been attacked. If interested in the first place. In fact the one time I did go to the police after an attack &#8212; the incident with the gym parking-lot rando who broke my nose &#8212; the cop refused to believe I didn&#8217;t know the guy, and threatened to arrest me when I objected to his focusing on what I was wearing. </p>\n<p>I can&#8217;t speak to the nonwhite experience, but I wouldn&#8217;t be surprised if that assurance was rare there, too.</p>\n]]>", "author": "Amy", "published": "2015-03-01 23:12:00+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>@Scott: &#8220;But I also feel that, if a public figure is going to be publicly brought down like this (yes, even by a private university), then the detailed findings of the investigation should likewise be made public, regardless of how embarrassing they are.  I know others differ, but I think the need of the world to see that justice was done overrides MIT’s internal administrative needs, and even Prof. Lewin’s privacy (the names of any victims could, of course, be kept secret).&#8221;</p>\n<p>In light of your experiences, do you still feel this way?  Or would you rather protect Prof. Lewin&#8217;s privacy?  I took Walter Lewin&#8217;s course on EdX, and while I would love to be able to view more of his lectures, I can sympathize with an institution&#8217;s (MIT) need to maintain it&#8217;s integrity for it&#8217;s own sake.  Given the popularity of the professor, and perhaps some of the comments from women in the STEM community after your post, could you take on faith that MIT would conduct a fair and open, albeit private, investigation that comes to a conclusion you trust to be the best of anyones knowledge?</p>\n]]>", "author": "Erin", "published": "2015-03-01 23:25:19+00:00", "title": "By: Erin"}, {"content": "<![CDATA[<p>Erin #147: Yes.  I still feel that the detailed findings of the investigation should have been, and should be, made public.  As I see it, the issue isn&#8217;t whether <i>I, personally</i> think justice was done: rather, it&#8217;s whether every interested person knows that justice was done, and everyone knows everyone knows, and so on, and can give an accounting of <i>why</i> justice was done if asked.  Paranoid conspiracies might be wrong and irrational, but we can&#8217;t claim surprise if we see them festering in darkness.</p>\n<p>Incidentally, while you write &#8220;In light of your experiences&#8230;,&#8221; I&#8217;m not sure what analogy you had in mind between my case and his.  I&#8217;ve committed no wrongdoing whose details I wanted to hide for the sake of privacy.  Instead, I was pilloried for a choice I made to <i>relinquish</i> my privacy, even though the story I told <i>didn&#8217;t</i> involve my doing anything wrong (or wanting to do anything wrong) to anyone!</p>\n]]>", "author": "Scott", "published": "2015-03-02 00:05:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #148: I guess the analogy would be, if you can be pilloried for doing no wrong, then an even more sensitive issue in Prof. Lewin&#8217;s case could result in him being pilloried, even if he is in fact innocent, or the females claiming to be sexually harassed could be pilloried, or both.  Does it really serve the public interest to deny him or others involved the right to choose to disclose or not to disclose?  If you feel wrongfully judged in your position, doesn&#8217;t it also follow that they could suffer similar treatment?</p>\n]]>", "author": "Erin", "published": "2015-03-02 01:21:38+00:00", "title": "By: Erin"}, {"content": "<![CDATA[<p>Erin #149: I already affirmed that the names of women shouldn&#8217;t be released.  As for Lewin himself, <i>he was already pilloried anyway</i>, as much as it&#8217;s possible for a person to be.  Everything he did for the past half-century is in tatters now.  So what difference would it make to him if MIT released the details?  And even if he <i>were</i> embarrassed further by the details&#8212;so what?  And if you&#8217;re worried about the accusations against him being false, then why shouldn&#8217;t that already be a grave concern for you, even without the details being released?</p>\n]]>", "author": "Scott", "published": "2015-03-02 01:50:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8220;Don’t some targets of online shaming campaigns, y’know, deserve it?</p>\n<p>&#8220;Of course!&#8221;</p>\n<p>So people who disagree with YOU deserve to have their lives destroyed &#8212; after all, what kind of a monstrously unjust world would allow somebody with a wrong opinion to feed his children? &#8212; but, you know, you&#8217;re totally against destroying people&#8217;s lives over lesser offenses like, uh, disagreeing with, say, Amanda Marcotte. </p>\n<p>But right there, you *are* Amanda Marcotte. You want to destroy people&#8217;s lives for saying something you disagree with. You are incapable of feeling any empathy for somebody who *said something you don&#8217;t like*. One wrong sentence, and to you, they are no longer fellow human beings. </p>\n<p>Do you think normal people are perfectly 100% pure? Never had a single bad thought in their lives? Justine Sacco, for example: It&#8217;s almost a shame she was joking, I guess, or else her punishment would have been richly deserved, and there wouldn&#8217;t be any injustice to feel bad about. Is that close to what you&#8217;re saying, or not? </p>\n<p>Because if some victims deserve it, then it must be that saying one bad thing (or, God forbid, TWO bad things!) changes you from a pure, innocent sinless being who isn&#8217;t Asking For It to a completely different creature: A Racist! Or A Homophobe! And they, by God, they&#8217;re Asking For It! From 100% good to 100% bad, in the click of a mouse. </p>\n<p>It&#8217;s easy to pick them out: You can tell by their pointed tails. The ones that are joking don&#8217;t have long red pointed tails with a little arrowhead on the end. </p>\n<p>Right. Your parents, for example. Or grandparents. No pointed tails there, I certainly hope. Or do they deserve worldwide public vilification? </p>\n<p>I don&#8217;t care HOW crazy of a thing somebody says or how much they meant it. This is not a reasonable way to treat other human beings. There isn&#8217;t a single assumption in there that maps in any sane way onto actual lived human experience. If somebody&#8217;s obnoxious enough I&#8217;ll avoid the dumb bastard, but I&#8217;m damned if I&#8217;ll exile him from the human race before he starts cutting people&#8217;s heads off or something. </p>\n<p>Of course, neither you nor I can do a damn thing about any of this. Nothing we say matters in the slightest, any more than it matters if my mother harbors the loathsome, incomprehensible delusion that people born with testicles are male.</p>\n]]>", "author": "Zoyd Wheeler", "published": "2015-03-02 02:45:25+00:00", "title": "By: Zoyd Wheeler"}, {"content": "<![CDATA[<p>1) Sacco now says that her tweet was ironic, i.e., as you explained above, a way to mock &#8220;privilege&#8221;.  Please tell me you don&#8217;t believe that.  Clearly, she was simply making a joke.</p>\n<p>Yet, even if she wasn&#8217;t making a statement about being conscious about privilege, it&#8217;s still *just a joke*.  That&#8217;s okay.  It doesn&#8217;t make her the Worst Person Ever.  *Most* jokes are offensive to someone; most jokes are tasteless to some people.  Making a joke, no matter how tasteless or offensive, should not destroy someone&#8217;s life.  </p>\n<p>For all we know, Sacco is a selfless human being who helps her neighbors, stands by her family, and supports her community.  One joke, no matter how tasteless, should not be the highest indicator of her moral worth.</p>\n<p>2) Sooner or later, if you&#8217;re honest with yourself, you&#8217;ll realize that at the heart of leftist thought is hate.  Stop aligning yourself with leftists and feminists.  You&#8217;ll eventually find yourself their victim, as you were a month ago.  That doesn&#8217;t mean you have to embrace the right, or any group of people.  Just detach yourself to the world of ideas rather than groups.</p>\n]]>", "author": "Tito", "published": "2015-03-02 02:57:11+00:00", "title": "By: Tito"}, {"content": "<![CDATA[<p>Amy #142:</p>\n<p>Do you have specific examples of cases where women complained to Conference Organizers that did not act? Have *you* had occasion to complain to a conference organizer that did not act? Do you know that PyCon has a history of being insensitive to harassment complaints? If not PyCon can you say this about a specific similar conference in this sector? </p>\n<p>I&#8217;d love to see one of these studies you cite, especially if it fits the context & is recent. I can believe things were the way you described at some point in the past or in some sectors even today. But personally knowing at least some of the guys involved in PyCon I say it is totally unfair of you to assume that they would ignore sexual harassment & by implication their official policy on it was some token statement. </p>\n<p>Now, I&#8217;ll speculate something different. Some people have a proclivity for overreaction & drama. They see insult and offense where none exist. Given a choice between an effective, low-key route and the sensationalist one they will take the later.  Do you know that Adria Richards did not fit the bill?</p>\n]]>", "author": "Rahul", "published": "2015-03-02 03:37:43+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Amy #143:</p>\n<blockquote><p>&#8220;&#8230;.law enforcement has been, as far as I can make out, useless in not only Brianna’s case but in several other well-publicized harassment campaigns involving credible threats of harm. It’s not that they could be “doing a better job”, it’s that they aren’t doing the job. The women call the police, the go to the police, they get shuffled around…and there are no arrests&#8230;.&#8221; </p></blockquote>\n<p>What is your definition of a &#8220;credible&#8221; threat? Can you elaborate? </p>\n<p>I can sympathize with law enforcement here. It&#8217;d be a Herculean task to track down every instance on an online moron spewing out hate in one of the hundreds of online forums that are chock full of such people. Especially in the midst of a shaming campaign or an internet meme. </p>\n<p>Just check out the comment list of even a fairly innocuous YouTube video & count the number of people calling for violent reactions. </p>\n<p>It is just not practical to expect LE to track every such guy down. </p>\n<p>As an aside, does someone know  of any lists of online shaming campaigns that resulted in actual physical harm being inflicted (assault, rape, etc. ). How often does that happen. I&#8217;m truly curious.</p>\n]]>", "author": "Rahul", "published": "2015-03-02 05:53:46+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Amy #142: &#8220;Dick jokes are not a part of my ambient work environment. In other industries I’ve worked in, that’s the kind of thing that, if overheard, would make people decide on the spot that you’re not suitable for promotion and maybe don’t belong in the company at all.&#8221;</p>\n<p>Do Adria Richards&#8217;s own penis jokes also mean that she doesn&#8217;t deserve employment either? If not, why not?</p>\n]]>", "author": "DHW", "published": "2015-03-02 07:33:42+00:00", "title": "By: DHW"}, {"content": "<![CDATA[<p><i>“check your privilege” ultra-feminists by day, to “check out the ass on that one” players by night.</i></p>\n<p>Reminds me of this huge scandal that rocked Canada, when a beloved radio host who played feminist by day (and back in college) turned out to be a serial abuser.</p>\n<p><a href=\"http://msmagazine.com/blog/2014/11/10/how-jian-ghomeshi-pulled-the-feminist-wool-over-everyones-eyes/\" rel=\"nofollow\">http://msmagazine.com/blog/2014/11/10/how-jian-ghomeshi-pulled-the-feminist-wool-over-everyones-eyes/</a></p>\n]]>", "author": "quax", "published": "2015-03-02 07:34:37+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Zoyd #151: It&#8217;s ironic that I&#8217;m now also being criticized for not taking a hard enough line against online shaming!  But I have this tic of always wanting to confront my opponents&#8217; strongest arguments.</p>\n<p>And I know my opponents would say: surely you agree that there are genuinely toxic people in the world, who gleefully inflict harm on others their entire lives and get away with it?  And that our only chance to nail such a person might be a single revealing remark caught on tape?  In which case, no, it&#8217;s not the remark itself that&#8217;s the problem, it&#8217;s just that the remark is the smoking gun, the thing we can prove.  Like getting Al Capone for tax evasion.</p>\n<p>And I know it&#8217;s no good for me to deny such things can happen.  I can only reply: in the old days, no doubt there were many lynching victims who were ACTUALLY guilty of rape or murder.  Including ones who otherwise would&#8217;ve escaped justice.  That still doesn&#8217;t mean lynching was a good system.</p>\n]]>", "author": "Scott", "published": "2015-03-02 11:12:17+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Amy, when you say</p>\n<p>>I wonder where y’all have been, and why, in your world, legal answers to violent and openly misogynist threats against women online haven’t rated much comment or planning-to-fix over the past few years, but this new fear of public embarrassment scores libel discussion.</p>\n<p>Do you mean to accuse us all of sexism?</p>\n<p>The answer to your question is really simple, if you pause to think about it. We all oppose threats against women (or anyone else), but those are usually done anonymously and are impossible to trace. These threats haven&#8217;t rated much &#8220;planning-to-fix&#8221; because we can&#8217;t think of any way to fix them: we would like to arrest the perpetrators of these threats, but we don&#8217;t know how.</p>\n<p>This is in contrast to, say, Arthur Chu, who is not anonymous and whose writing on Aaronson may or may not be libel. (Recall that Chu&#8217;s headline was &#8220;&#8230;Why so many shy, awkward guys end up hating feminism&#8221;, with a picture of Aaronson and a subtitle saying &#8220;this is what [Aaronson] meant&#8221;. Any reasonable person would conclude Scott hates feminism. Except Scott&#8217;s actual post said he is 97% on board with modern feminism, a fact Chu doesn&#8217;t mention).</p>\n]]>", "author": "Anonymous85", "published": "2015-03-02 12:03:20+00:00", "title": "By: Anonymous85"}, {"content": "<![CDATA[<p>I think the comment about Salon demonstrates a partial answer to your question. With violence and threats of violence, all it takes is one person. With shaming, the people attempting the shaming need some social capital in order to succeed. As you say, an individual can&#8217;t always rationally ignore social capital out of existence &#8211; if people can get you fired or worse, it may pay to pay attention to them. However, if you can deplete their social capital, then they look &#8211; and are &#8211; more and more like obvious paper tigers that can be safely ignored. This is where things like pointing out how clickbaity Salon is come in. Also the standing up for people bit.</p>\n<p>Hopefully, we can get to the point where people learn that if they lend their social capital to twitter mobs, then they stand to lose much of it. Thus the mobs have nothing to back them up, become easy to ignore, and are rendered relatively harmless &#8211; well, incapable of shaming at any rate.</p>\n<p>Back in 2009 I remember a pattern where I&#8217;d read something containing what we&#8217;d now call social justice memes, dismiss it as vexatious nonsense, then get distressed when a blogger I respected linked positively to it. Thankfully none of it was directed at _me_&#8230;</p>\n<p>(Remember that thing about eigenmorality? You could think about eigensocialcapital &#8211; you get eigencapital for being connected to people with lots of eigencapital.)</p>\n]]>", "author": "Peter", "published": "2015-03-02 12:29:21+00:00", "title": "By: Peter"}]