[{"content": "<![CDATA[<p>I loved the idea of the column, by the way.  I feel like I&#8217;ve got a much better grasp on P/poly now.</p>\n]]>", "author": "Alan Hardy", "published": "2017-11-16 12:05:08+00:00", "title": "By: Alan Hardy"}, {"content": "<![CDATA[<p>Scott,</p>\n<p>&#8220;Instead, poor schmucks like “Sensitive Nerd” should expect a level of heavenly fury that dwarfs anything that came before.&#8221;</p>\n<p>I don&#8217;t know. We know that there exist Amanda Marcotte&#8217;s in this world. I don&#8217;t see how the current collective cultural trauma we are experiencing emboldens them. People like her will be screaming, &#8220;Burn all the radicals!!&#8221; no matter what. Colby&#8217;s friends will always be trying to &#8220;help&#8221; him not go too far.</p>\n<p>When you see non-sensitive nerds getting legitimate just desserts for assualting and harassing women, I understand the instinct to flinch when you see the Marcotte&#8217;s feasting. Anger and rage can let loose fires that burn the whole forest even if it started as a &#8220;controlled&#8221; fire. Still, I think arsonists will set fires no matter what the situation is.</p>\n]]>", "author": "atreat", "published": "2017-11-16 13:48:40+00:00", "title": "By: atreat"}, {"content": "<![CDATA[<p>While we&#8217;re discussing polynomial advice, a question about it. Has anyone thought that much about the computational complexity of generating the advice itself for a given task?</p>\n<p>Here&#8217;s my very naive thoughts which can probably be improved (and probably already have been), but should make the question a little more clear and concrete:</p>\n<p>For example, the advice needed to put ZPP or BPP into P/Poly is can be computed in PSPACE. But we can also bound the time it takes. For BPP, if we simply run through every advice string and check that it gives the right result for that output then the time it takes to find a good string is about (2^O(A+n))M where A  is the length of working piece of advice, n is the length of our input to our BPP algorithim, and M is the amount of time it takes to actually compute with no advice or other tricks whether a given input for our problem is accept or reject. </p>\n<p>But for ZPP we can do slightly better because we can keep a string as part of our advice if it works for a really long sequence of inputs: BPP can&#8217;t do this immediately because a BPP machine taking the advice can&#8217;t tell when a string is giving bad advice where as the ZPP machine will when given bad advice simply return I-don&#8217;t-know and then move on to the next part of the advice string. This means that if we want to make advice for a problem in ZPP we can get away with<br />\n(2^(O(A)+o(n)))M. Note that although A is the length of a working piece of advice, we&#8217;ve actually ended up giving advice that is slightly longer than our minimum advice length. </p>\n<p>But we can actually with only a little overhead do the same for BPP by tagging our advice string so our advice essentially is of a slightly different form and reads:<br />\nFrom 0 to String A, use X<br />\nFrom String A+1 to String Y,<br />\netc. </p>\n<p>So in both cases we can do with time  (2^(O(A)+o(n)))M.  Can we do better?</p>\n]]>", "author": "Joshua Zelinsky", "published": "2017-11-16 14:14:07+00:00", "title": "By: Joshua Zelinsky"}, {"content": "<![CDATA[<p>Alan #21: Of course it&#8217;s no one else&#8217;s job to help Aspy guys.  What I think is reasonable to ask, and the bare minimum that other communities do ask, is that people don&#8217;t <i>actively make the problem worse</i> by libeling the sufferers, taking joy in their &#8220;tears,&#8221; etc.  I challenge you to spend a day typing the relevant search terms into Google, then come back and tell me this is a request that the mainstream is currently meeting.</p>\n<p>I also think you wildly underestimate the extent to which, if you&#8217;re a nerdy male, then absolutely anything you do or don&#8217;t do will nowadays get classified as Problematic.  The example par excellence of this was a <i>Telegraph</i> writer&#8212;not some random blog&#8212;<a href=\"https://mobile.twitter.com/juliagalef/status/865661975677632512?lang=en\" rel=\"nofollow\">attacking Silicon Valley nerds like Mark Zuckerberg for donating to cancer research</a>.</p>\n<p>Likewise, if nerdy guys do what you endorse, try to help each other solve their problems, and &#8220;pat each other on the back&#8221; for not being jerks, do you not see how they&#8217;re creating a toxic and exclusionary bro culture that needs to be broken down?</p>\n]]>", "author": "Scott", "published": "2017-11-16 14:34:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Joshua #24: Good question!  No, I don&#8217;t think anyone does know how to generate the advice faster&#8212;if they did, it would certainly be of great interest in the context of the  derandomization program, where of course the ultimate goal is to generate the advice in P.</p>\n]]>", "author": "Scott", "published": "2017-11-16 14:44:12+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>There&#8217;s no evident contradiction&nbsp;&mdash; that I can perceive anyway&nbsp;&mdash; between Scott&#8217;s perspective (<a href=\"#comment-1749182\" rel=\"nofollow\">#19</a> especially) and Alan Hardy&#8217;s perspective (<a href=\"#comment-1749208\" rel=\"nofollow\">#21-22</a> especially).  </p>\n<p>Quite the reverse, each of these two perspectives <i>gains</i> in scope and merit, when viewed in light of the other (AFAICT).  Whence this mutual synergy?</p>\n<p>Sociobiologist Ed Wilson&#8217;s books <a href=\"https://books.google.com/books?id=-YsWNfTXU7oC&pg=PA105\" rel=\"nofollow\"><i>Consilience</i></a> (1999) and <a href=\"https://books.google.com/books?id=2yR0AwAAQBAJ&pg=PT100\" rel=\"nofollow\"><i>The Meaning of Human Existence</i></a> (2014) provide a provocatively acerbic starting-point:</p>\n<blockquote><p>The history of philosophy when boiled down consists mostly of failed models of the brain.</p></blockquote>\n<p>More charitably, there&#8217;s no shortage of evidence in history to the effect that:</p>\n<blockquote><p>Progress in fields as seemingly disparate as pure mathematics, complexity theory, psychology, psychiatry, and philosophy&nbsp;&mdash; when boiled down&nbsp;&mdash; originates largely in new models of computation.</p></blockquote>\n<p>Accelerating advances in machine learning capability strikingly embody &#8220;new models of computation&#8221;&nbsp;&mdash; per the Avi Wigderson-reference of <a href=\"#comment-1749189\" rel=\"nofollow\">#20</a>&nbsp;&mdash; and these new models of computation are wonderfully (also fearfully) accelerating the rate-of-progress in many STEM/STEAM disciplines. </p>\n<p>Scientifically speaking, recent decades have witnessed a growing appreciation that human social cognition neurotypically occurs by processes that are network-structured, both anatomically and computationally.  </p>\n<p>Which is not to say that social cognition does not very commonly occur by alternative cognitive processes&nbsp;&mdash; nerdily ratiocinative processes for example.</p>\n<p>In view of real-world human cognitive diversity, it&#8217;s no simple matter to discern, or impute, or impose, any unifying structure whatsoever&nbsp;&mdash; any unifying mathematical, physical, economic, medical, or moral structure&nbsp;&mdash; upon humanity&#8217;s accelerating understanding of cognition and computation.  </p>\n<p>Speaking historically, what&#8217;s holding up pretty well (for me anyway) is old-fashioned Spinozism.  Spinoza&#8217;s five-point program for Enlightened Modernity is as follows (from Edwin Curley&#8217;s translation of Spinoza&#8217;s <i>Tractatus de Intellectus Emendatione</i>, <i>circa</i> 1661):</p>\n<blockquote><p>I shall only say briefly what I understand by the true good, and at the same time, what the highest good is&nbsp;&hellip; it is the knowledge of the union that the mind has with the whole of Nature.</p>\n<p>This, then, is the end I aim at: to acquire such a nature [as appreciates that union], and to strive that many acquire it with me. That is, it is part of my happiness to take pains that many others may understand as I understand, so that their intellect and desire agree entirely with my intellect and desire.</p>\n<p>To do this it is necessary, <i>first</i>, to understand as much of Nature as suffices for acquiring such a nature; <i>next</i>, to form a society of the kind that is desirable, so that as many as possible may attain it as easily and surely as possible. <i>Third</i>, attention must be paid to Moral Philosophy and to Instruction concerning the Education of children. Because Health is no small means to achieving this end, <i>fourth</i>, the whole of Medicine must be worked out. And because many difficult things are rendered easy by ingenuity, and by it we can gain much time and convenience in life, <i>fifth</i>, Mechanics is in no way to be despised.</p>\n<p>Before anything else we must devise a way of healing the intellect, and purifying it, as much as we can in the beginning, so that it understands things successfully, without error and as well as possible. </p>\n<p>Everyone will now be able to see that I wish to direct all the sciences toward one end and goal, namely, that we should achieve, as we have said, the highest human perfection&nbsp;&hellip; all our activities and thoughts are to be directed to this end.</p></blockquote>\n<p>Spinoza&#8217;s five Enlightened objectives are (of course) both technologically transformational and morally problematic.  </p>\n<p>Supposing that our global technological civilization does not revert to a pre-Enlightenment Dark Age, the next 50 years will witness more concrete progress toward a  Spinozist Enlightenment than the previous 350 years&nbsp;&mdash; without much regard for whether, as individuals, we desire this progress or&nbsp;not.  </p>\n<p>This prospect is exciting of course, and scary too.  It&#8217;s great to have <i>Shtetl Optimized</i> as a forum where, in regard to these fearfully tough issues, diverse points-of-view are respectfully and rationally set forth.</p>\n]]>", "author": "John Sidles", "published": "2017-11-16 14:58:01+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Scott #25,</p>\n<p>Just looked at that telegraph article and I don&#8217;t see how it is relevant to this discussion. First, if you steelman that article, the author&#8217;s objection is that we should not focus on curing diseases of old age because of population growth and demographic problems. That is of course highly problematic, but without knowing more and assuming bad faith I don&#8217;t see how to read that as hating on nerds.</p>\n<p>Second, even assuming that the author is being disingenuous and really does just want to hate on Zuckerberg, what does that have to do with this?? The only connection I can see is that Zuckerberg is a nerd, and a rich and successful one at that. But he is his own person and maybe the author has reasons for hating on him that are completely orthogonal to his gender or his politics or anything to do with his superficial resemblance to your shy socially awkward nerd who can&#8217;t read social cues.</p>\n<p>I would not be surprised at all if some idiot self-declared SJW somewhere had decided to take our current societal events to spew hatred indiscriminately and some innocents or socially awkward nerds were burned, but I don&#8217;t see the article cited as even remotely related. And, to be clear, I think regardless of current events that arsonists will burn. Those that practice anger and rage will have no problem finding targets.</p>\n]]>", "author": "atreat", "published": "2017-11-16 15:19:10+00:00", "title": "By: atreat"}, {"content": "<![CDATA[<p>Joshua #24: Good question! When computational advice is structured as a tensor network (as contrasted with a Boolean Circuit), then the geometric properties of tensorial varieties facilitate efficient &#8220;sculpting&#8221; of the advice, via deep-learning methods that have no evident analog in Boolean circuits (as far as anyone knows, definitely including me). </p>\n<p>Mike Nielsen&#8217;s free online book <a href=\"http://neuralnetworksanddeeplearning.com/\" rel=\"nofollow\"><i>Neural Networks and Deep Learning</i></a> is one starting-point, the deep-learning website <a href=\"http://www.offconvex.org/\" rel=\"nofollow\"><i>Off the Convex Path</i></a> is another, a review article by Haegeman, Mariën, Osborne, and Verstraete, titled &#8220;<a href=\"https://arxiv.org/abs/1210.7710\" rel=\"nofollow\">Geometry of matrix product states: Metric, parallel transport, and curvature</a>&#8221; (2014) is a third starting point.</p>\n<p>To quote the Roman poet Claudian:</p>\n<blockquote><p><i> Hic patet ingeniis campus,<br />\ncertusque merenti stat favor;<br />\nornatur propriis industria donis.</i></p></blockquote>\n<p>which is widely  translated as</p>\n<blockquote><p>Here is a field open for talent,<br />\nand here merit will have certain favor,<br />\nand industry graced with its due reward.</p></blockquote>\n<p>Best wishes!&nbsp;🙂</p>\n]]>", "author": "John Sidles", "published": "2017-11-16 15:21:33+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>It is not clear to me what Sensitive Nerd&#8217;s concern is. Is it about how he may be viewed by others or is he worried of unintentionally causing discomfort or harm to others? </p>\n<p>Either way, I sympathize with the anxiety that can be caused by the news and social media. I suffered from it myself and maybe still do at times. It fuels my darker thoughts of self-harm. But I refuse to be taken over by this, because I do not think it is in any way rational.</p>\n<p>It is not helpful to appeal to other people to adjust their rhetoric. At least not if your goal is that all of them will actually do it. There will always be people who are, or appear to you, unfair or overly vicious.</p>\n<p>What you <em>can</em> do however, is give concrete practical advice to the Sensitive Nerd on what they can change to lessen their suffering. For example, if you have difficulty interpreting social cues and are worried about getting it wrong, stay away from trying to find romantic connections in public or at work. Don&#8217;t ever ask anybody out who you met in a work context. Just don&#8217;t. Don&#8217;t even consider or think about it. Don&#8217;t ever approach anybody you see in public with this intention. Just don&#8217;t. In fact, I don&#8217;t even think the latter works very well for anybody anyway.</p>\n<p>Instead, date people where it is agreed, from the very start, that the purpose of the connection is of a romantic nature. Ask friends to set you up on dates. Use dating apps or websites. Be explicit about consent at every step. Don&#8217;t just kiss them. Ask them beforehand. Sure, many partners would say it is a turn off, but some may like it and for most others it will not be the sole reason not to date you. The ones that really really mind, are probably not a good fit for you anyway.</p>\n<p>If you are genuine and do your best to respect the wishes and boundaries of others. <strong>You will be fine.</strong> If you mess up in some small way, apologize. <strong>You will be fine.</strong> Consider what women experience in interactions with the Weinsteins of the world. Do you think they can maintain a lifelong grudge against a Sensitive Nerd who is truly apologetic about a minor unintentional misstep?</p>\n<p>Seek therapy if necessary to understand that it is not possible to please every single person in the world. There will always be men and there will always be women, some of whom will be vocal feminists, who don&#8217;t really know you and will find a reason not to like you or to disapprove of you or your actions. I don&#8217;t see any evidence of a widespread problem where these people have any significant impact on your life, if you simply ignore them. In contrast, I see a lot of evidence of a widespread problem of men assaulting and raping women and men so, understandably, this concern may be of higher priority to some people.</p>\n]]>", "author": "Parsely", "published": "2017-11-16 17:49:40+00:00", "title": "By: Parsely"}, {"content": "<![CDATA[<p>Parsely #30: Ultimately, you&#8217;re right.  Ultimately, it&#8217;s not possible to please everyone; sometimes you have to take an action even though some people in your social circle (or SneerClub or Twitter or Tumblr or whatever) will denounce you for it.  I.e., you don&#8217;t first need to refute the people and make them admit they misunderstood you; you can just &#8230; <i>take the action</i> (!).</p>\n<p>But this is, by far, the most difficult realization I ever came to in my life, far harder than anything scientific I ever learned.  It took me, basically, the first quarter-century of my life to learn it, and I <i>still</i> keep forgetting it and needing to remind myself.</p>\n<p>So I have a great deal of sympathy for any sensitive nerds who <i>haven&#8217;t</i> yet come to the realization that they can do things that somebody will despise them for.  And even while I help the nerds come to that realization, I&#8217;d also like to work a bit on the rest of the world, to try to stop it from mercilessly taunting nerds so much, or (the same thing, just with an intellectual veneer) writing thinkpieces about how &#8220;nerd culture encodes problematic and toxic assumptions.&#8221;</p>\n<p>Again, none of this is for me: I have a pretty good life these days.  But I owe it to my younger self to speak up on behalf of the nerdy kids I meet.</p>\n]]>", "author": "Scott", "published": "2017-11-16 19:08:51+00:00", "title": "By: Scott"}]