[{"content": "<![CDATA[<p>Aharon #190</p>\n<p>Here are several things to address here, but let me do one straight off. It is the observation that although the quantum state affects the particles (by guiding their motion), the particles in return do not affect the quantum state. That is perfectly true. Sometimes people say that that alone violates a &#8220;generalized Action-Reaction principle&#8221; or a &#8220;generalized Newton&#8217;s Third Law&#8221;, and is automatically a strike against the theory.</p>\n<p>The first thing to note is that the objection put this way (which I know is not how you put it) is just silly. Newton would certainly have rejected this generalization of his Third Law, as should  everyone else. For example, Newton&#8217;s law of universal gravitation obviously has an effect on the motion of particles, but the motion of the particles has no reciprocal back-action on the law of gravitation! (Maybe Lee Smolin will think this is a problem too!) As Shelly Goldstein says, the quantum state has something of a nomological flavor: if you want to analogize it to something familiar, it is more like a law than a classical field. Personally, I try to lay off the analogies. Quantum states are quantum states. They aren&#8217;t like anything in classical physics. Or, as David Albert once put it, &#8220;we&#8217;re here, we&#8217;re queer, get used to it&#8221;.</p>\n<p>But granting the no-back-reaction fact, what has that to do with consciousness or the &#8220;reality&#8221; of &#8220;worlds&#8221; associated with the &#8220;empty branches&#8221;? Well, nothing at all! To see this, just put a little bit of back-reaction into the theory: the actual particle configuration deforms the quantum state at least a little exactly &#8220;where&#8221; that configuration is in the quantum state. Does that suddenly change the interpretive situation significantly? How could it?</p>\n<p>Is the &#8220;existence of a universal state is falsified by every quantum experiment to ever involve macroscopic equipment&#8221; if there is no back-reaction? Why should it be? In Bohmian mechanics, the actual shape, location and behavior of the macroscopic equipment is determined by the location and motion of its particles, and the motion of the particles (given their locations) is determined by the quantum state. Without the quantum state the theory falls to pieces. So how can such an experiment falsify the theory?</p>\n<p>Scott # 192: Note that the particle locations and motions are *not* epiphenomenal in the usual sense of that term. It is not merely that epiphenomena do not have any reciprocal back-effect on their cause or base, but they *supervene* on the base. The Bohmian particle locations and motions do not at all supervene on the quantum state. If I give you the quantum state alone, you can never analyze it to figure out what the particles were actually doing. The particle locations are independent degrees of physical freedom from the physical degrees of freedom of the quantum state.</p>\n<p>That is why the &#8220;Bohm is Many Worlds in a constant state of denial&#8221; meme that Deutsch created is so completely off base. A collection of particles plus a quantum state has much more physical structure to it—more physical degrees of freedom—than a quantum state alone. Further, those extra degrees of freedom—the particle locations in space-time—are of a completely different physical character than any in the quantum state. So it is not surprise that you can make lots of stuff out of particles +quantum state that you can&#8217;t make out of quantum state alone. In particular, you can make all sorts of complex localized objects in the second case and none in the first. These objects include trees and rocks and cats and brains with the right sort of structure to support consciousness. The &#8220;empty branches&#8221; are devoid of all these things, because they don&#8217;t have the particles to work with. And of course, since the particles never &#8220;split&#8221; or &#8220;multiply&#8221; the concrete Bohmian objects never &#8220;split&#8221; or &#8220;multiply&#8221; either, so we have none of the conceptual headaches that come with that in Many Worlds.</p>\n]]>", "author": "Tim Maudlin", "published": "2018-02-08 00:12:58+00:00", "title": "By: Tim Maudlin"}, {"content": "<![CDATA[<p>Tim #195</p>\n<p>That is extremely interesting.  You gave me something to think about.</p>\n]]>", "author": "Travis Myers", "published": "2018-02-08 00:20:47+00:00", "title": "By: Travis Myers"}, {"content": "<![CDATA[<p>Aharon # 190</p>\n<p>I was going to go on to address the rest of you post, including the bit about Zombies, but let me try something else instead. I did this once before and it was really useful. </p>\n<p>Do your best to try to switch roles for a second. You understand enough about Bohmian mechanics now, for sure. So pretend that you are a Bohmian, and you are tasked with responding to the rest of the objections in post # 190. See if you can come up with the responses on your own. If you really can&#8217;t, then just raise them again and I&#8217;ll answer them. But I bet there will be no need.</p>\n]]>", "author": "Tim Maudlin", "published": "2018-02-08 00:21:45+00:00", "title": "By: Tim Maudlin"}, {"content": "<![CDATA[<p>Travis #191, or consider that how I use the word &#8216;anti-realism&#8217; might be different from what makes you reflexively recoil. I don&#8217;t consider myself a postmodern relativist. They deny too much. I believe in an externally existing world. It is *how* it exists that I wouldn&#8217;t describe as &#8216;real.&#8217;</p>\n<p>Tim #194, I think you lack imagination. Polar bears use their nose to track seals kilometers away. A blind/deaf beagle is going to be able to track down a fox no problem. I&#8217;d pick a blind deaf bear in a fight vs you 😉 </p>\n<p>To rule &#8216;reality&#8217; out of bounds for conscious beings with sense worlds fantastically different from our own makes &#8216;reality&#8217; pretty damn impoverished of a concept don&#8217;t you think? In a sense, you are saying that a conscious being without your &#8220;common sensibles&#8221; can not perceive &#8216;reality&#8217;. What then do you think a conscious being is perceiving? An imaginary world?</p>\n]]>", "author": "Atreat", "published": "2018-02-08 00:22:18+00:00", "title": "By: Atreat"}, {"content": "<![CDATA[<p>Mateus #202</p>\n<p>We have had our bad patch and got through it, I think, so let me try to intervene to avoid another. There is nothing at all impolite about Mario&#8217;s post. I myself have gotten this weird reaction both here and in other venues, that when I say that PBR killed all psi-epistemic theories and leaves us with only psi-ontic theories (including Bohm, GRW and Many Worlds) the temperature suddenly goes through the roof. But that is precisely my own understanding of the implications of PBR. And yes, I have read Matt Leifer! </p>\n<p>So somebody is misunderstanding something here. I am perfectly willing to explore the issue, and to defend my understanding of the implications of the theorem, but there is no reason at all for any particularly strong emotion to accompany that. I am completely befuddled by this reaction to a claim that I think is correct, and needs to be discussed with people who disagree.If I am wrong, I am wrong. But let&#8217;s just calmly try to work through the issues.</p>\n]]>", "author": "Tim Maudlin", "published": "2018-02-08 00:34:44+00:00", "title": "By: Tim Maudlin"}, {"content": "<![CDATA[<p>Travis # 181</p>\n<p>Obviously (I hope) an error in the last paragraph of my comment #200. It is the *secondary* qualities like color and flavor that are all in the mind, not the *primary* ones.</p>\n<p>Scott appreciates this:</p>\n<p>‘by convention sweet and by convention bitter, by convention hot, by convention cold, by convention color; but in reality atoms and void’</p>\n]]>", "author": "Tim Maudlin", "published": "2018-02-08 00:41:44+00:00", "title": "By: Tim Maudlin"}, {"content": "<![CDATA[<p>Atreat # 206</p>\n<p>It was not for nothing that I rooted my creature in the ground. Your polar bear and beagle locomote and have proprioception. (If they don&#8217;t have proprioception then I&#8217;ll take the bear on in a fight, no problem. It would be cruel to the bear, though.) Because they are moving around in three dimensions and have proprioception they can develop a three-dimensional spatial imagination and come to understand the basic spatial concepts. But without that, I don&#8217;t think it is possible. And without basic spatial concepts they will never arrive at an adequate physics for our world, because its spatial (or spatio-temporal) structure is so important to understanding its physics;</p>\n<p>I am not saying that creatures with a certain sort of impoverished sensory capacity cannot experience &#8220;real things&#8221;! Even our olfactory creature is smelling real things, not imaginary things. But I don&#8217;t think that such a creature can ever develop an adequate physics. It just won&#8217;t have the right concepts, no matter how intelligent (in some sense) it is.</p>\n]]>", "author": "Tim Maudlin", "published": "2018-02-08 01:05:05+00:00", "title": "By: Tim Maudlin"}, {"content": "<![CDATA[<p>Atreat #188: I agree that the idea that the set of worlds should have a (non-counting) measure on it seems a bit bizarre, but, you probably want to phrase your objections in those terms, rather than talking about cardinalities.</p>\n]]>", "author": "Sniffnoy", "published": "2018-02-08 01:23:12+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Sorry for joining the thread late. I just have two comments. First, about Scott&#8217;s cartoon: maybe I&#8217;m a prude, but to me it seems complex numbers belong in one&#8217;s ontology iff one is a Platonist. Furthermore, whether or not they exist, under most accounts complex numbers are abstract objects (<a href=\"https://plato.stanford.edu/entries/abstract-objects/\" rel=\"nofollow\">https://plato.stanford.edu/entries/abstract-objects/</a>). The same holds, e.g., for wavefunctions, which are elements of some projectivized Hilbert space. My question for those who like to put such objects in their ontology: do you really mean that mathematical objects are instantiated physically? (Tegmark would say &#8220;yes&#8221; but I&#8217;m not sure how widely his views are shared.) Or do you mean there&#8217;s some physical object, different than but mathematically described by an abstract wavefunction in a Platonic Hilbert space?</p>\n<p>My second comment is that to me, it seems that asking for an interpretation of quantum mechanics is a bit less demanding than asking for a metaphysical theory in which quantum mechanics naturally resides. To interpret quantum mechanics, isn&#8217;t it enough to assign meanings to the various things arising in quantum mechanics, such that the theorems of quantum mechanics are true statements about these meanings? It seems that the standard Copenhagen / psi-epistemic interpretation does at least this, whether or not you want to say this is enough to qualify as an interpretation. (Of course, interpretations in this sense are probably very far from unique.) I do view metaphysical questions as very interesting, and I find the phrase &#8220;shut up and calculate&#8221; to be overly dismissive of them. But metaphysics seems to be very difficult, and for now I&#8217;m happy enough with being able to make sense of quantum mechanics without worrying about paradoxes. </p>\n<p>For example, I can view the wavefunction of a system (even in cosmology) as representing the beliefs of a hypothetical perfectly-rational conscious experiencer about (certain aspects of) its future conscious experiences, given whatever its past experiences were. Then the Schrodinger equation expresses a true statement: if time dt has passed and the observer&#8217;s conscious experience during that time contained no new information pertaining to the relevant aspects of future experiences, then the (perfectly rational) observer will update its beliefs by multiplication by e^{iHdt}. If, however, after time dt the observer has learned information restricting the relevant aspects of future experience in some way (e.g. if the relevant aspects are the readouts of some experimental machine, and after time dt the readout appears), then the perfectly rational observer will update its beliefs with a projection operator rather than a unitary operator. If you like, you can equivalently view these true declarative statements as imperative statements instead: &#8220;after dt, thou shalt do this,&#8221; removing the need to invoke hypothetical perfectly rational observers (but removing the declarative content of the theory); I think this is more or less what&#8217;s intended by Fuchs&#8217; &#8220;Ten Commandments&#8221; figure (page 8 of <a href=\"https://arxiv.org/pdf/1003.5209.pdf\" rel=\"nofollow\">https://arxiv.org/pdf/1003.5209.pdf</a>), although I agree that no good reasons exist for praying at Fuchs&#8217; altar.</p>\n]]>", "author": "Andy", "published": "2018-02-08 03:24:37+00:00", "title": "By: Andy"}, {"content": "<![CDATA[<p>Hi Scott,</p>\n<p>I&#8217;m not an expert but saw a lecture called Copenhagen vs Everett by Leonard Susskind and since it&#8217;s related to the topic of this post was wondering what are your views on the connections he (Susskind) states between quantum mechanical interpretations and gravity, and things like GHZ branes etc. ? Is it just wildly speculative or speculative but with merit, or is that line of thinking outright wrong, in your opinion?</p>\n]]>", "author": "Conan", "published": "2018-02-08 06:10:48+00:00", "title": "By: Conan"}, {"content": "<![CDATA[<p>Andy #205: I <b>really don&#8217;t care</b> whether it&#8217;s &#8220;complex numbers in our ontologies&#8221; (a laugh line that Zach wrote and I enjoyed), or whether it&#8217;s physical systems, a central aspect of whose behavior happens to perfectly described using complex numbers.</p>\n<p>No, really, I don&#8217;t.</p>\n<p>Max Tegmark famously says that physical reality is literally a mathematical object.  Other people say that&#8217;s crazy, physical reality isn&#8217;t at all a mathematical object, it just happens to be isomorphic to one in all respects.  For my part, I don&#8217;t even understand what it would mean for one party to this dispute to be right and the other to be wrong.</p>\n<p>If you do care, then please go ahead and make whichever choice you&#8217;re happier with!  (Presumably the latter one?)</p>\n]]>", "author": "Scott", "published": "2018-02-08 06:47:57+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Conan #206: I&#8217;ve actually been working with Lenny for years on this subject, as part of the &#8220;It from Qubit&#8221; collaboration that he helped launch and that I&#8217;ve been part of since its beginning.  Just last night, Lenny <a href=\"https://arxiv.org/abs/1802.02175\" rel=\"nofollow\">posted a paper on the arXiv</a> about our joint work (with my blessing), after I&#8217;d dragged my feet for years doing my part to write our paper.  So yes, I&#8217;m quite excited about these connections.  Lenny himself is a living legend, whose enthusiasm and energy inspire everyone around him.  Compared to him, I&#8217;m a skeptic and conservative about quantum information being the future of fundamental physics.</p>\n<p>Having said that, I don&#8217;t know what GHZ branes are and haven&#8217;t seen the lecture in question, so I can&#8217;t comment on those specifically.</p>\n]]>", "author": "Scott", "published": "2018-02-08 07:36:10+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Out of those two choices, I would be happier with the latter one, although I prefer the epistemic approach (the Born rule just smells like Bayesian inference to me- actually the name Quantum Bayesianism was the one thing I liked most from Fuchs et al, and I&#8217;m not sure why they&#8217;ve abandoned it).</p>\n<p>It&#8217;s perfectly reasonable not to care about this type of philosophical question. It&#8217;s probably not precisely stated enough for one side to be right or wrong: what is a mathematical object, and what is a physical object? Already the ontological division of (abstract or (concrete = (physical or mental))) is highly debated, and there are lots of competing definitions / rejections of the whole scheme. Still, one can try to argue that the definitions *should* be set up in one way or another, to avoid consequences that violate the intuitions we&#8217;re trying to capture in the definitions.</p>\n<p>For example, here is one such argument: If wavefunctions exist physically, and wavefunction is literally taken to mean equivalence class of vectors in an appropriate Hilbert space, then presumably they don&#8217;t also exist as abstract objects (otherwise, confusing the physical wavefunction with the abstract one is like confusing the idea of the Parthenon with the physical Parthenon, using Quine&#8217;s example). Then it also seems plausible that no other mathematical objects exist as abstract objects (otherwise, why don&#8217;t the vectors in physical Hilbert spaces exist as abstract objects?), and since they don&#8217;t exist physically (or mentally) either, they don&#8217;t exist at all. But part of the usual intuition about mathematical objects is that they either all exist or they all don&#8217;t exist (e.g. there&#8217;s no largest number). So if one defines abstract objects, physical objects, mathematical objects, etc. precisely, it seems desirable to do so in such a way that mathematical objects (if they exist) are abstract and not physical. One could reasonably take issue with any point in the argument (it&#8217;s not rigorous), or reject the &#8220;all-or-nothing&#8221; intuition about mathematical objects. Or, one could prefer to work on actual scientific questions instead- this is my preference most of the time, but philosophy can be fun once in a while.</p>\n]]>", "author": "Andy", "published": "2018-02-08 08:07:44+00:00", "title": "By: Andy"}, {"content": "<![CDATA[<p>Maudlin #202: I&#8217;m not saying that this statement is impolite, I&#8217;m implying that it is wrong on so many levels that I&#8217;m not capable of arguing about it without insulting the person making the statement.</p>\n<p>So I&#8217;ll just leave it at that. I don&#8217;t want to fight with you again, or trade insults with Mario Hubert. It&#8217;s carnival in Cologne, and I have to get drunk at 11:11 am.</p>\n]]>", "author": "Mateus Arajo", "published": "2018-02-08 08:44:50+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>But I can reply politely to an argument you made in #181, if you don&#8217;t mind me barging in. You wrote that</p>\n<p>&#8220;Many Worlds is usually presented as falling under this category, although if we take the Wallace/Deutsch line on probabilities they at least seem to require reference to a *rational agent* making *practical decisions* to make sense of the apparently probabilistic content of the theory. So maybe we should expand to “Quantum theory without the observer or rational agent”. &#8221;</p>\n<p>I think you are confusing two things: one is the fudamental reality, where there is only a vector in a Hilbert space evolving deterministically under the Schrödinger equation. There are no probabilities to be talked about.</p>\n<p>Another thing is the experience of an observer. Now the branching process gives rise to the appearance of randomness, and a rational agent will deal with this randomness by assigning probabilities.</p>\n<p>So it doesn&#8217;t bother me in the least that I need to talk about observers when what I want to describe is the experience of an observer.</p>\n]]>", "author": "Mateus Arajo", "published": "2018-02-08 08:59:49+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Mateus #193:</p>\n<ul>The Michelson–Morley experiment made the æether change from being a detectable thing with interesting consequences, to an undetectable entity so lame that it is not worth talking about it. Or, in other words, it was sliced off by Occam’s razor.</ul>\n<p>But my whole point was that, if we identify the aether with the QED vacuum, then it&#8217;s <i>not</i> just a useless appendage doing nothing, waiting only to be put out of its misery by Occam&#8217;s Razor.  Do you agree that the QED vacuum has a real physical existence, and indeed is teeming with quantum-mechanical activity at every point in space?  Do you agree, moreover, that the things it does (e.g., provide a medium for electromagnetic waves to propagate) are in extremely close correspondence with what the aether was proposed to do?</p>\n<p>If so, then it seems to me that this all just comes down to a factual question about scientific history.  Namely: in the 19<sup>th</sup> century conception of luminiferous aether, how important was the idea of the aether defining an absolute rest frame, compared to the other functions the aether was supposed to serve (notably, that of providing &#8220;something for the E&#038;M waves to wave in&#8221;)?  Does anyone know?</p>\n]]>", "author": "Scott", "published": "2018-02-08 09:47:31+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #213:</p>\n<p>Yes, the QED vacuum is real. No, it doesn&#8217;t do what the æther was supposed to do, not even close. The æther discussion was a discussion about a preferred reference frame and an absolute time, historically speaking.</p>\n]]>", "author": "Mateus Arajo", "published": "2018-02-08 10:10:50+00:00", "title": "By: Mateus Araújo"}, {"content": "<![CDATA[<p>Mateus #213: I&#8217;m afraid I&#8217;m gonna need sources.</p>\n<p>Wikipedia seems <a href=\"https://en.wikipedia.org/wiki/Luminiferous_aether#End_of_aether?\" rel=\"nofollow\">very clear</a> that the main point of the aether was to be a medium for the propagation of light.  Having an absolute rest frame was just an additional property that it was wrongly postulated to have.</p>\n<p>Some other interesting tidbits that I learned:</p>\n<p>Einstein wrote a paper in 1924 called &#8220;Concerning the Aether,&#8221; arguing that one could speak of the &#8220;aether of electrodynamics,&#8221; the &#8220;aether of general relativity,&#8221; etc.&#8212;they just had different properties than the 19<sup>th</sup>-century aether was imagined to have, while upholding the concept in other respects.  But his suggestion was not adopted, and the word &#8220;aether&#8221; fell into disuse.</p>\n<p><i>The abandonment of the word was a sociological phenomenon in physics history and pedagogy&#8212;you might strongly support it, which is fine, but don&#8217;t confuse it with a scientific discovery!</i></p>\n<p>I also enjoyed this 1911 quote from Lorentz:</p>\n<ul>whether there is an aether or not, electromagnetic fields certainly exist, and so also does the energy of the electrical oscillations &#8230; if we do not like the name of &#8216;aether&#8217;, we must use another word as a peg to hang all these things upon &#8230; one cannot deny the bearer of these concepts a certain substantiality</ul>\n]]>", "author": "Scott", "published": "2018-02-08 10:50:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>#212<br />\nWe have to keep the concept of QED vacuum as something separate from what we see as our &#8220;real&#8221; vacuum.  What we see as real is something we have observed.  We observe an extremely stable &#8220;real&#8221; vacuum and all of what we see that manifests itself as &#8220;real&#8221; is effectively entangled with it.  In decoherence speak, the &#8220;real&#8221; vacuum is our environment which is always entangled but we trace out when we make our observations.</p>\n<p>As far as interpretations, we have to ask two questions:</p>\n<p>1) after we make an observation, can I exclude all other possibilities for that observation (e.g. Wave function collapse)</p>\n<p>2) what happens to all the other possibilities</p>\n<p>The answer to 1) in &#8220;real&#8221; terms is yes, but in QM the answer is more sophisticated.  If we accept the lessons of QED, then the correct answer is that all the other possibilities have been caused by our act of observation to cancel out.  If we think all actions as rotations, then our act of observation has rotated the state such that all other possibilities are phased such that they are no longer observable.  </p>\n<p>The answer to 2) is that we tend to forget that what we observe is time dependent.  Can we rotate back? I will say generally no, except under extremely controlled conditions. This is the question of how can we correct for the actions of the heat bath.  Can I rotate out of the acts of randomness?  In effect create a time independent state?  I think the answer is yes within certain time bounds, at least that appears to be the case from press reports on Quantum Computing.  Effectively time independent bubbles in largely time dependent background.</p>\n<p>Does this favor many worlds?  What is &#8220;real&#8221; is based on time dependent observation.  There is no schema that will allow an individual to rotate to see two &#8220;real&#8221; outcomes to an obsevation. Flipping a card over in blackjack doesn&#8217;t ever generate two cards.  However, we left out the other important concept of translation.  Two spatially separated individuals may not necessarily have the same starting state unless previously entangled.  This gets back to the earlier point about our &#8220;real&#8221; vacuum and it&#8217;s importance.  It is the means by which we ensure consistency in our observations.  </p>\n<p>It isn&#8217;t aether though.</p>\n]]>", "author": "Hal Swyers", "published": "2018-02-08 11:10:54+00:00", "title": "By: Hal Swyers"}]