[{"content": "<![CDATA[<p>Jochen #202</p>\n<p>What exactly did you find that eludes shallow Bieber/Spears fans after &#8220;getting to the bottom of it, engaging with it and finding out what’s behind the surface&#8221; of Bach, Mozart and Beethoven? Do tell.</p>\n]]>", "author": "luca turin", "published": "2015-10-24 18:09:18+00:00", "title": "By: luca turin"}, {"content": "<![CDATA[<p>Jochen #202 and Scott #201, there is no doubt that the humanities are more discourse driven, but there are also harder bits and pieces to it.  Take for instance linguistics research that tries to capture how language develops.  There&#8217;s good empirical science to be found, and the increase in digital artifacts allows for more data driven research.</p>\n<p>Now with regards to the concept that Scott takes issue with, i.e. privilege. Scott, how would you re-write this <a href=\"http://nypost.com/2015/09/30/white-people-reject-claims-of-white-privilege-study-finds/\" / rel=\"nofollow\">headline</a>, without the short-hand use of &#8220;privilege&#8221;?</p>\n<p>Or do you contend that the underlying study is an example for the kind of humanities BS that you want to call out?</p>\n]]>", "author": "quax", "published": "2015-10-24 21:11:10+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p><a href=\"http://www.sciencedirect.com/science/article/pii/S0022103115000852\" rel=\"nofollow\">Link to the actual paper the NY Post article references.</a></p>\n]]>", "author": "quax", "published": "2015-10-24 21:20:31+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>quax #204: Obviously, that headline doesn&#8217;t need to be rewritten at all, regardless of what you think about the underlying concept.</p>\n]]>", "author": "Scott", "published": "2015-10-24 21:27:21+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Re: the preschool Turing test:</p>\n<p>One important issue is who is the judge. Should any reasonably competent adult be able to distinguish the artist&#8217;s work from the preschooler&#8217;s? Or just experts in the field?</p>\n<p>Part of the importance of the Sokal hoax was that it fooled insiders, i.e. the very experts tasked with judging the work. (Though, as I understand it, the journal did not use peer review, so maybe it was an expose of lax publication standards rather than the inherent meaninglessness of the field! And such lax standards are hardly unique to literary criticism &#8212; given my own experience with peer review, I&#8217;m sure that are plenty of journals in technical fields that have published completely flawed work, and that might fall prey to a Sokal analog.)</p>\n<p>I&#8217;m not fan of modern art (at least the super abstract meta-cynical-self-commentary sort). And much such work might fail the preschool Turing test if *I* were the judge. But that doesn&#8217;t mean that it would fail such a test if a connoisseur of modern art was administering it.</p>\n<p>(Incidentally, most people probably wouldn&#8217;t be able to reliably distinguish a famous piece of classical 19th century art from something produced by a technically competent advanced art student.)</p>\n]]>", "author": "jonathan", "published": "2015-10-24 22:19:46+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>As an aside, as a practicing social scientist (economist), I like to think that the sort of obscurantism you complain about is not so common in the social sciences, and that most of the jargon and conceptual machinery we&#8217;ve developed is &#8220;paying its rent&#8221; by allowing us to express complicated topics more simply. That is certainly (mostly) the case in my own field, at least with the main concepts that everyone knows about.</p>\n<p>The sort of postmodern obscurantist BS exposed by the Sokal hoax is more properly found in the domain of the humanities. Even the &#8220;softer&#8221; social sciences, like sociology (economists&#8217; eternal enemies), are probably not guilty of much  out-and-out obscurantism, though they are certainly prone to ideological pompous verbal signaling games.</p>\n]]>", "author": "jonathan", "published": "2015-10-24 22:42:13+00:00", "title": "By: jonathan"}, {"content": "<![CDATA[<p>Instead of just talking about the toddler Turing test in the abstract, we could all just take one and see how we do:</p>\n<p><a href=\"http://www.remarkably.com/moderntoddler/\" rel=\"nofollow\">http://www.remarkably.com/moderntoddler/</a></p>\n]]>", "author": "Anonymous85", "published": "2015-10-25 01:24:10+00:00", "title": "By: Anonymous85"}, {"content": "<![CDATA[<p>Jonathan, I think the more important thing about the Sokal hoax was what happened afterwards at NYU, when Sokal came for a debate with humanists, and they refused to recognize his authority &#8212; science&#8217;s authority &#8212; in defining various realities, and instead posited science-as-we-know-it itself as a construct open to question. Which was not a set of ideas he&#8217;d expected. Maddeningly, the humanists are correct: science is a human endeavor, its values and methods and foci chosen and devised by humans, and these things are indeed the area of study of the humanists. So Sokal arrived to find himself and indeed science objects of inquiry.</p>\n<p>As I recall, the NYU crowd was not particularly friendly, which is something that maybe isn&#8217;t, or shouldn&#8217;t be, unexpected when the sciences are funded at 1000x the level of humanities. Which usually prompts some sort of response about the tangible value of science, to which I blandly respond with someting about the tangible expense of failing to have a well-framed and functional government. Very expensive not having a sense of history or political philosophy, also not having language to with which to frame laws and stir hearts.</p>\n<p>Anyway. It seems to me we jumped over the problem of the social sciences&#8217; reliance on models, abstracted and pared versions of reality, and how these require their own vocabulary. Science, when not being Very Serious about its models, tends to go for whimsy in the naming, which at this point I find irritating, but that&#8217;s how they do. Science can afford some whimsy; social sciences and especially humanities, living in cardboard boxes, has to dress sharp in order to be taken seriously, so they put on the fancy language duds.</p>\n<p>Let me suggest something, Scott, and it&#8217;s a thing I see very often in scientific writing: in universityland, students learn to use words that name concepts before they understand the concepts. They&#8217;re just out there throwing chunks of language around, learning to sound the part. Unfortunately, many of them never notice that they don&#8217;t understand what they&#8217;re talking about; they just learn syntax. So when they go out and have arguments with people about these things, whether in or out of academia, they&#8217;re just tossing language around as a means of gesturing at some quarter-grasped notion attached to something felt or seen. They&#8217;re not any too precise. And at this point we return to aspergerishness, because this sort of thing is guaranteed to drive the susceptible up a wall. The problem is that few people who engage in these conversations are at all likely to see a need for precision and clean, deep understanding of concepts and their provenance. Most people aren&#8217;t that sharp, particularly with language, and no, that doesn&#8217;t mean you can dismiss them from political argument. It does mean that instead of demanding precision they haven&#8217;t got, you must try to understand what they do mean, in all its cloudiness, and why.</p>\n]]>", "author": "Amy", "published": "2015-10-25 01:44:21+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Anonymous85 #209: I just tried, and got only 7 out of 16 correct!  (And yes, I was trying.)  I would&#8217;ve done better by inverting all my guesses.</p>\n]]>", "author": "Scott", "published": "2015-10-25 01:54:15+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>jonathan #207:</p>\n<ul>Incidentally, most people probably wouldn’t be able to reliably distinguish a famous piece of classical 19th century art from something produced by a technically competent advanced art student.</ul>\n<p>Nor could most people distinguish a famous 19<sup>th</sup>-century physics paper from a modern homework solution by a student, if you got rid of trivial differences in language and style.  It&#8217;s characteristic of a healthy field for what&#8217;s pioneering in one generation to become routine in the next, so I don&#8217;t see this as a problem for art at all.</p>\n]]>", "author": "Scott", "published": "2015-10-25 02:10:20+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Re the test: 13/16 for me, but that&#8217;s because I&#8217;ve put in the time and been interested and have a pretty good idea what modern art actually looks like. It has a vocabulary. The brushstrokes and fingerswipes of a toddler and a 45-year-old look different, there&#8217;s intent in the adult use of color that the toddler hasn&#8217;t got, etc. And if you see a really talented child&#8217;s drawings they look really very different than your average preschooler&#8217;s. </p>\n<p>Putting in the time and being sensitive to and aware of the stuff &#8212; makes a difference.</p>\n]]>", "author": "amy", "published": "2015-10-25 02:13:56+00:00", "title": "By: amy"}, {"content": "<![CDATA[<p>Scott #206, then getting back to the original comment that started it all, if the term makes sense there, then when are we exactly dealing with an empirically-empty notion of “privilege”?</p>\n<p>Obviously I have an idea of when and how you think this term is disabused given the arc of the conversation here, but you know what they say about assumptions &#8230;</p>\n]]>", "author": "quax", "published": "2015-10-25 02:14:29+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Anonymous #209: I tried it, and guessed the ones with obviously more purposeful brushwork as being modern art, and got 4 out of 16. Apparently you can identify the modern art based on its technique being inferior.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cohen:Bram.html\">Bram Cohen</a>", "published": "2015-10-25 04:08:27+00:00", "title": "By: Bram Cohen"}, {"content": "<![CDATA[<p>Amy #210:</p>\n<p>So, I think we have to draw a few distinctions here, depending on what our goals are.  I think the short version is, you can treat people as evidence or you can treat them as fellow arguers, but you can&#8217;t do both at once&#8230; unless they let you do so, and are willing to treat themselves as evidence, which lots of people aren&#8217;t.  And that&#8217;s often how you get the best evidence about them.</p>\n<p>Long version now.  Say you have an interesting argument going and someone jumps in and starts saying things that aren&#8217;t very clear.  You ask them to clarify particular points.  How do they respond?  Here are some possibilities:<br />\nA.) Actually clarifying &#8212; it turns out they had a clear idea all along and just didn&#8217;t express it well<br />\nB.) &#8220;Hm, I&#8217;m not so sure, now that you mention it.  I think I intended something rougly along the following lines. [&#8230;] Here are some more precise possibilities. [&#8230;] Evidence for and against each one: [&#8230;]&#8221; (or just some subset of this, possibly just &#8220;Honestly, now that you mention it, I don&#8217;t know!&#8221;)<br />\nC.) Just further unclear verbiage, with no acknowledgement of inclarity<br />\nD.) Same as (C), but now with a demand that you accept what they are saying in the form that they are saying it and cease your distortions of it</p>\n<p>(A), of course, is great.  (B) means you&#8217;re potentially in for a lot of work, but it is helpful, it is furthering the discussion, and it&#8217;s frequently necessary and unavoidable.  (C) is, well, not an improvement.  (D) is terrible.</p>\n<p>So basically we have two ways of treating what people are saying: As arguments, to be taken as arguments and appropriately picked apart, or simply as phenomena, of evidence towards some more general pattern to be explained.  Generally clear things go under the former and unclear things go under the latter.  It&#8217;s OK for some things to go under both (though usually not at the same time).  Maybe you make an argument, thinking it makes sense, then people point out the problems with your concepts, you realize you&#8217;re not so sure what you actually mean, and it gets filed under evidence instead.  That&#8217;s fine; that&#8217;s (B) above.</p>\n<p>(And this is how you get a lot of the best evidence &#8212; take something unclear, point out something that doesn&#8217;t make sense, get the person who originally stated it to try to fix it, iterate heavily.)</p>\n<p>So you don&#8217;t have to be clear; the rule shouldn&#8217;t be &#8220;be clear or be silent&#8221;.  But you should be clear on how clear you&#8217;re attempting to be (lampshading goes a long way!), and if it turns out you fell short, you should accept that and reclassify.  (Unless you were really were clear, in which case you should be able to argue for that!)</p>\n<p>So far this is all good.  The problem is those Cs and Ds &#8212; especially the Ds.  There seem to be a lot of people out there who want simultaneously to 1. be unclear, 2. not to have to in any way mark this, 3. not to have to admit this, 4. not to have to argue for this, 5. not to have to in any way clarify themselves, and 6. in fact really everyone they&#8217;re talking to should just shut up and accept what they say as it is.  They&#8217;re certainly not going to stand for multiple iterations of refining their concepts; they can&#8217;t admit that their concepts could possibly have any flaws in the first place.</p>\n<p>And hey &#8212; what these people say can certainly be useful&#8230; as evidence to be examined.  But you can&#8217;t treat such a person as a fellow arguer.  No way.</p>\n<p>So what are your options?  I guess it depends on just who you care about correctness among.  Some possibilities:<br />\n1.) If you just want to get the correct answer yourself, well, you&#8217;re going to have a hard time going it alone, but you don&#8217;t need to treat anyone as a fellow arguer.  There&#8217;s no group to wreck.  But I think most of us want a bit more than to just personally know the answer.<br />\n2.) If you have some tiny insulated group that has no problem with kicking out arbitrary people to maintain its borders, again, there&#8217;s no problem.  If someone starts being a problem, you kick them out.  But once again, does this really suffice for anyone?<br />\n3.) If you&#8217;re like me, what you want is is for &#8220;your people&#8221; to get the right answer &#8212; where &#8220;your people&#8221; is a very large group, too large for anyone to manage, but still having the property that <i>notionally</i> people in this group ought to be good truth-seekers (and possibly making a claim to that effect).  Unfortunately, despite such claims, what actually gets someone accepted as a group member may have little to do with this.  And such groups can be subverted and turned to epistemic closure and partisan hackery if they don&#8217;t recognize the threat of people trying to pervert the norms of discouse.  (Which is what the (D)s above try to do, at first subtlely, and then, once they&#8217;ve convinced you it&#8217;s OK, blatantly.)  And, y&#8217;know, this happens.  And you can to some extent get a new group, but it&#8217;s still a failure; you&#8217;re fleeing because the goal failed.<br />\n4.) And if you want society in general to get the right answer&#8230; well, I have no idea how anyone would accomplish that.</p>\n<p>So yeah &#8212; we do need to &#8220;try to understand what they do mean, in all its cloudiness, and why.&#8221;  But the best way to do that is to actually include them in their own decipherment, and for that to happen, they need to not screw things up, by for instance refusing to acknowledge when they&#8217;re unclear or objecting to any attempt to suggest that we need to interpret what they said in some alternate fashion.  If you merely want (2) you can kick them out, but then you lose out on a good source of information.  It would be much preferable to not have to kick them out, and frequently, it&#8217;s simply not a possibility in the first place.  So how do we get them to behave?</p>\n]]>", "author": "Sniffnoy", "published": "2015-10-25 07:38:49+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>Anonymous85 #209, Scott #211</p>\n<p>Fun test! </p>\n<p>I got 13/16 right merely by guessing whether any of the markings required more fine motor control than a toddler has. I think that an adult would find it just as hard to unlearn those skills and produce convincing toddler art. </p>\n<p>Ugly website, by the way: whoever produced it clearly has no visual taste&#8230;</p>\n<p>Reminded me of a story about the great abstract expressionist Hans Hartung: someone said to him &#8220;my toddler could do this&#8221; and he replied &#8220;Yes, but the amazing thing is I&#8217;m 85 and still doing it!&#8221;.</p>\n]]>", "author": "luca turin", "published": "2015-10-25 07:41:45+00:00", "title": "By: luca turin"}, {"content": "<![CDATA[<p>Amy #213:</p>\n<ul>13/16 for me &#8230; Putting in the time and being sensitive to and aware of the stuff — makes a difference.</ul>\n<p>I don&#8217;t doubt that for a second.  But the question remains: <i>why would I want to?</i>  When I finally learn to distinguish the random-looking brushstrokes of a 40-year-old from those of a 2-year-old, what will I have gained, beyond a very specific and weird forensic skill?</p>\n<p>(Yes, I know I&#8217;m violating my own policy on no more abstract-art discussion.  Whatever.  I&#8217;ll close down this entire thread in a day or two.  (Now let&#8217;s see if I keep <i>that</i> promise&#8230;))</p>\n]]>", "author": "Scott", "published": "2015-10-25 11:27:18+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Ha! You guys have got me out of bed (I haven&#8217;t been to sleep yet &#8212; incidentally, The Conformist is on Netflix, and it&#8217;s ~beautiful~) and also trying to reread Germinal, which I have only in French (and never made my way all the way through in French). </p>\n<p>All right. Sniffnoy #218, the first thing I think on reading your comment is: theatre. You guys don&#8217;t know about theatre. Consider anything in Pinter. Or Beckett. You can&#8217;t pay attention just to the words, you need also pay attention to the vehemence, the person or character they&#8217;re coming out of. What they&#8217;re a proxy for. They aren&#8217;t going to give you a reason, they&#8217;re only going to say the things they say, over and over again. As people do, only less stylistically. </p>\n<p>Argument is only a form of discourse, a kind of rhetoric. How it&#8217;s sung &#8212; you know, when that dopey mess of a half-educated student is ranting at you about, I don&#8217;t know, Bernie, when he has zero context for what kind of guy Bernie actually is, you need to just shut up and watch him. The kid, I mean. The kid&#8217;s own theatre is what you get for communication. The urgency, the way he moves, where the stresses in his speech are, which bits are plainly canned and which are his own, he is telling you something. If you pay attention only to the clarity of the text&#8217;s reason you&#8217;re missing the show. I&#8217;m thinking of Beneatha in A Raisin in the Sun, now, too &#8212; she has all kinds of reason and very tight rhetoric but what it shows you is that she&#8217;s out of her mind, she can&#8217;t live the way she does, she&#8217;s groping around seeking in a cudgel-of-scholarly-authority way she wants badly to have work, because she&#8217;s a kid, and she&#8217;s representative. </p>\n<p>In other words, the kind of argumentation you&#8217;re talking about is of limited use when people are talking &#8212; one way or another &#8212; about themselves. Need theatre.</p>\n<p>Scott: 😀 Oh, that one&#8217;s easy. Why? Because of beauty.</p>\n<p>Somewhat less beamingly (sorry, is a ridiculous hour, also too much not very good wine) &#8212; if you don&#8217;t feel it then I see no reason to. I kept going back to look at abstract expressionism because it was apparent to me that I was looking at something important, something with a lot of intelligence, but mostly something with real weight. I didn&#8217;t know what it was but I trusted that if I looked long enough I&#8217;d understand. That was right. Curiously &#8212; and this is to do with Jochem&#8217;s thing about context, taken literally &#8212; I find it much easier to see and hear these things outside museums and symphony halls, when you don&#8217;t have the importance of the institutions to contend with. Either way &#8212; if it doesn&#8217;t speak to you, then it doesn&#8217;t, and I see no point in hanging around for baloney culture reasons. Unless it&#8217;s just to give it a shot now and then. </p>\n<p>I don&#8217;t, incidentally, much care for the academic, idea-driven stuff that started showing up in the 80s, mostly because it takes artists away from what they&#8217;re actually good at. You get some real inanity that way. (You also get some genuinely funny and well-executed things, but that&#8217;s still not where the action is in art.) But I don&#8217;t think they&#8217;re all wrong. It&#8217;s just that there are very, very few worthwhile artists at any given time. </p>\n<p>One I&#8217;d missed along the way growing up, btw, and a favorite at the Art Institute of Chicago: John Marin. Boy, was he good, and tremendously influential. One of the few things I like at the new and improved MFA is the Gallaudet head of Marin. It&#8217;s in a hallway somewhere. He sure looks like some asshole who knows what he&#8217;s doing to the point where you can&#8217;t even talk to him.</p>\n]]>", "author": "Amy", "published": "2015-10-25 12:05:39+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>(Scott, occurs to me you grew up in a good theatre town.)</p>\n]]>", "author": "Amy", "published": "2015-10-25 12:24:51+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>oh, and Sniffnoy, about your (3) &#8212; you and I are looking for different things, I think. I don&#8217;t have people or argue in teams, and if a win comes from something I already thought, I figure something is wrong. Like right now I&#8217;m listening to Glenn Gould playing Sweelinck, and he&#8217;s doing his humming thing, and he&#8217;s thinking of this music in some way I wouldn&#8217;t have thought of, which is why he was humming. He knows something I don&#8217;t. But then I&#8217;m also deliberately off-career-track and don&#8217;t normally have to bother with other people&#8217;s perversions of discourse if I don&#8217;t want to. </p>\n<p>I don&#8217;t, incidentally, believe there&#8217;s that much difference between this sort of argument/conversation in STEM and in anything else just because the STEM things are not on the me-and-you level or necessarily directly perceivable. We are in the end talking about essay. And one of the more irritating things about the social scientists who turn the lens on science is that they make the point about the instruments and questions determining what one might see.</p>\n]]>", "author": "Amy", "published": "2015-10-25 12:45:43+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Aagh, sorry, misunderstood you, Sniffnoy. I get it. But I still don&#8217;t think of people being that susceptible to corralling &#8212; they&#8217;re people, they&#8217;re going to be political, miss points, find more diverting ends that look worth it. People are nuts, you know.</p>\n]]>", "author": "Amy", "published": "2015-10-25 12:49:22+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Scott 218:  I can imagine it being worthwhile to try to appreciate art since I know it works with literature.   The are great writers who are easy to read (say Steinbeck), those that take some effort (such as Shakespeare) but are outstanding once you do, and ones that are genuinely hard, but very much liked by folks who have put in the effort (perhaps &#8220;The Wasteland&#8221; or &#8220;Finnegan&#8217;s Wake&#8221;).  Furthermore, some of the people who wrote well-appreciated complex works also wrote great accessible ones (&#8220;Portrait of an Artist as a Young Man&#8221;) so they are not completely bluffing, and you can get annotated versions that show there is a lot of structure there in what appears, to a newcomer, to look like random words.  The same is definitely true for music, so why not art?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Scheffer:Lou.html\">Lou Scheffer</a>", "published": "2015-10-25 13:01:00+00:00", "title": "By: Lou Scheffer"}, {"content": "<![CDATA[<p>Lou #223: Shakespeare is hard, but 80% of that is just how much the English language changed in 400 years (as well as <i>which parts</i> of the language we care about&#8212;Shakespeare is full of animal and artisan metaphors that no one in Elizabethan England would&#8217;ve needed explained).  T.S. Eliot and James Joyce I confess I&#8217;ve never read (it didn&#8217;t help that my parents were both English majors who read everything, and they repeatedly assured me that reading those sorts of authors would be a waste of my time).</p>\n<p>I feel like I should clarify something.  I come from an extremely musical family&#8212;of the four people in my immediate family, I&#8217;m the only one with zero musical talent, and only my mom and I don&#8217;t have bands&#8212;so I was surrounded by high-quality music growing up.  In particular, my dad and my brother are both huge Zappa fans; either one can tell you anything Zappa-related you could possibly want to know.  And me?  When I listen to Zappa, I think: &#8220;this music is probably a little too complicated for my taste.  But still, it obviously requires <i>extreme</i> skill to write and play, and I can clearly see that someone who spent more time on music than I did would derive more enjoyment from it.&#8221;</p>\n<p>So, how to say this?  There&#8217;s a difference between Frank Zappa and John Cage.  There&#8217;s a difference between art where I can say, &#8220;this takes more effort than I&#8217;m willing to put in, but there&#8217;s clear evidence even I can see that the tradeoff is worth it for other people, so more power to them,&#8221; and art where I say, &#8220;this gives every appearance of being a <i>pure</i> status-signaling game.&#8221;</p>\n<p>Maybe it&#8217;s just because of my upbringing, the years of misery that I endured because of status-signaling games that I couldn&#8217;t play and didn&#8217;t understand, but I have an extreme reaction to anything where the artist seems to be going to zero effort to assure me that it&#8217;s NOT just a status-signaling game, seems to thumb their nose at me and revel in the status-signaling aspect, in just how much they can get away with because of who they are and how many popular friends they have.</p>\n]]>", "author": "Scott", "published": "2015-10-25 14:22:37+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>quax #214: If your subject is a <i>study about white people rejecting claims of white privilege,</i> then obviously you&#8217;ll use the term &#8220;white privilege&#8221; in reporting on that study, regardless of whether you agree or disagree with the claims themselves (or are neutral on them).  Likewise, despite my distaste for terms like &#8220;dialectical materialism,&#8221; I&#8217;d use them liberally were I writing a history of Marxist beliefs.  What is this, some nursery game like Simon Says? <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>As for your question, we&#8217;ve been over this ground so many times on this blog that I hesitate to tread it again.  But I don&#8217;t like the way the discourse of &#8220;privilege&#8221; alienates potential allies; shifts attention away from those who are suffering and what we can do to help them and toward those who mean well and how guilty they should feel; lends an air of respectability to cruel shaming campaigns; and blinds us to all forms of injustice outside our model (as in the modern spectacle of nerds getting lectured about their racial privilege and patriarchal privilege and &#8220;technical privilege,&#8221; by people blind to the neurotypical privilege that might actually swamp everything else in the situation in question).  If the goal is positive social change, then we ought to look for language that directly targets our consciences, and that tears down boundaries between people rather than building them up.</p>\n]]>", "author": "Scott", "published": "2015-10-25 15:23:33+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Shmi Nux #85:</p>\n<ul>Wanted to mention the apparent Scott-vergence: your SJ writings and those of Scott Alexander are more similar than before&#8230;</ul>\n<p>I&#8217;ll take that as one of the highest compliments I&#8217;ve ever gotten&#8212;thank you!</p>\n]]>", "author": "Scott", "published": "2015-10-25 15:38:15+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Beethoven: Music as statement.</p>\n<p>Zappa: Music as satire.</p>\n<p>Cage: Sound as music. And statement. And satire.</p>\n<p>Apropos Cage quote:</p>\n<p>&#8220;The first question I ask myself when something doesn&#8217;t seem to be beautiful is why do I think it&#8217;s not beautiful. And very shortly you discover that there is no reason.&#8221;</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Cross:James.html\">James Cross</a>", "published": "2015-10-25 15:16:22+00:00", "title": "By: James Cross"}, {"content": "<![CDATA[<p>I 100% agree with Ben #184</p>\n]]>", "author": "Raoul Ohio", "published": "2015-10-25 15:24:06+00:00", "title": "By: Raoul Ohio"}, {"content": "<![CDATA[<p>thank you, scott, for this blog, and for sharing your gray matter with us so graciously.</p>\n]]>", "author": "marctmiller", "published": "2015-10-25 16:06:37+00:00", "title": "By: marctmiller"}, {"content": "<![CDATA[<p>Everyone: I&#8217;m about ready to close this thread, as promised (threatened? <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> ).  But I wanted to share some final thoughts, which I hope will answer a large number of the comments I still haven&#8217;t answered.</p>\n<p>Of the dozens of critical comments I received, the one that made me think the most about what I was trying to say&#8212;for which I&#8217;m genuinely grateful!&#8212;was that of Susebron #128:</p>\n<ul>It seems to me that the problem you describe is not that plain language isn’t used, but that it is used when it shouldn’t be. Which, as far as I can tell, is the opposite of the problem you describe in the original post. If plain language should serve, then what would you name the concept of “privilege” if not “privilege”? If the problem is that the concept of “privilege” gets conflated with the connotations of the plain word privilege, then why should people not come up with jargon which is disconnected from prior connotations?</ul>\n<p>Susebron and others are entirely right that my complaint, in this post, is not with abstruse academic jargon <i>per se</i>.  Yes, such jargon sometimes leads to hilarious results, as in the following sentence by the famous Berkeley theorist Judith Butler, which took first place in the 1998 <a href=\"http://denisdutton.com/bad_writing.htm\" rel=\"nofollow\">Bad Writing Contest</a>:</p>\n<ul>The move from a structuralist account in which capital is understood to structure social relations in relatively homologous ways to a view of hegemony in which power relations are subject to repetition, convergence, and rearticulation brought the question of temporality into the thinking of structure, and marked a shift from a form of Althusserian theory that takes structural totalities as theoretical objects to one in which the insights into the contingent possibility of structure inaugurate a renewed conception of hegemony as bound up with the contingent sites and strategies of the rearticulation of power.</ul>\n<p>Yes, there are academic subcultures that stand eternally condemned for harboring sentences like that one in their midst.  But to be brutally honest, <i>if that were all there was to it, I wouldn&#8217;t care that much.</i>  I&#8217;d happily leave it to Alan Sokal to save the far left from itself, and leave it to my many friends in the social sciences and humanities to fight for clarity in their own fields.  After all, in some sense, the sentence above is a model of clarity and concision: in a mere 94 words, it completely answers the question of whether anyone should spend time studying Judith Butler.  So if the critical theorists were content with contentless puffery, people with scientific temperaments could respond by just &#8220;routing around&#8221; them, as Tim May #115 advocated.</p>\n<p>And as I acknowledged in the OP, there can even be social scientists and humanities scholars with <i>legitimate needs</i> for jargon: for example, those using a technical tool, like statistics or Chomskyan formal grammar.</p>\n<p>The problem, from my perspective, arises only when the social thinkers want to have it both ways: when they want to both (a) phrase all their arguments within a complicated, non-common-sense theoretical framework, and (b) treat those arguments as morally binding even on people <i>outside</i> the framework.</p>\n<p>To say it another way: I freely admit that I can be wrong about factual questions for abstruse theoretical reasons (indeed I often am).  I also admit that I can be wrong about moral questions for simple human reasons.  <i>But I don&#8217;t acknowledge the possibility that I can be wrong about a moral question for an abstruse theoretical reason.</i></p>\n<p>If you show me that I wronged someone, I&#8217;ll take that <i>extremely</i> seriously, and will probably obsess to the point of OCD about how to make restitution.  But whatever I did wrong must be explicable in plain language&#8212;for example, by telling me the actual stories of actual conscious beings who I harmed through malice or recklessness.</p>\n<p>In some cases, a full understanding of my wrongdoing might involve some complicated science, as well as consideration of probabilities and the remote future (e.g., if my sin involved releasing potent greenhouse gases).  But even in those cases, you ought to be able to &#8220;black-box&#8221; the scientific parts of your case against me, and state the moral part in straightforward human terms.</p>\n<p>What I won&#8217;t tolerate&#8212;can&#8217;t tolerate, while remaining psychologically healthy&#8212;is someone telling me that I should feel shame and guilt over something I did, but for moral reasons that only make sense within a Marxist framework, or an SJW framework, or a fundamentalist religious framework, or any other system that takes years of study to understand.  Was I racist or sexist or homophobic to someone?  Then that can be explained easily, and I&#8217;ll feel terrible about it and repent.  But was I simply &#8220;blind to my nerd technical privilege&#8221;?  Then sorry, but I won&#8217;t repent for crimes that I couldn&#8217;t even explain to (say) Mark Twain or Bertrand Russell or Alan Turing and have them understand what I was talking about.  I have too many <i>real</i> shortcomings to beat myself up over the fake ones.</p>\n<p>From this perspective, the problem with the word &#8220;privilege&#8221; is precisely that it moves so freely between the two worlds, that of social theory and that of real acts with real moral consequences.  As many commenters pointed out, it&#8217;s not an especially abstruse word, but it&#8217;s a deceiver, a trickster, a word that slimes well-meaning people with moral guilt without ever needing to identify a victim or a specific crime.  It would be fine as an everyday word, and <i>also</i> fine as a technical word; it&#8217;s only not fine as a chameleon, as a concept that creeps up and bites you, then scurries back to the theoretical realm before you can catch it and force it to explain itself.  It seems to me that many other social-justice words (&#8220;entitled,&#8221; &#8220;patriarchal,&#8221; &#8230;) do double-duty in just the same way.</p>\n<p>Anyway, when I talk about jargon, <i>this</i> is the phenomenon I&#8217;m complaining about.</p>\n]]>", "author": "Scott", "published": "2015-10-25 17:23:53+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #230: good post. When I read the original blog post, it seemed to me that your object-level point about words like &#8220;privilege&#8221; and the social justice movement are much more solid than your meta point about the role of jargon in various fields. I&#8217;m convinced that the specific jargon of Marx and of SJWs is garbage, but I&#8217;m not convinced that no useful jargon can ever be developed for everyday concerns.</p>\n<p>Just as an example, what do you think about rationalist/LessWrong jargon? E.g. Chesterton fences, Schelling points, Funging, mind-killing, etc.</p>\n<p>(personally, I find it to be excessive and at times annoying, but I can&#8217;t deny that the terms in question do capture some specific useful ideas).</p>\n]]>", "author": "Anonymous85", "published": "2015-10-25 20:01:57+00:00", "title": "By: Anonymous85"}, {"content": "<![CDATA[<p>I think maybe that stretches the point, Scott, if prettily. The other problem is that the entire point of the discussion of privilege is that it takes place on the societal, not the individual, level, even though individuals are often unwitting collaborators in making it go.</p>\n<p>Suppose I have a student from a poor, mostly-dead little town, the kind of place that&#8217;s not unusual 150 miles from here, and as is normal in those towns, she is responsible for looking after her grandma who&#8217;s dying; she may be in college, sure, but in those towns college is viewed with a good deal of suspsicion, and she&#8217;s a capable young woman with no family of her own to look after and no mortgage to pay, so she&#8217;s it. And because she&#8217;s a product of this town, she&#8217;s been taught since infancy not to complain or ask favors and certainly not to parade her family&#8217;s business around to strangers. And because she&#8217;s 19 years old, loves her nana, and was raised to be a good girl she has not got it in her to tell nana to use medicaid home health aides already and blow town for college. </p>\n<p>So she does fine the first three weeks of class and then her nana takes a turn and she disappears for two weeks. And then she&#8217;s back, and out, and although I send her an &#8220;are you okay, is there anything I can do&#8221; note, she doesn&#8217;t respond, or she does respond with baloney cheerfulness and a non-computing request for homework materials, as if this is high school. And meanwhile her grade&#8217;s going into the toilet, something that&#8217;s not a trivial matter because her scholarships are GPA-dependent.</p>\n<p>I&#8217;m not being mean to her &#8212; in fact I&#8217;m being nice. I&#8217;m concerned and reaching out. But the reality is that the social demands and norms of her world will not allow her to go to college as college demands. And, unwittingly, I am complicit in handing her an impossible task. In combination with all her other profs, some of whom have never emailed her and some who have &#8212; but most of whom will report a failing midterm grade &#8212; we make it difficult or impossible for her to go to college and have some hope of doing something other than taking up with Kevin and getting pregnant and married by the time she&#8217;s 21. </p>\n<p>That&#8217;s a structural problem. That&#8217;s people stuffed with education and money making and enforcing rules for advancement that someone &#8212; anyone &#8212; like this girl, who has got neither education nor money, can&#8217;t play by. Without the awareness that we are doing this, though, we can&#8217;t see the cruelty inherent in it, nor our own participation, and try to do anything about it. That&#8217;s where social models and their language come in, and I&#8217;ve talked twice now about these abstractions&#8217; needing their own words.</p>\n<p>Way back in the winter thread I asked you to role-play a very concrete set of suppositions &#8212; a certain amount of income, apartment life far from a job, limited education, the need to keep your car working so you could get to work, etc., etc. I did that because I wanted to make privilege concrete for you &#8212; I doubted very much that you had ever lived in this manner, and I wanted to make it as real as I could. You declined the offer silently a few times. If you don&#8217;t want the news in highfalutin&#8217; jargon, and you don&#8217;t want something imaginative that&#8217;s as close to a lived reality as you can get, then are you saying you don&#8217;t want this news at all? (The point of it, incidentally, is not to make you or anyone else feel bad. It isn&#8217;t about you (or me, which is part of why I don&#8217;t mind seeing the landscape of my own relative good fortune and how it might affect others). The point is to recognize and address inequities that harm many.)</p>\n]]>", "author": "Amy", "published": "2015-10-25 20:03:45+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Anonymous85 #231: Yeah, that&#8217;s an excellent test case.  I occasionally slip into LW jargon myself, just because it&#8217;s so common among the people I read and respect, and because I know that much (though not all) of that jargon &#8220;bottoms out&#8221; in well-defined concepts that make sense to me, from fields like game theory or evolution.  However, consistent application of the principles I&#8217;ve suggested here leads to the conclusion that one should <i>never, ever</i> deploy this terminology when criticizing someone outside the LW-sphere as morally wrong.</p>\n]]>", "author": "Scott", "published": "2015-10-25 20:09:26+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott #214, thanks for summarizing your stance once more. Figured this is how you feel about the issue, but you have a way with words, and put it much more beautifully than I could.</p>\n]]>", "author": "quax", "published": "2015-10-25 20:34:46+00:00", "title": "By: quax"}, {"content": "<![CDATA[<p>Also, Scott, I just worked my way through that miserable Butler paragraph &#8212; and it was worth doing. I actually learned something in there, even though I haven&#8217;t yet bothered looking up &#8220;Althusserian theory&#8221;. I am not a social scientist; like you, though, I pick up language relatively easily, and I spent enough time in a soc sci dept as a kid to recognize that she wasn&#8217;t just gibbering. And that stuff is beyond infelicitous but has meaning. </p>\n<p>Translation: It&#8217;s not unlike when I used to get pissed off at media scholars for ascribing evil righty intent to media corporations. I worked for media corporations, and what I saw was that they wanted one thing and one thing alone: money. Ain&#8217;t no red or blue, just green. As it happened, the media scholars were correct, there was an ideological agenda. She&#8217;s talking about an idea that this is just how money goes, what capital does as it does its natural thing, and its competition from an idea that says oh no, honey, this is on purpose, and it&#8217;s for the purpose of holding onto power, you watch them use that capital to punch you in the face on purpose again and again, and keep you down. And how the theorist had been over that ages ago, and then turned to a rather technocratic notion of capital is as capital does, and now are back to the use of this idea but with something else we don&#8217;t hear about in the space of a paragraph.</p>\n<p>Only she it says it with references to ideas that are much larger and better-articulated than anything I&#8217;ve just said. You&#8217;re seeing the technical language for those ideas, which are model-based. And when the social scientists leave that language and talk human talk, they have the same problems that physical scientists do: they have language that requires the understanding of those concepts, and while they can translate to English if they&#8217;re forced to, much is lost in translation. </p>\n<p>This is, incidentally, one of the biggest problems I have working with physical scientists on these things: they want to communicate what they know with as much clarity and precision as they can, but the demotic (<&#8211; see what I did?) will not allow them to do that, and they are very much afraid of giving people the wrong idea.</p>\n]]>", "author": "Amy", "published": "2015-10-25 20:41:07+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Amy #232: When I teach my undergrad class, I find myself constantly bending over backwards to accommodate students with stories of why they disappeared and didn&#8217;t show up for the exam or turn in their problem sets or answer emails.  My problem, in those matters, isn&#8217;t softening my hard heart, but rather learning how not to be a total pushover! <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/simple-smile.png\" alt=\":-)\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" />  (On the other hand, it&#8217;s true that I rely on the students to <i>tell me what&#8217;s going on</i>&#8212;I know that I&#8217;m not equipped to play detective or counselor with students who aren&#8217;t forthcoming, and am glad there are others who can fill that role.)</p>\n<p>You&#8217;re right that I was never in poverty, that I don&#8217;t know it firsthand.  On the other hand, both of my parents grew up in relative poverty, in Northeast Philadelphia (where they also faced overt antisemitism), while my grandparents and great-grandparents lived in more extreme poverty (though still glad to be in the US, rather than shot in pits in Eastern Europe like the rest of their extended families).  My parents were the first generation to attend college, though they could only afford state school, and barely that.  So I grew up with constant reminders&#8212;believe me! :-)&#8212;of what it&#8217;s like not to have money.</p>\n<p>And yet, I&#8217;m well-aware that neither of my parents would ever dream of using their modest means as an excuse for doing poorly in school, or not showing up for an exam, etc.  That&#8217;s just alien to how they think.  So, I don&#8217;t know, maybe I was biased by witnessing my parents&#8217; unusual competence and having-it-togetherness; maybe that made me too much a believer in the US as land of opportunity.  But given how far they got, starting from so much less than I did, I can remember thinking that I&#8217;d goddamn <i>better</i> succeed&#8212;not just modestly, but spectacularly&#8212;because if I don&#8217;t then I <i>really</i> have no excuse.</p>\n]]>", "author": "Scott", "published": "2015-10-25 21:01:25+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>&#8230;also, can&#8217;t resist pointing out before this thread closes that you&#8217;re marching with the marxists when it comes to high art. The same people also make a lot of (to me) incredibly tiresome arguments about talent and whether or not it exists or should be allowed, and they have friends in ed departments. I think their argument, though, is not with the artists and scholars, but with the cultural-edifice-makers that define culture and make a high and a low and go around anointing. You can distinguish them by their beautiful suits, and they take good care of their shoes, too. It&#8217;s people like that who are responsible for the canonization of Joyce, even though my guess is most of them never could read Joyce very well. The people who actually do read Joyce well are almost never important enough to make departmental rules and set conference agendas. They&#8217;re too busy being knocked out by Joyce.</p>\n<p>One of the things that becomes apparent in Ulysses, btw, is that all language wears clothing, all language comes from places and signals, trails these things along like toilet paper sticking to your heel, and there&#8217;s nothing you can do about it.</p>\n]]>", "author": "Amy", "published": "2015-10-25 21:11:01+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Oops, missed that. Yeah, the reason I posed that hypothetical situation in the winter thread for you to imagine your way through is that it&#8217;s set up much as reality is for too many people. There&#8217;s no way for you to get by in that situation. This is how people live now. You could read The Jungle instead for a more visibly grotesque version, but the setup makes it impossible for the little family to do anything but sink unless someone comes and rescues them &#8212; an aunt dies and there&#8217;s an insurance policy, say. </p>\n<p>At that point it&#8217;s not about complaining or struggle or hard work. These people do work hard, do knock themselves out. But they walked into life in a time and place where there wasn&#8217;t a hell of a lot they could do about the situation &#8212; the affordable housing is way out there, the job is way over here, there&#8217;s no way to get the better job without the degree, there&#8217;s no way to eat while getting the degree. </p>\n<p>To be in a setup where your work can actually pay off, help you get somewhere &#8212; that&#8217;s privilege. That&#8217;s one that&#8217;s been exceptionally difficult for Boomers to see; I find their parents, when still alive, saw more readily how things were going, recognized how people were once again being trapped and just hoping their kids could do better. But they&#8217;d seen it before, whereas the Boomers&#8217; timing was terrific. They could go to a state college and it was tough, but it also wasn&#8217;t going to kill you with debt for 20-30 years, and the degree could do something for you. But this country hasn&#8217;t made a living in 40 years, and things are different now for ordinary people starting out.</p>\n]]>", "author": "Amy", "published": "2015-10-25 21:23:23+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Amy #238: In that case, how much is there to say except that&#8212;like many other nerds, including those of us who regularly get called elitist sexist fedora-wearing white male shitlord neckbeards, and other lovely names by the hard SJW left&#8212;I vote straight-ticket Democrat, urge everyone else to vote Democrat, and donate money to Democrats?  (Indeed, the very first thing I became publicly known for was my ill-fated attempt to swing Florida from Bush to Gore, through my advocacy of Nadertrading.)  And I&#8217;d love to see a substantial increase in the minimum wage (with exceptions for people who aren&#8217;t working primarily for the money), and many of the other things discussed at the Democratic debate.</p>\n<p>Well, I guess there&#8217;s one other thing to say: that, setting aside its cruelties and collateral damage, I don&#8217;t see that the hardcore SJW rhetoric is doing anything at all to help Democrats win elections, and thereby alleviate the serious socioeconomic problems you mention.</p>\n]]>", "author": "Scott", "published": "2015-10-25 21:38:42+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>(I should take a shower.) The thing is, it takes a really long time for institutions to be interested in the fact that the kid&#8217;s in and out of class, and is one of many, and have some meetings in which they fail to understand the nature of the problem, and then propose solutions which, chiefly, make them feel good for having been kind enough to propose solutions, etc., and then when it fails see it as ill-spent administrative capital, and retreat from the effort. It takes the right person showing up in a position of power within the institution to make anything happen, and that person will also have to argue and fight with others who feel that they&#8217;re being discriminated against by not getting &#8220;special treatment&#8221;, etc. </p>\n<p>A perennial example: anything to do with babies on campus. We know women have babies. We know the women are primarily the ones responsible for the children and often haven&#8217;t money for evening childcare. We still schedule required classes in the evening without offering childcare. On my campus, it took the advent of one activist woman (not a mother) at the head of the family-services unit (the product of a single-mother provost&#8217;s fight) to provide stipends for childcare for evening classes and exams. This does not, of course, fix the fact that babysitters flake, and that the young mothers&#8217; attendance at lab would be much more reliable if lab were scheduled during normal daycare hours. Weighing against any rapid progress is the sentiment that this should not be our problem, also an unwillingness to recognize or deal with the fact that many of our students are actually grownups with children now. </p>\n<p>Anyway &#8212; until these things get sorted institutionally, structurally, the students rely on the kindness of professors, also the hope that each individual professor will recognize what&#8217;s going on with them, and it&#8217;s dangerous for the kids, wearing on us. Because at any time you can recognize that it&#8217;s up to you, individually, to help or not, and if the answer is, you know what, I&#8217;m pooped tonight, this kid will just have to deal &#8212; that&#8217;s a lot of power over a kid&#8217;s life.</p>\n]]>", "author": "Amy", "published": "2015-10-25 21:39:52+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>(hey, I know you want to close this thread, I&#8217;m out, anything else can go to email.)</p>\n]]>", "author": "Amy", "published": "2015-10-25 21:41:12+00:00", "title": "By: Amy"}, {"content": "<![CDATA[<p>Scott #230: Now that comment I will agree with!</p>\n<p>Amy #222: Yeah, sorry for being unclear there.  There&#8217;s a reason I disagreed with Scott&#8217;s original post and said, no, jargon is helpful. 😛  But unfortunately I don&#8217;t have the jargon for this one here.</p>\n<p>Really I had a particular example in mind &#8212; remember the phrase &#8220;reality-based community&#8221;?  Fooled me for a long time.  That&#8217;s the sort of thing I&#8217;m worried about, how this sort of mask makes easier the slide from &#8220;good place to argue&#8221; to &#8220;yet another place where everyone is afraid to question the consensus&#8221;.</p>\n<blockquote><p>But I still don’t think of people being that susceptible to corralling — they’re people, they’re going to be political, miss points, find more diverting ends that look worth it. People are nuts, you know.</p></blockquote>\n<p>Not sure what you&#8217;re getting at here.  Only sense I can make of it, taking it as a reply to what I wrote, is that we&#8217;re doomed forever to have to exclude the people being studied from their own study, that we&#8217;re never going to be able to sit down with them and iteratively refine their concepts.  (In which case, well, what&#8217;s the hope then?)  But I expect I&#8217;ve misunderstood, since it doesn&#8217;t seem that related to what I wrote&#8230;</p>\n]]>", "author": "Sniffnoy", "published": "2015-10-25 22:02:48+00:00", "title": "By: Sniffnoy"}, {"content": "<![CDATA[<p>There are many interesting issues in this discussion but let me pick one of them which I think is central to Scott&#8217;s point of view. (Objecting to the assumption &#8220;that the infinite complexities of human life break down into neat, easily defined and quantifiable categories.&#8221;)</p>\n<p>Here is a related discussion, I had with a close colleague, Avishai, in 95 at the IAS. The issue was that of systematic bias against women in academia and what should be done about it. (Of course, this is a description from memory.)</p>\n<p>(Below I will use the term &#8220;privilege&#8221; with its English meaning.)</p>\n<p>Avishai&#8217;s position was that the real problem is not bias against women but biases and injustice for many reasons. People are disadvantaged if they are little weird, if they are less socially connected, if there are more candid and less &#8220;diplomatic,&#8221; and for many other reasons unrelated to academic excellence. It is true that all these little biases, averaged out, may be more disadvantageous to women, but he argued that  we need to study injustice in academic decisions as a whole, correct those biases on case-by-case basis, and not pay special attention to the division between genders. </p>\n<p>The difficulty Avishai saw in targeting genders separately applies to the more general situation of gender bias.  If, for example, we will set a mechanism that will improve the situation of the most privileged women and harm men across the board. Is it just? desirable? or even worse, we may harm the most unprivileged among the men, and help the most privileged among women, leading to little more balance between genders and much more imbalance within the genders.</p>\n<p>My position was (and still is) different.  I  thought that, the problems regarding the representation and status of women in academia and related matters regarding relations across genders, make it necessary to deal with this issue separately. I also thought the effort to change the situation regarding genders represented in academia and the status of women there, the emerging mechanisms to make such a change, and  the social change such a change may bring, will be beneficial to the other forms of academic biases and injustice, that Avishai talked about. And also here, my point of view extends for greater generality. (Putting jargon aside it may be related to some essential difference of opinions among us.)</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2015-10-25 23:02:56+00:00", "title": "By: Gil Kalai"}]