[{"content": "<![CDATA[<p>Part of AI is going to be the <em>merging</em> of humans and machines&#8230; humans becoming more machine-like, while machines become more human-like, the lines of demarcation blurring. I&#8217;m doubtful that autonomous weapon systems can be successfully banned under such evolution.</p>\n]]>", "author": "Shecky R", "published": "2015-07-31 20:03:52+00:00", "title": "By: Shecky R"}, {"content": "<![CDATA[<blockquote><p>As far as I know, none of the projects currently under way in the U.S. aims to produce a “weaponized robot.”</p></blockquote>\n<p>dude, weaponized robots have existed for over a decade now, perfected in iraq, they are called DRONES. there wasnt much resistance at the time to the military industrial complex aka WARMACHINE which is now making very lucrative $$$ off of them. </p>\n<p>and of course remote control bombs around for many decades are basically &#8220;robotic systems&#8221; as well. a complex/ multidimensional issue. its an interesting factoid that legendary/ visionary Tesla predicted these uses over a century ago.</p>\n<p>but actually this is a very old story. we have been building dangerous, highly lethal weapons that far outpace even <i>humanity&#8217;s</i> moral sense. eg nuclear weapons. the obama deal on iran is a step in the right direction. yes we need governing bodies as aware of military robotics as they are about nuclear weapons & nonproliferation of ALL deadly military technology. but notice how politicized the issue got&#8230;.</p>\n<p>more on <a href=\"https://vzn1.wordpress.com/category/robotics/\" rel=\"nofollow\">robotics</a></p>\n]]>", "author": "vzn", "published": "2015-08-01 03:22:41+00:00", "title": "By: vzn"}, {"content": "<![CDATA[<p>I though you ment <a href=\"https://www.youtube.com/watch?v=uz7k4wGsGWo\" rel=\"nofollow\">Alpocalypse</a> :(</p>\n]]>", "author": "Dis Appointed", "published": "2015-08-01 09:07:54+00:00", "title": "By: Dis Appointed"}, {"content": "<![CDATA[<p>The IJCAI open letter makes a point of distinguishing between remotely controlled weapons like the Predator drone, with a human operator making the decision to fire a missile, and an autonomous weapon that would choose targets and decide to shoot at them without human supervision. I&#8217;m not sure the line is all that sharp, and I&#8217;m also not sure we haven&#8217;t crossed it already. (The Phalanx automated cannon, which is meant to protect ships at sea from cruise missile attacks, can be set to engage targets without human intervention — and that&#8217;s a technology that goes back to the 1970s.) Still, there are classes of robotic weapons that we can now choose to develop, or not. I am pleased to see that some 2,400 of the people who might well be involved in building those systems are urging us to choose not.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2015-08-01 10:55:31+00:00", "title": "By: Brian Hayes"}, {"content": "<![CDATA[<p>Mines are a class of weapons which have been killing autonomously for decades. While most nations in the world have ratified a ban on anti-personnel mines, some of the most powerful such as the US, China, Russia and India have not. I appreciate the call for a ban on autonomous weapons of the AI kind, but I doubt that it will be successful in those nations that do not even ban mines.</p>\n]]>", "author": "Martin", "published": "2015-08-01 16:09:36+00:00", "title": "By: Martin"}, {"content": "<![CDATA[<p>ah! so a few thousand scientists/ engrs finally decided to draw a &#8220;line in the sand&#8221; on <i>autonomous weaponized robotics</i> but have had virtually nothing to say about the drones that have killed <i>thousands</i> already, many <i>innocent civilians/ bystanders</i> and nobody has any <i>(&#8220;formally declared&#8221;)</i> issue of the verbal sleight-of-hand of military <i>defining</i> all &#8220;casualties&#8221; (DEATHS/KILLINGS) as &#8220;military combatants&#8221;. </p>\n<p>but anyway where was that line on development of nuclear weapons decades ago? they were <i>created</i> by scientists like oppenheimer et al who never or barely questioned the <i>morality</i> and very likely, <i>autonomous</i> weapons will be created by scientists who have no moral compunctions, no <i>meaningful/ actionable</i> ones anyway. lets face it theres a huge moral blind spot by <i>humans</i> on the use of technology, esp military technology. </p>\n<p>robotics is a new area of weaponization that is not gonna solve this deep issue. humans are the big part of the problem and a little petition is not gonna change much. oh and by the way do you know how many signatures are on 911 truth petition(s)? and what effect has <i>that</i> had? </p>\n<p>anyway all that said, just venting, not really against your personal ideas in this blog, which does bring some small )( awareness to the very damning issue, but which is a pandoras box far deeper than merely autonomous robots&#8230;.</p>\n]]>", "author": "vzn", "published": "2015-08-01 16:15:29+00:00", "title": "By: vzn"}, {"content": "<![CDATA[<p>Good point.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/h/Hayes:Brian.html\">Brian Hayes</a>", "published": "2015-08-01 16:28:27+00:00", "title": "By: Brian Hayes"}]