[{"content": "Michael, <br /><br />Thanks for a very interesting posts on a topic that touches many (all?) of us at some point in our academic careers and for the pointers to other blog posts I was unaware of. The comments have been thoughtful and I enjoyed reading them.<br /><br />I don&#39;t have the knowledge needed to compare stress levels in different professions or even among different career stages in the same profession. However, IMHO, there are several potential sources of stress in our work and some of the most pernicious ones are perhaps self-inflicted and are closely related to drive. (A point you mentioned in this post of yours.)<br /><br />One is the angst that comes with research, which we share with all the other &quot;creative professions&quot;, and feeds the inner worm of self-doubt.  I am sure that I am not alone in wondering whether I still have it in me to produce some &quot;new&quot; research and write another paper on it. Part of our work is to keep producing new knowledge and we feel that we are not fulfilling our job description and we are letting down our own department/research community/funding agency if we do not do so for some time. I think that this has led several of us to depression and this includes some people who did truly seminal work at some point in their careers. <br /><br />The poet Sylvia Plath wrote: &quot;The worst enemy to creativity is self-doubt.&quot; Sadly, her life ended in suicide. <br /><br />One of the joys of our work is having young, very bright colleagues and students around us. However, when self-doubt and depression start working their way into someone&#39;s psyche, this can turn into a curse. Our inner voices might start comparing their success with our (relative) lack of achievement, feeding the worm of self-doubt even more and increasing the psychological pressure to &quot;produce&quot;. As Sylvia Plath&#39;s quote says, this state of mind is not conducive to creative work and may lead to a vicious circle. <br /><br />The negative feeling that if one does not produce research, papers, or funding for some time then one is letting the whole department/university down may be even worse in a small department where one is considered to be one of the flag-bearers.<br /><br />What can one do about this? As Paul Beame wrote in an excellent comment on your first post in this series, I think that stressing a collegial and collaborative atmosphere in our own work places can help a lot. Lone rangers die. <br /><br /><br />", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/a/Aceto:Luca.html\">Luca Aceto</a>", "published": "2014-12-18 06:26:05.671000-05:00", "title": ""}]