[{"content": "<![CDATA[<p>Scott, your remarks [#37] are worthy of response, and numerous references exist that are written by Grothendieck&#8217;s physicist colleagues &#8230; alas comments that cite these references disappear into /dev/null.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-18 13:15:40+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Citations to work by Grothendieck&#8217;s IHES physicist-colleague David Ruelle, relating to the question &#8220;What is a metre?&#8221; and its generalizations, now appears as a comment in Ken Regan&#8217;s and Dick Lipton&#8217;s outstanding ecomium <b>&#8220;<a href=\"http://rjlipton.wordpress.com/2014/11/16/alexander-grothendieck-1928-2014/#comment-58356\" rel=\"nofollow\">Alexander Grothendieck 1928–2014</a>&#8220;</b></p>\n<p>For some reason (that&#8217;s not evident to me), the <i>Shtetl Optimized</i> comment-filter rejects these Ruelle citations&nbsp;&hellip; or maybe it&#8217;s the Saharon Shelah citations that are problematic?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-18 14:21:11+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>John #40: I&#8217;d be more motivated to search for the comments of yours caught by my spam-filter (in addition to the thousands of comments that aren&#8217;t caught), if you showed more willingness to <i>respond on point to what other people said.</i>  Do you understand that none of the David Ruelle quotes you offered actually bear at all on my question, let alone providing what you call a &#8220;concrete answer&#8221;?  (I.e., would Grothendieck have accepted the Planck length as a natural unit of length, or wouldn&#8217;t he?)  The quotes don&#8217;t even <i>mention</i> the Planck length, or anything related to it.</p>\n<p>The fact that my question might have <i>reminded</i> you of these quotes, doesn&#8217;t mean that the quotes address the question as far as anyone else can make out.  If you can just grasp this one distinction, your comments will become orders of magnitude more comprehensible.</p>\n]]>", "author": "Scott", "published": "2014-11-18 14:36:11+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p><b>Direct question</b>&nbsp; &#8220;Would Grothendieck have accepted the Planck length as a natural unit of length, or wouldn’t he?&#8221; </p>\n<p><b>Direct answer</b>&nbsp; &#8220;Probably not.&#8221;  </p>\n<p><b>Followup question</b>&nbsp; Isn&#8217;t the answer &#8220;probably not&#8221; so minimally informative as to suggest that better questions could be posed?  So why not pose them?</p>\n<p>&#8212;&#8212;&#8211;</p>\n<p><b>Summary</b>&nbsp; Ruelle&#8217;s work&nbsp;&mdash; and especially his first-hand physics-centric perspective upon Grothendieck&nbsp;&mdash; poses <i>rich</i> mathematical questions that can be <i>fruitfully</i> considered&nbsp;&hellip; by young researchers especially.</p>\n<p>&#8212;&#8212;&#8212;</p>\n<p><b>Falsifiable prediction&nbsp; </b><b>[ <a href=\"http://rjlipton.wordpress.com/2014/11/16/alexander-grothendieck-1928-2014/#comment-58359\" rel=\"nofollow\">see <i>G&ouml;del's Lost Letter</i></a> ]</b></p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-18 15:35:19+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>OK then, here&#8217;s a next step: you could explain the <b>reasons</b> why Grothendieck (or anyone else) should or would reject the Planck length, as a deep answer to the question of what&#8217;s a natural, non-arbitrary length scale.  That would be more informative, while still bearing on the question.</p>\n]]>", "author": "Scott", "published": "2014-11-18 15:41:14+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Scott, your question [#47] is worthy of a response, but not today and not by me.  The reason is, today is our thirty-fifth wedding anniversary! </p>\n<p><b>Falsifiable prediction</b>&nbsp; My spouse would be justifiably displeased were I to write-out a Grothendieck-oriented literature survey on mathematically natural descriptions of quantum measurement theory.</p>\n<p>Thank you sincerely, though, for the sustained generosity of <i>Shtetl Optimized</i> in hosting views that are sometimes not in sympathy with your own.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Sidles:John.html\">John Sidles</a>", "published": "2014-11-18 17:10:07+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>quax #35, indeed. No fun spoiled, I was simply glad to see an &#8220;advanced&#8221; word being used in what was already a high-quality article.</p>\n]]>", "author": "Apteris", "published": "2014-11-19 12:26:10+00:00", "title": "By: Apteris"}, {"content": "<![CDATA[<p>Hi Professor Aaronson,</p>\n<p>I was wondering if you would be interested in commenting on:</p>\n<p><a href=\"http://arxiv.org/pdf/1405.0931.pdf\" rel=\"nofollow\">http://arxiv.org/pdf/1405.0931.pdf</a></p>\n<p>I&#8217;m not sure how to interpret the abstract. The author claims that memcomputing is a new paradigm that allows for solving NP complete problems in polynomial time in a manner similar to the human brain&#8230; But as far as I&#8217;m aware, and from what you&#8217;ve written previously on this site, there is no evidence that biology, including the human brain, is capable of this feat.</p>\n<p>Abstract—We introduce the notion of universal memcomputing<br />\nmachines (UMMs): a class of brain-inspired general-purpose<br />\ncomputing machines based on systems with memory, whereby<br />\nprocessing and storing of information occur on the same physical<br />\nlocation. We analytically prove that the memory properties of<br />\nUMMs endow them with universal computing power—they are<br />\nTuring-complete—, intrinsic parallelism, functional polymorphism,<br />\nand information overhead, namely their collective states can<br />\nsupport exponential data compression directly in memory. We<br />\nalso demonstrate that a UMM has the same computational power<br />\nas a non-deterministic Turing machine, namely it can solve NP–<br />\ncomplete problems in polynomial time. However, by virtue of its<br />\ninformation overhead, a UMM needs only an amount of memory<br />\ncells (memprocessors) that grows polynomially with the problem<br />\nsize. As an example we provide the polynomial-time solution of<br />\nthe subset-sum problem and a simple hardware implementation<br />\nof the same. Even though these results do not prove the statement<br />\nNP=P within the Turing paradigm, the practical realization of<br />\nthese UMMs would represent a paradigm shift from present von<br />\nNeumann architectures bringing us closer to brain-like neural<br />\ncomputation.</p>\n]]>", "author": "Confused", "published": "2014-11-19 16:34:27+00:00", "title": "By: Confused"}, {"content": "<![CDATA[<p>Confused @46:<br />\nTheir machine is only brain-like in that the computing elements have memory; it&#8217;s not put together like a brain, and the computing elements don&#8217;t necessarily work like neurons.</p>\n<p>I didn&#8217;t read the article very thoroughly, but there are lots of different techniques for using analog computation to easily do things that are difficult or impossible for a digital computer &#8211; provided you ignore pesky details about precision, stability, dynamic range&#8230; This paper seems to be doing the same thing.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Standeven:Ben.html\">Ben Standeven</a>", "published": "2014-11-20 01:15:53+00:00", "title": "By: Ben Standeven"}, {"content": "<![CDATA[<p>Confused #46: Man oh man was that a cringe-inducing paper.  To show you how I read such a paper, let me highlight a few crucial sentences and my reactions to them:</p>\n<ul>In particular, we consider the NP-complete subset sum problem, and using two examples we show how a UMM can solve it in polynomial time using a number of memprocessors that either grows exponentially or, by exploiting the information overhead, uses a linear number of memprocessors.</ul>\n<p>Solving an NP-complete problem in polynomial time using an exponential number of parallel processors is trivial: <i>anyone</i> can do that!  So, the only remaining question is by what sleight-of-hand they&#8217;re going to claim that they can get the number of processors down to linear.  I wonder if it will have something to do with arithmetic precision?</p>\n<ul>In the present work, we employ an idealization of a DCRAM in the sense that we do not specify the actual electronic devices capable of reproducing exactly the machine we are going to present. Nevertheless, this does not exclude the possibility that such a machine can be realized in practice.</ul>\n<p>Uh-oh!  Trouble ahead.</p>\n<ul>This implies that the function g(x) contains information on all sums of all possible sub-sets of G.</ul>\n<p>Aha!  Just as I feared, the exponential blowup in resources is being hidden, by shoehorning the parallel processing needed into numbers that take exponentially many bits just to write down.  Oldest trick in the book; people observed similar things in the 60s and 70s.</p>\n<ul>However, we point out that p is not bounded by n and it depends on N, which scales exponentially with the number of bits used to represent fmax.</ul>\n<p>Ah, so the authors <i>do</i> understand the problem.  But why did they wait until page 11 to tell us this?  Why didn&#8217;t they say so on page 1, so people could make an informed decision about whether to read further?  Do they not realize that this kills the advertised idea that implementing &#8220;memprocessors&#8221; in hardware could give any real advantage (as opposed to an advantage in a counterfactual theoretical model, one where arithmetic on exponentially-large integers is free)?</p>\n<p>The whole point of my 2005 essay <a href=\"http://www.scottaaronson.com/papers/npcomplete.pdf\" rel=\"nofollow\">NP-complete Problems and Physical Reality</a> was that, if people read it and internalized its message, I thought it could serve as a prophylactic against exactly this sort of paper.  Unfortunately, it completely failed at that goal.</p>\n]]>", "author": "Scott", "published": "2014-11-20 02:57:04+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>When you say that the paper failed, which step do you think failed? Do people fail to read it, fail to understand it, or fail to internalize the message?</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Knight:Douglas.html\">Douglas Knight</a>", "published": "2014-11-20 05:36:15+00:00", "title": "By: Douglas Knight"}, {"content": "<![CDATA[<p>Douglas #49: Good question!  In this case, I assume (hope?) that the failure was at step 1.  There have <i>probably</i> also been failures at steps 2 and 3, but I don&#8217;t remember any example.</p>\n]]>", "author": "Scott", "published": "2014-11-20 11:45:47+00:00", "title": "By: Scott"}]