[{"content": "<![CDATA[<p>Ryan #40: Thanks!  Yes, Farhi did mention in his talk about this that for the degree-3 case, you can beat Goemans-Williamson by a little, still using SDP relaxation (and I see that they reference Halperin-Livnat-Zwick in their paper).  I&#8217;ve now edited the post to point that out.</p>\n<p>Is it known whether Halperin-Livnat-Zwick is optimal for the degree-3 case, assuming the UGC?</p>\n]]>", "author": "Scott", "published": "2015-01-15 06:07:11+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>If I were to bet,  then I&#8217;m saying that within the next six months, someone is going to come up with a classical algorithm that beats Håstad&#8217;s polynomial-time  algorithm.</p>\n]]>", "author": "Rahul", "published": "2015-01-15 06:17:55+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>Rahul #43: Yes, that is indeed a plausible bet.  Even then, though, it would still be kind of interesting that the quantum algorithm had come first.</p>\n<p>Incidentally, I didn&#8217;t feel bad at all about blogging the Martinis group&#8217;s work, because so many QC experiments that were so much less important have been hyped so much more!  Good to even things out once in a while. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" /></p>\n]]>", "author": "Scott", "published": "2015-01-15 13:54:39+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>Rahul # 41: Agreed!</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/s/Stanson:Jeremy.html\">Jeremy Stanson</a>", "published": "2015-01-15 14:23:12+00:00", "title": "By: Jeremy Stanson"}, {"content": "<![CDATA[<p>Scott #44:</p>\n<p>Indeed! Martinis himself seems like the ideal  researcher in these aspects. I think he doesn&#8217;t hype his stuff at all. </p>\n<p>D-Wave could learn a thing or two from him.  Speaking of D-Wave they&#8217;ve been kinda lying low for some time now. Maybe the criticism finally got to them. <img src=\"http://www.scottaaronson.com/blog/wp-includes/images/smilies/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" /></p>\n]]>", "author": "Rahul", "published": "2015-01-15 15:30:29+00:00", "title": "By: Rahul"}, {"content": "<![CDATA[<p>The difference between the 3.5th milestone and the 4th milestone plays a central role in the seventh post of my 2012-debate with Aram Harrow  <a href=\"https://rjlipton.wordpress.com/2012/09/16/quantum-repetition/\" rel=\"nofollow\">https://rjlipton.wordpress.com/2012/09/16/quantum-repetition/</a><br />\nIn connection with a conjecture I made in the first post (&#8220;Conjecture 1&#8243;) Aram made the point that classical error-correction can lead to very stable encoded qubits in certain states (which is essentially the 3.5 milestone). I gave a formal description of the conjecture, which essentially asserts that the 4th milestone, namely  insisting that encoded qubits allows arbitrary superpositions,  cannot be reached.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2015-01-16 08:21:58+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Gil,</p>\n<p>Just so I understand, you&#8217;re conjecturing that preserving a logical qubit for longer than the physical qubits cannot and will not be accomplished?  If so, is it your position then, that accomplishing this task would basically disprove or at least severally weaken your general conjecture regarding the impossibility of constructing an effective quantum computer?   Thanks.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bacon:Michael.html\">Michael Bacon</a>", "published": "2015-01-16 14:46:44+00:00", "title": "By: Michael Bacon"}, {"content": "<![CDATA[<p>Scott #44</p>\n<p>what&#8217;s the parallel here with the Shor algorithm that does not seem to have a classical counterpart?<br />\nThe problem at hand isn&#8217;t the type of &#8220;isolated island&#8221; that factorization is?</p>\n]]>", "author": "fred", "published": "2015-01-16 14:51:27+00:00", "title": "By: fred"}, {"content": "<![CDATA[<p>Dear Michael (#48) , yes, sure! as I said many times (See, for example,<a href=\"http://youtu.be/YCEHu4AUGpY?t=34m40s\" rel=\"nofollow\"> the discussion in my 2012 Simons Institute videotaped lecture 2</a>), implementation of quantum error-correction with encoded qubits which are substantially more stable than the raw qubits (and allow arbitrary superposition for the encoded qubit) will disprove my conjectures. Such stable encoded qubits are  expected from implementations of distance-5 surface code.</p>\n<p>Let me add, Michael, that I will be impressed to see even a realization of distance-3 (or distance-5) surface code that will give good quality encoded qubits, even if the encoded qubits will have quality which is somewhat worse than that of the raw qubits used for the encoding. These experiments, including those that were already carried out, also give various other opportunities to test my conjectures.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/k/Kalai:Gil.html\">Gil Kalai</a>", "published": "2015-01-17 16:04:37+00:00", "title": "By: Gil Kalai"}, {"content": "<![CDATA[<p>Thanks Gil.</p>\n]]>", "author": "<a href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Bacon:Michael.html\">Michael Bacon</a>", "published": "2015-01-17 21:28:32+00:00", "title": "By: Michael Bacon"}]