[{"content": "<![CDATA[<p>The movie must be doing pretty well.  All the copies of Kanigel&#8217;s book are checked out of all the libraries around here (I&#8217;ve looked online at several).  I&#8217;ll have to wait.</p>\n]]>", "author": "asdf", "published": "2016-05-02 20:57:23+00:00", "title": "By: asdf"}, {"content": "<![CDATA[<p>This particular <i>Shtetl Optimized</i> essay points toward a particularly rich mine of literary themes.  Here are three.</p>\n<p><b>Theme One</b>&nbsp; Susan Wloszczyna&#8217;s review (cited in #32) suggests:<br />\n<blockquote>&#8220;The lives of many of these ladies [who are spouses of mathematicians] often would provide enough material for a potentially fascinating film all on their own.&#8221;</p></blockquote>\n<p>Recommended as a concrete example is Yannick Grannec&#8217;s scrupulously detailed (and best-selling, prize-winning, etc.) novelization of the marriage of and Adele and Adele Porkert and Kurt Gödel: <i>The Goddess of Small Victories</i> (2014).  Adele and Kurt&#8217;s rich story would make a &#8220;must see&#8221; movie for plenty of folks (well, me anyway).</p>\n<p><b>Theme Two</b>&nbsp; As Scott&#8217;s review mentions, the medical knowledge of Ramanujan&#8217;s generation plausibly would have sufficed to prevent Ramanujan&#8217;s death (in 1920) from hepatic amoebiasis.  So it is natural to wonder, whether the knowledge of Arlene (Greenbaum) Feynman&#8217;s generation similarly would have sufficed to prevent Arlene&#8217;s death (in 1945) from tuberculosis&nbsp;&mdash; Arlene being Richard Feynman&#8217;s young wife.</p>\n<p>Let us assume, for the sake of Hollywood melodrama, that a small team of ambitious young scientists, familiar with Arlene&#8217;s desperate case, and familiar too with the medical literature of the era, were willing to build upon top-secret Army-sponsored biomedical research, with the help of state-of-the-art chemical separation techniques, and bend the rules to attempt a miracle cure&nbsp;mdash; a cure that succeeded against all odds? </p>\n<p>What&#8217;s remarkable is that this high-drama story is historically <i>true</i>&nbsp;&hellip; and it happened in November of 1944&nbsp;&hellip; seven months <i>before</i> Arlene Feynman&#8217;s death in June of 1945. For the well-documented details of the then-miraculous cure of tuberculosis patient &#8220;Patricia T&#8221; as history knows her, see for example Carol Dyer&#8217;s (scholarly) <a href=\"https://books.google.com/books?id=YA2Mupc2aM0C&pg=PA64\" rel=\"nofollow\"><i>Tuberculosis</i></a> and/or Peter Pringle&#8217;s (more sensational) <i>Experiment Eleven: Dark Secrets Behind the Discovery of a Wonder Drug</i> (2012).</p>\n<p>Might Feynman plausibly have learned of this Army-sponsored, high-risk/high-payoff tuberculosis research, and with the help of Groves&#8217; and Oppenheimer&#8217;s unlimited clout, heroically arranged for &#8220;Arlene F&#8221; to be a second &#8220;Patricia T&#8221;?  </p>\n<p>If there&#8217;s anything to Many Worlds quantum theory, the remarkable (even sobering) answer is &#8220;yes, definitely&#8221;.</p>\n<p><b>Theme Three</b>&nbsp; Scott&#8217; vivid memories (in the o.p.) of a &#8220;childhood self&#8221; who was enduringly inspired by the Ramanujan/Hardy story, finds a beautiful (for me) echo in mathematician Robert Langland&#8217;s much-cited essay &#8220;Is&nbsp;there beauty in mathematical theories?&#8221; (2013, this essay is collected in editor Vittorio Hösle&#8217;s <i>The Many Faces of Beauty</i>; note that Google finds Langland&#8217;s essay on-line); </p>\n<p>Langland&#8217;s Scott-themed passages include:<br />\n<blockquote>Both G.W.Dunnington, the author of <i>Gauss, Titan of Science</i> (1954) and W.K. Bühler, the author of <i>Gauss, A Biographical Study</i> (1981), perhaps the two best-known Gauss biographies, seem to me singularly insensitive to the value to an adolescent of even a very brief introduction to intellectual possibilities [&hellip;] </p>\n<p>My purpose here [in this essay] is to make the case for a mathematical beauty that transcends neither the simple mathematical pleasures of arithmetic and geometry nor the fascination of difficult problems but that integrates them with the quite different intellectual pleasure of creating order from seeming chaos, even in an inconsequential&nbsp;&mdash; but not for me&nbsp;&mdash; realm.</p></blockquote>\n<p>In particular, Langland&#8217;s &#8220;Section 5: From algebraic number theory to spectroscopy&#8221;, provides a multigenerational algebraic perspective on the research of quantum luminaries that include (in alphabetical order) Balmer, Bohr, Dirac, Lyman, Pauli, Schrödinger, and Wigner.  </p>\n<p>Langland&#8217;s observations provide <i>plenty</i> of algebraic meat for quantum researchers to digest (however this comment has grown sufficiently long that I had best refrain from listing further references) 🙂</p>\n<p><b>Conclusion</b>&nbsp; <i>Shtetl Optimized</i> readers who enjoy films like <i>The Man Who Knew Infinity</i>, and who have enjoyed too Scott&#8217;s fine review of it, are likely to enjoy the above-cited works by Yannick Grannec, Carol Dyer, Peter Pringle and (especially) Robert Langlands.  </p>\n<p>In&nbsp;aggregate, these works illuminate with a rainbow of light the diverse potentialities of mathematics to enrich lives, speed healing, and in general (in Langland&#8217;s phrase) &#8220;create order from seeming chaos.&#8221;   And as these works variously show, the &#8220;order created&#8221; can be variously personal, domestic, medical, scientific, and even universal.  What could be more inspiring? 🙂</p>\n]]>", "author": "John Sidles", "published": "2016-05-02 23:37:34+00:00", "title": "By: John Sidles"}, {"content": "<![CDATA[<p>Thanks for the recomendation Scott. I wonder if you have read the David Foster Wallace essay on novels about mathematics.</p>\n]]>", "author": "Michael Vassar", "published": "2016-05-03 01:53:16+00:00", "title": "By: Michael Vassar"}, {"content": "<![CDATA[<p>Scott #32: Yes, human beings are complex, individualistic and irreducible to stereotypes: who knew ;)! One of the wonderful ways in which both Kanigel&#8217;s book and the movie both illustrate these complex realities is by breaking those stereotypes (&#8220;All Brahmins are privileged&#8221; or &#8220;The English are all bad.&#8221;). In fact I am convinced that the only reason humanity as a whole progresses is because there&#8217;s enough of us who buck stereotypes (notwithstanding what social media seems to be constantly yelling at us).</p>\n<p>That review about how we &#8220;love our male geniuses&#8221; is just plain silly, especially so when you realize that Ramanujan&#8217;s &#8216;privilege&#8217; relative to the writer of the review was probably not just zero but negative.</p>\n]]>", "author": "Passerby", "published": "2016-05-03 02:02:47+00:00", "title": "By: Passerby"}, {"content": "<![CDATA[<p>Long very interesting post by Stephen Wolfram on Ramanujan:</p>\n<p><a href=\"http://blog.stephenwolfram.com/2016/04/who-was-ramanujan/\" rel=\"nofollow\">http://blog.stephenwolfram.com/2016/04/who-was-ramanujan/</a></p>\n<p>Short summary: Ramanujan relied heavily on numerical methods and intuition rather than formal proofs, anticipating some of Wolfram’s own empirical approach to mathematics. Ramanujan’s main interest was in the field of number theory, which only really took off from the 1970s onwards with advances in computing power.</p>\n<p>I should mention my own favourite number here, isn’t number ’27’ simply the most perfect beautiful number?</p>\n<p>Look, 27 is a perfect cube (3^3=27)</p>\n<p>27 is also the smallest number with 2 representations as a sum of 3 positive squres:<br />\n (27= 1^2+1^2+5^2, 27=3^2+3^2+3^2)</p>\n<p>Fun personal fact Scott: 3 1/2 years ago I inserted number ’27’ in all the lines of my lottery ticket and hit the jackpot, using my winnings to travel through England, France and Scotland.</p>\n]]>", "author": "mjgeddes", "published": "2016-05-03 04:13:19+00:00", "title": "By: mjgeddes"}, {"content": "<![CDATA[<p>Also sometimes this is why I think something grander is at play unless you believe the likes of Newtons and Eulers are much more plenty than discovered.</p>\n<p>Had Ramanujan born 20 years later or 20 years before even if he were a sparkling white genius would not have been the Ramanujan we know today because the right mathematics was not there or mathematics had already moved on. In fact it is highly unlikely just by reading two books anyone could get into Berkeley today even for computer science.</p>\n<p>&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;</p>\n<p>Also scott regarding #29 Brahmins have high chance of academic and managerial success even if they are poor. Do not compare US poverty and Indian poverty in 20th century and even now. US is segregated with bad schooling at bad places stupid gun laws. The culture in India is much different. Lack of money by an individual does not mean lack of success by individuals in areas where the individual shines if there is traditional strengths in those areas by these castes.</p>\n]]>", "author": "turbo", "published": "2016-05-03 09:36:10+00:00", "title": "By: turbo"}, {"content": "<![CDATA[<p>#38: The good thing is that because of affirmative action there are now plenty of educational opportunities that are available to those of previously lower castes which are not easily available to Brahmins; for instance a Brahmin has to do exceptionally well in standardized tests to stand a chance of getting admitted to a prestigious college. In addition there are &#8216;special seats&#8217; in prestigious colleges in India which can literally be bought by the wealthy: this puts them out of reach of poor people in general, irrespective of what caste they are. A bit like old money at Harvard.</p>\n]]>", "author": "Passerby", "published": "2016-05-03 13:00:02+00:00", "title": "By: Passerby"}, {"content": "<![CDATA[<p>Let me add one error: the movie mistakenly uses a &#8216;lungi&#8217; (which is a muslim dress and in those days will never be worn by hindus) as Ramanujan&#8217;s dress instead of the correct Tamil dress dhoti</p>\n]]>", "author": "Asokan Pichai", "published": "2016-05-03 15:19:58+00:00", "title": "By: Asokan Pichai"}, {"content": "<![CDATA[<p>Michael #35: No, I haven&#8217;t read that!  Do you have a link?  I just googled for it and couldn&#8217;t find it.</p>\n]]>", "author": "Scott", "published": "2016-05-03 15:51:30+00:00", "title": "By: Scott"}, {"content": "<![CDATA[<p>mjgeddes #37: Wolfram&#8217;s article was surprisingly interesting: it also contains the best integrated product placement I have ever witnessed. </p>\n<p>Concerning his penultimate section where he wonders if there&#8217;d be modern Ramanujans, I think in many ways the world did get one, but, not with as cool a origin story: Bill Thurston.</p>\n]]>", "author": "anon_sc", "published": "2016-05-03 16:44:20+00:00", "title": "By: anon_sc"}, {"content": "<![CDATA[<p>My father, when I was a child, was tremendously interested, and quite conversant, with Claude Shannon&#8217;s work, and in particular his famous 1948 paper, which linked information to the thermodynamic concept of entropy, among other things. Although I was only a child, I listened with rapt attention to my father&#8217;s explication of some of the ideas embodied in Shannon&#8217;s work.</p>\n<p>When I was on staff at CMU in the 1980s I asked over the campus network how I could reach Shannon. Herb Simon, the Nobel Prize winner in Economics, answered with: &#8220;Who&#8217;s asking?&#8221; I replied with my credentials, mostly the editing of many award-winning PBS shows, and the shooting and editing of a few other productions. Then Simon replied with: &#8220;Claude Shannon is a very private person who would not be interested&#8221;.</p>\n<p>Well, I suppose it&#8217;s better to be rebuffed by a Nobelist than by just anybody, but I would have preferred Shannon, or an agent of his, telling me that himself&#8230;</p>\n<p>I still think that Shannon&#8217;s story would make a great feature film, rather than the NOVA-like documentary I envisioned in the 1980s.</p>\n]]>", "author": "Nicholas Spies", "published": "2016-05-04 18:36:53+00:00", "title": "By: Nicholas Spies"}, {"content": "<![CDATA[<p>Scott #41: I believe the essay he&#8217;s referring to is here: <a href=\"http://science.sciencemag.org/content/290/5500/2263.1.full\" rel=\"nofollow\">http://science.sciencemag.org/content/290/5500/2263.1.full</a></p>\n]]>", "author": "Patrick", "published": "2016-05-05 01:34:05+00:00", "title": "By: Patrick"}]